{
  "id": 7400,
  "slug": "7400",
  "title": "Automated order confirmations with Abacate Pay: first-buyer coupon rewards via email & Slack",
  "description": "### Workflow Overview\nThis workflow provides a complete, automated post-purchase solution triggered by a successful payment webhook from **Abacate Pay**. *(For international users, think of Abacate Pay as 'the Brazilian Stripe' – a popular and robust payment gateway in Brazil).*\n\nWhen a successful payment is registered, this workflow instantly sends a beautiful, responsive HTML confirmation email to the customer and posts a detailed notification to a designated Slack channel.\n\nThe key feature is its ability to **dynamically reward first-time buyers**. The workflow checks the customer's purchase history, and if it's their first order, it automatically generates a 10% discount coupon for their next purchase and includes it in the welcome email.\n\n### Key Features:\n\n* **Webhook Trigger:** Securely listens for successful payment events from Abacate Pay.\n* **First-Time Buyer Detection:** Queries past orders to identify new customers.\n* **Automatic Coupon Generation:** Creates a unique, single-use discount coupon for new buyers.\n* **Dynamic Content:** The email and Slack messages automatically include the coupon details, but only for first-time buyers.\n* **Responsive HTML Email:** Sends a professional and mobile-friendly order confirmation.\n* **Rich Slack Notifications:** Uses Block Kit for well-formatted, actionable alerts for your team.\n* **Centralized Configuration:** A single `Configs` node makes it easy to manage static variables like company name and tokens.\n\n### Setup Instructions:\n\n1.  **Webhook Node:** Copy the webhook URL and paste it into your Abacate Pay dashboard for the \"payment successful\" event (e.g., `billing.paid`).\n2.  **Configs Node:** Open this `Set` node and fill in your company's information (`companyName`, `companySite`, `companyEmail`) and the `token` used to validate the webhook requests.\n3.  **HTTP Request Nodes (`GetOrders`, `CreateCustomCoupon`):** In both nodes, go to the \"Authentication\" or \"Header\" section and replace the placeholder Bearer Token with your actual Abacate Pay API key.\n4.  **Send Email Node:** Select your email credentials from the dropdown or configure a new account (e.g., `SMTP`, `Gmail`).\n5.  **Slack Node:** Select your Slack credentials and choose the channel where you want to receive notifications.\n6.  **Activate the Workflow:** Save and activate the workflow. It's now ready to process incoming orders!\n\n### Required Credentials:\n\n* Abacate Pay API Credentials\n* Email Credentials (e.g., `SMTP`, `SendGrid`, `Gmail`)\n* Slack API Credentials",
  "featuredImage": "/data/workflows/7400/7400.webp",
  "author": {
    "id": 101,
    "slug": "julinho",
    "name": "Matheus Pedrosa",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 159,
  "downloads": 15,
  "createdAt": "2025-08-14T21:07:36.957Z",
  "updatedAt": "2026-01-16T08:50:09.869Z",
  "publishedAt": "2025-08-14T21:07:36.957Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7400"
}