{
  "id": 9821,
  "slug": "9821",
  "title": "Create videos with AI-generated backgrounds using Gemini and VideoBGRemover",
  "description": "Automated workflow that generates custom AI image backgrounds from text prompts using Gemini's Nano Banana (native image generation), removes video backgrounds, and composites videos on AI-generated scenes. Create any background you can imagine without needing stock images.\n\n## How it works\n\n• **Describe background**: Provide video URL and text prompt describing desired background scene (e.g., \"modern office with city skyline at golden hour\")\n• **AI generates image**: Gemini creates a background image from your prompt in ~10-20 seconds\n• **Upload to Drive**: Generated background is saved to Google Drive and made publicly accessible\n• **Remove & composite**: Video background is removed and composited on AI-generated scene with centered template\n• **Save final video**: Completed video is uploaded to Google Drive with shareable link\n\n## Set up steps\n\n**⏱️ Total setup time: ~5 minutes**\n\n• **Get Gemini API Key** (~1 min): Visit https://aistudio.google.com/apikey, create new API key, add to n8n Settings → Variables as `GEMINI_KEY`\n• **Get VideoBGRemover API Key** (~2 min): Visit https://videobgremover.com/n8n, sign up, add to n8n as `VIDEOBGREMOVER_KEY`\n• **Connect Google Drive** (~2 min): Click \"Save Background Image to Drive\" node, click \"Connect\", authorize n8n\n\n**Use cases:**\n- Marketing videos with custom branded environments tailored to your message\n- Product demos with unique AI-generated backgrounds that match your product aesthetic\n- Social media content with creative scenes you can't find in stock libraries\n- AI avatars placed in AI-generated worlds\n- Presentations with custom backgrounds generated for specific topics\n- A/B testing different background variations for the same video\n\n**Pricing:**\n- Gemini: ~$0.03 per generated image\n- VideoBGRemover: $0.50-$2.00 per minute of video\n- Total: ~$0.53-$2.03 per video\n\n**Triggers:** Webhook (for automation) or Manual (for testing)\n\n**Processing time:** Typically 5-7 minutes total\n\n**Prompt tips:** Be descriptive and specific. Instead of \"office,\" try: \"A modern minimalist office with floor-to-ceiling windows overlooking a city skyline at golden hour. Warm sunlight, polished concrete floors, sleek wooden desks, green plants.\"",
  "featuredImage": "/data/workflows/9821/9821.webp",
  "author": {
    "id": 101,
    "slug": "paul",
    "name": "Paul Roussel",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 98,
  "downloads": 9,
  "createdAt": "2025-10-17T10:13:55.756Z",
  "updatedAt": "2026-01-16T09:02:07.347Z",
  "publishedAt": "2025-10-17T10:13:55.756Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9821"
}