{
  "id": 8199,
  "slug": "8199",
  "title": "Automated meeting prep with GPT-5 & Gemini research from calendar to Slack via Attio CRM",
  "description": "This n8n template transforms your daily meeting preparation by automatically researching attendees and generating comprehensive briefing documents. Every weekday morning, it analyzes your calendar events, researches each external attendee using multiple data sources, and delivers professionally formatted meeting briefs directly to your Slack channel.\n\n## Who's it for\nBusiness professionals, sales teams, account managers, and executives who regularly attend meetings with external contacts and want to arrive fully prepared with relevant context, conversation starters, and strategic insights about their attendees.\n\n## How it works\nThe workflow triggers automatically Monday through Friday at 6 AM, fetching your day's calendar events and filtering for meetings with external attendees.\n\nFor each meeting, an AI agent researches attendees using your CRM (Attio), email history (Gmail), past calendar interactions, and external company research via Perplexity when needed.\n\nThe system then generates structured meeting briefs containing attendee background, relationship context, key talking points, and strategic objectives, delivering everything as a formatted Slack message to start your day.\n\n## Requirements\n\n- Google Calendar with OAuth2 credentials\n- Gmail with OAuth2 credentials\n- Slack workspace with bot token and channel access\n- Attio CRM with API bearer token\n- OpenRouter API key for AI model access (or other API credentials to connect AI to your AI agents)\n- Perplexity API key for company research\n\n## How to set up\n\n1. Configure credentials for all required services in your n8n instance\n2. Update personal identifiers in the workflow:\n\t1. Replace \"YOUR_EMAIL@example.com\" with your actual calendar email in both Google Calendar nodes\n\t2. Replace \"YOUR_SLACK_CHANNEL_ID\" with your target channel ID in both Slack nodes\n\n3. Adjust AI models in OpenRouter nodes based on your preferences and model availability\n4. Test the workflow manually with a day that contains external meetings\n5. Verify Slack formatting appears correctly in your channel\n\n## How to customize the workflow\n- Change meeting research depth: Modify the AI agent prompt to focus on specific research areas like company financial data, recent news, or technical background.\n- Adjust notification timing: Update the cron expression in the Schedule Trigger to run at different times or days.\n- Expand CRM integration: Add additional Attio API calls to capture more contact details or create follow-up tasks.\n- Enhance Slack formatting: Customize the Block Kit message structure in the JavaScript code node to include additional meeting metadata or visual elements.\n- Add more research sources: Connect additional tools like LinkedIn, company databases, or news APIs to the AI agent for richer attendee insights.\n---\n\nThe template uses multiple AI models through OpenRouter for different processing stages, allowing you to optimize costs and performance by selecting appropriate models for research tasks versus text formatting operations.",
  "featuredImage": "/data/workflows/8199/8199.webp",
  "author": {
    "id": 101,
    "slug": "harrysiggins-onetwogrowth",
    "name": "Harry Siggins",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 270,
  "downloads": 27,
  "createdAt": "2025-09-03T00:34:44.290Z",
  "updatedAt": "2026-01-16T08:54:38.278Z",
  "publishedAt": "2025-09-03T00:34:44.290Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8199"
}