{
  "id": 8225,
  "slug": "8225",
  "title": "Track weekly keyword rankings with Google SERP, Serper API, and Google Sheets",
  "description": "This template is designed for SEO specialists, content marketers, and digital growth teams who want to automate the process of tracking keyword rankings.\n\nManually checking SERPs every week is time-consuming and prone to error. This workflow solves that by automatically querying Google search results with the Serper API, updating rankings in Google Sheets, and keeping historical data for up to 12 weeks.\n\nPrerequisites\n\nBefore you begin, make sure you have:\n\nA Google Sheet with columns:\n\nSr.no (unique row identifier)\n\nKeyword\n\nTarget Page (the URL you want to track)\n\nA Google Service Account credential set up in n8n\n\nA Serper API key (added to n8n credentials as serperApiKey)\n\nDetailed Setup\n\nImport the workflow into n8n.\n\nUpdate the Google Sheets nodes:\n\nReplace your-google-sheet-id with your actual Google Sheet ID\n\nReplace your-sheet-name with the correct tab name\n\nAdd your Google Service Account credentials to the Google Sheets nodes.\n\nAdd your Serper API key to the HTTP Request node (serperApiKey).\n\n(Optional) Update the HARDCODED_DOMAIN variable in the Code node if you want to lock rankings to a specific domain.\n\nRun the workflow once manually to confirm everything is working.\n\nUsage & Customization\n\nBy default, the workflow runs every Monday at 00:00 (midnight). You can adjust this by editing the Cron node.\n\nThe workflow stores ranking history for 12 weeks. If you want more, simply extend the columns in your Google Sheet and update the Code node logic.\n\nThe workflow checks for both exact URLs and domains. You can customize this in the Code node depending on whether you want to track page-level or domain-level rankings.\n\nData is updated only for the current week unless you allow overwriting, ensuring historical accuracy.",
  "featuredImage": "/data/workflows/8225/8225.webp",
  "author": {
    "id": 101,
    "slug": "amuratech",
    "name": "Amuratech",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 198,
  "downloads": 19,
  "createdAt": "2025-09-03T15:24:50.969Z",
  "updatedAt": "2026-01-16T08:54:45.985Z",
  "publishedAt": "2025-09-03T15:24:50.969Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8225"
}