{
  "id": 6255,
  "slug": "6255",
  "title": "Generate and schedule AI discussion posts for Reddit with GPT-4 and Airtable",
  "description": "### How the sequence works:\n1. A \"Schedule Trigger\" node activates the automation at a defined schedule.\n2. An \"[Airtable](https://airtable.com)\" node will search for previously posted questions in your question database.\n\t1. Airtable Base Template: [here](https://airtable.com/app6wzQqegKIJOiOg/shrzy7L9yv8BFRQdY)\n3. An \"Aggregate\" node will take all the questions from Airtable and compress them to a single output.\n4. ChatGPT, or a model of your choice, will generate a discussion question based on the options in the system prompt.\n5. The discussion question will be posted to the subreddit of your choice by the \"Reddit\" node.\n\t1. You can choose between a text, image, or link post!\n6. The recently-posted discussion question will then be uploaded to your Airtable base using the \"Airtable\" node. This will be used to prevent ChatGPT from creating duplicate questions.\n\n### Setup Steps\nThe setup process will take about 5 minutes. An Airtable base template is also pre-made for you here: [https://airtable.com/app6wzQqegKIJOiOg/shrzy7L9yv8BFRQdY](https://airtable.com/app6wzQqegKIJOiOg/shrzy7L9yv8BFRQdY)\n\n1. Set the recurrence in the \"Schedule\" node\n2. Create an Airtable account, you can use the link [here](https://airtable.com/invite/r/zhjTCrgs).\n3. Get an Airtable personal access token [here](https://airtable.com/create/tokens).\n4. Configure the \"Get Previous Discussions\" Airtable node.\n5. Configure the options in brackets in the \"Generate New Discussion\"  node.\n6. Set the desired subreddit to post to and the post type(text, image, or link) in the \"Post Discussion\" node.\n7. Configure the \"Create Archived Discussion\" node to map to the Airtable base(required) and specific subreddit(optional).",
  "featuredImage": "/data/workflows/6255/6255.webp",
  "author": {
    "id": 101,
    "slug": "josh-universe",
    "name": "Josh Universe",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 255,
  "downloads": 25,
  "createdAt": "2025-07-22T05:33:34.096Z",
  "updatedAt": "2026-01-16T08:44:04.378Z",
  "publishedAt": "2025-07-22T05:33:34.096Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6255"
}