{
  "id": 9609,
  "slug": "9609",
  "title": "Private secret santa assignment & notification system with Gmail & verification",
  "description": "### **Secret Santa (Amigo Invisible) Automation 🎁**\n\nThis workflow fully automates a **Secret Santa** (Amic Invisible) event — perfect for friends, families, or office teams who want to make their gift exchange fun, fair, and completely private.\n\nIt takes a simple list of participant names and emails, then automatically pairs everyone using a **non-repeating random assignment system (derangement algorithm)** — meaning no one is ever assigned to themselves and every participant both gives and receives a gift exactly once.\n\nOnce the pairs are generated, the workflow sends each participant a beautifully formatted email revealing only their assigned recipient. After each email is sent, it is **automatically deleted from the “Sent” folder** to ensure the organizer cannot see or trace who got whom, keeping the surprise intact.\n\nAt the end of the process, the workflow generates a **numerical summary** like “1 sent to 2, 2 sent to 3…” — allowing the organizer to verify that everything worked correctly **without revealing the actual names or emails** of the participants.\n\nThis automation combines creativity, privacy, and transparency — making it perfect for anyone who wants to manage a Secret Santa game with ease, fairness, and a touch of automation magic.\n\nCreated by [oxsr11](https://n8n.io/creators/oxsr11/) — explore more original and innovative workflows on my n8n profile.\n",
  "featuredImage": "/data/workflows/9609/9609.webp",
  "author": {
    "id": 101,
    "slug": "oxsr11",
    "name": "Oriol Seguí",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 155,
  "downloads": 15,
  "createdAt": "2025-10-14T09:12:13.701Z",
  "updatedAt": "2026-01-16T09:01:12.030Z",
  "publishedAt": "2025-10-14T09:12:13.701Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9609"
}