{
  "id": 6938,
  "slug": "6938",
  "title": "Automatically save & organize Outlook email attachments in OneDrive folders",
  "description": "# Outlook to OneDrive\nThis workflow automates the process of saving binary attachments from Outlook emails into newly created folders in OneDrive. It's ideal for users who regularly receive files and need them organized into separate folders without manual intervention. Each folder is automatically named based on the email subject and the current timestamp, allowing all attachments from that email to be stored inside the corresponding folder. This is particularly useful for streamlining document workflows, improving file traceability, and reducing the time spent on repetitive tasks like organizing client submissions, invoices, or internal reports.\n\nThe configuration and setup of the workflow can be customized to meet the business or personal needs of the user. Its purpose is to automatically process binary attachments from Outlook emails and upload them to dynamically created folders in OneDrive.\n\n# Overview\n1. **Microsoft Outlook Trigger** – Monitors your inbox for new emails.\n2. **Filter** – Ensures only emails with binary attachments proceed.\n3. **Get Outlook Message** – Retrieves the full email and downloads attachments.\n4. **Create Folder** – Makes a new folder in OneDrive based on the email subject and time.\n5. **Split Out** – Extracts each binary attachment.\n6. **Merge**– Combines folder and file data before upload.\n7. **Upload File OneDrive** – Uploads each binary file into the new folder.\n\n# Need Help? Have Questions?\nFor consulting and support, or if you have questions, please feel free to connect with me on [LinkedIn](www.linkedin.com/in/michael-gullo-46b3b7274) or [via email](michael.gullo@outlook.com). \n",
  "featuredImage": "/data/workflows/6938/6938.webp",
  "author": {
    "id": 101,
    "slug": "mgullo",
    "name": "Michael Gullo",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 7578,
  "downloads": 757,
  "createdAt": "2025-08-03T16:05:57.477Z",
  "updatedAt": "2026-01-16T08:47:43.333Z",
  "publishedAt": "2025-08-03T16:05:57.477Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6938"
}