{
  "id": 3962,
  "slug": "3962",
  "title": "Automate Cal.com meeting attendee management with Google Sheets, Beehiiv & Telegram",
  "description": "This n8n workflow template automates the process of managing meeting guests booked through Cal.com. It captures attendee information, logs it in a Google Sheet, and subscribes new guests to your Beehiiv newsletter, while also notifying you in Telegram.\n\n### How it Works\nThis workflow is designed to streamline your post-booking process. When a new meeting is booked via Cal.com, the workflow automatically triggers. It extracts the attendee details, adds a new row with the guest's information to a designated Google Sheet, and then adds the guest as a subscriber to your Beehiiv newsletter. Finally, it sends a notification to a specified Telegram channel, keeping you informed of new subscribers.\n\n### Features\n- **Automated Data Entry:** Automatically log meeting guest details into Google Sheets.\n- **Newsletter Growth:** Effortlessly add new meeting guests to your Beehiiv subscriber list.\n- **Real-time Notifications:** Get instant alerts in Telegram for new subscribers.\n- **Seamless Integration:** Connects Cal.com, Google Sheets, Beehiiv, and Telegram.\n\n### Set Up\nTo use this workflow, you will need the following:\n\n- **[Cal.com](https://refer.cal.com/1node):** Set up a Cal.com account and configure a webhook to trigger the workflow on new bookings. You will need the webhook URL provided by the first node in this workflow.\n- **Google Cloud:** A Google Cloud account with access to Google Sheets. You will need to specify the Sheet and the range where data should be added.\n- **[Beehiiv](https://www.beehiiv.com?via=1node-ai):** A Beehiiv account. You will need your Beehiiv API key and the publication ID of your newsletter.\n- **Telegram Account:** A Telegram account and a channel where you want to receive notifications. You will need your Telegram Bot Token and the chat ID of the channel.\n- **Configure each node** in the workflow with your respective API keys, IDs, and sheet details as required. The \"Define your parameters\" box in the workflow provides guidance on finding your Telegram chat ID and Beehiiv API key/publication ID.\n\n### Additional Enhancements\nThis workflow can be extended and customized further:\n\n- **Conditional Logic:** Add filters to only subscribe guests based on certain criteria (e.g., specific meeting types).\n- **Data Enrichment:** Integrate with other services to enrich guest data before adding to Google Sheets or Beehiiv.\n- **CRM Integration:** Connect to a CRM to create or update contact records for new guests.\n- **Custom Notifications:** Customize the content and format of the Telegram notification.\n\n### Need Help?\nIf you need assistance setting up this workflow, encounter any issues, or would like to explore setting up similar automation workflows tailored to your company's specific needs, please contact us at [1 Node](https://1node.ai).\n",
  "featuredImage": "/data/workflows/3962/3962.webp",
  "author": {
    "id": 101,
    "slug": "aitoralonso",
    "name": "Aitor | 1Node",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1409,
  "downloads": 140,
  "createdAt": "2025-05-09T14:09:48.256Z",
  "updatedAt": "2026-01-16T08:32:24.506Z",
  "publishedAt": "2025-05-09T14:09:48.256Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3962"
}