{
  "id": 10765,
  "slug": "10765",
  "title": "Market intelligence engine with AI sentiment detection & competitor analysis",
  "description": "## How It Works\nA scheduled process aggregates content from eight distinct data sources and standardizes all inputs into a unified format. AI models perform sentiment scoring, detect conspiracy or misinformation signals, and generate trend analyses across domains. An MCDN routing model prioritizes and channels insights to the appropriate workflows. Dashboards visualize real-time analytics, trigger KPIs based on thresholds, and compile comprehensive market-intelligence reports for stakeholders.\n\n## Setup Steps\n1. **Data Sources:** Connect news APIs, social media platforms, academic databases, code repositories, and documentation feeds.\n2. **AI Analysis:** Configure OpenAI models for sentiment analysis, conspiracy detection, and trend scoring.\n3. **Dashboards:** Integrate analytics platforms and enable automated email or reporting outputs.\n4. **Storage:** Configure a database for historical records, trend archives, and competitive-intelligence storage.\n\n\n## Prerequisites\nMulti-source API credentials; OpenAI API key; dashboard platform access; email service; code repository access; academic database credentials\n\n## Use Cases\nCompetitive intelligence monitoring; market trend analysis; technology landscape tracking; product strategy research; misinformation filtering\n\n## Customization\nAdjust sentiment thresholds; add/remove data sources; modify analysis rules; extend AI models\n\n## Benefits\nReduces research time 80%; consolidates market intelligence; improves decision accuracy\n\n",
  "featuredImage": "/data/workflows/10765/10765.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 230,
  "downloads": 23,
  "createdAt": "2025-11-12T15:50:48.861Z",
  "updatedAt": "2026-01-16T09:06:13.337Z",
  "publishedAt": "2025-11-12T15:50:48.861Z",
  "nodes": 46,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10765"
}