{
  "id": 8420,
  "slug": "8420",
  "title": "Classify & extract data from floorplans with Mistral AI OCR & JigsawStack",
  "description": "<section>\n  <h2>🌊 What it Does</h2>\n  <p>\n    This workflow <strong>automatically classifies uploaded files</strong> (PDFs or images) as\n    <span>floorplans</span> or <span>non‑floorplans</span>.  \n    It filters out junk files, then analyzes valid floorplans to extract <em>room sizes</em> and <em>measurements</em>.\n  </p>\n\n  <h2>👥 Who it’s For</h2>\n  <p>\n    Built for <strong>real estate platforms, property managers, and automation builders</strong> \n    who need a trustworthy way to detect invalid uploads while quickly turning true floorplans \n    into structured, reusable data.\n  </p>\n\n  <h2>⚙️ How it Works</h2>\n  <ol>\n    <li>User uploads a file (<code>PDF</code>, <code>JPG</code>, <code>PNG</code>, etc.).</li>\n    <li>Workflow routes the file based on type for specialized processing.</li>\n    <li>A two‑layer quality check is applied using heuristics and AI classification.</li>\n    <li>A confidence score determines if the file is a valid floorplan.</li>\n    <li>Valid floorplans are passed to a powerful OCR/AI for deep analysis.</li>\n    <li>Results are returned as <strong>JSON</strong> and a user-friendly <strong>HTML table</strong>.</li>\n  </ol>\n\n  <h2>🧠 The Technology Behind the Demo</h2>\n  <p>\n    This MVP is a glimpse into a more advanced commercial system. It runs on a custom <strong>n8n workflow</strong> that leverages <strong>Mistral AI's</strong> latest OCR technology. Here’s what makes it powerful:\n  </p>\n  <ul>\n    <li>\n      <strong>Structured Data Extraction:</strong> The AI is forced to return data in a clean, predictable <code>JSON Schema</code>. This isn't just text scraping; it’s a reliable data pipeline.\n    </li>\n    <li>\n      <strong>Intelligent Data Enrichment:</strong> The workflow doesn't just extract data—it enriches it. A custom script automatically calculates crucial metrics like <strong>wall surface area</strong> from the floor dimensions, even using fallback estimates if needed.\n    </li>\n    <li>\n      <strong>Automated Aggregation:</strong> It goes beyond individual rooms by automatically calculating totals per floor level and per room type, providing immediate, actionable insights.\n    </li>\n  </ul>\n  <p>\n    While this demo shows the core classification and measurement (Step 1), the full commercial version includes <strong>Step 2 & 3 (Automated Offer Generation)</strong>, currently in use by a client in the construction industry.\n  </p>\n  <div>\n    <a href=\"https://form0.app/forms/drTI6g\" target=\"_blank\">\n      Test the Live MVP\n    </a>\n  </div>\n  <h2>📋 Requirements</h2>\n  <ul>\n    <li>Jigsaw Stack API Key</li>\n    <li>n8n Instance</li>\n    <li>Webhook Endpoint</li>\n  </ul>\n\n  <h2>🎨 Customization</h2>\n  <p>\n    Adjust thresholds, fine‑tune heuristics, or swap OCR providers to \n    better match your business needs and downstream integrations.\n  </p>\n</section>",
  "featuredImage": "/data/workflows/8420/8420.webp",
  "author": {
    "id": 101,
    "slug": "reklaim",
    "name": "Stephan Koning",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 174,
  "downloads": 17,
  "createdAt": "2025-09-09T15:23:51.906Z",
  "updatedAt": "2026-01-16T08:55:43.458Z",
  "publishedAt": "2025-09-09T15:23:51.906Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8420"
}