{
  "id": 8489,
  "slug": "8489",
  "title": "Save AI-generated markdown to Google Docs using gotoHuman for approval",
  "description": "![n8n flow screenshot.JPG](fileId:2615)\t\nCollaborate with an AI Agent on a joint document, e.g. for creating your content marketing strategy, a sales plan, project status updates, or market analysis.\nThe AI Agent generates markdown text that you can review and edit it in **gotoHuman**, and only then is the existing Google Doc updated.  \nIn this example we use AI to update our company's content strategy for the next quarter.\n\n## How It Works\n1. The AI Agent has access to other documents that provide enough context to write the content strategy. We ask it to generate the text in markdown format.\n2. To ensure our strategy document is not changed without our approval, we request a human review using **gotoHuman**. There the markdown content can be edited and properly previewed.\n3. Our workflow resumes once the review is completed. We check if the content was approved and then write the (potentially edited) markdown to our Google Docs file via the Google Drive node.\n\n![mdreview.JPG](fileId:2614)\n\n## How to set up\n\n1. **Most importantly, install the verified gotoHuman node before importing this template!**\n(Just add the node to a blank canvas before importing. Works with n8n cloud and self-hosted)\n2. Set up your credentials for gotoHuman, OpenAI, and Google Docs/Drive\n3. In gotoHuman, select and create the pre-built review template \"Strategy agent\" or import the ID: `F4sbcPEpyhNKBKbG9C1d`\n4. Select this template in the gotoHuman node\n\n## Requirements\n\nYou need accounts for\n- gotoHuman (human supervision)\n- OpenAI (Doc writing)\n- Google Docs/Drive\n\n## How to customize\n\n- Let the workflow run on a schedule, or create and connect a [manual trigger in gotoHuman](https://docs.gotohuman.com/manual-triggers) that lets you capture additional human input to feed your agent\n- Provide the agent with more context to write the content strategy\n- Use the gotoHuman response (or a Google Drive file change trigger) to run additional AI agents that can execute on the new strategy",
  "featuredImage": "/data/workflows/8489/8489.webp",
  "author": {
    "id": 101,
    "slug": "gotohuman",
    "name": "gotoHuman",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 308,
  "downloads": 30,
  "createdAt": "2025-09-12T00:06:12.656Z",
  "updatedAt": "2026-01-16T08:56:07.046Z",
  "publishedAt": "2025-09-12T00:06:12.656Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8489"
}