{
  "id": 9577,
  "slug": "9577",
  "title": "Automate freelance project intake with custom proposals using Jotform & Gemini",
  "description": "Workflow explaination: [https://youtu.be/ecafBTFPuvE?si=7csA1yNsaUxUG72F](https://youtu.be/ecafBTFPuvE?si=7csA1yNsaUxUG72F)\n\nThis workflow is designed to automatically handle new freelance project requests from a JotForm, analyze the requirements using AI, create a **custom proposal**, log the details in a Google Sheet, and send a personalized response to the client.\n\n---\n\n## 1. JotForm Trigger\n\n* **Purpose**: This node is the entry point of the entire automation. It waits for a new freelance project submission from your specified JotForm.\n* **Action**: When a potential client fills out and submits the form, this node **instantly triggers** the workflow, passing all submitted data (name, email, project requirements, and budget) to the next node.\n* **Key Detail**: Uses a webhook for real-time activation, ensuring immediate processing of every new project request.\n\n---\n\n## 2. AI Agent\n\n* **Purpose**: The central brain of your freelance workflow. 🧠 It takes the project submission and turns it into a structured, customized proposal.\n* **Action**: The agent follows a prompt sequence to perform these tasks:\n\n  1. **Calls the `My Freelance Document` Tool**: Fetches your Google Doc containing details about your services, pricing, and project templates — your “source of truth.”\n  2. **Analyzes the Project Request**: Reads the client’s requirements and goals from the form.\n  3. **Generates a Custom Proposal**: Based on scope, budget, and relevance to your offerings, it prepares a short, tailored proposal or quote that fits the project.\n  4. **Creates a Personalized Email**: Builds an HTML email with the proposal embedded, including next steps or a scheduling link for further discussion.\n  5. **Outputs Structured Data**: Packages everything (project summary, proposal text, email subject, and body) into a clean JSON object for downstream use.\n\n---\n\n## 3. Append or Update Row in Sheet (Google Sheets)\n\n* **Purpose**: Serves as your lightweight CRM for all project inquiries.\n* **Action**: Logs data from the AI Agent (proposal details, client info, and project summary) into a Google Sheet.\n* **Key Detail**: Configured to **Append or Update**—if an email already exists, it updates that row instead of duplicating. Keeps your client records clean and organized.\n\n---\n\n## 4. If\n\n* **Purpose**: Acts as a control node to decide whether a proposal email should be sent.\n* **Action**: Checks the output from the AI Agent to ensure the proposal text is valid (not empty).\n* **Key Detail**: If the proposal generation fails or returns “NAN,” the workflow stops here to avoid sending incomplete responses.\n\n---\n\n## 5. Send a Message (Gmail)\n\n* **Purpose**: Sends the final personalized proposal email to the client.\n* **Action**: Pulls the recipient’s email from the sheet and sends the **AI-generated subject and HTML proposal email** automatically.\n* **Key Detail**: The email is customized per project, giving the client an instant, professional response with no manual effort.\n",
  "featuredImage": "/data/workflows/9577/9577.webp",
  "author": {
    "id": 101,
    "slug": "iamvaar",
    "name": "iamvaar",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 339,
  "downloads": 33,
  "createdAt": "2025-10-13T14:04:57.194Z",
  "updatedAt": "2026-01-16T09:01:03.582Z",
  "publishedAt": "2025-10-13T14:04:57.194Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9577"
}