{
  "id": 5739,
  "slug": "5739",
  "title": "Automated invoice data extraction with LlamaParse, Gemini 2.5 & Google Sheets",
  "description": "### This n8n template demonstrates how to automate invoice data extraction from PDF attachments received via Gmail. Using LlamaParse and Gemini LLM, this workflow parses structured fields like PO numbers, line items, tax amounts, and totals — and stores them neatly into a Google Sheet.\n\nPerfect for use cases such as:\n💼 Finance teams managing vendor invoices\n📊 Bookkeeping workflows\n🔄 Automating monthly reconciliation\n\n\n## Good to Know\nAt the time of writing, LlamaParse and Gemini may involve API usage costs depending on your subscription tier. Check LlamaIndex Pricing and Gemini Pricing for updated info.\n\nLlamaParse provides Markdown-formatted parsed output which is then passed to an LLM for structured field extraction.\n\nGemini models may be geo-restricted. If you encounter \"model not found\" errors, your region might not be supported.\n\n\n## How it Works\n- Trigger: Watches your Gmail for new emails with PDF attachments.\n- Email Filter: Ensures we only parse fresh emails not already labeled as \"invoice synced\".\n- LlamaParse Upload: Uploads the PDF to LlamaParse’s parsing endpoint.\n- Status Polling: Periodically checks whether the parsing is complete.\n- Download Markdown: Once ready, it fetches the parsed invoice in Markdown format.\n- AI Parsing with Gemini: Sends the Markdown to Gemini LLM to extract structured JSON (like PO number, line items, taxes, etc.) using a predefined schema.\n- Google Sheets Upload: Stores extracted data into a predefined spreadsheet. \n- Labeling: Marks the email as “invoice synced” to avoid reprocessing.\n\n## How to Use\nThe trigger is based on Gmail, but you can replace this with a webhook or manual trigger for testing.\n\n## Setup Instructions\nGmail API\n- Enable Gmail API in Google Cloud Console.\n- Connect your Gmail account in n8n credentials.\n- Allow read + modify access.\n\nGoogle Sheets\n\n- Create a new Google Sheet with the following headers (row 1): Date | Vendor Name | Invoice Number | PO Number | Line Items | Subtotal | Tax | Total Amount\n- Connect Google Sheets in n8n and paste the Sheet ID in the node.\n- You can customise the google sheet basis your requirement.\n\nLlamaParse\n\n- Get a LlamaIndex API Key from LlamaIndex.\n- Use the LlamaParse upload and polling nodes to process your PDFs.\n\nGemini (via Vertex AI)\n\n- Set up Gemini access in GCP.\n- Use the Gemini 2.5 Model.\n- Construct a structured prompt to extract required fields.\n\nLabeling\n\n- Create a Gmail label named \"Invoice Synced\" for tracking processed emails.\n\n## Requirements\nGmail account with API access\n\nLlamaParse (LlamaIndex) account with API Key\n\nGoogle Sheets API credentials\n\nAccess to Gemini 2.5 model via Google Vertex AI\n\n## Customising This Workflow\nThis template is just the beginning. You can expand it to:\n\n- Auto-generate invoices back to vendors\n- Run duplicate checks before inserting into Sheets\n- Integrate with accounting tools like Zoho, QuickBooks, or Tally\n- Trigger Slack/Email notifications on specific vendors or high invoice amounts\n\n",
  "featuredImage": "/data/workflows/5739/5739.webp",
  "author": {
    "id": 101,
    "slug": "arpanjain29",
    "name": "Agentick AI",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 807,
  "downloads": 80,
  "createdAt": "2025-07-07T07:03:16.407Z",
  "updatedAt": "2026-01-16T08:41:11.493Z",
  "publishedAt": "2025-07-07T07:03:16.407Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5739"
}