{
  "id": 2924,
  "slug": "2924",
  "title": "Hacker news job listing scraper and parser",
  "description": "This automated workflow scrapes and processes the monthly \"Who is Hiring\" thread from Hacker News, transforming raw job listings into structured data for analysis or integration with other systems. Perfect for job seekers, recruiters, or anyone looking to monitor tech job market trends.\n\n## How it works\n\nAutomatically fetches the latest \"Who is Hiring\" thread from Hacker News\nExtracts and cleans relevant job posting data using the HN API\nSplits and processes individual job listings into structured format\nParses key information like location, role, requirements, and company details\nOutputs clean, structured data ready for analysis or export\n\n## Set up steps\n\n1. Configure API access to [Hacker News](https://github.com/HackerNews/API\n) (no authentication required)\n2. Follow the steps to get your cURL command from [https://hn.algolia.com/](https://hn.algolia.com/) \n3. Set up desired output format (JSON structured data or custom format)\n4. Optional: Configure additional parsing rules for specific job listing information\n5. Optional: Set up integration with preferred storage or analysis tools\nThe workflow transforms unstructured job listings into clean, structured data following this pattern:\n\n- Input: Raw HN thread comments\n- Process: Extract, clean, and parse text\n- Output: Structured job listing data\n\nThis template saves hours of manual work collecting and organizing job listings, making it easier to track and analyze tech job opportunities from Hacker News's popular monthly hiring threads.",
  "featuredImage": "/data/workflows/2924/2924.webp",
  "author": {
    "id": 101,
    "slug": "jksr",
    "name": "Julian Kaiser",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5113,
  "downloads": 511,
  "createdAt": "2025-02-17T09:05:52.229Z",
  "updatedAt": "2026-01-16T08:27:11.975Z",
  "publishedAt": "2025-02-17T09:05:52.229Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2924"
}