{
  "id": 10944,
  "slug": "10944",
  "title": "WhatsApp assistant with Gemini AI for calendar management via Evolution API",
  "description": "## AI Agent that uses MCP Server to execute actions requested via Evolution API.\n This workflow receives messages and media from WhatsApp via the Evolution API, converts the content into structured inputs, and forwards them to an AI Agent capable of triggering MCP tools to execute external actions.\n\n### 🔧  **How it works**\n- A **Webhook** receives messages sent to WhatsApp via the **Evolution API**.\n- The **\"Message Type\"** node detects and forwards the received media. It handles the types `Text`, `Image`, `Audio`, and `Document`. If it is another media type, the fallback forwards a \"media not supported\" message to the user.\n- The message goes to the system where it retrieves the **Base64** of the media.\n- The media is converted into **Binary File(s)** and a Gemini node will generate a text input for the agent.\n- The **AI Agent** receives the structured input and calls the appropriate **MCP Tool**. In this example, only one **MCP Server** was configured.\n- The AI ​​Agent generates the output and sends it to the user.\n\n### 🗒️ Requirements\n- Evolution API Account, with the instance configured.\n- Gemini API.\n- Google Calendar API.\n- MCP Server (Internal or external, whichever you prefer) configured and with a URL to link to the MCP Tool.\n\n### ✔️ How to set up\n- **Configure the Evolution API webhook**\n    - Copy the webhook URL generated in the first node.\n    - In the Evolution API panel, go to the instance &gt; webhook &gt; paste the URL into the corresponding field.\n- **Configure Google Calendar credentials**\n    - In n8n, go to *Credentials → Create New* and select **Google Calendar OAuth2**.\n    - Select this credential in all Google Calendar MCP nodes (Get, Create, Update, Delete).\n- **Enable MCP Server nodes**\n    - Copy the MCP Server URL and paste it into the “**Endpoint** field of the MCP Tool.\n- **Configure Evolution API nodes**\n    - In all Evolution API nodes, you need to fill in the “**instance** field with the name of your Evolution API instance.\n\n### 🦾 how to adapt it?\n- **Customize or extend the MCP Tools**\n    - You can add new MCP tools (e.g., Google Sheets, Notion, ClickUp).\n    - Only the agent prompt needs to be updated; the workflow structure remains the same.\n- I opted to use simple memory, but if you want the agent to remember the entire conversation, I recommend changing the memory type; as it is, it will only remember the last 8 messages.\n- If you're going to use a tool like Chatwoot or TypeBot, simply change the webhook URL and pay attention to the objects that the switch (Message Type) uses.",
  "featuredImage": "/data/workflows/10944/10944.webp",
  "author": {
    "id": 101,
    "slug": "pedroprotes",
    "name": "Pedro Protes",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 600,
  "downloads": 60,
  "createdAt": "2025-11-17T23:15:08.909Z",
  "updatedAt": "2026-01-16T09:06:52.960Z",
  "publishedAt": "2025-11-17T23:15:08.909Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10944"
}