{
  "id": 5904,
  "slug": "5904",
  "title": "Transform meeting notes into action items with Gemini & Google Workspace",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n## ❓ What Problem Does It Solve?\n\nManual transcription and action planning from meeting notes is often error-prone, time-consuming, and inconsistent. Important tasks, decisions, or deadlines can be overlooked or delayed. This workflow solves these pain points by automatically analyzing notes using AI and turning them into actionable, structured data. It drastically reduces follow-up delays, miscommunications, and administrative effort, letting teams focus on execution instead.\n\n## 💡 Why Use Google Meet Automation?\n\n* **Save Hours of Manual Work:** Automatically transform raw meeting notes into structured tasks and emails without lifting a finger.\n* **Ensure Accurate Follow-up:** Never miss important action items or decisions buried in text; everything is extracted and assigned clearly.\n* **Improve Team Collaboration:** Instantly distribute meeting summaries and next steps to attendees, keeping everyone aligned.\n* **Leverage Advanced AI:** Utilize Google Gemini’s powerful natural language processing tailored specifically for meetings.\n* **Fully End-to-End Automated:** From receiving notes to task creation and email dispatch — your post-meeting workflow is completely hands-free.\n\n\n\n### ⚡ Who Is This For?\n\n* **Project Managers:** Streamline task delegation and keep project timelines on track.\n* **Team Leads:** Quickly communicate key takeaways and follow-ups to team members.\n* **Sales and Account Teams:** Document client meetings efficiently and automate follow-up outreach.\n* **Remote Teams:** Ensure clarity and continuity after virtual meetings.\n* **Executives:** Get concise summaries and important decision logs automatically.\n\n### 🔧 What This Workflow Does\n\n* ⏱ **Trigger:** Activated via a POST webhook receiving meeting notes, title, attendees, date, and duration.\n* 📎 **Step 2:** Validates inputs; if missing required fields, sends an error response.\n* 🔍 **Step 3:** Extracts and formats meeting data into structured variables for processing.\n* 🤖 **Step 4:** Sends meeting notes to Google Gemini AI for advanced analysis to identify action items, decisions, summaries, follow-ups, and dates.\n* 💌 **Step 5:** Splits AI responses to create Google Tasks from action items and send personalized follow-up emails via Gmail.\n* 🗂 **Step 6:** Generates a Google Docs meeting summary document and finally returns a success response with all processed results.\n\n\n### 🔐 Setup Instructions\n\n1. Import the provided `Google Meet Automation.json` file into your n8n instance. use [Payload example](https://docs.google.com/document/d/1SJIt0WzRqAVKQeEo7K_dqdHlw37L5aywds9qET2sYGE/edit?usp=sharing)\n\n2. Set up credentials for:\n   * Google OAuth2 API (Google Tasks, Google Docs)\n   * Gmail OAuth2 API for sending emails\n   * Google Palm API (for Google Gemini AI access)\n3. Customize workflow parameters:\n\n   * Webhook URL and access permissions\n   * Google Tasks project or folders if applicable\n   * Email templates if desired (subject line, branding)\n4. Update any API endpoints or credential references to match your account setup.\n5. Thoroughly test with sample meeting note payloads to ensure smooth execution.\n\n### 🧩 Pre-Requirements\n\n* Active [n8n instance](https://n8n.partnerlinks.io/khaisastudio) (Cloud or Self-hosted)\n* Google Cloud Platform project with:\n\n  * Google Tasks API enabled\n  * Google Docs API enabled\n  * Gmail API enabled\n  * Google Palm API access (Google Gemini AI)\n* Valid OAuth2 credentials configured in n8n for above services\n* API quota and permissions for sending emails, creating docs, and tasks\n\n\n### 🛠️ Customize It Further\n\n* Integrate with calendar apps (Google Calendar, Outlook) to auto-schedule next meetings.\n* Add Slack or Microsoft Teams notifications for real-time alerts.\n* Extend AI prompt for deeper insights like sentiment analysis or risk flags.\n* Customize email templates with branding, signatures, or attachments.\n* Connect task outputs with project management tools like Asana, Trello, or Jira.\n\n\n## 📞 Support\n\n**Made by:** [khaisa Studio](khaisa.studio)\n**Tag:** automation, google meet, meeting notes, AI, google tasks, gmail, google docs\n**Category:** Productivity\n**Need a custom?** **[Contact Us](khaisa.studio/contact)** \n",
  "featuredImage": "/data/workflows/5904/5904.webp",
  "author": {
    "id": 101,
    "slug": "khaisastudio",
    "name": "Khaisa Studio",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1802,
  "downloads": 180,
  "createdAt": "2025-07-12T08:57:08.124Z",
  "updatedAt": "2026-01-16T08:42:03.006Z",
  "publishedAt": "2025-07-12T08:57:08.124Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5904"
}