{
  "id": 10688,
  "slug": "10688",
  "title": "Daily habit RPG: Gamified Gmail reminders with quest system and progress tracking",
  "description": "Who's it for\nThis template is perfect for anyone struggling with habit consistency who wants a fun, engaging way to maintain daily routines. It's ideal for productivity enthusiasts, fitness beginners, remote workers, students, or anyone who loves gamification and RPG elements. If you've ever wished your daily tasks felt more like an adventure game, this workflow is for you.\nHow it works\nThe workflow runs automatically every morning at your chosen time (default: 6 AM) and transforms your daily habits into an RPG adventure:\n1. Daily Trigger - Scheduled to run every morning\n2. Player Stats Generation - Creates random level, XP, and streak data (in production, connect to a database)\n3. Quest Generation - Assigns daily \"quests\" based on the day of week (weekday routines, weekend specials, Monday goals)\n4. Quote Fetching - Gets a motivational quote from a free API\n5. Achievement Processing - Checks for milestone achievements (7-day streak, 30-day streak, level 10)\n6. Email Creation - Builds a beautiful HTML email with game-like design\n7. Email Delivery - Sends the quest email via Gmail\n8. Stats Logging - Records execution statistics\nThe system includes different habit sets for weekdays and weekends, random bonus quests, a rank system (D to SSS), achievement unlocks, and progress tracking with visual elements like progress bars.\nSetup steps\nSetup takes approximately 5 minutes:\n1. Import the workflow into your n8n instance\n2. Connect Gmail - Click \"Create New\" in the Gmail node credentials and authenticate via OAuth2\n3. Update recipient email - Change \"your-email@gmail.com\" to your actual email in the \"Send Quest Email\" node\n4. Customize habits (optional) - Edit the quest arrays in the \"Generate Daily Quests\" node\n5. Test the workflow - Click \"Execute Workflow\" to send a test email\n6. Activate - Toggle the workflow to \"Active\" when ready for daily automation\nRequirements\n* Gmail account with OAuth2 authentication\n* n8n instance (cloud or self-hosted)\n* No external API keys required (uses free Quotable API)\n* No database required (uses random data for demonstration)\nHow to customize the workflow\nModify Daily Habits\nEdit the questDatabase object in the \"Generate Daily Quests\" node:\n* Add your own habits with custom names\n* Adjust XP and coin rewards\n* Change difficulty levels (Easy, Medium, Hard, Epic, Bonus)\n* Set different quests for weekdays vs weekends\nVisual Customization\nIn the \"Create Email Template\" node:\n* Modify color schemes in the CSS\n* Adjust font sizes and layouts\n* Change emoji icons for quests\n* Update achievement thresholds\nTiming and Schedule\nIn the \"Daily Morning Trigger\" node:\n* Change the trigger hour (default: 6 AM)\n* Adjust timezone if needed\n* Set different schedules for weekdays/weekends\nMotivational Content\n* Update daily motivation messages for each day of the week\n* Customize achievement names and descriptions\n* Modify rank titles and progression\n* Add your own fallback quotes\nThis workflow brings the addictive nature of RPG games to your daily habits, making routine tasks feel like an epic adventure. Perfect for anyone who wants to level up their life, one quest at a time!",
  "featuredImage": "/data/workflows/10688/10688.webp",
  "author": {
    "id": 101,
    "slug": "ueharayuuki1012",
    "name": "ueharayuuki",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 213,
  "downloads": 21,
  "createdAt": "2025-11-10T12:40:33.178Z",
  "updatedAt": "2026-01-16T09:05:55.930Z",
  "publishedAt": "2025-11-10T12:40:33.178Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10688"
}