{
  "id": 6123,
  "slug": "6123",
  "title": "Real-time currency conversion via webhook & Google search parsing",
  "description": "This automated n8n workflow provides real-time currency conversion by capturing GET requests via a webhook, parsing exchange rate data from Google Search, and returning a formatted response. The system handles query parameter validation and error cases to ensure reliable conversions.\n\n## What is Real-Time Currency Conversion?\nReal-time currency conversion involves fetching the latest exchange rates from Google Search via HTTP requests, processing the data, and delivering a user-friendly conversion result based on a provided query parameter.\n\n## Good to Know\n- The workflow requires a valid query parameter (q) for conversion requests\n- Google Search parsing depends on the availability and structure of search results\n- Error handling is included for missing query parameters\n- Responses are formatted for easy integration\n\n## How It Works\n- **Webhook** - Captures GET requests with query parameter **q**\n- **Check Query Parameter** - Validates that the required query parameter exists\n- **Fetch Exchange Rate** - Makes HTTP request to Google search for exchange rates\n- **Error Response** - Handles missing query parameter errors\n- **Extract Conversion Data** - Processes HTML response to extract conversion data\n- **Format Currency Response** - Formats the result into a user-friendly response\n- **Send Conversion Response** - Returns the formatted response\n\n## How to Use\n- Import the workflow into n8n\n- Configure the webhook to receive GET requests with a query parameter (q)\n- Test the workflow with sample conversion queries (e.g., \"1 USD to INR\")\n- Monitor for error responses and adjust query handling if needed\n\n## Requirements\n- Webhook configuration\n- Internet access for Google Search requests\n\n## Customizing This Workflow\n- Adjust the query parameter validation in the Check Query Parameter node to support additional formats\n- Modify the Format Currency Response node to change the output format based on user needs",
  "featuredImage": "/data/workflows/6123/6123.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 320,
  "downloads": 32,
  "createdAt": "2025-07-18T07:54:50.403Z",
  "updatedAt": "2026-01-16T08:43:16.441Z",
  "publishedAt": "2025-07-18T07:54:50.403Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6123"
}