{
  "id": 4443,
  "slug": "4443",
  "title": "Automated brand mentions tracker with GPT-4o, Google Sheets, and email",
  "description": "![AI Rankings Monitor.png](fileId:1409)\nThis workflow enables you to automate the daily monitoring of how an AI model (like ChatGPT) responds to specific queries relevant to your market. It identifies mentions of your brand and predefined competitors, logs detailed interactions in Google Sheets, and delivers a comprehensive email report.\n\n### Main Use Cases\n\n*   Monitor how your brand is mentioned by AI in response to relevant user queries.\n*   Track mentions of key competitors to understand AI's comparative positioning.\n*   Gain insights into AI's current knowledge and portrayal of your brand and market landscape.\n*   Automate daily intelligence gathering on AI-driven brand perception.\n\n### How it works\n\nThe workflow operates as a scheduled process, organized into these stages:\n\n1.  **Configuration & Scheduling**\n    *   Triggers daily (or can be run manually).\n    *   Key variables are defined within the workflow: your brand name (e.g., \"YourBrandName\"), a list of queries to ask the AI, and a list of competitor names to track in responses.\n2.  **AI Querying**\n    *   For each predefined query, the workflow sends a request to the OpenAI ChatGPT API (via an HTTP Request node).\n3.  **Response Analysis**\n    *   Each AI response is processed by a Code node to:\n        *   Check if your brand name is mentioned (case-insensitive).\n        *   Identify if any of the listed competitors are mentioned (case-insensitive).\n        *   Extract the core AI response content (limited to 500 characters for brevity in logs/reports).\n4.  **Data Logging to Google Sheets**\n    *   Detailed results for each query—including timestamp, date, the query itself, query index, your brand name, the AI's response, whether your brand was mentioned, and any errors—are appended to a specified Google Sheet.\n5.  **Email Report Generation**\n    *   A comprehensive HTML email report is compiled. This report summarizes:\n        *   Total queries processed, number of times your brand was mentioned, total competitor mentions, and any errors encountered.\n        *   A summary of competitor mentions, listing each competitor and how many times they were mentioned.\n        *   A detailed table listing each query, whether your brand was mentioned, and which competitors (if any) were mentioned in the AI's response.\n6.  **Automated Reporting**\n    *   The generated HTML email report is sent to specified recipients, providing a daily snapshot of AI interactions.\n\n### Summary Flow:\n\nSchedule/Workflow Trigger → Initialize Brand, Queries, Competitors (in Code node) → For each Query: Query ChatGPT API → Process AI Response (Check for Brand & Competitor Mentions) → Log Results to Google Sheets → Generate Consolidated HTML Email Report → Send Email Notification\n\n### Benefits:\n\n*   Fully automated daily monitoring of AI responses concerning your brand and competitors.\n*   Provides objective insights into how AI models are representing your brand in user interactions.\n*   Delivers actionable competitive intelligence by tracking competitor mentions.\n*   Centralized logging in Google Sheets for historical analysis and trend spotting.\n*   Easily customizable with your specific brand, queries, competitor list, and reporting recipients.\n",
  "featuredImage": "/data/workflows/4443/4443.webp",
  "author": {
    "id": 101,
    "slug": "tomax",
    "name": "Daniel Shashko",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 958,
  "downloads": 95,
  "createdAt": "2025-05-27T21:43:46.459Z",
  "updatedAt": "2026-01-16T08:34:22.924Z",
  "publishedAt": "2025-05-27T21:43:46.459Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4443"
}