{
  "id": 7418,
  "slug": "7418",
  "title": "Automatically archive old WordPress posts to draft status",
  "description": "##  Overview: Automated WordPress Post Archiving\n\nThis workflow is designed to maintain your blog's health and SEO by automatically moving old, published posts into a \"draft\" or \"archive\" state. This prevents outdated or low-traffic content from negatively impacting your site's performance and allows you to easily review and update them later.\n\n---\n\n## How It Works\n\n1.  **Quarterly Trigger**: The workflow is set to run automatically on a recurring schedule, specifically on the 1st day of every 3rd month (quarterly). This ensures that your content is regularly audited without any manual intervention.\n2.  **Find Old Posts**: The workflow connects to your WordPress site and fetches all published posts that are older than a specified time frame (in this case, 12 months). It uses the WordPress API's filtering capabilities to efficiently find the right content.\n3.  **Check if Posts Found**: An **If** node checks if the previous step found any posts. This prevents the workflow from running further steps if there's nothing to archive. If no posts are found, the workflow ends and logs this.\n4.  **Archive Post**: If posts are found, the workflow proceeds to update each one. It changes the post's status from `publish` to `draft` and automatically adds tags like `archived` and `old-content` for easy identification within your WordPress dashboard.\n5.  **Send Notification**: After the archiving process is complete, the workflow sends an email notification to the administrator. This provides a summary of the activity, letting you know that the task has been completed.\n\n---\n\n## Setup Steps\n\n1.  **Configure WordPress Credentials**: In both the **Find Old Posts** and **Archive Post** nodes, you need to add your WordPress credentials. This typically involves entering your site URL and creating an application password in your WordPress admin dashboard for secure API access.\n2.  **Set Up Email Credentials**: In the **Send Notification** node, add your email service credentials (like SMTP or a Gmail account) to enable the workflow to send you the completion notification.\n3.  **Adjust the Archiving Period**: In the **Find Old Posts** node, the current expression is `{{ $now.minus({ months: 12 }).toISO() }}` which archives posts older than 12 months. You can change the number of months to fit your content strategy (e.g., `24` for two years).\n4.  **Customize Tags**: In the **Archive Post** node, you can customize the tags to better suit your needs. You can change or add new tags that will be applied to the archived posts.\n5.  **Activate the Workflow**: Once all credentials and settings are configured, make sure to activate the workflow to set the quarterly schedule in motion.",
  "featuredImage": "/data/workflows/7418/7418.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "File Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 167,
  "downloads": 16,
  "createdAt": "2025-08-15T07:44:40.859Z",
  "updatedAt": "2026-01-16T08:50:16.240Z",
  "publishedAt": "2025-08-15T07:44:40.859Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7418"
}