{
  "id": 6217,
  "slug": "6217",
  "title": "Automated Instagram reels posting using Google Drive, Cloudinary & Sheets",
  "description": "## Who is this for?\n\nThis workflow is ideal for social media managers, content creators, marketing teams, and automation enthusiasts looking to streamline their Instagram Reels posting from Google Drive using n8n, Google Sheets, and Cloudinary.\n\n## What problem is this workflow solving? / Use case\n\nManually downloading video files, uploading to third-party platforms, and posting to Instagram Reels is time-consuming. This workflow automates the whole process, ensuring timely, consistent content delivery and reducing manual errors.\n\n## What this workflow does\n\n- Automatically fetches scheduled Reel content from Google Sheets ([Sample link](https://docs.google.com/spreadsheets/d/1TjZL_eWbs01DdRYs8pJNDr5UMXzYe8u311o6rVUwjdg/edit?usp=sharing))\n- Downloads video files from Google Drive folders\n- Uploads videos to Cloudinary for hosting\n- Posts the videos as Instagram Reels with custom captions\n- Updates the Google Sheet to mark content as posted\n\n## Setup\n\n- Prepare a Google Drive folder set to public sharing for your videos\n- Create a Cloudinary account and configure upload presets\n- Connect an Instagram Business account (linked to a Facebook Page)\n- Set up a Google Sheet with video post details: `Video Name`, `Type`, `Caption`, `Status`\n- Configure the workflow schedule in n8n\n\n## How to customize this workflow to your needs\n\n- Adjust the schedule for desired posting frequency\n- Add fields to your sheet for custom tags or content variations\n- Change the Cloudinary or Instagram settings for different media types\n- Integrate additional steps for error handling or approval workflows",
  "featuredImage": "/data/workflows/6217/6217.webp",
  "author": {
    "id": 101,
    "slug": "henry",
    "name": "Henry",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1569,
  "downloads": 156,
  "createdAt": "2025-07-21T07:46:34.981Z",
  "updatedAt": "2026-01-16T08:43:54.299Z",
  "publishedAt": "2025-07-21T07:46:34.981Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6217"
}