{
  "id": 5753,
  "slug": "5753",
  "title": "Deploy code to GitHub with natural language via Slack & Claude 3.5",
  "description": "## Github Deployer Agent\n## Overview\nThe Github Deployer Agent is an intelligent automation tool that integrates with Slack to streamline code deployment workflows. Powered by Anthropic's Claude 3.5 and Tavily for web search, it enables seamless, context-aware file pushes to a GitHub repository with minimal user input.\n\n## Capabilities\n- Accepts natural language via Slack\n- Automatically pushes code to a default GitHub repository\n- Uses Claude 3.5 for code generation and decision-making\n- Leverages Tavily for real-time web search to enhance context\n- Supports folder structure hints to ensure clean and organized repositories\n\n## Required Connections\nTo operate correctly, the following integrations must be in place:\n- Slack API Token with permission to read messages and post responses\n- GitHub Personal Access Token with repo write permissions\n- Tavily API Key for external search functionality\n- Claude 3.5 API Access via Anthropic\n\n*Detailed configuration instructions are provided in the workflow*\n\n## Example Input\nFrom Slack, you can send messages like:\n\"Generate a basic `README.md` for my Python project and store it in the root directory.\"\n\n## Customising This Workflow\nYou can tailor the workflow by:\n- Modifying default folder paths or repository settings\n- Integrate Jira node to use issue keys as default folder naming\n- Add slack file upload option ",
  "featuredImage": "/data/workflows/5753/5753.webp",
  "author": {
    "id": 101,
    "slug": "humbleturtle",
    "name": "Humble Turtle",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 233,
  "downloads": 23,
  "createdAt": "2025-07-07T19:41:38.762Z",
  "updatedAt": "2026-01-16T08:41:16.469Z",
  "publishedAt": "2025-07-07T19:41:38.762Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5753"
}