{
  "id": 9859,
  "slug": "9859",
  "title": "Monitor AI research papers with Gemini-powered filtering and email summaries",
  "description": "#### This n8n workflow template implements an intelligent research paper monitoring system that automatically tracks new publications in ArXiv's Artificial Intelligence category, filters them for relevance using LLM-based analysis, generates structured summaries, and delivers a formatted email digest.\n\nThe system uses a three-stage pipeline architecture:\n1. automated paper retrieval from ArXiv's API\n2. AI-powered relevance filtering and analysis via Google Gemini\n3. Intelligent summarization with HTML formatting for clean email delivery\n\nThis eliminates the need to manually browse ArXiv daily while ensuring you only receive summaries of papers genuinely relevant to your research interests.\n\n## What This Template Does (Step-by-Step)\n\n1. Runs on a configurable schedule (Tuesday-Friday) to fetch new papers from ArXiv's cs.AI category via their API.\n2. Uses Google Gemini with structured output parsing to analyze each paper's relevance based on your defined criteria for \"applicable AI research.\"\n3. Generates concise, structured summaries for the three selected papers using a separate LLM call\n4. Aggregates three relevant paper's data and summaries into a single, readable digest\n\n## Important Notes\n- The workflow only runs Tuesday through Friday, as ArXiv typically doesn't publish new papers on weekends\n- Customize the \"Paper Relevance Analyzer\" criteria to match your specific research interests\n- Adjust the similarity threshold and selection logic to control how many papers are included in each digest\n\n## Required Integrations:\n- ArXiv API (no authentication required)\n- Google Gemini API (for relevance analysis and summarization)\n- Email service (SMTP or email provider like Gmail, SendGrid, etc.)\n\n## Best For:\n🎓 Academic researchers tracking AI developments in their field\n💼 ML practitioners and data scientists staying current with new techniques\n🧠 AI enthusiasts who want curated, digestible research updates\n🏢 Technical teams needing regular competitive intelligence on emerging approaches\n\n## Key Benefits:\n✅ Automates daily ArXiv monitoring, saving 60+ minutes of manual research time\n✅ Uses AI to pre-filter papers, reducing information overload by 80-90%\n✅ Delivers structured, readable summaries instead of raw abstracts\n✅ Fully customizable relevance criteria to match your specific interests\n✅ Professional HTML formatting makes digests easy to scan and share\n✅ Eliminates the risk of missing important papers in your field",
  "featuredImage": "/data/workflows/9859/9859.webp",
  "author": {
    "id": 101,
    "slug": "maximosipovs",
    "name": "Maxim Osipovs",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 590,
  "downloads": 59,
  "createdAt": "2025-10-18T09:42:29.590Z",
  "updatedAt": "2026-01-16T09:02:20.771Z",
  "publishedAt": "2025-10-18T09:42:29.590Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9859"
}