{
  "id": 7304,
  "slug": "7304",
  "title": "Automated workflow backup with intelligent change detection using GitHub",
  "description": "# Advanced n8n Workflow Sync with GitHub\n\nA robust workflow to back up and synchronize your n8n workflows to a GitHub repository, with intelligent change detection and support for file renames.\n\n## 🎯 Who's it for?\n\nThis workflow is for n8n administrators, developers, and power users who want a reliable, automated way to:\n\n- Keep a version-controlled history of their workflows.\n- Collaborate on workflows using GitHub's infrastructure.\n- Prevent data loss and have a disaster recovery plan for their n8n instance.\n\n## ✨ Key Features (What it does)\n\n- **Intelligent Sync**: Backs up all your n8n workflows to a designated GitHub repository.\n- **Human-Readable Filenames**: Saves workflows with filenames based on their actual names in n8n (e.g., `My Awesome Workflow.json`).\n- **Reliable Matching**: Uses the unique n8n workflow ID to reliably track files, even if their names change.\n- **Rename Detection**: If you rename a workflow in n8n, it intelligently deletes the old file and creates a new one in a single logical operation.\n- **Efficient Commits**: Commits changes to GitHub only when there are actual modifications to a workflow's logic or structure. It performs a deep comparison, ignoring metadata changes.\n- **Clear Commit History**: Generates clean, informative commit messages:\n  - `create: workflowName`\n  - `update: workflowName`\n  - `rename: oldName - newName`\n\n## ⚙️ How It Works (Simple Steps)\n\n1. **Get n8n Workflows**: The workflow starts by fetching all your current workflows from n8n.\n2. **Get GitHub Files**: At the same time, it lists all existing workflow files from your GitHub repository.\n3. **Compare & Decide**: It then compares each n8n workflow with its GitHub counterpart. It checks if anything changed, if it was renamed, or if it's new.\n4. **Take Action**:\n    - If a workflow is **new**, it's created on GitHub.\n    - If a workflow is **updated**, the file content is changed on GitHub.\n    - If a workflow was **renamed**, the old file is deleted, and a new one is created.\n    - If **nothing changed**, the workflow is skipped.\n5. **Send Report**: Finally, it can send a summary report to Telegram about what happened.\n\n## 🚀 How to Set Up\n\n1. **Credentials**:\n    - **GitHub**: Go to `Credentials` &gt; `New` and add your GitHub credentials. You'll need a token with `repo` permissions.\n    - **n8n API**: In the same `Credentials` section, create `n8n API` credentials. You'll need your n8n instance's Base URL and an API key (you can create one in your n8n user settings).\n    - **Telegram (Optional)**: If you want notifications, add your Telegram Bot credentials.\n\n2. **Configure the Workflow**:\n    - Open the `Configuration` node (the green one at the start).\n    - Fill in the following values:\n        - `repo.owner`: Your GitHub username or organization name.\n        - `repo.name`: The name of the repository for backups.\n        - `repo.path`: The folder inside the repository to store workflows (e.g., `workflows/`).\n        - `report.tg.chatID` (Optional): Your Telegram chat ID for notifications. Set to `0` to disable.\n        - `report.verbose`: Set to `true` to receive a report even if there were no changes.\n\n3. **Connect Credentials**:\n    - Select your newly created credentials in the following nodes:\n        - `Get all workflows`: Select your n8n API credentials.\n        - All GitHub nodes (e.g., `List files`, `Create new file`): Select your GitHub credentials.\n        - `Send a message` (Telegram): Select your Telegram credentials.\n\n4. **Set the Schedule**:\n    - In the `Schedule Trigger` node, configure how often you want the backup to run (e.g., every hour, once a day).\n\n5. **Activate the Workflow**:\n    - Save the workflow and toggle it to \"Active\".\n\n## 🔧 How to Customize\n\n- **Change Report Destination**: The final part of the workflow sends a report to Telegram. You can easily replace the `Send a message` node with a node for Slack, Discord, or email to change where notifications go. The message is pre-formatted in the `Render summary` node.\n\n## 💡 What's Next? (Future Updates)\n\nThis workflow is actively maintained! Here's a sneak peek at what's planned for future versions:\n\n- **Automatic Archive Handling**: The next major update will introduce logic to automatically detect when a workflow is archived in n8n and move it to a dedicated `archived/` folder in your GitHub repository, keeping your main backup directory clean.\n- **Performance Optimizations**: I'm exploring ways to reduce API traffic by intelligently checking for changes before fetching full workflow data.\n\nTo get the latest version with these features when it's released, be sure to follow my profile for new workflow publications!\n",
  "featuredImage": "/data/workflows/7304/7304.webp",
  "author": {
    "id": 101,
    "slug": "j2h4u",
    "name": "Maksym Brashenko",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 585,
  "downloads": 58,
  "createdAt": "2025-08-12T19:11:14.131Z",
  "updatedAt": "2026-01-16T08:49:37.151Z",
  "publishedAt": "2025-08-12T19:11:14.131Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7304"
}