{
  "id": 6442,
  "slug": "6442",
  "title": "Automated Gmail reply drafts with OpenAI assistant for labeled emails",
  "description": "n8n workflow template description [template]\nThis workflow automatically drafts replies to your emails using an OpenAI Assistant, streamlining your inbox management. It's designed for support teams, sales professionals, or anyone looking to accelerate their email response process by leveraging AI to create context-aware draft replies in Gmail.\nHow it works\nThe workflow runs on a schedule (every minute) to check for emails with a specific label in your Gmail account.\nIt takes the content of the newest email in a thread and sends it to your designated OpenAI Assistant for processing.\nA draft reply is generated by the AI assistant.\nThis AI-generated reply is then added as a draft to the original email thread in Gmail.\nFinally, the initial trigger label is removed from the email thread to prevent it from being processed again.\nSet up steps\nConnect your accounts: You'll need to connect your Gmail and OpenAI accounts in the respective nodes.\nConfigure the trigger: In the \"Get threads with specific labels\" Gmail node, specify the label that you want to use to trigger the workflow (e.g., generate-reply). Any email you apply this label to will be processed.\nSelect your OpenAI Assistant: In the \"Ask OpenAI Assistant\" node, choose the pre-configured Assistant you want to use for generating replies.\nConfigure label removal: In the \"Remove AI label from email\" Gmail node, ensure the same trigger label is selected to be removed after the draft has been successfully created.\nActivate the workflow: Save and activate the workflow to begin automating your email replies.",
  "featuredImage": "/data/workflows/6442/6442.webp",
  "author": {
    "id": 101,
    "slug": "melikahichul",
    "name": "Hichul",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1527,
  "downloads": 152,
  "createdAt": "2025-07-25T13:39:00.752Z",
  "updatedAt": "2026-01-16T08:45:01.741Z",
  "publishedAt": "2025-07-25T13:39:00.752Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6442"
}