{
  "id": 4329,
  "slug": "4329",
  "title": "Extract product info from webpage screenshots using Dumpling AI and GPT-4o",
  "description": "\n### Who is this for?\n\nThis workflow is perfect for eCommerce teams, market researchers, and product analysts who want to track or extract product information from websites that restrict scraping tools. It’s also useful for virtual assistants handling product comparison tasks.\n\n---\n\n### What problem is this workflow solving?\n\nMany eCommerce and retail sites use dynamic content or anti-bot protections that make traditional scraping methods unreliable. This workflow bypasses those issues by taking a screenshot of the full page, using OCR to extract visible text, and summarizing product information with GPT-4o—all fully automated.\n\n---\n\n### What this workflow does\n\nThis workflow monitors a Google Sheet for new URLs. Once a new link is added, it performs the following steps:\n\n1. **Trigger on New URL in Sheet** – Watches for new rows added to a Google Sheet.\n2. **Screenshot URL via Dumpling AI** – Sends the URL to Dumpling AI’s screenshot endpoint to capture a full-page image of the product webpage.\n3. **Save Screenshot to Drive Folder** – Uploads the screenshot to a specific Google Drive folder for reference or logging.\n4. **Extract Text from Screenshot with Dumpling AI** – Uses Dumpling AI’s image-to-text endpoint to pull all visible content from the screenshot.\n5. **Extract Product Info from Screenshot Text with GPT-4o** – Sends the extracted raw text to GPT-4o, prompting it to identify structured product information such as product name, price, ratings, deals, and purchase options.\n6. **Split Each Product Entry** – Splits the GPT response (an array of product objects) so each product becomes an individual item for saving.\n7. **Save Products info to Google Sheet** – Appends each product’s structured details to a separate sheet in the same spreadsheet.\n\n---\n\n### Setup\n\n1. **Google Sheet**\n   - Create a Google Sheet with at least two sheets:  \n     - `Sheet1` should contain a header row with a column labeled `URL`.\n     - `Sheet2` should contain headers: `Product Name`, `price`, `purchased`, `ratings`, `deal`, `buyingOptions`.\n   - Connect your Google account in both the trigger and final write-back node.\n\n2. **Dumpling AI**\n   - Sign up at [Dumpling AI](https://app.dumplingai.com)\n   - Create an API key and use it for both HTTP modules:\n     - **Screenshot URL via Dumpling AI**\n     - **Extract Text from Screenshot with Dumpling AI**\n   - The screenshot endpoint used is `https://app.dumplingai.com/api/v1/screenshot`.\n\n3. **Google Drive**\n   - Create a folder for storing screenshots.\n   - In the `Save Screenshot to Drive Folder` node, select the correct folder or provide the folder ID.\n   - Make sure permissions allow uploading from n8n.\n\n4. **OpenAI**\n   - Provide an API key for GPT-4o in the `Extract Product Info from Screenshot Text with GPT-4o` node.\n   - The prompt is structured to return structured product listings in JSON format.\n\n5. **Split & Save**\n   - `Split Each Product Entry` takes the array of product objects from GPT and makes each one a separate execution.\n   - `Save Products info to Google Sheet` writes structured fields into `Sheet2` under:  \n     `Product Name`, `price`, `purchased`, `ratings`, `deal`, `buyingOptions`.\n\n---\n\n### How to customize this workflow\n\n- Adjust the GPT prompt to return different product fields (e.g., shipping info, product categories).\n- Use a filter node to limit which types of products get written to the final sheet.\n- Add sentiment analysis to analyze review content if available.\n- Replace Google Drive with Dropbox or another file storage app.\n\n---\n\n### Notes\n\n- Make sure you monitor your API usage on both Dumpling AI and OpenAI to avoid rate limits.\n- This setup is great for snapshot-based extraction where scraping is blocked or unreliable.\n\n",
  "featuredImage": "/data/workflows/4329/4329.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 489,
  "downloads": 48,
  "createdAt": "2025-05-22T22:11:09.830Z",
  "updatedAt": "2026-01-16T08:33:49.799Z",
  "publishedAt": "2025-05-22T22:11:09.830Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4329"
}