{
  "id": 7528,
  "slug": "7528",
  "title": "Personal finance assistant: Query Notion data via Telegram & WhatsApp with Claude AI",
  "description": "## Query personal finance data in Notion via Telegram and WhatsApp\n\n### Who’s it for\nThis workflow is for individuals who track their finances in Notion and want quick answers via chat. Entrepreneurs, freelancers, and professionals can use it to check expenses, income, or budgets instantly without opening Notion.\n\n### How it works\nThe workflow acts as an **Accountant Agent** powered by Claude AI through OpenRouter. When you send a query like *“Total expenses for August 2025”* through Telegram or WhatsApp, the agent identifies the right Notion database, applies filters, and retrieves the requested data. It then replies with a summarized result directly to your phone.\n\n### How to set up\n1. **Clone the [Personal Finance System Notion template](https://www.notion.so/templates/personal-finance-system)** into your workspace.  \n2. Create a Telegram bot with BotFather and collect the bot token and chat ID.  \n3. Get an API key from OpenRouter.  \n4. Create a Notion integration token and connect it with your duplicated finance template.  \n5. Set up WhatsApp Business credentials via Meta (WABA ID, Phone Number ID, and permanent access token).  \n\n### Requirements\n- n8n instance (self-hosted or cloud)  \n- Accounts on Telegram, OpenRouter, Notion, and WhatsApp Business  \n- Your duplicated **Personal Finance System Notion template**  \n\n### How to customize the workflow\nYou can extend the workflow to handle assets, liabilities, or budgets. Add more Notion databases, adjust query filters, or configure WhatsApp templates for automated financial updates.\n",
  "featuredImage": "/data/workflows/7528/7528.webp",
  "author": {
    "id": 101,
    "slug": "anoop",
    "name": "Anoop",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1152,
  "downloads": 115,
  "createdAt": "2025-08-17T21:08:32.733Z",
  "updatedAt": "2026-01-16T08:50:52.759Z",
  "publishedAt": "2025-08-17T21:08:32.733Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7528"
}