{
  "id": 10246,
  "slug": "10246",
  "title": "Generate AI-curated Reddit digests for Telegram, Discord & Slack with Gemini",
  "description": "Automatically fetch, curate, and distribute Reddit content digests using AI-powered filtering. This workflow monitors multiple subreddits, ranks posts by relevance, removes spam and duplicates, then delivers beautifully formatted digests to Telegram, Discord, or Slack.\n\n## Who's it for\n\nPerfect for content creators tracking trends, marketers monitoring discussions, researchers following specific topics, and community managers staying informed. Anyone who wants high-quality Reddit updates without manually browsing multiple subreddits.\n\n## How it works\n\nThe workflow fetches top posts from your chosen subreddits using Reddit's JSON API (no authentication required). Posts are cleaned, deduplicated, and filtered by upvote threshold and custom keywords. An AI model (Google Gemini, OpenAI, or Claude) then ranks remaining posts by relevance, filters out low-quality content, and generates a formatted digest. The final output is delivered to your preferred messaging platform on a schedule or on-demand.\n\n## Setup requirements\n\n- n8n version 1.0+\n- AI provider API key (Google Gemini recommended - has free tier)\n- At least one messaging platform configured:\n  - Telegram bot token + chat ID\n  - Discord webhook URL  \n  - Slack OAuth token + channel access\n\n## How to set up\n\n1. Open the **Configuration** node and edit subreddit list, post counts, and keywords\n2. Configure the **Schedule Trigger** or use manual execution\n3. Add your AI provider credentials in the **AI Content Curator** node\n4. Enable and configure your preferred delivery platform (Telegram/Discord/Slack)\n5. Test with manual execution, then activate the workflow\n\n## Customization options\n\n- **Subreddits**: Add unlimited subreddits to monitor (comma-separated)\n- **Time filters**: Choose from hour, day, week, month, year, or all-time top posts\n- **Keywords**: Set focus keywords to prioritize and exclude keywords to filter out\n- **Post count**: Adjust how many posts to fetch vs. how many appear in final digest\n- **AI prompt**: Customize ranking criteria and output format in the AI node\n- **Schedule**: Use cron expressions for hourly, daily, or weekly digests\n- **Output format**: Modify the formatting code to match your brand style\n\nAdd email notifications, database storage, or RSS feed generation by extending the workflow with additional nodes.",
  "featuredImage": "/data/workflows/10246/10246.webp",
  "author": {
    "id": 101,
    "slug": "hemantharety",
    "name": "Hemanth Arety",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 417,
  "downloads": 41,
  "createdAt": "2025-10-28T09:56:19.077Z",
  "updatedAt": "2026-01-16T09:04:06.148Z",
  "publishedAt": "2025-10-28T09:56:19.077Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10246"
}