{
  "id": 4565,
  "slug": "4565",
  "title": "Analyze Crunchbase startups by keyword with Bright Data, Gemini AI & Google Sheets",
  "description": "This n8n workflow automates the discovery, enrichment, and comparative analysis of startups from the Crunchbase dataset via Bright Data, enhanced with AI, and exports structured results to Google Sheets.\n\n🚀 **What It Does**\n- Receives a keyword from the user that describes the area of interest — such as an industry, sector, technology, or trend (e.g., \"AI in healthcare\", \"carbon capture\", \"edtech\"). \n- This keyword is used to filter relevant startups from the Crunchbase dataset via Bright Data.\n- Fetches data from Bright Data's Crunchbase snapshot API.\n- Extracts and cleans key fields from the JSON response.\n- Sorts startups by most recent founding date.\n- Selects the top 10 most recent companies.\n- Sends these 10 companies to Google Gemini AI for comparative analysis.\n- Embeds the AI-generated summary into the final export.\n\n- Appends results to a Google Sheet for tracking and reporting.\n\n🛠️ **Step-by-Step Setup**\n1. Get user keyword input from a form.\n2. Use 3 Bright Data requests:\nStart snapshot.\nPoll snapshot status until ready.\nFetch snapshot data in JSON format.\n3. Use a Python Code node to:\n4. Parse and sort companies by founded_date.\n5. Clean and standardize data fields.\n6. Pass the top 10 companies into Gemini AI for comparative insight.\n7. Merge the AI output back with company data.\n8. Send everything to Google Sheets.\n\n🧠 **How It Works**\n- Snapshot Control: Polls every few seconds until the Bright Data snapshot is complete.\n- Code Cleanup: Ensures consistent structure and formatting across all records.\n- Comparative AI Analysis: Gemini compares all 10 companies at once and returns a unified analysis.\n- Merging Output: AI analysis is merged into the first company’s record (to avoid duplication), while all 10 are exported.\n\n📤 **Google Sheet Output**\nEach row includes:\n- name, \nfounded, \nabout, \nnum_employees, \ntype, \nipo_status, \nfull_description, \nsocial_media_links, \naddress, \nwebsite, \nfunding_total, \nnum_investors, \nlead_investors, \nfounders, \nproducts_and_services, \nmonthly_visits, \ncrunchbase_link, \nai_analysis.\n\n- AI comparative analysis summary (only once per batch – attached to the first company).\n- All fields from above customizible through the python code (you can add additional ones from Bright Data output).\n\n🔐 **Required Credentials**\n- **Bright Data** – Replace **YOUR_API_KEY** in 3 HTTP Request nodes.\n- **Google Gemini API** – For AI analysis.\n- **Google Sheets OAuth2** – For spreadsheet export.\n\n⚠️ **Notes**\n- AI output is shared once per batch of 10 companies, attached to the first company entry. You can configure the limit of batch size in the first \"Code\" node.\n\n",
  "featuredImage": "/data/workflows/4565/4565.webp",
  "author": {
    "id": 101,
    "slug": "glebd",
    "name": "Gleb D",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 346,
  "downloads": 34,
  "createdAt": "2025-06-01T19:35:53.627Z",
  "updatedAt": "2026-01-16T08:35:02.068Z",
  "publishedAt": "2025-06-01T19:35:53.627Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4565"
}