{
  "id": 6216,
  "slug": "6216",
  "title": "Automate CV screening & candidate validation with AI & email parsing",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\nThis automated n8n workflow streamlines the process of screening CVs and validating candidate information using AI and email parsing. The system listens for new emails with CV attachments, extracts and processes the data, and either saves valid CVs to a target directory or notifies HR of invalid submissions.\n\n## Good to Know\n- The workflow improves efficiency by automating CV screening and validation.\n- Ensures only CVs with essential fields (e.g., name, email, skills) are processed further.\n- Email notifications alert HR to incomplete or invalid CVs for timely follow-up.\n- The system pauses until all CV data is fully loaded to avoid processing errors.\n\n## How It Works\n1. **Trigger on New CV Email** - Detects new emails with CV attachments.\n2. **Extract Text from PDF CV** - Parses content from attached PDF files.\n3. **Ensure All CV Data Loaded** - Waits until all data is ready for processing.\n4. **Parse & Structure CV Information** - Extracts structured details like name, skills, and experience using AI or custom logic.\n5. **Check CV for Required Fields** - Verifies the presence of essential fields (e.g., name, email, skills).\n6. **Save Valid CV to Folder** - Stores successfully validated CVs into a target directory.\n7. **Notify HR of Invalid CV** - Sends an email alert for incomplete or invalid CVs.\n\n## Data Sources\nThe workflow processes data from email attachments:\n- **CV PDF Files** - Contains candidate information in PDF format.\n\n## How to Use\n- Import the workflow into n8n.\n- Configure email account credentials for monitoring new CV emails.\n- Set up a target directory for storing validated CVs.\n- Test with sample CV PDFs to verify extraction and validation.\n- Adjust AI or custom logic based on specific required fields.\n- Monitor email notifications for invalid CVs and refine the process as needed.\n\n## Requirements\n1. Email account access with IMAP/POP3 support.\n2. PDF parsing capabilities (e.g., OCR or text extraction tools).\n3. AI or custom logic for data extraction and validation.\n4. A target directory for storing validated CVs.\n\n## Customizing This Workflow\n- Modify the \"Check CV for Required Fields\" node to include additional required fields (e.g., education, certifications).\n- Adjust the email notification format to include more details about invalid CVs.\n- Integrate with HR software for seamless candidate tracking.\n\n## Details\n- The workflow ensures efficient CV screening by automating repetitive tasks.\n- Notifications help maintain a high-quality candidate pool by addressing issues early.",
  "featuredImage": "/data/workflows/6216/6216.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 543,
  "downloads": 54,
  "createdAt": "2025-07-21T07:16:38.667Z",
  "updatedAt": "2026-01-16T08:43:51.341Z",
  "publishedAt": "2025-07-21T07:16:38.667Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6216"
}