{
  "id": 3606,
  "slug": "3606",
  "title": "Document analysis & chatbot creation with Llama Parser, Gemini LLM & Pinecone DB",
  "description": "### 📄Description\nThis automation workflow enables users to upload files via an N8N form, automatically analyzes the content using Google Gemini agents, and delivers the analyzed results via email along with a chatbot link. The system leverages Llama Cloud API, Google Gemini LLM, Pinecone vector database, and Gmail to provide a seamless, multilingual content analysis experience.\n\n### ✅ Prerequisites\nBefore setting up this workflow, ensure the following are in place:\n\nAn active N8N instance.\n\nAccess to Llama Cloud API.\n\nGoogle Gemini LLM API keys (for Translator & Analyzer agents).\n\nA Pinecone account with an active index.\n\nA Gmail account with API access configured.\n\nBasic knowledge of N8N workflow setup.\n\n### ⚙️ Setup Instructions\nDeploy the N8N Form\n\nCreate a public-facing form using N8N.\n\nConfigure it to accept:\n\nFile uploads.\n\nUser email input.\n\nFile Preprocessing\n\nStore the uploaded files temporarily.\n\nOrganize and preprocess them as needed.\n\nContent Extraction using Llama Cloud API\n\nFeed the files into the Llama Cloud API.\n\nExtract and parse the content for further processing.\n\n### Translation (if required)\n\nUse a Translator Agent (Google Gemini).\n\nCheck if the content is in English. If not, translate it.\n\n### Content Analysis\n\nForward the (translated) content to the Analyzer Agent (Google Gemini).\n\nPerform deep analysis to extract insights.\n\nVector Storage in Pinecone\n\n### Store both:\n\nThe parsed and translated content.\n\nThe analyzed content.\n\nUse Pinecone to store the content as embeddings for chatbot use.\n\n### User Notification via Gmail\n\nSend the analyzed content and chatbot link to the user’s provided email using Gmail API.\n\n### 🧩 Customization Guidance\nTo add more languages: Update the translation logic to include additional language support.\n\nTo modify analysis depth: Adjust the prompts sent to the Gemini Analyzer Agent.\n\nTo change the chatbot behavior: Retrain or reconfigure the chatbot to utilize the new Pinecone index contextually.\n\n### 🔁 Workflow Summary\nUser uploads files and email via N8N form.\n\nFiles are parsed using Llama Cloud API.\n\nContent is translated (if needed) using Gemini Translator Agent.\n\nTranslated content is analyzed by the Gemini Analyzer Agent.\n\nParsed and analyzed data is stored in Pinecone.\n\nUser receives email with analyzed results and a chatbot link.\n\n",
  "featuredImage": "/data/workflows/3606/3606.webp",
  "author": {
    "id": 101,
    "slug": "pavith",
    "name": "pavith",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 4033,
  "downloads": 403,
  "createdAt": "2025-04-19T06:23:10.288Z",
  "updatedAt": "2026-01-16T08:30:35.069Z",
  "publishedAt": "2025-04-19T06:23:10.288Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3606"
}