{
  "id": 6614,
  "slug": "6614",
  "title": "Practice job interviews with voice-based Google Gemini AI interviewer",
  "description": "## What does this workflow do?\n\nThis workflow acts as the backend \"brain\" for a sophisticated AI Voice Interviewer. It receives a user's resume text and a target job description, then uses a Large Language Model (LLM) to conduct a realistic, voice-based interview. The workflow maintains conversation history to ask relevant follow-up questions, creating a dynamic and personalized interview practice experience.\n\nThis template is designed to work with a simple HTML frontend that handles the voice-to-text and text-to-speech functionality.\n\n## What services does this workflow use?\n\n- **Google Gemini:** This is the LLM used to generate intelligent interview questions. You can easily swap this out for other models like OpenAI.\n\n## What credentials do you need to have?\n\nYou will need one credential:\n- A **Google Gemini API Key**. You can get one for free from the [Google AI Studio](https://aistudio.google.com/app/apikey).\n\n## How to use this workflow\n\nThis workflow is the backend and requires a frontend to interact with.\n\n1.  **Set up the Frontend:** You can find the complete frontend code and setup instructions in this [GitHub repository](https://github.com/Sarry000/ai-voice-interviewer).\n2.  **Configure Credentials:** In this n8n workflow, click on the \"Google Gemini Chat Model\" node and add your own Gemini API credential.\n3.  **Activate the Workflow:** Make sure the workflow is saved and active.\n4.  **Connect Frontend to Backend:** Click on the \"Webhook\" node and copy the **Production URL**. Paste this URL into the `voice-interview.html` page as instructed in the GitHub repository's `README.md` file.\n5.  **Start Interviewing:** Fill out the form on the web page to begin your voice interview!\n",
  "featuredImage": "/data/workflows/6614/6614.webp",
  "author": {
    "id": 101,
    "slug": "sarry",
    "name": "Sarry",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1377,
  "downloads": 137,
  "createdAt": "2025-07-29T08:38:45.607Z",
  "updatedAt": "2026-01-16T08:45:58.214Z",
  "publishedAt": "2025-07-29T08:38:45.607Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6614"
}