{
  "id": 11009,
  "slug": "11009",
  "title": "Process social media leads with GPT-4.1 summaries, Google Sheets, Jira & Slack",
  "description": "# Automated Social Media Lead Processing with AI Summaries, Slack Alerts & Jira Ticketing\n\nThis workflow automatically collects new lead messages from social media platforms, LinkedIn or web forms, filters relevant marketing inquiries using keywords, classifies and summarizes the lead with AI, logs it to Google Sheets, creates a Jira task and sends Slack notifications. Additionally, it generates weekly lead reports for team insights.  \n\nIt reduces manual triage, ensures no valid inquiry is missed and keeps your team updated with both immediate notifications and summary reports.\n\n### Quick Start – Implementation Steps\n\n1. Connect your webhook to your social media inbox, LinkedIn, Twitter or web form.  \n2. Add your OpenAI, Google Sheets, Jira and Slack credentials.  \n3. Enable the workflow.  \n4. Send a test message to confirm Google Sheets logging, Slack notification and Jira task creation.  \n5. Activate the scheduler for weekly reports to track lead performance.\n\n## What It Does\n\nThis workflow performs the following key tasks:\n\n* Filters incoming messages for marketing-related keywords like *ad request*, *promo request*, *collaboration*, *partnership* or *social media inquiry*.  \n* Uses OpenAI GPT to classify the lead into categories such as Sales, Support, Partnership, Influencer Inquiry or General Lead.  \n* Generates a short AI summary of the message.  \n* Logs structured lead data to Google Sheets, including username, source, category, summary and timestamp.  \n* Creates a Jira task automatically with summary, description, category and received time.  \n* Sends a Slack notification to alert the team instantly.  \n* Runs a scheduled workflow that aggregates weekly leads and sends a weekly report to Slack.\n\nThis ensures a structured, automated pipeline for capturing, summarizing and assigning leads efficiently.\n\n## Who’s It For\n\n* Marketing and sales teams managing leads from social media and web forms. \n* Agencies handling client campaigns and inquiries.\n* Businesses that want automated notifications and ticketing.\n* Teams using Slack and Jira for daily operations.\n\n## Requirements to Use This Workflow\n\n* n8n account or self-hosted instance.  \n* Webhook-enabled social media inbox or lead form.  \n* OpenAI API Key.  \n* Slack Bot Token with channel posting permission.  \n* Jira Software Cloud API credentials.  \n* Google Sheets credentials.  \n* Predefined keyword list for filtering messages.  \n\n## How It Works & Setup Steps\n\n### 1. Get DM (Webhook Trigger)\n\nReceives new messages from social media or web forms and starts the workflow.\n\n### 2. Lead Keyword Filter (Code Node)\n\nFilters incoming messages for predefined marketing keywords and removes irrelevant or spam messages.\n\n### 3. AI Lead Classifier (OpenAI Node)\n\nClassifies the lead into categories (Sales, Support, Partnership, Influencer Inquiry, General Lead) and generates a one-line summary using GPT-4.1.\n\n### 4. AI Output Parser (Code Node)\n\nParses AI JSON output and merges it with original message data, adding timestamp and structured fields.\n\n### 5. Store Lead (Google Sheets Node)\n\nLogs structured lead data to Google Sheets including username, source, category, summary and timestamp.\n\n### 6. Create Task (Jira Node)\n\nAutomatically creates a Jira story or task in your selected project with the AI summary, category and timestamp.\n\n### 7. Send a Summary (Slack Node)\n\nSends a formatted message to your selected Slack channel, alerting your team of the new lead.\n\n### 8. Weekly Reporting\n\n* **Schedule Trigger** – triggers the weekly reporting workflow.  \n* **Extract Lead Data** – fetches all logged leads from Google Sheets.  \n* **Weekly Lead Filter** – filters data to include leads from the last week.  \n* **Report Data Formatter** – calculates total leads, category counts, source counts and example leads.  \n* **Weekly Report Slack** – sends a formatted weekly lead summary to Slack.\n\n## How to Customize Nodes\n\n### Keyword Filter\n\nAdd or remove keywords in the JavaScript code to match your specific lead types or campaigns.\n\n### AI Classification\n\nUpdate the OpenAI prompt for different summary lengths, tones, or lead categories.\n\n### Google Sheets Logging\n\nMap additional columns like email, phone or campaign source as needed.\n\n### Jira Fields\n\nCustomize summary, description, labels, priority or assignees based on your project requirements.\n\n### Slack Message Format\n\nModify emojis, line breaks and formatting to suit your team’s Slack notifications.\n\n## Add-Ons (Extend the Workflow)\n\n* Send email alerts for high-priority leads.  \n* Trigger WhatsApp replies using an API provider.\n* Integrate with CRMs like HubSpot, Zoho or Salesforce.\n* Add sentiment analysis to detect frustrated or VIP users.\n* Automate daily or weekly analytics reports to Slack.\n\n## Use Case Examples\n\n1. Collecting Instagram, LinkedIn and Twitter DMs and logging them to Google Sheets.  \n2. Creating automated Jira tickets for marketing inquiries.  \n3. Sending instant Slack notifications for new leads.  \n4. Filtering out irrelevant messages and only processing valid marketing leads.  \n5. Generating weekly lead summary reports for team review.  \n\n## Troubleshooting Guide\n\n| Issue | Possible Cause | Solution |\n|-------|----------------|----------|\n| No leads appearing | Webhook not receiving messages | Check webhook URL and ensure messages are sent correctly |\n| AI summary empty | OpenAI API key invalid or model limit reached | Regenerate API key / check usage |\n| Jira task not created | Missing required Jira fields or incorrect project ID | Add required fields or update Jira project settings |\n| Slack message not sent | Wrong channel ID or missing permissions | Reconnect Slack credentials |\n| Filter passes 0 items | Keywords do not match | Update or expand keyword list in filter node |\n\n\n## Need Help?\n\nIf you need assistance setting up this workflow, customizing nodes, building add-ons or automating more processes, our [n8n workflow development team](https://www.weblineindia.com/hire-n8n-developers/) at **WeblineIndia** is happy to help. We can guide you through integrations, scaling or building end-to-end automation systems tailored to your business.",
  "featuredImage": "/data/workflows/11009/11009.webp",
  "author": {
    "id": 101,
    "slug": "weblineindia",
    "name": "WeblineIndia",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 18,
  "downloads": 1,
  "createdAt": "2025-11-19T10:59:06.578Z",
  "updatedAt": "2026-01-16T09:07:06.982Z",
  "publishedAt": "2025-11-19T10:59:06.578Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11009"
}