{
  "id": 11154,
  "slug": "11154",
  "title": "Generate personalized BP meal plans with Gemini, Google Search, and QuickChart",
  "description": "**Description:** Transform your health data into actionable meal plans with an Advanced AI Chain. 🥗🤖\n\nThis workflow goes beyond a simple prompt. It orchestrates a chain of Google Gemini agents to manage your blood pressure. It acts as a personal health assistant that analyzes your data, strategizes a diet plan, and finds real-world recipes.\n\n## Key Features:\n\nDual AI Logic: Uses Gemini (1.5-flash) in two stages—first to decide the search strategy based on BP status (High/Normal), and second to synthesize a 5-day meal plan.\n\nReal Recipe Search: Automatically searches Google for recipes that match the AI's dietary strategy (e.g., \"Low sodium dinner\").\n\nVisual Tracking: Generates a blood pressure trend chart using QuickChart.io and attaches it to the email report.\n\nOrganized Layout: Nodes are clearly grouped into sections (Data Collection, AI Strategy, Execution, Synthesis) for easy customization.\n\n## How it works:\n\nAnalyze: Fetches last 7 days of BP data from Google Sheets.\n\nDecide: AI determines the best search keywords (e.g., \"Dash diet recipes\") based on your average BP.\n\nExecute: Searches for recipes and generates a chart simultaneously.\n\nSynthesize: AI combines the recipes and health stats into a weekly plan.\n\nDeliver: Emails the plan and chart to you.\n\n## Setup Requirements:\n\nGoogle Sheets: Create headers: date, systolic, diastolic.\n\nGoogle Gemini API Key\n\nGoogle Custom Search API Key & Engine ID\n\nGmail",
  "featuredImage": "/data/workflows/11154/11154.webp",
  "author": {
    "id": 101,
    "slug": "shuichi",
    "name": "NODA shuichi",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 9,
  "downloads": 0,
  "createdAt": "2025-11-23T12:03:14.930Z",
  "updatedAt": "2026-01-16T09:07:45.160Z",
  "publishedAt": "2025-11-23T12:03:14.930Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11154"
}