{
  "id": 11857,
  "slug": "11857",
  "title": "Personalized customer retention campaigns with GPT-4o analytics & Gmail",
  "description": "## HOW IT WORKS\nThis workflow automates end-to-end data intelligence processing by ingesting structured data (CSV, JSON), enriching it through multiple AI analysis pathways, and generating actionable insights. Designed for business analysts, data scientists, and operations teams, it solves the problem of manual data enrichment and fragmented analysis by consolidating diverse AI models (GPT-4, LLM analysis, sentiment detection) into a unified pipeline. Data flows from source ingestion → enrichment/validation → branching into three specialized analysis paths (Competitive Intelligence, Sentiment Analysis, Market Insights) → aggregation → result storage (Google Sheets) and notifications (Slack, Gmail). Each path applies distinct AI models for comprehensive intelligence gathering.\n\n## SETUP STEPS\n1. Configure OpenAI API key in credentials\n2. Set up Google Sheets connection with service account\n3. Add Slack webhook for notifications\n4. Connect Gmail for automated report distribution\n5. Configure NVIDIA API (if using specialized models)\n6. Map input data source (CSV upload or API endpoint)\n7. Test each branch independently before full deployment\n\n## PREREQUISITES\nOpenAI API key, Google Sheets access, Slack workspace, Gmail account, basic n8n familiarity.  \n\n## USE CASES\nMarket research automation, competitive intelligence monitoring, customer feedback analysis at scale \n\n## CUSTOMIZATION\nSwap AI models (Claude, Gemini, Llama), add/remove analysis branches, modify output destinations \n\n## BENEFITS\nEliminates manual data processing (80% time savings), enables simultaneous multi-perspective analysis ",
  "featuredImage": "/data/workflows/11857/11857.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 54,
  "downloads": 5,
  "createdAt": "2025-12-16T11:27:05.249Z",
  "updatedAt": "2026-01-16T09:10:25.130Z",
  "publishedAt": "2025-12-16T11:27:05.249Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11857"
}