{
  "id": 5270,
  "slug": "5270",
  "title": "🎓 Learn n8n keyboard shortcuts with an interactive hands-on tutorial workflow",
  "description": "## How it works\n\nThis template is an interactive playground designed to help you master the most useful keyboard shortcuts in n8n and supercharge your building speed. Forget boring lists—this workflow gives you hands-on tasks to complete, turning learning into a practical exercise.\n\nThe workflow is structured into four chapters, each focusing on a different aspect of workflow development:\n\n1.  **Node Basics:** Learn the fundamentals of interacting with a single node, such as renaming, editing, duplicating, and deactivating.\n2.  **Canvas Navigation & Selection:** Master the art of moving around the canvas and selecting multiple nodes efficiently.\n3.  **Advanced Actions:** Discover powerful moves like tidying up messy connections and creating sub-workflows.\n4.  **Execution & Debugging:** Uncover essential shortcuts for testing your workflows, like pinning data and navigating the executions panel.\n\nEach step provides a clear task in a sticky note, guiding you to perform the action yourself.\n\n## Set up steps\n\n**Setup time: 0 minutes!**\n\nThis workflow is a self-contained tutorial and requires no setup, credentials, or configuration.\n\n1.  Open the workflow.\n2.  Follow the instructions in the sticky notes, starting from the top.\n3.  Perform the actions as described to build muscle memory for each shortcut.\n\nThat's it! Get ready to become an n8n power user.",
  "featuredImage": "/data/workflows/5270/5270.webp",
  "author": {
    "id": 101,
    "slug": "lucaspeyrin",
    "name": "Lucas Peyrin",
    "avatar": ""
  },
  "categories": [
    "Miscellaneous"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5147,
  "downloads": 514,
  "createdAt": "2025-06-24T22:49:03.368Z",
  "updatedAt": "2026-01-16T08:38:41.783Z",
  "publishedAt": "2025-06-24T22:49:03.368Z",
  "nodes": 46,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5270"
}