{
  "id": 9284,
  "slug": "9284",
  "title": "Automate meeting summaries & action items with Google Meet, AssemblyAI & Claude AI",
  "description": "The Google Meet AI Assistant workflow provides intelligent meeting analysis by integrating Google Calendar, Google Drive, AssemblyAI transcription, Anthropic Claude AI, Slack, and Notion. It automates the complete process of fetching meeting data, retrieving recordings, transcribing conversations, analyzing with AI, and distributing actionable insights.\n\n**Workflow Steps**\n\nStep 1: Fetch Meetings\n- Retrieves Google Calendar events from the last 24 hours.\n- Filters for confirmed meetings with Google Meet conference links.\n\nStep 2: Get Recording\n- Searches for the meeting recording file saved in Google Drive.\n- Downloads the recording for transcription purposes.\n\nStep 3: Transcribe Recording\n- Uses AssemblyAI to transcribe the recording.\n- Transcription includes speaker labels, highlights, and sentiment analysis.\n\nStep 4: AI Analysis\n- Analyzes the transcript with Anthropic Claude AI.\n- Extracts:\nMeeting summary (2-3 paragraphs)\nAction items with responsible parties\nMentioned dates or deadlines\nOverall meeting sentiment\n\nStep 5: Distribute Summary\n- Posts meeting summary and insights to a Slack channel.\n- Creates tasks for action items in Notion.\n\n**Integration Overview**\n- Google Calendar: Event retrieval and filtering of Google Meet meetings.\n- Google Drive: Recording search and download.\n- AssemblyAI: Audio transcription with advanced features.\n- Anthropic Claude (Langchain): AI-driven analysis of transcripts.\n- Slack: Notification distribution for meeting summaries.\n- Notion: Task creation for actionable items.\n\n**Error Handling**\nIf a recording is not found, stops execution and returns an error message:\n*\"No recording found for this meeting. Please ensure the meeting was recorded and saved to Google Drive.\"*\n\n**Summary**\nThis workflow fully automates the end-to-end process of meeting analysis from calendar event detection to action item task creation using AI, enabling productivity gains for meeting-heavy teams.\n\nIf further use or support is needed, you can contact me via [LinkedIn](LinkedIn).\n\nIf you want, I can also help create a detailed documentation or a formatted description ready for sharing or integration guides. Let me know!",
  "featuredImage": "/data/workflows/9284/9284.webp",
  "author": {
    "id": 101,
    "slug": "dominicgs",
    "name": "Dominic GS",
    "avatar": ""
  },
  "categories": [
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 444,
  "downloads": 44,
  "createdAt": "2025-10-05T17:49:54.014Z",
  "updatedAt": "2026-01-16T08:59:49.199Z",
  "publishedAt": "2025-10-05T17:49:54.014Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9284"
}