{
  "id": 9208,
  "slug": "9208",
  "title": "Automate RSS-to-social media with AI summaries and image generation",
  "description": "## How it works\n\nThis workflow automates publishing content from any RSS feed directly to Facebook and Instagram.\nIt reads new RSS entries, extracts the article content, generates a short social-media-friendly summary using an AI model, and then creates an AI-generated image based on the topic.\nThe post is uploaded to Facebook and Instagram (via Graph API) and logged in Google Sheets for reference.\nFinally, a Telegram bot sends you a notification with links to the published posts.\n\n## Set up steps\n\t1.\tInsert your RSS feed URL in the RSS Feed Trigger node.\n\t2.\tConfigure Google Sheets credentials and replace the example sheet with your own.\n\t3.\tIn Supabase Config, insert your Supabase URL and bucket name.\n\t4.\tIn Facebook/Instagram nodes, replace [INSERT_YOUR_SITE_ID] with your own page or account ID.\n\t5.\tConnect your Facebook Graph API credentials (remove hardcoded tokens).\n\t6.\tConnect your OpenAI / Anthropic / Gemini credentials for text and image generation.\n\t7.\tSet up your Telegram Bot credentials if you want to receive notifications.\n\n## Notes\n\t•\tSticky notes inside the workflow explain each section (RSS trigger, filtering, content generation, posting, logging, notifications).\n\t•\tNo credentials are saved in the template – you must connect your own before running.\n\t•\tAll generated content (text + images) is fully automated but can be customized (e.g. change AI prompts for your preferred style).\n",
  "featuredImage": "/data/workflows/9208/9208.webp",
  "author": {
    "id": 101,
    "slug": "smart-camp-ai",
    "name": "Karol Otręba",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 738,
  "downloads": 73,
  "createdAt": "2025-10-02T20:44:45.874Z",
  "updatedAt": "2026-01-16T08:59:28.970Z",
  "publishedAt": "2025-10-02T20:44:45.874Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9208"
}