{
  "id": 12113,
  "slug": "12113",
  "title": "Invoice management system with Gmail reminders, Google Sheets, and Slack escalations",
  "description": "## Who is this for?\n\nThis template is designed for freelancers, small businesses, and finance teams who need automated invoice management with intelligent payment follow-ups. Perfect for service providers, agencies, or any business that needs to track receivables and reduce late payments.\n\n## What this workflow does\n\nThis workflow provides complete invoice lifecycle management with two main flows:\n\n**Invoice Generation Flow:**\n- Receives order data via webhook with line items\n- Splits line items using Split Out node for individual processing\n- Calculates subtotals, tax, and totals\n- Aggregates results and saves to Google Sheets\n- Sends professional invoice email with payment link\n\n**Payment Reminder Flow:**\n- Runs daily via Schedule Trigger to check for overdue invoices\n- Loops through unpaid invoices using Split In Batches\n- Routes to appropriate reminder level using Switch node (5 levels)\n- Sends escalating reminders: friendly → second notice → urgent → final → collections\n- Notifies internal team via Slack for collections handoff\n\n## Setup\n\n1. Create a Google Sheet with columns: Invoice ID, Client, Email, Subtotal, Tax, Total, Due Date, Status, Created, Last Reminder\n2. Connect Google Sheets and Gmail credentials\n3. Configure Slack for collections escalation notifications\n4. Set up the webhook URL in your order management system\n\n## Requirements\n\n- Google Sheets (invoice database)\n- Gmail account (invoice and reminder emails)\n- Slack workspace (collections notifications)\n\n## How to customize\n\n- Adjust overdue day thresholds in the Code node\n- Add SMS reminders via Twilio for urgent notices\n- Modify email templates for your brand\n- Connect to accounting software for automatic reconciliation\n\n",
  "featuredImage": "/data/workflows/12113/12113.webp",
  "author": {
    "id": 101,
    "slug": "isakai",
    "name": "飯盛　正幹",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 58,
  "downloads": 5,
  "createdAt": "2025-12-24T16:17:25.403Z",
  "updatedAt": "2026-01-16T09:11:25.942Z",
  "publishedAt": "2025-12-24T16:17:25.403Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12113"
}