{
  "id": 11691,
  "slug": "11691",
  "title": "Monitor school admission updates with web scraping, Gemini AI & email alerts",
  "description": "This N8N template helps keep track of multiple school websites for admission updates and sends an email notification.\n\n## Good To Know\nThis template uses all free tier tools like Gemini for LLM, Email alerting, \n\n## How it works\n- For each School Website provided:\n\t- Get & clean the content through HTTP Request Node\n\t- Gemini model takes the HTML content and defined prompt that instructs on how to identify if Pre-nursery Admissions for year 2026-207 have announced yet.\n\t- If LLM response confirms the announcement, trigger an email to the configured address.\n\n## Features\n- Scheduled daily checks\n- HTTP scraping\n- Google Gemini text extraction for admission for Pre-nursery\n- Email alerts\n\n## How to use\n1. Import workflow. \n2. Provide already created or new Gemini API key within \"Are admissions open\" node.\n2. Setup SMTP account credentials within \"Send Email\" node, along with From-Email and To-Email.\n3. Finally update your list of School and their Admission URLs within \"Shortlisted Schools\" node.\n\n## Customizing the workflow\n1. It can be used for tracking school admissions for any class including Pre-Nursery/ Bal-vatika/ 1st etc. via modifying the prompt.\n2. It can be used for tracking any school that has details uploaded on their websites and can be extracted via HTTP request node.\n",
  "featuredImage": "/data/workflows/11691/11691.webp",
  "author": {
    "id": 101,
    "slug": "aimasterishita",
    "name": "Ishita Virmani",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 27,
  "downloads": 2,
  "createdAt": "2025-12-11T09:23:05.005Z",
  "updatedAt": "2026-01-16T09:09:41.892Z",
  "publishedAt": "2025-12-11T09:23:05.005Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11691"
}