{
  "id": 10754,
  "slug": "10754",
  "title": "Automate SEO blog creation from trends using Gemini AI, Apify, and Google Docs",
  "description": "# Automate SEO Blog Creation with Apify + Google Docs + KIE AI’s Nano Banana API\n\n## Who’s it for\n\nFor content creators, SEO specialists, and digital marketers who want to automatically generate SEO-optimized blog posts from trending topics — no manual writing or formatting required.\n\n## How it works / What it does\n\nThis workflow turns trending searches into fully structured blog posts using AI:\n1. Fetch trending topics from India (or any country) using Apify’s Google Trends scraper.\n2. Generate a SEO-optimized blog post with title, meta description, headings, and long-form content using Gemini AI.\n3. Refine the System Message (optional) with Gemini AI for better readability and engagement.\n4. Create a custom blog image using KIE AI’s Nano Banana API based on the blog title.\n5. Automatically insert all content and images into a Google Doc, ready for publishing.\n\n## How to set up\n1. Add your Apify API token in the Google Trends node.\n2. Configure Google Docs OAuth2 credentials for the document update node.\n3. Add your KIE AI Nano Banana API token for image generation.\n4. Schedule the Daily Trigger to your preferred time (default is 8 AM).\n\n## Requirements\n1. Apify API token (for trending search scraping)\n2. Google account with Docs access\n3. KIE AI Nano Banana API token\n\n## How to customize the workflow\n1. Change country or timeframe for trending searches.\n2. Update the AI prompt for tone, length, or style of the blog.\n3. Change the Google Doc ID to insert content into a different document.\n4. Adjust image generation settings (size, style) in the KIE AI node.",
  "featuredImage": "/data/workflows/10754/10754.webp",
  "author": {
    "id": 101,
    "slug": "parthpansuriya",
    "name": "Parth Pansuriya",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 318,
  "downloads": 31,
  "createdAt": "2025-11-12T12:22:40.062Z",
  "updatedAt": "2026-01-16T09:06:09.611Z",
  "publishedAt": "2025-11-12T12:22:40.062Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10754"
}