{
  "id": 7788,
  "slug": "7788",
  "title": "AI-powered workflow documentation & promotion with Gemini, Notion & LinkedIn",
  "description": "Automated n8n Workflow Documentation and LinkedIn Promotion\n\nStreamline your n8n workflow management! This powerful workflow automatically documents your n8n creations in Notion and promotes them on LinkedIn, all triggered by a simple file upload to Google Drive. Leverage Google Gemini AI to generate comprehensive descriptions and engaging social media content effortlessly.\n\n### Who is this For\nThis workflow is perfect for:\n- **n8n Developers** who want to save time on manual documentation\n- **Content Creators** regularly sharing n8n workflow templates\n- **Teams** needing a centralized, updated database of their automation solutions\n- **Consultants** showcasing their n8n expertise and offerings\n- **Anyone** looking to automate their workflow publishing and promotion process\n\n### Features\n*   **Automated Trigger**: Starts when an n8n workflow JSON is uploaded to a designated Google Drive folder.\n*   **AI-Powered Description Generation**: Google Gemini AI analyzes your workflow JSON and creates a detailed, human-readable description.\n*   **Notion Database Integration**: Automatically creates a new page in your Notion database, populated with the workflow's title, AI-generated description, and a direct download link.\n*   **Dynamic LinkedIn Post Creation**: Transforms the workflow description into an engaging, shareable LinkedIn post.\n*   **Seamless LinkedIn Publishing**: Automatically posts the generated content to your LinkedIn profile to reach your audience.\n*   **Centralized Documentation**: Maintains an organized and always-current record of your n8n templates.\n\n### How It Works\n1.  **Upload Workflow JSON to Google Drive:**\n    - Simply drag and drop your n8n workflow's JSON file into a specific Google Drive folder configured in the workflow.\n\n2.  **AI Analyzes and Generates Content:**\n    - The workflow automatically detects the new file and downloads its content.\n    - Google Gemini AI then analyzes the workflow JSON to understand its functionality.\n    - The AI crafts a comprehensive description and an engaging LinkedIn post based on the analysis.\n\n3.  **Notion Documentation:**\n    - A new page is automatically created in your specified Notion database.\n    - This page includes the workflow's title, the AI-generated description, and a direct link to the original JSON file on Google Drive for easy download.\n\n4.  **LinkedIn Promotion:**\n    - The AI-generated LinkedIn post is automatically published to your LinkedIn profile.\n    - This allows you to effortlessly share your latest n8n creations with your network.\n\n5. **Video Demo:**\n\t- [See this youtube Video](https://youtu.be/qbb5Z2N0nx8) to explore \"how it works\".\n\n\n### Setting Up Google Drive and AI\n1.  **Import the Workflow**\n    - Create a new workflow in n8n\n    - Import the JSON file by clicking \"three dots\" (upper right corner) &gt; \"Import from file...\"\n\n2.  **Configure Google Drive Credentials**\n    - In the \"wait for the json file upload\" node, connect your \"Google Drive OAuth2 API\" credential.\n    - Select the specific Google Drive folder where you will upload your n8n workflow JSON files.\n    - In the \"Download the json\" node, connect the same \"Google Drive OAuth2 API\" credential.\n\n3.  **Configure Google Gemini API**\n    - Get your Google AI Studio API key from [Google AI Studio](https://aistudio.google.com)\n    - Create a \"Google Gemini (PaLM) API\" credential in n8n.\n    - Connect this credential to both the \"Description generator\" and \"Linkedin post generator\" nodes.\n\n### Setting Up Notion and LinkedIn\n1.  **Set Up Notion Integration**\n    - In the \"Create the notion page\" node, connect your \"Notion API\" credential.\n    - Select your Notion database. Ensure your Notion database has at least the following properties: \"Title\" (Title type), \"Description\" (Rich text type), \"Automation Tools\" (Select type), \"Status\" (Select type), and \"Template-Download-Link\" (URL type).\n\n2.  **Set Up LinkedIn Integration**\n    - In the \"Create the linkedIn post\" node, connect your \"LinkedIn OAuth2 API\" credential.\n    - Specify the `Person ID` to whom the post should be published (this is usually your profile ID).\n\n3.  **Test the Workflow**\n    - Activate the workflow.\n    - Upload an n8n workflow JSON file to your designated Google Drive folder.\n    - Verify that a Notion page is created and a LinkedIn post is published successfully.\n\n### Pre-requisites\n*   **Necessary Accounts:**\n    1.  Google Account (for Google Drive access)\n    2.  Google AI Studio Account (for Gemini API access)\n    3.  Notion Account (with a database for templates)\n    4.  LinkedIn Account (for posting)\n    5.  n8n Instance (cloud or self-hosted)\n\n*   **API Access:**\n    - Google Generative AI API access\n    - Valid Google Drive, Notion, and LinkedIn OAuth/API credentials\n\n*   **N8N Requirements:**\n    - n8n version 1.0.0 or higher\n    - LangChain nodes package installed\n    - Internet access for API calls\n\n### Customization Guidance\n1.  **AI Prompt Tuning:**\n    - Modify the prompts in the \"Generate the description\" and \"Generate the linkedin post\" nodes to adjust the tone, style, length, or specific information requested from the AI.\n2.  **Notion Database Structure:**\n    - Customize the Notion database properties in the \"Create the notion page\" node to include additional fields like tags, video demos, or integration details.\n3.  **LinkedIn Post Strategy:**\n    - Adjust the LinkedIn post generation prompt to include specific hashtags, mentions, or calls to action to optimize for your audience.\n\n### Technical Specifications\n-   **Trigger Source**: Google Drive file upload (JSON files)\n-   **AI Model**: Google Gemini\n-   **Output Destinations**: Notion database page, LinkedIn personal feed\n-   **Input Format**: n8n workflow JSON\n-   **Processing Time**: Typically under 1 minute (depends on AI response time and API calls)\n\n### Limitations & Considerations\n-   Ensure the Google Drive folder specified in the trigger is exclusively for n8n workflow JSONs to prevent accidental triggers from other file types.\n-   While AI-generated, it's recommended to manually review descriptions and LinkedIn posts, especially for critical content, before relying solely on automation.\n-   API rate limits for Google Gemini, Notion, and LinkedIn should be considered for very high-volume usage.\n-   The Notion database must be pre-configured with the correct property types (Title, Rich Text, URL, Select) for the workflow to function as intended.\n\n**Ready to Automate Your Workflow Documentation and Promotion?**\nThis workflow empowers you to effortlessly share and document your n8n creations, allowing you to focus more on building and less on administrative tasks.",
  "featuredImage": "/data/workflows/7788/7788.webp",
  "author": {
    "id": 101,
    "slug": "pomegai",
    "name": "Md. Nazmul Islam",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 231,
  "downloads": 23,
  "createdAt": "2025-08-24T14:50:00.611Z",
  "updatedAt": "2026-01-16T08:52:24.759Z",
  "publishedAt": "2025-08-24T14:50:00.611Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7788"
}