{
  "id": 7540,
  "slug": "7540",
  "title": "Pull references from Google AI mode to Google Sheets with DataForSEO",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n![Pull references from Google AI Mode with DataForSEO.png](fileId:2133)\n\n## Who’s it for\n\nSEO analysts and marketers who want to capture and analyze source references from Google’s AI Mode answers, track competitor mentions or measure brand visibility in generative search features.\n\n***Note: this template uses DataForSEO community node and works for self-hosted n8n instances only.***\n\n## What it does\n\nThis workflow automates the process of gathering source references from Google’s AI Mode results. Using the DataForSEO SERP API, it extracts the source title, URL, and domain, and records that data in Google Sheets. You can use this template to monitor how often your site appears in AI-generated answers or what competitor domains get mentioned for your target keywords.\n\n## How it works\n\nTriggers on your chosen schedule (default: every 7 days).\nCalls the DataForSEO SERP API for your keyword.\nExtracts and cleans Google AI Mode results.\nStores the data in a Google Sheet.\n\n## Requirements\n\n* Self-hosted n8n instance \n* DataForSEO account\n* A Google Sheet that contains the Source, Domain, URL, Title, and Text columns (as in the example: [https://docs.google.com/spreadsheets/d/1XCjkjyVxrtpTUQenHeR3B07xfEZ489mhuVidjhGOO7I/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1XCjkjyVxrtpTUQenHeR3B07xfEZ489mhuVidjhGOO7I/edit?usp=sharing)).\n\n## Customization\n\nYou can change the schedule or swap the Google Sheet for BI dashboards or reporting tools.\n",
  "featuredImage": "/data/workflows/7540/7540.webp",
  "author": {
    "id": 101,
    "slug": "dataforseo",
    "name": "DataForSEO",
    "avatar": ""
  },
  "categories": [
    "AI Summarization",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 355,
  "downloads": 35,
  "createdAt": "2025-08-18T08:15:28.047Z",
  "updatedAt": "2026-01-16T08:50:58.399Z",
  "publishedAt": "2025-08-18T08:15:28.047Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7540"
}