{
  "id": 6468,
  "slug": "6468",
  "title": "Analyze customer review sentiment automatically with Google Sheets",
  "description": "\n## Overview\nThis workflow watches for new rows in a Google Sheet (e.g., where you manually log customer reviews) and uses a Code node to perform a simple sentiment analysis, then updates the same row with the detected sentiment.\n\n**Use Case**: Quickly gauge customer satisfaction, identify positive/negative trends, and prioritize follow-ups based on sentiment.\n\n## How It Works\nThis workflow operates in four main steps:\n\nGoogle Sheets Trigger (New Row):\n\nThe workflow starts with a Google Sheets Trigger node configured to monitor a specific Google Sheet for new rows. This triggers the workflow whenever a new review is added.\n\nCode Node (Sentiment Analysis):\n\nA Code node receives the new row data (containing the review text).\n\nInside this node, JavaScript code performs a basic sentiment analysis by checking for keywords (e.g., \"great\", \"excellent\" for positive; \"bad\", \"problem\" for negative). It assigns \"Positive\", \"Negative\", or \"Neutral\" sentiment.\n\nUpdate Google Sheet Row:\n\nA Google Sheets node is configured to update the same row that triggered the workflow.\n\nIt adds the sentiment result (and potentially other analysis data) to a new column in that row.\n\n## Setup Steps\nTo get this workflow up and running, follow these instructions:\n\nStep 1: Create Google Sheets Credentials in n8n\n\nIn your n8n instance, click on Credentials in the left sidebar.\n\nClick New Credential.\n\nSearch for and select \"Google Sheets OAuth2 API\" and follow the authentication steps with your Google account. Save it.\n\nMake note of the Credential Name (e.g., \"My Google Sheets Account\").\n\nStep 2: Prepare Your Google Sheet (or better Make a copy of the one provided in the template)\n\nCreate a new Google Sheet in your Google Drive (e.g., Customer Reviews).\n\nIn the first row, add these column headers:\n\nTimestamp\n\nCustomer Name\n\nReview Text\n\nSentiment (This column will be updated by the workflow)\n\nReview ID (Optional, for tracking)\n\nCopy the Sheet ID from the URL (e.g., https://docs.google.com/spreadsheets/d/YOUR_GOOGLE_SHEET_ID_HERE/edit).\n\nCopy the GID of the specific sheet tab (e.g., https://docs.google.com/spreadsheets/d/YOUR_GOOGLE_SHEET_ID_HERE/edit#gid=YOUR_GID_HERE). This is the sheetName value.\n\nStep 3: Import the Workflow JSON\n\nStep 4:  Activate and Test the Workflow\n\nClick the \"Activate\" toggle button in the top right corner of the n8n workflow editor.\n\nGo to your Google Sheet and manually add a new row with a \"Review Text\" (e.g., \"This product is great, I love it!\"). Leave the \"Sentiment\" column empty.\n\nThe workflow should trigger automatically (it polls every minute by default), analyze the sentiment, and update the \"Sentiment\" column in your Google Sheet. You can also manually \"Execute Workflow\" to test immediately.\n\n",
  "featuredImage": "/data/workflows/6468/6468.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 511,
  "downloads": 51,
  "createdAt": "2025-07-26T01:15:56.227Z",
  "updatedAt": "2026-01-16T08:45:07.351Z",
  "publishedAt": "2025-07-26T01:15:56.227Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6468"
}