{
  "id": 2845,
  "slug": "2845",
  "title": "Complete business WhatsApp AI-powered RAG chatbot using OpenAI",
  "description": "The provided workflow in n8n is designed to create a Business WhatsApp AI RAG (Retrieval-Augmented Generation) Chatbot.\n\n---\n\n### How it works:\n1. **Webhook Setup**: The workflow begins by setting up webhooks for verification and response. The *Verify* webhook receives GET requests and sends back a verification code, while the *Respond* webhook handles incoming POST requests from Meta regarding WhatsApp messages.\n2. **Message Handling**: Once a message is received, the workflow checks if the incoming JSON contains a user message. If it does, the message is processed further; otherwise, a generic response is sent.\n3. **AI Agent Interaction**: The user's message is passed to the AI Agent node, which uses a conversational agent with a predefined system message tailored for an electronics store. This ensures that the AI provides accurate and professional responses based on the knowledge base.\n4. **Knowledge Base Utilization**: The AI Agent references a knowledge base stored in Qdrant, a vector database. Documents from Google Drive are downloaded, vectorized using OpenAI embeddings, and stored in Qdrant for retrieval during conversations.\n5. **Response Generation**: The AI Agent generates a response using the OpenAI chat model (gpt-4o-mini) and sends it back to the user via WhatsApp.\n\n---\n\n### Set up steps:\n1. **Create Qdrant Collection**:\n   - Update the `QDRANTURL` and `COLLECTION` variables in the workflow.\n   - Use the *Create collection* HTTP request node to initialize the collection in Qdrant.\n\n2. **Vectorize Documents**:\n   - Configure the *Get folder* and *Download Files* nodes to fetch documents from a specified Google Drive folder.\n   - Use the *Embeddings OpenAI* node to generate embeddings for the downloaded files.\n   - Store the vectorized documents in Qdrant using the *Qdrant Vector Store* node.\n\n3. **Configure Webhooks**:\n   - Ensure both *Verify* and *Respond* webhooks have the same URL.\n   - Set the *Verify* webhook to use the GET HTTP method and the *Respond* webhook to use the POST HTTP method.\n\n4. **Set Up AI Agent**:\n   - Define the system prompt for the AI Agent, specifying guidelines for product information, technical support, customer service, and knowledge base usage.\n   - Link the AI Agent to the OpenAI chat model and configure any additional tools as needed.\n\n5. **Test Workflow**:\n   - Trigger the workflow manually using the *When clicking ‘Test workflow’* node to ensure all components are functioning correctly.\n   - Monitor the flow of data through the nodes and verify that responses are being generated and sent accurately.\n\nBy following these steps, the workflow will be fully operational, enabling a robust AI-powered chatbot capable of handling customer inquiries via WhatsApp.\n\n---\n\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/). ",
  "featuredImage": "/data/workflows/2845/2845.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 41595,
  "downloads": 4159,
  "createdAt": "2025-02-04T10:29:23.985Z",
  "updatedAt": "2026-01-16T08:26:48.172Z",
  "publishedAt": "2025-02-04T10:29:23.985Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2845"
}