{
  "id": 8203,
  "slug": "8203",
  "title": "Lead routing system: Qualify & direct Typeform leads to HubSpot, Sheets & Airtable",
  "description": "## How it works\nThis workflow starts whenever a new lead submits a Typeform. It captures the lead’s details, checks their budget, and routes them based on priority and source. High-budget leads are pushed into HubSpot with a follow-up task for sales. Facebook leads are logged in Google Sheets for marketing, while SurveyMonkey leads are stored in Airtable for campaign tracking. Finally, every lead receives an automated Gmail acknowledgment to confirm receipt and set expectations.\n\n## Step-by-step\n\n**Capture Leads**\n- The workflow listens for new form responses from Typeform.\n\n- Each lead’s details — name, email, phone, budget, and message — are captured for processing.\n\n**Prioritize High-Budget Leads**\n- The budget field is checked.\n\n- If the budget is greater than $5,000 → the lead is flagged as high priority.\n\n- These leads are added or updated in HubSpot CRM.\n\n- A priority follow-up task is created in HubSpot for the sales team.\n\n**Route by Lead Source**\n\n- If the source is Facebook → the lead is logged in a Google Sheet for marketing analysis.\n\n- If the source is SurveyMonkey → the lead is stored in Airtable for structured campaign tracking.\n\n**Send Auto-Response**\n- After storage, every lead receives an automated Gmail reply.\n\n- The email thanks them for their interest and assures them that the sales team will follow up within 24 hours.\n\n## Why use this?\n\n- Captures and organizes leads from multiple channels in one workflow.\n\n- Flags and escalates high-budget leads instantly to sales.\n\n- Routes leads to the right system (HubSpot, Google Sheets, Airtable) based on their source.\n\n- Automates acknowledgment emails, improving response time and customer experience.\n\n- Saves manual effort by centralizing lead capture, qualification, and routing in one place.",
  "featuredImage": "/data/workflows/8203/8203.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 195,
  "downloads": 19,
  "createdAt": "2025-09-03T04:47:36.596Z",
  "updatedAt": "2026-01-16T08:54:38.726Z",
  "publishedAt": "2025-09-03T04:47:36.596Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8203"
}