{
  "id": 6296,
  "slug": "6296",
  "title": "Automated security alert analysis with Sophos, Gemini AI, and VirusTotal",
  "description": "## **How It Works**\nThis workflow automates the analysis of security alerts from Sophos Central, turning raw events into actionable intelligence. It uses the official Sophos SIEM integration tool to fetch data, enriches it with VirusTotal, and leverages Google Gemini to provide a real-time threat summary and mitigation plan via Telegram.\n\nPrerequisite (Important): This workflow is triggered by a webhook that receives data from an external Python script. You must first set up the Sophos-Central-SIEM-Integration script from the official Sophos GitHub. This script will fetch data and forward it to your n8n webhook URL.\n\nTool Source Code: [Sophos/Sophos-Central-SIEM-Integration](Sophos/Sophos-Central-SIEM-Integration)\n\n## **The n8n Workflow Steps**\n**Webhook**: Receives enriched event and alert data from the external Python script.\n\n**IF (Filter)**: Immediately filters the incoming data to ensure only events with a high or critical severity are processed, reducing noise from low-priority alerts.\n\n**Code (Prepare Indicator)**: Intelligently inspects the Sophos event data to extract the primary threat indicator. It prioritizes indicators in the following order: File Hash (SHA256), URL/Domain, or Source IP.\n\n**HTTP Request (VirusTotal)**: The extracted indicator is sent to the VirusTotal API to get a detailed reputation report, including how many security vendors flagged it as malicious.\n\n**Code (Prompt for Gemini)**: The raw JSON output from VirusTotal is processed into a clean, human-readable summary and a detailed list of flagging vendors.\n\n**AI Agent (Google Gemini)**: All collected data—the original Sophos log, the full alert details, and the formatted VirusTotal reputation—is compiled into a detailed prompt for Gemini. The AI acts as a virtual SOC analyst to:\n\nCreate a concise incident summary.\n\nDetermine the risk level.\n\nProvide a list of concrete, actionable mitigation steps.\n\n**Telegram**: The complete analysis and mitigation plan from Gemini is formatted into a clean, easy-to-read message and sent to your specified Telegram chat.\n\n## **Setup Instructions**\nConfigure the external Python script to forward events to this workflow's Production URL.\n\nIn n8n, create Credentials for Google Gemini, VirusTotal, and Telegram.\n\nAssign the newly created credentials to the corresponding nodes in the workflow.",
  "featuredImage": "/data/workflows/6296/6296.webp",
  "author": {
    "id": 101,
    "slug": "rizkyriyan",
    "name": "Rizky Febriyan",
    "avatar": ""
  },
  "categories": [
    "SecOps",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 800,
  "downloads": 80,
  "createdAt": "2025-07-23T02:18:09.292Z",
  "updatedAt": "2026-01-16T08:44:18.675Z",
  "publishedAt": "2025-07-23T02:18:09.292Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6296"
}