{
  "id": 10424,
  "slug": "10424",
  "title": "Track government grants with OpenRouter AI, RSS feeds, Google Sheets & Gmail",
  "description": "## How it works\nThis workflow automatically fetches the latest public grant information from the Ministry of Health, Labour and Welfare (MHLW) RSS feed.  \nIt uses AI to summarize and structure each grant post into a clear format, stores the results in Google Sheets, and sends a formatted HTML summary via Gmail.\n\n**Workflow summary**\n1. Schedule Trigger – Runs the flow daily or weekly.  \n2. RSS Feed Reader – Fetches the latest MHLW news and updates.  \n3. Text Classifier (AI) – Categorizes the item as “Grant/Subsidy”, “Labor-related”, or “Other”.  \n4. AI Agent – Extracts structured data such as title, summary, deadline, amount, target, and URL.  \n5. Google Sheets – Appends or updates the database using the grant title as the key.  \n6. Code Node – Builds an HTML report summarizing new entries.  \n7. Gmail – Sends a daily digest email to your inbox.\n\n---\n\n## Setup steps\n1. Add your **OpenRouter API key** as a credential (used in the AI Agent).  \n2. Replace the **Google Sheets ID** and sheet name with your own.  \n3. Update the **recipient email** address in the Gmail node.  \n4. Adjust the **schedule trigger** to match your preferred frequency.  \n5. (Optional) Add more RSS feeds if you want to monitor other sources.\n\n---\n\n## Ideal for\n- Consultants or administrators tracking subsidy and grant programs  \n- Small business owners who want automatic updates  \n- Anyone who wants a daily AI-summarized government grant digest  \n\n---\n\n⚙️ **Note:**  \nDetailed explanations and setup hints are included as **Sticky Notes** above each node inside the workflow.\n",
  "featuredImage": "/data/workflows/10424/10424.webp",
  "author": {
    "id": 101,
    "slug": "tsubasa-shukuwa",
    "name": "Tsubasa Shukuwa",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 209,
  "downloads": 20,
  "createdAt": "2025-11-02T02:36:52.332Z",
  "updatedAt": "2026-01-16T09:04:59.425Z",
  "publishedAt": "2025-11-02T02:36:52.332Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10424"
}