{
  "id": 9390,
  "slug": "9390",
  "title": "Enhance product photos with Google Gemini AI for e-commerce catalog",
  "description": "## Automated image processing for e-commerce product catalog\n\n### Use cases \n* Monitor a Google Drive folder, process each image based on the prompt defined in `Workflow Configuration` and save the new image to the specified output Google Drive folder.\n* Maintain a processing log in Google Sheets.\n\n👍 This use case can be extended to any scenario requiring batch image processing, for example, unifying the look and feel of team photos on a company website.\n\n### How it works\n* Trigger: Watches a Google Drive folder for new or updated files.\n* Downloads the image, processes it using Google Gemini (Nano Banana), and uploads the new image to the specified output folder.\n\n### How to use\n* Google Drive and Google Sheets nodes:\n  * Create Google credentials with access to Google Drive and Google Sheets. [Read more about Google Credentials](https://docs.n8n.io/integrations/builtin/credentials/google/).\n  * Update **all** Google Drive and Google Sheets nodes (6 nodes total) to use these credentials\n* Gemini AI node:\n  * Create Google Gemini(PaLM) Api credentials. [Read more about Google Gemini(PaLM) credentials](https://docs.n8n.io/integrations/builtin/credentials/googleai/).\n  * Update the `Edit Image` node to use the Gemini Api credentials.\n* Create a Google Sheets spreadsheet following the steps in `Google Sheets Configuration` (see right ➡️). Ensure the spreadsheet can be accessed as `Editor` by the account used for the Google Credentials.\n* Create input and output directories in Google Drive. Ensure these directories are accessible by the account used for the credentials.\n* Update the `File Created`, `File Updated` and `Workflow Configuration` node following the steps in the green Notes (see right ➡️).\n\n\n### Requirements\n* Google account with Google API access\n* Google AI Studio account with ability to create a Google Gemini API key.\n* Basic n8n knowledge: understanding of triggers, expressions, and credential management\n\n\n### Who’s it for\nAnyone wanting to batch process images for product catalog. \nOther use cases are applicable. Please [reach out](https://www.linkedin.com/in/ytkaczyk/) reach out if you need help customizing this workflow. \n\n\n### 🔒 Security\nAll credentials are stored securely using n8n's credential system.\nThe only potentially sensitive information stored in the workflow is the Google Drive folder and Sheet IDs. These should be secured according to your organization’s needs.\n\n\n### Need Help?\nReach out on [LinkedIn](https://www.linkedin.com/in/ytkaczyk/) or Ask in the [Forum](https://community.n8n.io/)!\n",
  "featuredImage": "/data/workflows/9390/9390.webp",
  "author": {
    "id": 101,
    "slug": "ytkaczyk",
    "name": "Yves Tkaczyk",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1264,
  "downloads": 126,
  "createdAt": "2025-10-08T21:44:42.603Z",
  "updatedAt": "2026-01-16T09:00:18.605Z",
  "publishedAt": "2025-10-08T21:44:42.603Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9390"
}