{
  "id": 9557,
  "slug": "9557",
  "title": "Automate email responses with GPT-4o-mini and human review in Gmail",
  "description": "This n8n template demonstrates a “Human-in-the-Loop” workflow where AI automatically drafts replies to inbound emails, which are then reviewed and approved by a human before being sent. This powerful pattern ensures both the efficiency of AI and the quality assurance of human oversight.\n\nUse cases are many: Streamline sales inquiry responses, manage first-level customer support, handle initial recruitment communications, or any business process that requires personalized yet consistent email replies.\n\n# Good to know\n\n- At the time of writing, the cost per execution depends on your OpenAI API usage. This workflow uses a cost-effective model like gpt-4o-mini. See [OpenAI Pricing](https://openai.com/pricing) for updated info.\n- The AI’s knowledge base and persona are fully customizable within the **Basic LLM Chain** node’s prompt.\n\n# How it works\n\n1.  The **Gmail Trigger** node starts the workflow whenever a new email arrives in the specified inbox.\n2.  The **Classify Potential Leads** node uses AI to determine if the incoming email is a potential lead. If not, the workflow stops.\n3.  The **Basic LLM Chain**, powered by an OpenAI Chat Model, generates a draft reply based on a detailed system prompt and your internal knowledge base.\n4.  A **Structured Output Parser** is crucially used to force the AI’s output into a reliable JSON format (`{\"subject\": \"...\", \"body\": \"...\"}`), preventing errors in subsequent steps.\n5.  The **Send for Review** Gmail node sends the AI-generated draft to a human reviewer and pauses the workflow, waiting for a reply.\n6.  The **IF** node checks the reviewer’s reply for approval keywords (e.g., “approve”, “承認”).\n7.  If approved, the **✅ Send to Customer** Gmail node sends the final email to the original customer.\n8.  If not approved, the reviewer’s feedback is treated as a revision request, and the workflow loops back to the **Basic LLM Chain** to generate a new draft incorporating the feedback.\n\n# How to use\n\n- **Gmail Trigger** node: Configure with your own Gmail account credentials.\n- **Send for Review** node: Replace the placeholder email `reviewer@example.com` with the actual reviewer's email address.\n- **IF** node: You can customize the approval keywords to match your team’s vocabulary.\n- **OpenAI Nodes**: Ensure your OpenAI credentials are set up. You can select a different model if needed, but the prompt is optimized for models like GPT-4o mini.\n\n# Requirements\n\n- An OpenAI account for the LLM.\n- A Gmail account for receiving customer emails and for the review process.\n\n# Customising this workflow\n\n- By modifying the prompt and knowledge base in the **Basic LLM Chain**, you can adapt this agent for various departments, such as technical support, HR, or public relations.\n- The approval channel is not limited to Gmail. You can easily replace the review nodes with Slack or Microsoft Teams nodes to fit your internal communication tools.",
  "featuredImage": "/data/workflows/9557/9557.webp",
  "author": {
    "id": 101,
    "slug": "yusuke-yamamoto",
    "name": "Yusuke Yamamoto",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 116,
  "downloads": 11,
  "createdAt": "2025-10-13T07:06:02.585Z",
  "updatedAt": "2026-01-16T09:00:55.104Z",
  "publishedAt": "2025-10-13T07:06:02.585Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9557"
}