{
  "id": 10377,
  "slug": "10377",
  "title": "Customer financial report delivery system with Telegram and Google Sheets",
  "description": "How it works\n\nThis workflow receives messages from Telegram using the Telegram Trigger node.\n\nIt detects the user’s action (/start or customer name) and decides whether to send a welcome message or perform a customer search.\n\nThe system fetches customer and access information from Google Sheets, checks if the user is authorized (based on chat IDs in the “Access” sheet), and then proceeds accordingly.\n\nIf access is granted, the workflow aggregates financial and weight data, formats a summary report, and sends it back to the same Telegram chat automatically.\n\nIf access is denied or customer data is not found, it sends an appropriate “no permission” or “incorrect name” message to the user.\n\n⚙️ Set up steps\n\nConnect your Telegram Bot API credentials in the Input user2, Send Report2, and related Telegram nodes.\n\nConnect your Google Sheets account and update:\n\ndocumentId → link to your Google Sheet\n\nsheetName → replace with your actual sheet/tab names (“Access”, “Sheet1”, etc.)\n\nlookupColumn → update to match column names used in your sheet (e.g., Customer name, Groups).\n\nReplace placeholder text such as Your Custom Message and Your Custom Name with your actual message texts or variable names.\n\nTest by sending a message to your Telegram bot with either /start or a known customer name.\n\nExpected setup time: 10–15 minutes depending on how your Google Sheets and Telegram bot are configured.\n\nKeep detailed field mapping or transformation logic (column names, sheet IDs) inside sticky notes within your workflow.",
  "featuredImage": "/data/workflows/10377/10377.webp",
  "author": {
    "id": 101,
    "slug": "miad-dadbin",
    "name": "Miad Dadbin",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 147,
  "downloads": 14,
  "createdAt": "2025-10-31T09:12:56.728Z",
  "updatedAt": "2026-01-16T09:04:47.387Z",
  "publishedAt": "2025-10-31T09:12:56.728Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10377"
}