{
  "id": 10412,
  "slug": "10412",
  "title": "Automated SEO ranking monitor with AI, Decodo scraper & multi-channel alerts",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\nKeep your SEO performance on track with this automated SEO Watchlist Monitor! \n  \nThis workflow combines AI-powered strategy analysis with real-time search ranking checks to track keyword positions, identify content gaps, and alert you to critical ranking drops. Perfect for marketing teams ensuring search visibility and competitive intelligence across platforms. 🚀🔍\n\n**What This Template Does**  \n1️⃣ Triggers daily SEO intelligence checks to monitor keyword performance.   \n2️⃣ Configures target keywords, competitor domains, and geographic focus.  \n3️⃣ Validates SEO configuration to ensure proper setup. \n4️⃣ Uses AI to analyze keyword competitiveness and strategic opportunities.  \n5️⃣ Checks real-time search rankings using Google Search scraper.  \n6️⃣ Detects critical ranking drops below position 10. \n7️⃣ Saves SEO intelligence to Google Sheets for tracking. \n8️⃣ Sends email alerts for urgent ranking issues. \n9️⃣ Provides daily Slack summaries of SEO performance.  \n\n**Key Benefits**  \n✅ Monitors keyword rankings and competitor movements daily  \n✅ Identifies content gaps and strategic opportunities with AI analysis  \n✅ Alerts instantly to critical ranking drops for quick action  \n✅ Centralizes SEO intelligence in Google Sheets for team visibility  \n✅ Combines AI insights with real-time search data for comprehensive monitoring  \n\n**Features**  \n- Daily automated schedule for continuous monitoring  \n- AI-powered SEO strategy analysis and competitive intelligence  \n- Real-time search ranking checks using Decodo scraper  \n- Critical alert system for ranking drops  \n- Google Sheets integration for data centralization  \n- Slack and Gmail notifications for team awareness  \n- Configuration validation and error logging  \n- Structured data parsing for consistent reporting  \n\n**Requirements**  \n- OpenAI API credentials for AI analysis  \n- Decodo API credentials for search scraping  \n- Google Sheets OAuth2 credentials with edit access  \n- Gmail OAuth2 credentials for email alerts  \n- Slack Bot Token with chat:write permission  \n- Environment variables for configuration settings  \n\n**Target Audience**  \nSEO and digital marketing teams 🎯  \nContent strategy and growth teams 📈  \nCompetitive intelligence professionals 🔍  \nMarketing operations teams 🚀  \nAgency account managers managing multiple clients 💼  \n\n**Step-by-Step Setup Instructions**  \n1️⃣ Connect OpenAI credentials for AI analysis capabilities  \n2️⃣ Set up Decodo API credentials for search scraping functionality  \n3️⃣ Configure Google Sheets with required headers (Keyword, Rank, description, etc.)  \n4️⃣ Add Gmail and Slack credentials for alerting and notifications  \n5️⃣ Set your target keywords, competitors, and geographic focus in the configuration node  \n6️⃣ Configure the cron schedule (hourly) for daily monitoring frequency  \n7️⃣ Run once manually to verify all integrations and data flow  \n8️⃣ Activate for ongoing SEO performance tracking and alerting ✅  \n\n**Pro Tip:** Use coupon code \"YARON\" to get 23K requests for testing (in Decodo)",
  "featuredImage": "/data/workflows/10412/10412.webp",
  "author": {
    "id": 101,
    "slug": "yaron-nofluff",
    "name": "Yaron Been",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 115,
  "downloads": 11,
  "createdAt": "2025-11-01T17:21:42.824Z",
  "updatedAt": "2026-01-16T09:04:56.164Z",
  "publishedAt": "2025-11-01T17:21:42.824Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10412"
}