{
  "id": 9641,
  "slug": "9641",
  "title": "YouTube competitor video analytics to Google Sheets",
  "description": "![Screenshot 20251014 191255.png](fileId:2945)\n\n## Short Description:\nAutomatically collect and analyze your competitor’s YouTube performance. This workflow extracts video titles, views, likes, and descriptions from any YouTube channel and saves the data to Google Sheets — helping creators spot viral trends and plan content that performs.\n\n## Who’s it for  \nFor content creators, YouTubers, and marketing teams who want to track what’s working for their competitors — without manually checking their channels every day.\n\n## How it works  \nThis workflow automatically collects data from any YouTube channel you enter.  \nYou just write the channel name in the form — n8n fetches the channel ID, gets all recent video IDs, and extracts each video’s title, views, likes, and description.  \nFinally, all the information is saved neatly into a connected Google Sheet for analysis.\n\n## How to set up  \n1. Create a Google Sheet with columns for Title, Views, Likes, Description, and URL.  \n2. Connect your Google account to n8n.  \n3. Add your YouTube Data API key inside the HTTP Request nodes (use n8n credentials, not hardcoded keys).  \n4. Update your form submission or trigger node to match your input method.  \n5. Execute the workflow once to test and verify that data is flowing into your sheet.\n\n## Requirements  \n- YouTube Data API key  \n- Google Sheets account  \n- n8n cloud or self-hosted instance  \n\n## How to customize  \nYou can modify the JavaScript code node to include more metrics (like comments or publish date), filter by keywords, or change the output destination (e.g., Airtable or Notion).\n",
  "featuredImage": "/data/workflows/9641/9641.webp",
  "author": {
    "id": 101,
    "slug": "asfandyar-malik",
    "name": "Asfandyar Malik",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 247,
  "downloads": 24,
  "createdAt": "2025-10-14T14:16:56.449Z",
  "updatedAt": "2026-01-16T09:01:18.752Z",
  "publishedAt": "2025-10-14T14:16:56.449Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9641"
}