{
  "id": 9130,
  "slug": "9130",
  "title": "Auto-generate Instagram, Facebook & LinkedIn posts from YouTube videos with GPT-4o & Dumpling AI",
  "description": "## Who’s it for\n\nThis template is perfect for content marketers, social media managers, and creators who want to repurpose YouTube videos into platform-specific posts without manual work. If you spend hours brainstorming captions, resizing content, or creating images for different platforms, this workflow automates the entire process from video selection to ready-to-publish posts.\n\n---\n\n## What it does\n\nThe workflow takes a topic from a Google Sheet, finds the most relevant and recent YouTube video using Dumpling AI and GPT-4o, then automatically generates unique posts for **Instagram**, **Facebook**, and **LinkedIn**. Each post comes with a tailored **AI-generated image**, and all content is saved back into a Google Sheet for easy scheduling and review.\n\nHere’s what happens step by step:\n1. Picks an unsearched topic from Google Sheets  \n2. Searches YouTube via **Dumpling AI** and sorts videos  \n3. Uses **GPT-4o** to select the most relevant video  \n4. Extracts the video transcript using Dumpling AI  \n5. Generates three platform-specific posts using **GPT-4o**  \n6. Creates matching images for each post using **Dumpling AI** image generation  \n7. Saves the final Instagram, Facebook, and LinkedIn posts into a Google Sheet  \n8. Marks the topic as processed so it won’t repeat\n\n---\n\n## How it works\n\n1. **Scheduled Trigger**: Starts the workflow automatically on a set schedule  \n2. **Google Sheets**: Retrieves one unprocessed topic from the YouTube Topics sheet  \n3. **Dumpling AI**: Finds and filters YouTube videos matching the topic  \n4. **GPT-4o**: Chooses the best video and turns the transcript into three unique posts  \n5. **Dumpling AI (Image)**: Generates platform-specific visuals for each post  \n6. **Google Sheets**: Saves all posts and images to the Social Media Post sheet for publishing\n\n---\n\n## Requirements\n\n- ✅ **Dumpling AI API key** stored as credentials  \n- ✅ **OpenAI GPT-4 credentials**  \n- ✅ **Google Sheets** connection with the following sheets:  \n  - **YouTube Topics** with columns `Youtube Topics` and `Searched?`  \n  - **Social Media Post** with columns `platform`, `Content`, `Image`  \n\n---\n\n## How to customize\n\n- Adjust the GPT prompt to match your brand voice or content style  \n- Add or remove platforms depending on your posting strategy  \n- Change the schedule trigger frequency to fit your content calendar  \n- Integrate with scheduling tools like Buffer or Hootsuite for auto-publishing  \n- Add review or approval steps before posts are finalized\n\n---\n\n&gt; This workflow helps you transform a single YouTube video into three polished, platform-ready posts with matching visuals, in minutes—not hours.\n",
  "featuredImage": "/data/workflows/9130/9130.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 708,
  "downloads": 70,
  "createdAt": "2025-09-30T21:40:18.571Z",
  "updatedAt": "2026-01-16T08:59:07.559Z",
  "publishedAt": "2025-09-30T21:40:18.571Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9130"
}