{
  "id": 5729,
  "slug": "5729",
  "title": "Learn JavaScript data processing with code node: filtering, analysis & export examples",
  "description": "## Overview\nA comprehensive educational workflow that demonstrates practical JavaScript usage in n8n's Code node through real-world business scenarios. Perfect for learning data manipulation, transformation, and automation patterns that you can immediately apply to client projects.\nWhat This Template Teaches:\n\nData Filtering & Transformation - Filter employees by age, calculate bonuses, format contact information\nStatistical Analysis - Generate team statistics, averages, role distributions, and KPIs\nMulti-Format Export - Create CSV files, email lists, and API-ready payloads from raw data\nn8n Best Practices - Proper JSON handling, return formats, and data flow patterns\n\n## How It Works:\n\nManual Trigger starts the workflow with sample employee data\nSet Sample Data provides realistic business data (employees with roles, salaries, ages)\nThree Code Node Examples process the same data differently:\n\nFilter & Transform: Creates adult employee list with calculated bonuses\nCalculate Stats: Generates comprehensive team analytics and reports\nFormat for Export: Prepares data for external systems (APIs, emails, CSV)\n\n\n\n**Key Learning Points**:\n\nAccess input data using items[0].json.propertyName\nReturn proper n8n format with [{ json: data }] structure\nUse JSON.parse() for string-to-object conversion\nApply JavaScript array methods (filter, map, reduce) for data processing\nHandle multiple output scenarios and data aggregation\n\n**Perfect For**:\n\nn8n beginners learning Code node fundamentals\nDevelopers transitioning to n8n automation\nClient demos showing data processing capabilities\nTeam training and onboarding sessions\nFoundation for building custom business automation workflows\n\n**Business Use Cases**:\nTransform this template for lead qualification, customer segmentation, report generation, data enrichment, and API integrations. Each Code node pattern can be adapted for different industries and automation needs.",
  "featuredImage": "/data/workflows/5729/5729.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 906,
  "downloads": 90,
  "createdAt": "2025-07-07T03:32:28.392Z",
  "updatedAt": "2026-01-16T08:41:07.730Z",
  "publishedAt": "2025-07-07T03:32:28.392Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5729"
}