{
  "id": 9690,
  "slug": "9690",
  "title": "SOL trading recommendations w/ multi-timeframe analysis using Gemini & Telegram",
  "description": "## Try It Out!\n\nThis workflow builds a Telegram-based Solana (SOL/USDT) Multi-Timeframe AI Market Analyzer that automatically pulls live candlestick data for SOL/USDT, runs structured multi-timeframe technical analysis (1-minute, 5-minute, 1-hour) through an AI Agent, and posts a professional, JSON-structured analysis + trading recommendation straight to your Telegram chat.\nIt combines on-chain / market data aggregation, LLM-driven interpretation, and instant Telegram reporting — giving you concise, actionable market intelligence every hour.\n\nHow It Works\n\nHourly Trigger – The workflow runs once per hour to pull fresh market data.\n\nMarket Data Fetch – Three HTTP requests gather candlesticks from CryptoCompare:\n\n1-minute (last 60 candles)\n\n5-minute aggregate (last 60 aggregated candles)\n\n1-hour (last 60 candles)\n\nMerge & Transcribe – The three feeds are merged and a lightweight code node extracts:\n\nsymbol, current price, arrays for data_1m, data_5m, data_1h.\n\nAI Agent Analysis – The LLM (configured via your model node) receives the merged payload and runs a structured multi-timeframe technical analysis, returning a strict JSON report containing:\n\nPer-timeframe analysis (momentum, volume, S/R,MA, volatility)\n\nMarket structure / confluence findings\n\nTrading recommendation (action, entry, stop, TPs, position sizing)\n\nA final disclaimer\n\nParse AI Output – Extracts the JSON block from the agent’s reply and validates/parses it for downstream formatting.\n\nTelegram Reporting – Sends two nicely formatted Telegram messages:\n\nMulti-timeframe breakdown (1m / 5m / 1h)\n\nMarket structure + Trading Recommendation (TPs, SL, position size, disclaimer)\n\nHow to Use\n\nImport the workflow into your n8n workspace (or replicate the nodes shown in the JSON).\n\nAdd credentials:\n\nCryptoCompare API Key — for reliable candlestick data.\n\nLLM model credentials — e.g., Google Gemini / OpenAI, configured in the LangChain/LM node.\n\nTelegram Bot Token & Chat ID — to send messages.\n\n(Optional) AFK Crypto API key if you want to enrich data with wallet info later.\n\nNode mapping & endpoints:\n\nFetch_1m → GET https://min-api.cryptocompare.com/data/v2/histominute?fsym=SOL&tsym=USDT&limit=60\n\nFetch_5m → GET https://min-api.cryptocompare.com/data/v2/histominute?fsym=SOL&tsym=USDT&limit=60&aggregate=5\n\nFetch_1h → GET https://min-api.cryptocompare.com/data/v2/histohour?fsym=SOL&tsym=USDT&limit=60\n\nMerge → combine the three responses into a single payload.\n\nTranscribe (code) → extract last close as current price and attach the arrays.\n\nAI Agent → pass the structured prompt (system message instructs exact JSON structure).\n\nParse AI Output → extract the json ... block and JSON.parse it.\n\nTelegram nodes → format and send two messages (timeframes and recommendation).\n\nAdjust analysis frequency: default is hourly — change the Schedule Trigger node as desired.\n\nDeploy and activate: the workflow will post an AI-driven SOL/USDT market analysis to your Telegram hourly.\n\n(Optional) Extend This Workflow\n\nAdd price / orderbook enrichment (e.g., AFK price endpoints or exchange orderbook) to improve context.\n\nAdd wallet exposure checks (AFK wallet balances) to tailor position sizing suggestions.\n\nStore AI reports in Notion / Google Sheets for historical auditing and backtesting.\n\nAdd alert filtering to only post when the LLM flags high-confidence signals or confluence across timeframes.\n\nExpose Telegram commands to request on-demand analysis (e.g., /analyze now 5m).\n\nAdd risk management logic to convert LLM recommendation into automated orders (careful — requires manual review and stronger safety controls).\n\nSafety Mechanisms\n\nExplicit system prompt — forces AI to output only the exact JSON structure to avoid free-form text parsing errors.\n\nJSON parser node — validates the agent response and throws if malformed before any downstream action.\n\nRead-only market analysis — the workflow only reports by default (no auto-trading), reducing operational risk.\n\nCredentials gated — ensure LLM and Telegram credentials are stored securely in n8n.\n\nDisclaimer — every report includes a legal/financial disclaimer from the agent.\n\nRequirements\n\nCryptoCompare API Key (for minute/hour candlesticks)\n\nLLM model credentials (Google Gemini / OpenAI / other supported model in your LangChain node)\n\nTelegram Bot Token + Chat ID (where analysis messages are posted)\n\nOptional: AFK Crypto API key if you plan to add wallet/position context\n\nn8n instance with: HTTP Request, Code, Merge, LangChain/Agent, and Telegram nodes enabled\n\nAFK / External APIs Used\n\nCryptoCompare Candles:\n\nGET https://min-api.cryptocompare.com/data/v2/histominute?fsym=SOL&tsym=USDT&limit=60 (1m)\n\nGET https://min-api.cryptocompare.com/data/v2/histominute?fsym=SOL&tsym=USDT&limit=60&aggregate=5 (5m)\n\nGET https://min-api.cryptocompare.com/data/v2/histohour?fsym=SOL&tsym=USDT&limit=60 (1h)\n\nTelegram Bot API – via n8n Telegram node.\n\nLLM / LangChain – your chosen LLM provider (configured in the workflow).\n\n**Summary**\n\nThe Solana (SOL/USDT) Multi-Timeframe AI Market Analyzer (Telegram) gives you hourly, professional multi-timeframe technical analysis generated by an LLM agent using real candlestick data from CryptoCompare. It combines the speed of automated data collection with the structure and reasoning of an AI analyst, delivering clear trading recommendations and a timestamped analysis to your Telegram chat — ideal for traders who want reliable, concise market intelligence without manual charting.\n\n---\n\n**Our Website**: https://afkcrypto.com/\n**Check our blogs**: https://www.afkcrypto.com/blog",
  "featuredImage": "/data/workflows/9690/9690.webp",
  "author": {
    "id": 101,
    "slug": "afkcrypto",
    "name": "AFK Crypto",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 295,
  "downloads": 29,
  "createdAt": "2025-10-15T09:22:37.185Z",
  "updatedAt": "2026-01-16T09:01:33.510Z",
  "publishedAt": "2025-10-15T09:22:37.185Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9690"
}