{
  "id": 8468,
  "slug": "8468",
  "title": "Automate sales follow-ups with GPT-4o-mini, HubSpot, Slack, Teams & Telegram",
  "description": "## How it works\n\nThis workflow automatically generates personalized follow-up messages for leads or customers after key interactions (e.g., demos, sales calls). It enriches contact details from HubSpot (or optionally Monday.com), uses AI to draft a professional follow-up email, and distributes it across multiple communication channels (Slack, Telegram, Teams) as reminders for the sales team.\n\n## Step-by-step\n**1. Trigger & Input**\n\n- Schedule Trigger – Runs automatically at a defined interval (e.g., daily).\n\n- Set Sample Data – Captures the contact’s name, email, and context from the last interaction (e.g., “had a product demo yesterday and showed strong interest”).\n\n**2. Contact Enrichment**\n\n- HubSpot Contact Lookup – Searches HubSpot CRM by email to confirm or enrich contact details.\n\n- Monday.com Contact Fetch (Optional) – Can pull additional CRM details if enabled.\n\n**3. AI Message Generation**\n\n- AI Language Model (OpenAI) – Provides the underlying engine for message creation.\n\n- Generate Follow-Up Message – Drafts a short, professional, and friendly follow-up email:\n\n- References previous interaction context.\n\n- Suggests clear next steps (call, resources, etc.).\n\n- Ends with a standardized signature block for consistency.\n\n**4. Multi-Channel Communication**\n\n- Slack Reminder – Posts the generated message as a reminder in the sales team’s Slack channel.\n\n- Telegram Reminder – Sends the follow-up draft to a Telegram chat.\n\n- Teams Reminder – Shares the same message in a Microsoft Teams channel.\n\n## Benefits\n\n- Personalized Outreach at Scale – AI ensures each follow-up feels tailored and professional.\n\n- Context-Aware Messaging – Pulls in CRM details and past interactions for relevance.\n\n- Cross-Platform Delivery – Distributes reminders via Slack, Teams, and Telegram so no follow-up is missed.\n\n- Time-Saving for Sales Teams – Eliminates manual drafting of repetitive follow-up emails.\n\n- Consistent Branding – Ensures every message includes a unified signature block.",
  "featuredImage": "/data/workflows/8468/8468.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 384,
  "downloads": 38,
  "createdAt": "2025-09-11T05:02:34.154Z",
  "updatedAt": "2026-01-16T08:56:00.077Z",
  "publishedAt": "2025-09-11T05:02:34.154Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8468"
}