{
  "id": 11968,
  "slug": "11968",
  "title": "Sync WooCommerce orders and inventory with Google Sheets and Slack",
  "description": "## Automate order fulfillment and inventory sync from WooCommerce to Google Sheets and Slack\n\n\nThis workflow provides a robust, end-to-end automated pipeline for managing e-commerce orders. It bridges the gap between your storefront and your fulfillment team by handling inventory validation, multi-channel notifications, and centralized data logging.\n\n\n## Who’s it for?\nThis template is designed for e-commerce business owners and operations managers using **WooCommerce** who want to eliminate manual order processing. It is ideal for teams that need real-time updates on stock availability and automated communication with both customers and warehouse staff.\n\n\n## How it works\n1.  **Order Capture**: The workflow triggers via a WooCommerce Webhook (real-time) or a Schedule Trigger (hourly sync).\n2.  **Data Extraction**: It parses complex order JSON into a clean, usable format.\n3.  **Inventory Check**: The system iterates through each line item to verify stock levels.\n4.  **Fulfillment Logic**: It determines if an order is \"Ready\" or \"Backordered\" and calculates estimated shipping priorities.\n5.  **Multi-Channel Notification**:\n    *   **In-Stock**: Sends a confirmation email to the customer and alerts the fulfillment team on Slack.\n    *   **Backordered**: Sends a delay notice to the customer and alerts the inventory manager on Slack.\n6.  **Data Logging**: Every order is appended to a Google Sheet for long-term analytics and tracking.\n\n\n## Requirements\n*   **WooCommerce**: REST API access and Webhook setup.\n*   **Gmail**: OAuth2 credentials for sending automated emails.\n*   **Slack**: A Bot Token with permissions to post in `#fulfillment` and `#alerts` channels.\n*   **Google Sheets**: A spreadsheet prepared with headers matching the order data.\n\n\n## How to set up\n1.  **Credentials**: Connect your WooCommerce, Gmail, Slack, and Google Sheets accounts in the respective nodes.\n2.  **WooCommerce Webhook**: Copy the Webhook URL from the first node and paste it into your WooCommerce Webhook settings (Topic: Order Created).\n3.  **Inventory Logic**: The \"Check Inventory\" node currently uses a simulated Code node. Replace this logic with a lookup to your actual inventory database or ERP system.\n4.  **Google Sheets**: Open the \"Log Order to Sheets\" node and select your specific Spreadsheet ID and Sheet Name.\n\n\n## How to customize\n*   **Shipping Rates**: Modify the \"Process Order Logic\" node to include your specific carrier rates or integrate a shipping API (like ShipStation).\n*   **Priority Rules**: Adjust the logic to flag \"High Value\" orders or specific VIP customers for faster processing.\n*   **Messaging**: Customize the Gmail and Slack message templates to match your brand's voice.",
  "featuredImage": "/data/workflows/11968/11968.webp",
  "author": {
    "id": 101,
    "slug": "yyuyayamanaka",
    "name": "yu-ya",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 18,
  "downloads": 1,
  "createdAt": "2025-12-19T18:31:54.085Z",
  "updatedAt": "2026-01-16T09:10:50.469Z",
  "publishedAt": "2025-12-19T18:31:54.085Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11968"
}