{
  "id": 4653,
  "slug": "4653",
  "title": "LinkedIn profile extract and build JSON resume with Bright Data & Google Gemini",
  "description": "### Who this is for?\n\nThe LinkedIn Profile Extract and JSON Resume Builder is a powerful workflow that scrapes professional profile data from LinkedIn using Bright Data's infrastructure, then transforms that data into a clean, structured JSON resume using Google Gemini. The workflow is ideal for automating resume parsing, candidate profiling, or integrating into recruiting platforms.\n\nThis workflow is tailored for:\n\n- HR professionals & recruiters automating resume screening\n\n- Talent acquisition platforms enriching candidate profiles\n\n- Developers & AI builders creating resume-parsing AI pipelines\n\n- Data scientists working on labor market analytics\n\n- Growth hackers profiling prospects via public data\n\n### What problem is this workflow solving?\n\nParsing resumes or LinkedIn profiles into machine-readable formats is often a manual, error-prone process. Most scraping tools either fail due to anti-bot protections or return unstructured HTML that's hard to work with.\n\nThis workflow solves that by:\n\n- Using Bright Data's Web Unlocker for reliable, CAPTCHA-free LinkedIn scraping\n\n- Extracting clean text and structured profile data via Google Gemini LLM\n\n- Automatically generating a standards-compliant JSON Resume and Skills\n\n- Sending the resume to webhooks or storing it for downstream usage\n\n### What this workflow does\n\n- Accepts LinkedIn Profile URL and required metadata (Bright Data zone, webhook)\n\n- Scrapes LinkedIn profile using Bright Data Web Unlocker\n\n- Extracts clean content and skills using Google Gemini LLM\n\n- Builds a JSON-formatted resume following the JSON resume schema\n\n- Sends the JSON resume via Webhook Notification\n\n- Persists the output by saving the file to disk\n\n### Setup\n\n- Sign up at [Bright Data](https://brightdata.com/).\n- Navigate to Proxies & Scraping and create a new Web Unlocker zone by selecting Web Unlocker API under Scraping Solutions.\n- In n8n, configure the Header Auth account under Credentials (Generic Auth Type: Header Authentication).\n![Header Authentication.png](fileId:1438)\nThe Value field should be set with the\n**Bearer XXXXXXXXXXXXXX**. The XXXXXXXXXXXXXX should be replaced by the Web Unlocker Token.\n- In n8n, configure the Google Gemini(PaLM) Api account with the Google Gemini API key (or access through Vertex AI or proxy).\n- Update the **Set URL and Bright Data Zone** node with the LinkedIn profile, Bright Data Zone and the Webhook notification URL. For testing purposes, you can obtain a webhook url using https://webhook.site/\n\n### How to customize this workflow to your needs\n\n**Add Language Translation**\n\nInsert a translation LLM node to support multilingual profiles.\n\n**Generate PDF Resumes**\n\nConvert JSON to formatted PDF resumes using an HTML-to-PDF module.\n\n**Push to ATS or CRM**\n\nAdd integration nodes to pipe data into applicant tracking systems (ATS), CRMs, or databases.\n\n**Use Alternative LLMs**\n\nSwap Gemini with OpenAI or Anthropic Claude if preferred.\n\n\n\n",
  "featuredImage": "/data/workflows/4653/4653.webp",
  "author": {
    "id": 101,
    "slug": "ranjancse",
    "name": "Ranjan Dailata",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 6449,
  "downloads": 644,
  "createdAt": "2025-06-04T16:01:06.726Z",
  "updatedAt": "2026-01-16T08:35:32.927Z",
  "publishedAt": "2025-06-04T16:01:06.726Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4653"
}