{
  "id": 10250,
  "slug": "10250",
  "title": "Create stylized product photography with Airtable & Gemini Nano Banana",
  "description": "This workflow automates the process of generating stylized product photos for e-commerce by combining real product shots with creative templates. It enables the creation of a complete set of images for an SKU from a single product photo and a set of reusable templates. The workflow uses Google Gemini (Nano Banana) for image editing and Airtable as the data source.\n\n**Example use case.** An apparel brand can use this workflow to turn plain product photos (e.g., socks on a white background) into lifestyle images that match their brand aesthetic. By combining each product photo with predefined templates and reference images, the workflow generates a variety of stylized results automatically - ready for marketing or online stores.\n\n## How it works\n\nThis workflow expects the following Airtable table setup:\n- **\"Product Images\"** - contains original product photos, one per record.\n- **\"Reference Images\"** - contains reference images for templates, one per record.\n- **\"Templates\"** - contains reusable generation templates. Each template includes a text prompt and up to three reference images.\n- **\"Jobs\"** - contains batch generation jobs. Each job references multiple product images and multiple templates.\n- **\"Results\"** - contains the generated outputs. Each result includes a generated image, references to the job, product image, and template, and a status field (pending, approved, rejected).\n\n\nThe workflow is triggered by a webhook that receives a job ID from Airtable. It then:\n1. Fetches the job record.\n2. Retrieves the associated product images and templates (each with its text prompt and reference images).\n3. Downloads all required product and reference images.\n4. For each product-template combination, sends these images and the prompt to Google Gemini to generate new AI-edited images.\n5. Saves the generated images back into Airtable.\n\n**NOTE**: A separate workflow should handle the human-in-the-loop approval process and any regeneration of rejected results.\n\n## Requirements\n1. Airtable Personal Access Token\n2. Google Gemini API key\n\n## Setup\n1. Ensure all required Airtable tables exist.\n2. Configure parameters in the **parameters** node:\n    - Set Airtable Base ID\n    - Set ID of the attachment field in the \"Results\" table (where the generated images will be uploaded) \n4. Configure credentials for all Airtable nodes.\n5. Set Google Gemini API key for the \"Generate...\" nodes.",
  "featuredImage": "/data/workflows/10250/10250.webp",
  "author": {
    "id": 101,
    "slug": "coderik",
    "name": "Vadim",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 633,
  "downloads": 63,
  "createdAt": "2025-10-28T13:34:07.611Z",
  "updatedAt": "2026-01-16T09:04:08.587Z",
  "publishedAt": "2025-10-28T13:34:07.611Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10250"
}