{
  "id": 12092,
  "slug": "12092",
  "title": "Automate investment risk monitoring with Qwen-Max AI, Slack & email alerts",
  "description": "## How It Works\nAutomates financial risk evaluation by intelligently consolidating information from five critical sources: financial, operational, legal, insurance, and regulatory systems. Hourly triggers enable continuous, AI-driven risk assessment using the OpenRouter Chat Model, producing dynamic risk scores while simultaneously identifying emerging compliance gaps and potential exposure areas. High-risk findings automatically initiate corrective actions, trigger secondary investigations, and send real-time alerts through Slack notifications as well as investor email updates. Designed for financial institutions, compliance teams, risk managers, and investment firms, it provides continuous, scalable, and fully data-driven monitoring of risk across complex regulatory and operational environments.\n\n## Setup Steps\n1. Configure hourly/daily schedule trigger. \n2. Authenticate all five data APIs. \n3. Set OpenRouter credentials. \n4. Configure Slack webhook. \n5. Set Gmail for email distribution. \n6. Define risk thresholds and compliance rules.\n\n## Prerequisites\nOpenRouter API key, five data source APIs, Slack access, Gmail account, investor contacts \n\n## Use Cases\nBanking risk audits, insurance compliance monitoring, portfolio risk tracking \n\n## Customization\nSwap AI models, modify data sources, adjust thresholds \n\n## Benefits\n90% faster risk assessment, eliminates manual aggregation ",
  "featuredImage": "/data/workflows/12092/12092.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 82,
  "downloads": 8,
  "createdAt": "2025-12-24T07:11:08.862Z",
  "updatedAt": "2026-01-16T09:11:22.084Z",
  "publishedAt": "2025-12-24T07:11:08.862Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12092"
}