{
  "id": 3937,
  "slug": "3937",
  "title": "Send personalized WhatsApp templates triggered by KlickTipp with auto-responses",
  "description": "![Ricardo Automated WhatsApp Campaigns via KlickTipp  TEMPLATE.png](fileId:1297)\n\n**Community Node Disclaimer**: This workflow uses KlickTipp community nodes.\n\n#### How It Works\n\nThis workflow automates personalized WhatsApp message template delivery triggered by events in KlickTipp or by messages sent to the Whatsapp Business account. When a contact triggers an Outbound, the workflow uses a pre-approved WhatsApp message template to send dynamic, real-time messages through the WhatsApp Business Cloud API. When receiving messages it checks whether a cancellation should be processed or if a auto-response is sent.\n\nThis setup is ideal for time-sensitive campaigns such as:\n- Birthday greetings\n- Discount or promo notifications\n- Follow-ups on product or service interest\n\n#### Key Features\n\n**KlickTipp Trigger**\n- Starts the workflow when a specific outbound is triggered\n- Typical use case: subcriber receives activation Tag and triggers an Outbound which sends a webhook call to trigger WhatsApp messaging.\n\n**WhatsApp Business Cloud - Message Trigger**\n- Listens to messages from the contact and processes answers with answering auto-responder or by tagging the contact in KlickTipp.\n\n**WhatsApp Business Cloud - Sending Template Messages**\n- Sends  WhatsApp message templates using a pre-approved template.\n- Template placeholders are filled with data from KlickTipp custom fields.\n\n\n#### Setup Instructions\n\n1. Set up the KlickTipp and Whatsapp nodes in your n8n instance.\n2. Authenticate your WhatsApp and KlickTipp accounts.\n3. Create the necessary custom fields to match the data structure\n4. Verify and customize field assignments in the workflow to align with your specific form and subscriber list setup.\n\n| Field Label                 | Field Type  |\n|-----------------------------|-------------|\n| Whatsapp \\| Product/service | Single line |\n| Whatsapp \\| URL             | URL         |\n| Whatsapp \\| Name/company    | Single line |\n| Whatsapp \\| URL ending      | Single line |\n\n\n---\n\n#### Testing & Deployment\n\n1. Use a real test contact with all required fields filled.\n2. Trigger the Outbound in KlickTipp using the activation tag and answer with a message to the template.\n3. Run the scenario once in n8n to verify successful delivery of the whatsapp message template to your test contact as well as the reception of the auto-responder and the subscription and tagging in KlickTipp to stop further messages.\n\n---\n\n#### Campaign Expansion Ideas\n\n- Connect campaign to process keywords like \"STOP\" from WhatsApp messages\n- Pair WhatsApp with welcome email series for onboarding.\n- Use tags like `product_interest_X` for precise segmentation.\n- A/B test templates with different CTA formats or timings.\n- Monitor CTRs via dynamic URLs in WhatsApp templates.\n\n#### Benefits\n\n- **Multi-channel engagement:** Adds WhatsApp to your marketing toolkit.\n- **Dynamic content:** Personalizes messages using contact data.\n-**KlickTipp campaign control** Whatsapp contacts can for example signal with messages like \"STOP\" to receive the according Tag in KlickTipp in order to start/end automations.\n\n&gt; 💡 **Pro Tip:** Customize the domain link ending per campaign or product line. This allows targeted redirects, e.g., `meinshop.de/ProduktA` or `mein\n\n**Ressources:**\n- [Send WhatsApp Templates with KlickTipp](https://www.klicktipp.com/support/knowledge-base/automate-send-whatsapp-templates-with-make/)\n- [Use KlickTipp Community Node in n8n](https://www.klicktipp.com/support/knowledge-base/install-klicktipp-node-n8n/)\n- [Automate Workflows: KlickTipp Integration in n8n](https://www.klicktipp.com/support/knowledge-base/klicktipp-integration-n8n/)\n",
  "featuredImage": "/data/workflows/3937/3937.webp",
  "author": {
    "id": 101,
    "slug": "KlickTipp",
    "name": "KlickTipp",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3392,
  "downloads": 339,
  "createdAt": "2025-05-08T10:59:08.584Z",
  "updatedAt": "2026-01-16T08:32:15.269Z",
  "publishedAt": "2025-05-08T10:59:08.584Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3937"
}