{
  "id": 6830,
  "slug": "6830",
  "title": "Send daily 4K Bluray preorder updates from Blu-ray.com to Discord",
  "description": "This is a simple webpage scraper that  specifically grabs today's newest 4K Bluray Preorders as listed on the Blu-ray.com website.  This is a scheduled workflow that can run every day and will post a formatted summary message of links to a Discord channel of your choice.\n\n## Minimal setup required:\n- Just create a webhook for the channel you want posted to in Discord and provide that in the final step.\n- The timezone format step is set to East Coast (NYC) by default, feel free to change.\n- No API keys or any special configuration needed (beyond your Discord webhook)\n- Feel free to customize the formatting of the message that gets posted 👍\n\n\n## How it works:\n- First format todays date to match the formatting used on the website\n- Grab the HTML for the preorders page at www.blu-ray.com\n- Filter only the hyperlinks for each Bluray on the page\n- Then further filter only those with an html header matching today's date\n- Format how you want the message to be sent to your Discord channel (in this case a simple list of Hyperlinks for each Title)\n- Send to Discord!\n\n## Disclaimer:\n- **This should be only for personal use.**\n- The links go back to the blu-ray.com website, which is a good thing!\n- Don't abuse this by slamming their site with some crazy level of automation frequency.\n- Support the blu-ray.com website by using their affiliate links whenever you do want to preorder a title ;) \n- This is one of my first shared templates, so it may not be super optimal or perfect but it works for my needs and hopefully you'll find some use out of it!\n- Discord currently has a 2000 character limit on webhook messages. Some of the messages may get truncated as a result.",
  "featuredImage": "/data/workflows/6830/6830.webp",
  "author": {
    "id": 101,
    "slug": "shorttompkins",
    "name": "Jason Krol",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 161,
  "downloads": 16,
  "createdAt": "2025-08-02T00:38:20.759Z",
  "updatedAt": "2026-01-16T08:47:15.174Z",
  "publishedAt": "2025-08-02T00:38:20.759Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6830"
}