{
  "id": 9987,
  "slug": "9987",
  "title": "Automate Telegram support handover from AI to humans with GPT4 and email alerts",
  "description": "\n## How it Works\n\nThis is a **Telegram AI-to-Human Handover System** that seamlessly transitions customer support conversations between an AI agent and human operators:\n\n1. **AI-First Response**: When users message the Telegram bot, an AI agent handles the conversation initially, using memory to maintain context across messages.\n\n2. **Smart Handover Detection**: The AI recognizes when users request human assistance and triggers a two-step confirmation process (user approval, then operator availability check).\n\n3. **Topic-Based Routing**: Once confirmed, the system creates a dedicated Telegram Forum topic named after the user's ID, where operators can respond. Messages are automatically forwarded between the user's private chat and the operator's topic.\n\n4. **Session Management**: A data table tracks conversation states ('ai', 'human', 'open', 'closed'), ensuring messages route correctly and maintaining conversation history.\n\n5. **Clean Closure**: Operators type \"exit\" in the topic to close conversations, updating the database and closing the forum topic.\n\n## Set-up Steps\n\n**Estimated Time: 30-45 minutes** (first-time setup)\n\nYou'll need to:\n\n- Create and configure a Telegram bot via BotFather\n- Set up a Telegram group with Topics enabled and add your bot as admin\n- Configure SMTP credentials (Gmail app password recommended)\n- Create an n8n Data Table with specific columns (type, status, topic, user)\n- Add your bot token to multiple HTTP Request nodes\n- Set up AI model credentials (OpenRouter or Azure OpenAI)\n- Fill in the Configuration node with your IDs and email addresses\n- Test the flow using the included Personal Trigger to capture your group/user IDs\n\n**Note**: The template includes detailed video guides (1-minute overview and 10-minute setup walkthrough) plus extensive documentation in sticky notes covering every node and credential setup.",
  "featuredImage": "/data/workflows/9987/9987.webp",
  "author": {
    "id": 101,
    "slug": "mookielian",
    "name": "Meelioo",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 166,
  "downloads": 16,
  "createdAt": "2025-10-21T14:50:26.460Z",
  "updatedAt": "2026-01-16T09:02:53.120Z",
  "publishedAt": "2025-10-21T14:50:26.460Z",
  "nodes": 40,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9987"
}