{
  "id": 3546,
  "slug": "3546",
  "title": "Screen and score resumes from Gmail to Sheets with AI",
  "description": "## Description\n\nThis intelligent n8n automation streamlines the process of collecting, extracting, and scoring resumes sent to a Gmail inbox—making it an ideal solution for recruiters who regularly receive hundreds of applications. The workflow scans incoming emails with attachments, extracts relevant candidate information from resumes using AI, evaluates each candidate based on customizable criteria, and logs their scores alongside contact details in a connected Google Sheet.\n\n## Who Is This For?\n\n- **Recruiters & Hiring Managers**: Automate the resume screening process and save hours of manual work.\n- **HR Teams at Startups & SMBs**: Quickly evaluate talent without needing large HR ops infrastructure.\n- **Agencies & Talent Acquisition Firms**: Screen large volumes of resumes efficiently and with consistent criteria.\n- **Solo Founders Hiring for Roles**: Use AI to help score and shortlist top candidates from email applications.\n\n## What Problem Does This Workflow Solve?\n\nManually reviewing resumes is time-consuming, error-prone, and inconsistent. This workflow solves these challenges by:\n\n- Automatically detecting and extracting resumes from Gmail attachments.\n- Using OpenAI to intelligently extract candidate info from unstructured PDFs.\n- Scoring resumes using customizable evaluation criteria (e.g., relevant experience, skills, education).\n- Logging all candidate data (Name, Email, LinkedIn, Score) in a centralized, filterable Google Sheet.\n- Enabling faster, fairer, and more efficient candidate screening.\n\n## How It Works\n\n### 1. Gmail Trigger\n- Runs on a scheduled interval (e.g., every 6 or 24 hours).\n- Scans a connected Gmail inbox (using OAuth credentials) for unread emails that contain PDF attachments.\n\n### 2. Extract Attachments\n- Downloads the attached resumes from matching emails.\n\n### 3. Parse Resume Text\n- Sends the PDF file to OpenAI's API (via GPT-4 or GPT-3.5 with file support or via base64 + PDF-to-text tool).\n- Prompts GPT with a structured format to extract fields like Name, Email, LinkedIn, Skills, and Education.\n\n### 4. Score Resume\n- Evaluates the resume on predefined scoring logic using AI or logic inside the workflow (e.g., \"Has X skill = +10 points\").\n\n### 5. Log to Google Sheets\n- Appends a new row in a connected Google Sheet, including:\n  - Candidate Name\n  - Email Address\n  - LinkedIn URL\n  - Resume Score\n\n## Setup\n\n### Accounts & API Keys\nYou’ll need accounts and credentials for:\n\n- **n8n** (hosted or self-hosted)\n- **Google Cloud Platform** (for Gmail, Drive, and Sheets APIs)\n- **OpenAI** (for GPT model access)\n\n### Google Sheet\n- Make a Google Sheet and connect it via Google Sheets node in n8n. Columns should include:\n  - Name\n  - Email\n  - LinkedIn\n  - Score\n\n## Configuration\n\n### Google Cloud:\n- Enable Gmail API and Google Sheets API.\n- Set up OAuth 2.0 Credentials in Google Console.\n- Connect n8n Gmail, Drive, and Sheets nodes to these credentials.\n\n### OpenAI:\n- Generate an API Key.\n- Use the HTTP Request node or official OpenAI node to send prompt requests.\n\n### n8n Workflow:\n- Add Gmail Trigger.\n- Add extraction logic (e.g., filter PDFs).\n- Add OpenAI prompt for resume parsing and scoring.\n- Connect structured output to a Google Sheets node.\n\n## Requirements\n\n### Accounts:\n- **n8n**\n- **Google** (Gmail, Sheets, Drive, Cloud Console)\n- **OpenAI**\n\n### API Keys & Credentials:\n- OpenAI API Key\n- Google Cloud OAuth Credentials\n- Gmail Access Scopes (for reading attachments)\n- Configured Google Sheet\n- OpenAI usage (after free tier)\n- Google Cloud API usage (if exceeding free quota)\n",
  "featuredImage": "/data/workflows/3546/3546.webp",
  "author": {
    "id": 101,
    "slug": "hicounselor",
    "name": "Aditya Sharma",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 6762,
  "downloads": 676,
  "createdAt": "2025-04-14T11:05:17.689Z",
  "updatedAt": "2026-01-16T08:30:16.719Z",
  "publishedAt": "2025-04-14T11:05:17.689Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3546"
}