{
  "id": 6816,
  "slug": "6816",
  "title": "Create custom reasoning patterns for AI agents with GraphRAG & knowledge ontology",
  "description": "## Teach your AI agent HOW to think, not WHAT to think\n\n[![Video tutorial](https://img.youtube.com/vi/jhqBb3nuyAY/sddefault.jpg)](https://www.youtube.com/watch?v=jhqBb3nuyAY)\n\nThis workflow demonstrates how you can build an AI agent in n8n that uses the reasoning logic you define. So an LLM learns a way of thinking, which you can then apply to multiple problems: \n\n- Make an **AI chatbot that knows how to convince anybody** using the \"Getting to Yes\" method\n- Build an **LLM workflow that uses Ray Dalio's principles** to spot investment opportunities\n- Create an AI agent crew of **interdisciplinary thinkers**: e.g. a specialist in psychology who gives an advice on education programmes.\n\n![InfraNodus knowledge graph](https://infranodus.com/images/front/blog/reasoning-knowledge-graph-infranodus.png)\n\n\n## How it works\nThis template uses the n8n AI agent node as an orchestrating agent that has access to a certain reasoning logic defined by an [InfraNodus knowledge graph](https://infranodus.com).\n\nThis graph contains a list of reasoning rules (ontology), which is extracted to provide an advice that is relevant to the original prompt. It uses GraphRAG under the hood to traverse the parts of the graph relevant to the query.\n\nThis advice and the reasoning logic extracted is then used by the AI agent to generate a response that is relevant to the user's query but that uses the reasoning logic provided through the graph.\n\nHere's a description step by step:\n\n- The user submits a question using the AI chatbot (n8n interface, in this case, a web form that can be embedded to any website, or a webhook that can be connected to a Telegram / WhatsApp bot)\n- The AI agent node accesses the Reasoning Logic HTTP InfraNodus nodes. The description of AI agent and the description of the reasoning InfraNodus node provides the agent with an understanding of how to rephrase the original question to retrieve relevant reasoning logic.\n-  The request is sent to the InfraNodus node. It provides a response that contains the reasoning logic needed to answer the question.\n- This reasoning logic is then sent back to an LLM along with the original query to produce the response.\n\n\nInfraNodus uses **[GraphRAG](https://infranodus.com/docs/graph-rag-knowledge-graph)** under the hood: \n- convert user query into graph\n- find the overlap with the reasoning graph (using n=1 or more hops to include more relations)\n- use similarity search to get additional parts of the graph\n- generate a response based on this intersection as well as the context provided\n- provide information about the underlying structure\n\n## How to use\n\nYou need an [InfraNodus account](https://infranodus.com/use-case/ai-knowledge-graphs) to use this workflow. \n\n- Create an InfraNodus account\n- Get the API key at [https://infranodus.com/api-access](https://infranodus.com/api-access) and create a Bearer authorization key for the InfraNodus HTTP nodes.\n- Create a separate knowledge graph for the reasoning logic\n- Use the [AI ontology creator](https://infranodus.com/import/ai-ontologies) to generate an ontology for a certain topic or text using AI. Then augment it with your own data. See our [help article on creating ontologies](https://support.noduslabs.com/hc/en-us/articles/18301655686172-Generate-Knowledge-Graphs-and-Ontologies-in-Plain-Text) for detailed instructions\n- For each graph, go to the workflow, paste the name of the graph into the request JSON `body` `name` field.\n- Change the system prompt in the AI agent node to reflect the nature of your reasoning logic. For instance, if it's an expert in interactions, you specify that, if it's a psychology expert, you need to specify that as well.\n- Change the description of the reasoning node (HTTP tool). Use the InfraNodus `summary` and `Project Notes` &gt; `RAG prompt` buttons to generate a description for the reasoning logic, which you can then reuse in your workflow.\n- add the LLM key to the OpenAI node (or to the model of your choice) and launch the workflow\n\n## Requirements\n\n- An [InfraNodus](https://infranodus.com/use-case/ai-knowledge-graphs) account and API key\n- An OpenAI (or any other LLM) API key\n\n\n## Customizing this workflow\n\nYou can use this same workflow with a Telegram bot, so you can interact with it using Telegram. There are many more customizations available. \n\nCheck out the **complete guide** at [https://support.noduslabs.com/hc/en-us/articles/21429518472988-Using-Knowledge-Graphs-as-Reasoning-Experts](https://support.noduslabs.com/hc/en-us/articles/21429518472988-Using-Knowledge-Graphs-as-Reasoning-Experts)\n\nAlso check out the **video tutorial** with a demo:\n\n[![Video tutorial](https://img.youtube.com/vi/jhqBb3nuyAY/sddefault.jpg)](https://www.youtube.com/watch?v=jhqBb3nuyAY)\n\n\n\n\n",
  "featuredImage": "/data/workflows/6816/6816.webp",
  "author": {
    "id": 101,
    "slug": "infranodus",
    "name": "InfraNodus",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI RAG"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 967,
  "downloads": 96,
  "createdAt": "2025-08-01T16:29:18.234Z",
  "updatedAt": "2026-01-16T08:47:10.207Z",
  "publishedAt": "2025-08-01T16:29:18.234Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6816"
}