{
  "id": 4738,
  "slug": "4738",
  "title": "Generate a legal website accessibility statement with AI and WAVE",
  "description": "## Who is this for?\nThis template is for any website owner, digital agency, or compliance officer operating within the **European Union**. It's designed for users who need to comply with the upcoming **European Accessibility Act (EAA)** but may not have deep technical or legal expertise.\n\n## Disclaimer\nThis workflow uses an npm package called \"cheerio\" to work with the specified URLs HTML code. Installing packages is only possible in self hosting.\n\n## What problem is this workflow solving? / Use Case\nStarting **June 28, 2025**, the European Accessibility Act (EAA) mandates that most websites offering products or services in the EU must be accessible and publish a formal Accessibility Statement. Manually creating this legal document is complex, requiring both a technical site analysis and knowledge of specific legal requirements. This workflow automates the generation of a compliant first draft, saving significant time and effort.\n\n## What this workflow does\nAfter you input your details (like website URL and API key) in a central configuration node, this workflow automatically:\n1.  Scans your live website for accessibility issues using the powerful **WAVE API**.\n2.  Processes the scan results to identify the main problem areas.\n3.  Instructs a **Google Gemini AI agent** with a specialized legal prompt based on the European Accessibility Act.\n4.  Generates a formal Accessibility Statement in your desired language.\n5.  Saves the statement as an `.html` file and **sends it to you as an email attachment**.\n\n## Setup\nThis workflow is designed for a quick setup:\n1.  **Configure All Variables:** Click the **'CHANGE THESE: dependencies'** node. This is your central control panel. Fill in all the values, including your WAVE API Key, the URL to analyze, company details, and desired output language.\n2.  **Set Up Credentials:** You will need to connect your Google accounts for the workflow to run.\n    * **Gemini:** Click the **'gemini 2.5 pro'** node, click the gear icon (⚙️) next to the \"Credential\" field, and connect your Google Gemini API credentials.\n    * **Gmail:** Click the **'Send report by email'** node and connect your Gmail account to allow sending the final report.\n3.  **Activate & Execute:** Make sure the workflow is **active** in the top-right corner, then click **'Execute Workflow'** to run your first analysis.\n\n## How to customize this workflow to your needs\nThis template is a great starting point for any EU country. Here's how to adapt it:\n* **Localize for Your Country (Important!):** The generated statement contains a placeholder for the \"Enforcement Procedure\". You **must** edit the prompt in the **'Accessibility Statement Generator'** node to replace this placeholder with the name and link to your specific country's official enforcement body.\n* **Change the AI:** Swap the Google Gemini node for any other AI model, like OpenAI or Anthropic Claude, by replacing the node and connecting it to the agent.\n* **Change the Trigger:** Replace the **'When clicking ‘Execute workflow’'** node with a Form Trigger or Webhook Trigger to run this workflow based on external inputs, for example, to offer this analysis as a service to your clients.",
  "featuredImage": "/data/workflows/4738/4738.webp",
  "author": {
    "id": 101,
    "slug": "lukaskunhardt",
    "name": "Lukas Kunhardt",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 658,
  "downloads": 65,
  "createdAt": "2025-06-06T16:22:13.453Z",
  "updatedAt": "2026-01-16T08:35:54.613Z",
  "publishedAt": "2025-06-06T16:22:13.453Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4738"
}