{
  "id": 6038,
  "slug": "6038",
  "title": "Automation of creative testing and campaign launching for Meta ads",
  "description": "This workflow is a comprehensive solution for digital marketers, performance agencies, and e-commerce brands looking to scale their creative testing process on Meta Ads efficiently. It eliminates the tedious manual work of uploading assets, creating campaigns, and setting up ads one by one.\n\n#### **Use Case**\nManually launching weekly creative tests is time-consuming and prone to errors. This workflow solves that problem by creating a fully automated pipeline: from a creative asset in a folder to a complete, ready-to-launch (but paused) ad structure in your Meta Ads account. It's perfect for teams that want to:\n*   Save hours of manual work every week.\n*   Systematically test a high volume of creatives.\n*   Maintain a structured and consistent campaign naming convention.\n*   Keep a detailed log of all created assets for data-driven performance analysis.\n\n#### **How it Works**\n\nThe workflow is structured into four logical blocks:\n\n**1. Configuration & Scheduling:**\n*   The workflow runs on a weekly schedule.\n*   A central **\"Configuration\" Set node** at the beginning holds all key variables (Ad Account ID, Page ID, Pixel ID, making it incredibly easy to adapt the template for different projects.\n\n**2. Creative Ingestion & Processing:**\n*   It scans a specific Google Drive folder for new image and video files.\n*   Using an **IF node**, it branches the logic based on the file type.\n*   Each file is uploaded to the Meta Ads library, and a corresponding **Ad Creative** is built with a pre-defined destination URL.\n\n**3. Campaign & Ad Set Assembly:**\n*   The workflow creates a single new **Campaign** with an `OUTCOME_SALES` objective.\n*   It then creates a single **Ad Set** optimized for `OFFSITE_CONVERSIONS` (e.g., \"Add to Cart\"), using the Pixel ID from the configuration.\n*   A **Merge node** intelligently combines the single Ad Set ID with every creative processed in the previous block, preparing the data for the final step.\n\n**4. Ad Creation & Data Logging:**\n*   The workflow iterates through the prepared data, creating a unique **Ad** for each creative.\n*   Upon the successful creation of each ad, a new row is appended to a Google Sheet, logging all relevant IDs (`CampaignID`, `AdSetID`, `AdID`, `CreativeID`) and metadata for a complete audit trail.\n\n---\n\n### **Setup Instructions**\n\nTo use this template, you need to configure a few key nodes.\n\n**1. Credentials:**\n*   Connect your **Meta Ads** account.\n*   Connect your **Google** account (for both Drive and Sheets).\n\n**2. The `⚙️ Configuration` Node (Set node):**\nThis is the most important step. Open the first `Set` node and fill in your specific values:\n*   `adAccountId`: Your Meta Ad Account ID.\n*   `pageId`: The ID of the Facebook Page you're advertising for.\n*   `pixelId`: Your Meta Pixel ID for conversion tracking.\n\n**3. Google Sheets Node (`Save Full Report to Sheet`):**\n*   Select your spreadsheet and the specific sheet where you want to save the reports.\n*   Make sure your sheet has columns with the following headers: `CampaignID`, `AdSetID`, `AdID`, `CreativeID`, `FileName`, `MimeType`, `Timestamp`.\n\n**4. Check URLs and IDs in HTTP Request Nodes:**\n*   The template is configured to use the variables from the `⚙️ Configuration` node. Double-check that the URLs in the `Create Campaign`, `Create Ad Set`, and `Create ... Creative` nodes correctly reference these variables (e.g., `.../act_{{ $('⚙️ Configuration Meta Ads').item.json.adAccountId }}/campaigns`).\n*   Verify the `link` in the `Create Video Creative` and `Create Image Creative` nodes points to your desired landing page.\n\n**5. Activate the Workflow:**\n*   Set your desired schedule in the `Schedule Trigger` node.\n*   Save and activate the workflow.\n\n---\n\n### **Further Ideas & Customization**\n\nThis workflow is a powerful foundation. You can easily extend it to:\n*   **Create a second workflow** that runs a week later, reads the Google Sheet, and pulls performance data for all the ads created.\n*   **A/B test ad copy** by adding different text variations from a spreadsheet.\n*   **Add a Slack or Email notification** at the end to confirm that the weekly campaign launch was successful.\n",
  "featuredImage": "/data/workflows/6038/6038.webp",
  "author": {
    "id": 101,
    "slug": "hotgomer",
    "name": "Kirill Khatkevich",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2603,
  "downloads": 260,
  "createdAt": "2025-07-15T19:37:04.566Z",
  "updatedAt": "2026-01-16T08:42:48.690Z",
  "publishedAt": "2025-07-15T19:37:04.566Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6038"
}