{
  "id": 2335,
  "slug": "2335",
  "title": "Build a financial documents assistant using Qdrant and Mistral.ai",
  "description": "This n8n workflow demonstrates how to manage your Qdrant vector store when there is a need to keep it in sync with local files. It covers creating, updating and deleting vector store records ensuring our chatbot assistant is never outdated or misleading.\n\n## Disclaimer\nThis workflow depends on local files accessed through the local filesystem and so will only work on a self-hosted version of n8n at this time. It is possible to amend this workflow to work on n8n cloud by replacing the local file trigger and read file nodes.\n\n## How it works\n* A local directory where bank statements are downloaded to is monitored via a local file trigger. The trigger watches for the file create, file changed and file deleted events.\n* When a file is created, its contents are uploaded to the vector store.\n* When a file is updated, its previous records are replaced.\n* When the file is deleted, the corresponding records are also removed from the vector store.\n* A simple Question and Answer Chatbot is setup to answer any questions about the bank statements in the system.\n\n## Requirements\n* A self-hosted version of n8n. Some of the nodes used in this workflow only work with the local filesystem.\n* Qdrant instance to store the records.\n\n## Customising the workflow\n\nThis workflow can also work with remote data. Try integrating accounting or CRM software to build a managed system for payroll, invoices and more.\n\n## Want to go fully local?\n\nA version of this workflow is available which uses Ollama instead. You can download this template here: https://drive.google.com/file/d/189F1fNOiw6naNSlSwnyLVEm_Ho_IFfdM/view?usp=sharing",
  "featuredImage": "/data/workflows/2335/2335.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 18963,
  "downloads": 1896,
  "createdAt": "2024-07-10T15:09:06.891Z",
  "updatedAt": "2026-01-16T08:24:05.940Z",
  "publishedAt": "2024-07-10T15:09:06.891Z",
  "nodes": 29,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2335"
}