{
  "id": 4623,
  "slug": "4623",
  "title": "Unix timestamp to ISO date converter",
  "description": "This n8n workflow provides a simple yet powerful utility to convert Unix timestamps (seconds since epoch) into the universally recognized ISO 8601 date and time format. This is crucial for harmonizing date data across different systems, databases, and applications.\n\n---\n\n# 🔧 How it works\n- Receive Timestamp Webhook: This node acts as the entry point, listening for incoming POST requests. It expects a JSON body containing a single property: timestamp, which should be a Unix timestamp in seconds (e.g., 1678886400).\n- Convert to ISO 8601: This node takes the timestamp received from the webhook. Since JavaScript's Date object typically uses milliseconds, it multiplies the Unix timestamp by 1000. It then uses new Date(...).toISOString() to convert this into an ISO 8601 formatted string (e.g., 2023-03-15T00:00:00.000Z) and assigns it to a new property called convertedTime.\n- Respond with Converted Time: This node sends the convertedTime property back as the response to the original webhook caller.\n\n---\n\n# 👤 Who is it for?\n### This workflow is extremely useful for:\n\n- Developers & Integrators: When working with APIs or databases that return dates as Unix timestamps, and you need to display them in a human-readable or standardized format in your applications or dashboards.\n- Data Analysts & Scientists: For cleaning and transforming raw timestamp data from logs, event streams, or legacy systems into a consistent format for analysis.\n- System Administrators: For debugging logs where timestamps are often in Unix format.\n- Anyone Managing Data Imports/Exports: Ensuring date compatibility when moving data between different platforms.\n- Automators: As a building block in larger workflows where incoming data has Unix timestamps that need to be normalized before further processing (e.g., adding to a spreadsheet, sending in an email, or performing date calculations).\n\n\n---\n\n# 📑 Data Structure\nWhen you trigger the webhook, send a POST request with a JSON body structured as follows:\n\n```\n{\n  \"timestamp\": 1678886400\n}\n```\n\nThe workflow will return a JSON response similar to this:\n\n```\n{\n  \"convertedTime\": \"2023-03-15T00:00:00.000Z\"\n}\n```\n\n---\n\n# ⚙️ Setup Instructions\n- Import Workflow: In your n8n editor, click \"Import from JSON\" and paste the provided workflow JSON.\n- Configure Webhook Path:\n  - Double-click the Receive Timestamp Webhook node.\n  - In the 'Path' field, set a unique and descriptive path (e.g., /convert-timestamp or /unix-to-iso).\n- Activate Workflow: Save and activate the workflow.\n\n---\n\n# 📝 Tips\nThis simple conversion workflow can be drastically enhanced and leveraged in many ways:\n\n- Dynamic Output Formats:\n  - Upgrade: Modify the Convert to ISO 8601 node (or add a Function node after it) to accept an optional format parameter in the webhook.\n  - Leverage: Allow users to request formats like MM/DD/YYYY HH:mm:ss, YYYY-MM-DD, DD-MM-YYYY, or just the time, making the output directly usable in various contexts without further processing.\n\n- Example using a Function node:\n```\nconst date = new Date($json.timestamp * 1000);\nconst format = $json.format || 'iso'; // Default to ISO\nlet output;\n\nswitch (format.toLowerCase()) {\n    case 'iso':\n        output = date.toISOString();\n        break;\n    case 'locale': // e.g., \"3/15/2023, 12:00:00 AM UTC\"\n        output = date.toLocaleString('en-US', { timeZone: 'UTC' });\n        break;\n    case 'dateonly': // e.g., \"2023-03-15\"\n        output = date.toISOString().split('T')[0];\n        break;\n    case 'timeonly': // e.g., \"00:00:00 UTC\"\n        output = date.toLocaleTimeString('en-US', { timeZone: 'UTC', hour12: false });\n        break;\n    default:\n        output = date.toISOString(); // Fallback\n}\nreturn [{ json: { convertedTime: output } }];\n```\n- Timezone Conversion:\n  - Upgrade: Combine this with the Time Zone Converter workflow (or integrate moment-timezone.js if using a Code node and have a self-hosted instance). Accept an optional targetTimeZone parameter in the webhook.\n  - Leverage: Convert the Unix timestamp directly into a human-readable date and time in a specific target timezone, which is incredibly valuable for global scheduling or reporting.\n\n- Error Handling and Input Validation:\n  - Upgrade: Add an IF node after the Receive Timestamp Webhook. Check if isNaN($json.body.timestamp) or if typeof $json.body.timestamp !== 'number'.\n  - Leverage: If the input timestamp is invalid, branch to a Respond to Webhook node that returns a clear error message (e.g., \"Invalid timestamp provided. Please provide a numeric Unix timestamp in seconds.\"). This makes your API more robust.\n\n- Reverse Conversion (ISO to Unix):\n  - Upgrade: Create a separate workflow, or add another branch to this one, to convert an ISO 8601 string back to a Unix timestamp. This provides a complete conversion utility.\n  - *Example Set node value: ={{ new Date($json.body.isoString).getTime() / 1000 }}*\n\n- Integration with Data Pipelines:\n  - Upgrade: Use this workflow as a microservice in larger ETL (Extract, Transform, Load) pipelines.\n  - Leverage: If you're pulling data from a source that provides Unix timestamps (e.g., a logging system, IoT device, certain databases), send that data through this workflow to normalize the dates before loading them into your analytics database, CRM, or data warehouse.\n\n- Automated Reporting:\n  - Upgrade: If you have a system that generates reports with Unix timestamps, trigger this webhook for each timestamp.\n  - Leverage: Produce reports with human-readable dates for better readability and decision-making for non-technical stakeholders.\n\n\n*This workflow is a cornerstone for any automation involving diverse date and time data. By implementing the suggested upgrades, you can transform it from a basic converter into a highly flexible and reliable date-time processing hub.*",
  "featuredImage": "/data/workflows/4623/4623.webp",
  "author": {
    "id": 101,
    "slug": "ist00dent",
    "name": "ist00dent",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 661,
  "downloads": 66,
  "createdAt": "2025-06-03T13:48:58.409Z",
  "updatedAt": "2026-01-16T08:35:22.612Z",
  "publishedAt": "2025-06-03T13:48:58.409Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4623"
}