{
  "id": 3436,
  "slug": "3436",
  "title": "Send links from Telegram channel to Hoarder and Readeck",
  "description": "### What this template is made for:\nI have a personal Telegram channel and a bot inside it where I save interesting links that I want to save or read later. The idea is that n8n will take care of reading the new links added to this channel and send them, through the corresponding API, to the Hoarder and Readeck installations.\n\n### How it works\n- Since my server where n8n runs is not always on, a \"Schedule Trigger\" will be responsible for checking every so often if there is any new content in the Telegram channel where I store the links. This request is made through \"http request\" and the Telegram API.\n- Next, a code block is responsible for filtering out everything that is not a hyperlink.\nAt this point, the flow splits into two so that parallel and similar processes are performed for Hoarder and Readeck.\n- The corresponding API is accessed to get a list of all the links saved in the corresponding service.\n- A code block is responsible for filtering the list of hyperlinks previously obtained from Telegram so that only those that are not already saved in the service continue.\n- Finally, another \"Http Request\" node is responsible for using the service API to save the link in the corresponding service.\n\n### Configuration instructions\nThe template makes use of the environment variables that I have declared in the n8n \"docker-compose.yml\" file through an external \".env\" file. These are the variables I use:\n``` txt\n# Telegram Bot Token Sherlink\nTG_SHERLINK_BOT_TOKEN=XXXXXXXX:XXXXXXXXXXXXXXXX\n# Id Telegram Channel Sherlink\nTG_SHERLINK_ID=-XXXXXXXXXXXXX\n# Readeck server\nREADECK_SERVER=http://readeck.midomain.com\nREADECK_API_KEY=xxxxxxxxxxxxx\n# Hoarder server\nHOARDER_SERVER=http://hoarder.midomain.com\nHOARDER_API_KEY=xxxxxxxxxxxxxx\n```\n\nCreated in 1.85.4 n8n version",
  "featuredImage": "/data/workflows/3436/3436.webp",
  "author": {
    "id": 101,
    "slug": "sherlockes",
    "name": "Sherlockes",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 298,
  "downloads": 29,
  "createdAt": "2025-04-04T11:19:47.480Z",
  "updatedAt": "2026-01-16T08:29:44.988Z",
  "publishedAt": "2025-04-04T11:19:47.480Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3436"
}