{
  "id": 12476,
  "slug": "12476",
  "title": "Turn Gmail meeting summaries into HubSpot CRM records with OpenAI",
  "description": "## How it works\nThis workflow listens for incoming meeting summary emails in Gmail and processes them automatically. The email content is cleaned and sent to an AI model that extracts CRM-ready sales data in a structured format. The parsed data is then used to create or update contacts, deals, and meeting engagements in HubSpot. This removes manual note-taking and ensures CRM data stays accurate and consistent after every call.\n\n## Step-by-step\n- **Trigger on meeting summary email**\n  - **Gmail Trigger** – Watches the inbox for new meeting summary emails from a specific sender.\n\n- **Prepare and normalize meeting notes**\n  - **Prepare Meeting Summary** – Extracts the meeting text and stores it in a clean summary field for AI processing.\n\n- **Extract structured sales insights**\n  - **AI Extraction** – Sends the meeting summary to an AI model to identify company details, problems, budget, decision makers, timing, competitors, and next steps.\n\n- **Parse AI response**\n  - **Parse AI JSON Output** – Validates and converts the AI response into structured JSON fields usable by CRM nodes.\n\n- **Update HubSpot CRM**\n  - **Create or Update Contact** – Creates a new contact or updates an existing one based on extracted details.\n  - **Update Deal** – Updates the related deal with budget, description, stage, and pipeline information.\n  - **Create Meeting Engagement** – Logs a meeting engagement in HubSpot with key discussion points and next actions.\n\n## Why use this?\n- Eliminates manual CRM updates after sales or discovery calls.\n- Ensures meeting insights are captured consistently and accurately.\n- Reduces admin work for sales teams and improves data quality.\n- Works seamlessly with meeting recap tools that send summary emails.\n- Scales easily as meeting volume increases without extra effort.\n",
  "featuredImage": "/data/workflows/12476/12476.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3,
  "downloads": 0,
  "createdAt": "2026-01-05T13:01:52.089Z",
  "updatedAt": "2026-01-16T09:12:28.858Z",
  "publishedAt": "2026-01-05T13:01:52.089Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12476"
}