{
  "id": 12654,
  "slug": "12654",
  "title": "Scrape Trustpilot reviews 📊 with ScrapegraphAI and OpenAI Reputation analysis",
  "description": "This workflow automates the **collection, analysis, and reporting of Trustpilot reviews** for a specific company, transforming unstructured customer feedback into **structured insights and actionable intelligence**.\n\n---\n\n### Key Advantages\n\n#### 1. ✅ End-to-End Automation\n\nThe entire process—from scraping reviews to delivering a polished management report—is fully automated, eliminating manual data collection and analysis .\n\n#### 2. ✅ Structured Insights from Unstructured Data\n\nThe workflow transforms raw, unstructured review text into structured fields and standardized sentiment categories, making analysis reliable and repeatable.\n\n#### 3. ✅ Company-Level Reputation Intelligence\n\nInstead of focusing on individual products, the analysis evaluates the **overall brand, service quality, customer experience, and operational performance**, which is critical for leadership and strategic teams.\n\n#### 4. ✅ Action-Oriented Outputs\n\nThe AI-generated report goes beyond summaries by:\n\n* Identifying reputational risks\n* Highlighting improvement opportunities\n* Proposing concrete actions with priorities, effort estimates, and KPIs\n\n#### 5. ✅ Visual & Executive-Friendly Reporting\n\nAutomatic sentiment charts and structured executive summaries make insights immediately understandable for non-technical stakeholders.\n\n#### 6. ✅ Scalable and Configurable\n\n* Easily adaptable to different companies or review volumes\n* Page limits and batching protect against rate limits and excessive API usage\n\n#### 7. ✅ Cross-Team Value\n\nThe output is tailored for multiple internal teams:\n\n* Management\n* Marketing\n* Customer Support\n* Operations\n* Product & UX\n\n---\n\n### Ideal Use Cases\n\n* Brand reputation monitoring\n* Voice-of-the-customer programs\n* Executive reporting\n* Customer experience optimization\n* Competitive benchmarking (by reusing the workflow across brands)\n\n---\n\n### **How It Works**\n\nThis workflow automates the complete process of scraping Trustpilot reviews, extracting structured data, analyzing sentiment, and generating comprehensive reports. The workflow follows this sequence:\n\n1. **Trigger & Configuration**: The workflow starts with a manual trigger, allowing users to set the target company URL and the number of review pages to scrape.\n\n2. **Review Scraping**: An HTTP request node fetches review pages from Trustpilot with pagination support, extracting review links from the HTML content.\n\n3. **Review Processing**: The workflow processes individual review pages in batches (limited to 5 reviews per execution for efficiency). Each review page is converted to clean markdown using ScrapegraphAI.\n\n4. **Data Extraction**: An information extractor using OpenAI's GPT-4.1-mini model parses the markdown to extract structured review data including author, rating, date, title, text, review count, and country.\n\n5. **Sentiment Analysis**: Another OpenAI model performs sentiment classification on each review text, categorizing it as Positive, Neutral, or Negative.\n\n6. **Data Aggregation**: Processed reviews are collected and compiled into a structured dataset.\n\n7. **Analytics & Visualization**:\n   - A pie chart is generated showing sentiment distribution\n   - A comprehensive reputation analysis report is created using an AI agent that evaluates company-level insights, recurring themes, and provides actionable recommendations\n\n8. **Reporting & Delivery**: The analysis is converted to HTML format and sent via email, providing stakeholders with immediate insights into customer feedback and company reputation.\n\n## **Set Up Steps**\n\nTo configure and run this workflow:\n\n1. **Credential Setup**:\n   - Configure OpenAI API credentials for the chat models and information extraction\n   - Set up ScrapegraphAI credentials for webpage-to-markdown conversion\n   - Configure Gmail OAuth2 credentials for email notifications\n\n2. **Company Configuration**:\n   - In the \"Set Parameters\" node, update `company_id` to the target Trustpilot company URL \n   - Adjust `max_page` to control how many review pages to scrape\n\n3. **Review Processing Limits**:\n   - The \"Limit\" node restricts processing to 5 reviews per execution to manage API costs and processing time\n   - Adjust this value based on your needs and OpenAI usage limits\n\n4. **Email Configuration**:\n   - Update the \"Send a message\" node with the recipient email address\n   - Customize the email subject and content as needed\n\n5. **Analysis Customization**:\n   - Modify the prompt in the \"Company Reputation Analyst\" node to tailor the report format\n   - Adjust sentiment analysis categories if different classification is needed\n\n6. **Execution**:\n   - Click \"Test workflow\" to execute the manual trigger\n   - Monitor execution in the n8n editor to ensure all API calls succeed\n   - Check the configured email inbox for the generated report\n\n**Note**: Be mindful of API rate limits and costs associated with OpenAI and ScrapegraphAI services when processing large numbers of reviews. The workflow includes a 5-second delay between paginated requests to comply with Trustpilot's terms of service.\n\n\n---\n\n👉 [Subscribe to my new **YouTube channel**](https://youtube.com/@n3witalia). Here I’ll share videos and Shorts with practical tutorials and **FREE templates for n8n**.\n\n[![image](https://n3wstorage.b-cdn.net/n3witalia/youtube-n8n-cover.jpg)](https://youtube.com/@n3witalia)\n\n\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/). ",
  "featuredImage": "/data/workflows/12654/12654.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2026-01-12T10:35:36.137Z",
  "updatedAt": "2026-01-16T09:12:51.326Z",
  "publishedAt": "2026-01-12T10:35:36.137Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12654"
}