{
  "id": 6351,
  "slug": "6351",
  "title": "Client onboarding automation: Tally Forms to Google Drive, Notion & Slack",
  "description": "📝 Automation: Instantly Onboard New Clients from Tally Form to Notion, Google Drive & Slack\nThis automation streamlines the client onboarding process by integrating Tally, Notion, Google Drive, and Slack. When a potential client submits a Tally form, the automation is triggered via a webhook, automatically handling all onboarding steps without manual intervention.\n\n⚙️ How It Works – Step-by-Step\nForm Submission Triggered\nA new Tally form submission is received via a webhook.\n\nClient Data Extraction\nThe automation extracts essential client details from the form, including:\n\n-Name\n\n-Email\n\n-Project Type\n\n-Budget\n\nGoogle Drive Folder Creation\nA dedicated Google Drive folder is generated using the client’s name and project type for storing onboarding assets.\n\nNotion Database Entry Creation\nA new item is added to a specified Notion database, storing:\n\nClient information\n\nProject scope\n\nFolder link\n\nSlack Team Notification\nA Slack message is sent to your designated team channel containing all onboarding details, ensuring the team is informed instantly.\n\n✅ Pre-Conditions / Requirements\nA published Tally form collecting client data.\n\nA connected Google Drive account with folder creation permissions.\n\nAn existing Notion database with columns for name, email, budget, etc.\n\nA Slack workspace with an active bot/token integrated with the automation tool.\n\n🛠️ Notion Database Structure\nYour Notion database should include at least the following fields:\n\n-Name (Text)\n\n-Email (Email)\n\n-Project Type (Select)\n\n-Budget (Select)\n\n-Onboarding Folder Link (URL)\n\n🧩 Customization Guidance\nYou can modify the Google Drive folder naming convention to include a timestamp or custom ID.\n\nAdjust Slack message formatting to include project-specific tags or mention specific team members.\n\nExtend the Notion entry to include more fields like project deadline or contact notes.\n\n",
  "featuredImage": "/data/workflows/6351/6351.webp",
  "author": {
    "id": 101,
    "slug": "muhammadahmad33",
    "name": "Muhammad Ahmad",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 547,
  "downloads": 54,
  "createdAt": "2025-07-23T22:08:47.135Z",
  "updatedAt": "2026-01-16T08:44:33.310Z",
  "publishedAt": "2025-07-23T22:08:47.135Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6351"
}