{
  "id": 7836,
  "slug": "7836",
  "title": "Generate daily Bitcoin on-chain metrics PDF report with NASDAQ data",
  "description": "# Purpose and Audience\nThis n8n automation workflow is designed to generate a Bitcoin Daily On-Chain Metrics report in PDF format by fetching and transforming real-time blockchain data. It is ideal for cryptocurrency analysts, traders, investors, and blockchain enthusiasts who want to monitor Bitcoin's network activity, market valuation, and security metrics efficiently.\n\n## What It Does\nThe workflow automates the retrieval of Bitcoin blockchain data via the Nasdaq API, processes key on-chain metrics such as transaction volume, fees, market cap, hash rate, and mining difficulty, and dynamically populates a visually appealing PDF report template. It provides a clear snapshot of Bitcoin’s network health, adoption levels, and market dynamics based on the latest available data.\n\n## Who Is It For\nThis workflow is perfect for crypto analysts, financial data scientists, blockchain researchers, and investors who require automated, up-to-date, and detailed Bitcoin network reports. It serves those looking to integrate real-time crypto data into their decision-making, reporting, or portfolio management processes with minimal manual intervention.\n\n## How to Setup\n1. Import the provided n8n workflow into your n8n instance.\n2. Configure API keys for Nasdaq data access and APITemplate.io for PDF generation within the workflow nodes.\n3. Trigger the workflow manually or use schedule trigger node for automatic execution to fetch the previous day's Bitcoin on-chain metrics.\n4. Review or download the generated PDF report containing all key Bitcoin metrics, including transaction volumes, market cap, miner revenue, hash rate, and more.\n\nNote: Step by step setup guide is inlcuded with the workflow file.\n\n## Report Snapshot:\n![image.png](fileId:2188)",
  "featuredImage": "/data/workflows/7836/7836.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 52,
  "downloads": 5,
  "createdAt": "2025-08-25T12:33:15.765Z",
  "updatedAt": "2026-01-16T08:52:32.484Z",
  "publishedAt": "2025-08-25T12:33:15.765Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7836"
}