{
  "id": 9448,
  "slug": "9448",
  "title": "Automate Shopify orders from Airtable with Gmail confirmations",
  "description": "## This n8n template from [Intuz](https://www.intuz.com/) provides a complete solution to automate your order creation process. \n\nIt seamlessly syncs order data from an Airtable base directly to your Shopify store, creates the official order, and automatically sends a beautiful confirmation email to the customer, closing the loop by updating the status in Airtable.\n\n## Who's this workflow for?\n- E-commerce Managers\n- Operations Teams\n- Businesses with Custom Order Processes (e.g., B2B, phone orders, quotes)\n- Shopify Store Owners using Airtable as a CRM\n\n## How it works\n**1. Triggered from Airtable**: The workflow starts instantly when an Airtable Automation sends a signal via a webhook. This happens when you mark an order as ready to be processed in your Airtable base.\n\n**2. Fetch Order Details:** n8n receives the record ID from Airtable and fetches the complete order details, including customer information and the specific line items for that order.\n\n**3. Create Order in Shopify:** All the gathered information is used to create a new, official order directly in your Shopify store.\n\n**4. Send Confirmation Email:** Once the order is successfully created in Shopify, a professionally formatted HTML order confirmation email is sent to the customer via Gmail.\n\n**5. Update Airtable Status:** Finally, the workflow updates the original order record in Airtable, marking its status as \"Done\" to prevent duplicate processing and keep your records in sync.\n\n## Key Requirements to Use This Template\n**1. n8n Instance:** An active n8n account (Cloud or self-hosted).\n**2. Airtable Base:** An Airtable base on a \"Pro\" plan or higher (required for Airtable Automations). It should contain tables for Orders and Order Line Items.\n**3. Shopify Store:** An active Shopify store with API access permissions.\n**4. Gmail Account:** A Gmail account to send confirmation emails.\n\n## Setup Instructions\n**1. Configure the n8n Workflow:**\n- Webhook Node: Activate the workflow to get the Production URL from the \"Webhook\" node. Copy this URL.\n- Airtable Nodes: In the Get a record and Update record nodes, connect your Airtable credentials and select the correct Base and Table IDs.\n- Shopify Node: In the Create an order node, connect your Shopify store using OAuth2 credentials.\n- Gmail Node: In the Send a message node, connect your Gmail account.\n\n**2. Set Up the Airtable Automation (Crucial Step):**\n- Go to your Airtable base and click on \"Automations\".\n- Create a new automation. For the trigger, select \"When a record meets conditions\".\n- Choose your Orders table and set a condition that makes sense for you (e.g., When \"Shopify Ordered\" is \"Pending\").\n- For the action, choose \"Run a script\". Paste the code below into the script editor:\n**JavaScript**\nconst inputConfig = input.config();\nconst recordId = inputConfig.recordId;\nconst webhookUrl = 'PASTE_YOUR_N8N_PRODUCTION_URL_HERE';\n\nawait fetch(webhookUrl, {\n    method: 'POST',\n    headers: { 'Content-Type': 'application/json' },\n    body: JSON.stringify({ recordId: recordId }),\n});\n- ReplacePASTE_YOUR_N8N_PRODUCTION_URL_HERE with the Production URL you copied from n8n.\n- Add an input variable to the script named recordId and set its value to the \"Airtable record ID\" from the trigger step.\n- Test the script and turn your Airtable Automation ON.\n\n## Connect with us\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n\n## For Custom Workflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n",
  "featuredImage": "/data/workflows/9448/9448.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 180,
  "downloads": 18,
  "createdAt": "2025-10-10T05:38:48.296Z",
  "updatedAt": "2026-01-16T09:00:35.410Z",
  "publishedAt": "2025-10-10T05:38:48.296Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9448"
}