{
  "id": 7952,
  "slug": "7952",
  "title": "Scheduled Gmail cleanup - auto-delete spam, promotions, social & trash",
  "description": "# Scheduled Gmail Cleanup – Auto-Delete Spam, Promotions, Social & Trash to save the Gmail space and time\nManaging Gmail manually can be tedious and time-consuming. Spam, Promotions, Social, and Trash folders quickly fill up with unwanted emails, taking up valuable storage and creating clutter. This workflow provides a simple yet powerful **Gmail automation** for efficient **email management**, helping you maintain a cleaner inbox with zero daily effort.  \n\nThis workflow is triggered by a **Schedule node** that runs once per day (customizable). It then uses multiple **Gmail nodes** to:  \n1. **Fetch Spam Emails** – Identify all emails in the Spam folder.  \n2. **Fetch Promotions Emails** – Collect promotional messages from Gmail’s Promotions category.  \n3. **Fetch Social Emails** – Pull emails from the Social tab.  \n4. **Fetch Trash Emails** – Find all items already marked as trash.  \n5. **Delete Fetched Emails** – Automatically delete the emails retrieved from these categories.  \n\nBy default, the workflow deletes the selected emails permanently. Once removed, they are not recoverable.  \n\n---\n\n## Key Benefits\n- Automatically deletes junk, spam, and promotional emails daily  \n- Keeps Gmail storage under control and prevents hitting Google’s limits  \n- Saves time by eliminating manual cleanup tasks  \n- Helps you achieve and maintain **Inbox Zero**  \n- Simple “set and forget” automation — once activated, it runs in the background  \n\n---\n\n## How to Use\n1. Import this workflow into your n8n account.  \n2. Connect your Gmail account using **Gmail OAuth2 credentials**.  \n3. Open each Gmail node and select your Gmail credential.  \n4. Adjust the **Schedule Trigger** if you want to run it more or less frequently (default: once per day).  \n5. Save and activate the workflow.  \n\nOnce set up, your Gmail inbox will automatically stay clean and organized every day.  \n\n---\n\n## Who Is This For?\n- Professionals who want to focus only on important emails  \n- Productivity enthusiasts striving for Inbox Zero  \n- Users approaching Gmail’s **15GB storage limit**  \n- Teams managing shared inboxes with heavy email flow  \n\n---\n\n## Customising this workflow\n- **Schedule**: Adjust the Schedule Trigger to run hourly, daily, or weekly.  \n- **Categories**: Remove nodes for folders you want to keep, or add filters to only delete emails older than a certain number of days.  \n- **Deletion Settings**: Modify the Gmail Delete node to move emails to Trash instead of permanent deletion if you prefer a safer cleanup.",
  "featuredImage": "/data/workflows/7952/7952.webp",
  "author": {
    "id": 101,
    "slug": "tejas",
    "name": "Tejas Ambalia",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1111,
  "downloads": 111,
  "createdAt": "2025-08-27T14:34:59.714Z",
  "updatedAt": "2026-01-16T08:53:12.781Z",
  "publishedAt": "2025-08-27T14:34:59.714Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7952"
}