{
  "id": 9209,
  "slug": "9209",
  "title": "Scheduled monitoring of new & modified files across Google Drive folders",
  "description": "# This n8n template allows you to, on a schedule, list all files that have been modified since the last execution in a Google Drive folder and in all its subfolders\nWhile Google Drive is accessible and easy to use, file listings via API are limited to either all files in the entire Drive or all files in a specific folder. This also means that the n8n triggers for Google Drive are limited to changes to a specific file or folder.\n\nThis template is built to replace the built-in trigger nodes in the situations when you need to trigger on new or changed files in a folder or any of its subfolders.\n\n## Use cases\n* Trigger a RAG pipeline to update with new or updated documents\n* Push newly uploaded or updated documents into CMS, project management tool or other external platform\n* Log changes to build an audit trail\n* Trigger a backup job or sync process only for files that have changed since the last run, saving bandwidth and processing time.\n* Notify team or client about new documents\n* Can also be run without the scheduling part to perform a one-time iteration of all files \n\n## Good to know\n* Works well if you attach a loop node to the \"output node\" to run additional actions on the files\n* The workflow is designed to use a minimal amount of custom code, preferring built-in nodes in n8n\n* Does not identify file removals\n\n## How it works\n* Recursively executes a subworkflow for each folder in the main folder\n* Each subworkflow execution sends a list of all files in the folder to an \"output node\" that checks if the files was created or modified since the last execution\n* When all subworkflows have been executed, the files in the main folder are sent to the \"output node\"\n* A persistent variable (time of trigger node activation) is set for timestamp comparison on the next execution (**this is only set on non-manually triggered active workflow executions**)\n\n## How to use\n* Set schedule interval in the trigger node (default every 60min)\n* Add Google Drive credentials to the four Google Drive nodes\n* Define your main/root folder in the two nodes inside the red box\n* Connect your workflow to process the files after the node in the yellow box, please note that there will be \"one output\" per folder",
  "featuredImage": "/data/workflows/9209/9209.webp",
  "author": {
    "id": 101,
    "slug": "ossian",
    "name": "Ossian Madisson",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 658,
  "downloads": 65,
  "createdAt": "2025-10-02T21:34:57.256Z",
  "updatedAt": "2026-01-16T08:59:29.200Z",
  "publishedAt": "2025-10-02T21:34:57.256Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9209"
}