{
  "id": 5722,
  "slug": "5722",
  "title": "Transform email responses with GPT-4O Mini and Telegram human-in-the-loop",
  "description": "## Description\n\nThis workflow automates your email communication by listening for incoming emails and notifying you via Telegram. It then prompts you to provide a quick response, which it transforms into a polished, professional message inspired by Chick-fil-A’s renowned customer support style—super friendly, thoughtful, and smooth. This ensures your replies always sound top-notch, even if you’re not naturally great at writing customer messages.\n\nI use this exact flow for my own business to handle customer interactions with ease and exceptional care.\n\n---\n\n## Step-by-Step Setup Instructions\n\n### 1. Email Connection\n\n* Connect your email inbox (e.g., Gmail, Outlook) to the workflow to monitor incoming emails.\n* Set the trigger to listen for new messages or specific labels/folders as needed.\n\n### 2. Telegram Connection\n\n* Connect your Telegram account using a Telegram Bot token.\n* Configure the bot to send notifications when a new email arrives and to receive your reply input directly in Telegram.\n\n### 3. OpenAI Connection\n\n* Connect your OpenAI account by adding your API key.\n* Use OpenAI to rephrase your raw responses into highly polished, friendly customer support messages.\n\n---\n\n## Workflow Description\n\n* The system continuously monitors your email inbox.\n* When a new email arrives, you receive an instant Telegram notification with the email summary.\n* You reply quickly on Telegram with your initial thoughts or answers.\n* The reply is sent to OpenAI, which “translates” it into a Chick-fil-A style, ultra-courteous response.\n* The final message is either emailed back to the customer or saved for you to review and send manually.\n\n---\n\n## Target Audience and Problem Solved\n\nThis workflow is perfect for:\n\n* Small business owners who handle customer support alone.\n* Entrepreneurs who want to maintain a high level of professionalism in their responses but struggle with wording.\n* Teams looking to streamline email replies with fast, human-like, and warm communication.\n\n**Problem solved:**\nIt removes the stress of crafting perfectly polite and engaging customer support emails from scratch, saving time and boosting customer satisfaction.\n\n---\n\n## Customization Guidance\n\n* **Adapting tone and style:** Change the OpenAI prompt to match your brand voice, whether more formal, casual, or playful.\n* **Different business contexts:** Adjust email filters or Telegram notifications to prioritize specific types of inquiries.\n* **Response automation:** Add extra steps to automatically send replies or integrate with CRM tools.\n* **Multilingual support:** Incorporate language detection and translation if your business serves customers in multiple languages.\n",
  "featuredImage": "/data/workflows/5722/5722.webp",
  "author": {
    "id": 101,
    "slug": "arkhip",
    "name": "Arkhip",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 317,
  "downloads": 31,
  "createdAt": "2025-07-06T18:26:03.030Z",
  "updatedAt": "2026-01-16T08:41:06.049Z",
  "publishedAt": "2025-07-06T18:26:03.030Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5722"
}