{
  "id": 7973,
  "slug": "7973",
  "title": "Automate LinkedIn content using viral post analysis with Gemini AI & Flux image generation",
  "description": "# LinkedIn Viral Post Scraper + AI Content Generator with Auto Publishing\n\n## Who's it for\n\nContent creators, social media managers, marketing agencies, and LinkedIn growth hackers who want to automate their content strategy by analyzing viral posts and generating original, high-engagement content at scale.\n\n## What it does\n\nThis comprehensive automation pipeline combines LinkedIn data intelligence with AI-powered content creation to build a complete content marketing system:\n\n**Data Collection Phase:**\n- Automatically scrapes high-engagement posts from target LinkedIn profiles\n- Filters content based on viral metrics (20+ likes, comments, or reposts)\n- Stores trending content data in Google Sheets for analysis\n- Runs on a 12-hour schedule with built-in rate limiting\n\n**Content Generation Phase:**\n- AI analyzes trending patterns and engagement triggers from collected data\n- Generates original LinkedIn posts using Google Gemini's advanced language model\n- Creates custom visuals using AI image generation (HuggingFace Flux model)\n- Automatically publishes complete posts with images to your LinkedIn company page\n- Tracks processed content to prevent duplicate analysis\n\n## How it works\n\nThe workflow operates in two connected phases. The scraping phase monitors specified LinkedIn profiles, collecting high-performing posts into a centralized database. When new viral content is detected, the AI analysis phase triggers automatically, identifying trending topics and creating original content that leverages proven engagement patterns while maintaining authenticity.\n\n## Requirements\n\n**APIs and Credentials:**\n- Google Sheets API (for data storage and profile management)\n- Apify API key (for LinkedIn post scraping)\n- Google Gemini API access (for content generation)\n- HuggingFace API token (for image generation)\n- LinkedIn API access (for publishing)\n\n**Setup Prerequisites:**\n- Google Sheets document with LinkedIn profile URLs\n- LinkedIn company page for publishing\n- Self-hosted n8n instance (uses community nodes)\n\n## How to set up\n\n1. **Configure Data Sources:** Create a Google Sheet with two tabs - one for target LinkedIn profile URLs and another for storing scraped data\n2. **API Integration:** Add all required API credentials to n8n credential manager\n3. **Customize Filters:** Adjust engagement thresholds (currently 20+ for each metric) based on your niche\n4. **AI Prompt Tuning:** Modify the content generation prompt to match your brand voice and industry focus\n5. **Publishing Settings:** Configure your LinkedIn organization ID and posting preferences\n6. **Schedule Optimization:** Set scraping frequency based on your content needs and API limits\n\n## How to customize the workflow\n\n**Content Targeting:** Modify the profile list in Google Sheets to focus on specific industries, thought leaders, or competitors in your niche.\n\n**Engagement Thresholds:** Adjust the filter conditions to be more or less selective about which posts qualify as \"viral\" content.\n\n**AI Voice Customization:** Edit the comprehensive system prompt in the LinkedIn Content Strategy AI node to match your brand personality, industry terminology, and content style preferences.\n\n**Visual Branding:** Customize image generation prompts to include your brand colors, logo elements, or specific visual styles.\n\n**Publishing Schedule:** Modify the trigger frequency and add conditional logic to publish at optimal times for your audience.\n\n**Data Retention:** Add cleanup nodes to manage historical data and prevent Google Sheets from becoming unwieldy over time.",
  "featuredImage": "/data/workflows/7973/7973.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 119,
  "downloads": 11,
  "createdAt": "2025-08-28T06:47:01.985Z",
  "updatedAt": "2026-01-16T08:53:20.015Z",
  "publishedAt": "2025-08-28T06:47:01.985Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7973"
}