{
  "id": 10346,
  "slug": "10346",
  "title": "Multi-channel event countdown manager with Telegram, Slack and Email",
  "description": "This n8n workflow automates the creation and countdown notifications for events like product launches or birthdays via a Telegram bot, ensuring timely group alerts through multi-channel routing (e.g., Slack or email). It processes incoming event data from webhooks, stores it persistently, and triggers scheduled reminders to keep teams or groups informed.\n\n### Key Features\n- Handles event creation or updates via webhook from Telegram chats or external sources.\n- Fetches and processes upcoming events on a customizable schedule for countdown notifications.\n- Routes alerts dynamically to channels like Slack or email based on event settings.\n- Validates incoming data, formats messages for optimal delivery, and confirms responses to initiators.\n\n### Workflow Process\n- The **Webhook Trigger** node starts the workflow when an external system (e.g., Telegram bot) sends a POST request with event details like date, description, and notification preferences.\n- The **Process Webhook Event** node parses and validates incoming webhook data, ensuring required fields (e.g., event date, channel) are present before proceeding.\n- The **Events Database** node fetches upcoming events (e.g., launches or birthdays) from a data source, either triggered by the webhook for updates or scheduled for notifications.\n- The **Webhook Response** node sends a confirmation or status response back to the webhook sender (e.g., Telegram bot) in JSON format.\n- The **Schedule Trigger** node runs the workflow automatically on a defined schedule (e.g., daily at 9AM) to check for countdown-eligible events.\n- The **Is Slack?** node checks if the event's notification channel is set to Slack; if true, it routes to Slack-specific formatting.\n- The **Format Slack Message** node formats the event countdown message in a Slack-friendly layout (e.g., with mentions or embeds).\n- The **Send to Slack** node sends the formatted message to the target Slack channel for group notifications.\n- The **Is Email?** node checks if the event's notification channel is set to email (fallback from Slack check); if true, it routes to email-specific formatting.\n- The **Format Email** node formats the event countdown message in an email-friendly detail (e.g., with HTML for readability).\n- The **Send Email** node sends the formatted email to the recipient list (e.g., group organizers or participants).\n\n### Setup Instructions\n- Import the workflow into n8n and configure the **Webhook Trigger** with your Telegram bot's webhook URL for event creation requests.\n- Set up database credentials in the **Events Database** node (e.g., connect to PostgreSQL or Airtable for event storage).\n- Configure channel integrations: Slack app token for **Send to Slack**, SMTP credentials for **Send Email**, and ensure **Schedule Trigger** aligns with your countdown frequency (e.g., hourly for real-time alerts).\n- Test by sending a sample POST request to the webhook with event data and manually triggering the schedule to verify notifications.\n- Monitor executions in the n8n dashboard and refine validation logic in **Process Webhook Event** for custom event fields.\n\n### Prerequisites\n- Telegram bot with webhook setup for incoming event creation messages.\n- Database service (e.g., PostgreSQL or Google Sheets) for storing and querying events.\n- Slack workspace and email provider (e.g., Gmail SMTP) for notifications.\n- n8n instance with webhook and cron scheduling enabled.\n- Basic API setup for Telegram bot token and channel routing.\n\n### Modification Options\n- Add a Telegram-specific check node (e.g., \"Is Telegram?\") branching from **Events Database** to integrate direct bot messaging.\n- Customize the **Schedule Trigger** for dynamic timing, like event-specific intervals for countdowns (e.g., daily leading up to the date).\n- Extend **Format Slack Message** or **Format Email** with dynamic templates, such as embedding countdown timers or images.\n- Integrate additional channels (e.g., Discord) by duplicating the **Is Slack?** / **Is Email?** logic.\n- Enhance **Process Webhook Event** to support recurring events or auto-populate recipient lists from Telegram group data.\n\n\n\n**Explore More AI Workflows:** [Get in touch with us](https://www.oneclickitsolution.com/contact-us/) for custom n8n automation!",
  "featuredImage": "/data/workflows/10346/10346.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 85,
  "downloads": 8,
  "createdAt": "2025-10-30T12:43:18.302Z",
  "updatedAt": "2026-01-16T09:04:39.200Z",
  "publishedAt": "2025-10-30T12:43:18.302Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10346"
}