{
  "id": 10308,
  "slug": "10308",
  "title": "Generate AI short-form videos with Creatomate, ElevenLabs & Pexels Stock",
  "description": "## Who is this for?\n- Creators, agencies, and marketers who need short-form vertical video at scale.\n- Anyone who wants to turn a topic into an edited “talking shorts” style clip without opening a video editor.\n\n## What problem does it solve?\nManually producing shorts is slow and repetitive. You have to write the script, hunt for b-roll, generate voiceover, layer music, edit timing, and export. This workflow automates that from prompt to rendered MP4 using AI, stock video, and Creatomate.\n\nNote: this template requires a Creatomate template like the one shown below:\n![Screenshot 20251030 at 3.52.41 PM.jpg](fileId:3155)\n\n## How it works\n1. You submit a topic in a simple n8n form.\n2. The workflow uses an AI model to generate a YouTube Shorts style script (~100 words) with hook, body, and looping ending.\n3. A second AI step turns that script into 8 visual search terms (for example “person typing at desk,” “happy team in office,” “corporate meeting”) that are likely to exist in stock footage.\n4. For each term, the workflow calls the Pexels Videos API and pulls the best portrait clip. It fetches clip details and filters files under 50 MB, then keeps the largest high quality version under that limit.\n5. The selected clip URLs are combined into a list that will later map to eight background layers in the Creatomate template.\n6. The generated script is sent to ElevenLabs (text-to-speech) to create the voiceover audio file.\n7. That audio is uploaded to Google Drive. The workflow then:\n   - Randomly picks a background music track from a Drive folder.\n   - Sets the Drive file sharing to “anyone with the link” so Creatomate can fetch it directly.\n8. The workflow calls Creatomate’s Render API:\n   - Injects the voiceover URL, the chosen music URL, and the eight stock video URLs into a predefined vertical template.\n   - Also enables auto-subtitles in the template by linking the transcript to on-screen captions.\n9. The workflow polls Creatomate until render status is `succeeded`.\n10. When rendering is done, cleanup runs:\n    - The temporary voice file in Drive is deleted.\n    - Final output metadata (including the render ID and status) is passed to the last node.\n\nResult: You get an edited 9:16 short with stock b-roll, captions, voiceover, background music, and transitions.\n\n## Setup steps\n1. n8n\n   1. Import this workflow JSON into n8n.\n   2. Expose the included Form Trigger to capture the `topic` input.\n2. AI script + search terms\n   1. Connect your AI model credentials in the `Short Text` node for script generation.\n   2. Connect your AI model credentials in the `Video Search Terms` node for visual search term generation.\n   3. Confirm both nodes are wired to output structured JSON to their paired Structured Output Parser nodes.\n3. Stock footage\n   1. Add your Pexels API key as the `Authorization` header in both `Search Videos` and `Get The Video Details`.\n   2. Keep `orientation=portrait` so clips match 9:16.\n4. Voiceover\n   1. Add your ElevenLabs API key to the `Generate Voice` request header (`xi-api-key`).\n   2. Set the voice ID in the ElevenLabs URL if you want a different voice.\n5. Google Drive\n   1. Connect Google Drive OAuth in `Google Drive`, `List Short Music Files`, and `Set File Permissions`.\n   2. In `List Short Music Files`, point `q` and `folderId` to the folder that stores your background music tracks.\n   3. Confirm `Set File Permissions` is using `role: reader`, `type: anyone` so Creatomate can fetch the audio file.\n6. Creatomate render\n   1. Set your Creatomate API key (`Authorization: Bearer &lt;key&gt;`) in `Create Short` and `Check Video Status`.\n   2. Replace `template_id` with your own Creatomate template ID if different.\n   3. Map each `Background-1` ... `Background-8` field in the JSON body to the combined clip URLs. These correspond to layers in your Creatomate template.\n7. Test end to end\n   1. Run the workflow with a sample topic.\n   2. Confirm:\n      - Script is generated.\n      - At least 8 stock clips are found.\n      - Voice file uploads to Drive and becomes publicly readable.\n      - Creatomate render finishes with `status = succeeded`.\n   3. Adjust template timing and transitions in Creatomate if visuals do not match pacing.\n\n## Notes\n- The cleanup step deletes the temporary voiceover file from Drive after render to avoid clutter.\n- The workflow chooses a random music track each run to keep videos from sounding identical.\n- The render loop will keep polling Creatomate until the final MP4 is ready.\n\n## Resources\n- n8n workflow basics: [n8n Docs](https://docs.n8n.io/)\n- Using AI models in n8n: [n8n Docs on AI](https://docs.n8n.io/integrations/builtin/ai/)\n- Anthropic model usage: [Anthropic Docs](https://docs.anthropic.com/en/docs)\n- Pexels API reference: [Pexels API](https://www.pexels.com/api/)\n- ElevenLabs text to speech: [ElevenLabs Docs](https://docs.elevenlabs.io/)\n- Google Drive file access control: [Google Drive API](https://developers.google.com/drive/api)\n- Creatomate render API: [Creatomate API](https://docs.creatomate.com/)",
  "featuredImage": "/data/workflows/10308/10308.webp",
  "author": {
    "id": 101,
    "slug": "mattyreed1",
    "name": "Matty Reed",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 76,
  "downloads": 7,
  "createdAt": "2025-10-30T08:05:26.077Z",
  "updatedAt": "2026-01-16T09:04:25.377Z",
  "publishedAt": "2025-10-30T08:05:26.077Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10308"
}