{
  "id": 6391,
  "slug": "6391",
  "title": "Ai-powered automated job search & application",
  "description": "**Unleash the power of AI to automate your job search, tailor your applications, and boost your chances of landing your dream job!** This comprehensive workflow handles everything from finding relevant job postings to generating personalized resumes and cover letters.\n\n**Use cases are many:**\n* **Automate your entire job application process:** Spend less time searching and more time preparing for interviews.\n* **Tailor your resume and cover letter for every application:** Maximize your ATS compatibility and stand out to recruiters.\n* **Efficiently track your applications:** Keep all your job search activities organized in one place.\n* **Discover new job opportunities:** Leverage the Adzuna API to find relevant listings.\n\n---\n\n**Good to know:**\n\n* **Free Adzuna API:** This workflow utilizes the *free* Adzuna API, making job search capabilities accessible without initial cost.\n* **OpenRouter Chat Model Costs:** AI model usage (for resume rewriting and cover letter generation) will incur costs based on the OpenRouter pricing model. Please check OpenRouter's official website for updated pricing information.\n* **Model Availability:** The AI models used may have geo-restrictions. If you encounter a \"model not found\" error, it might not be available in your country or region.\n\n---\n\n**How it works:**\n\n1.  **Webhook Trigger:** The workflow is initiated via a webhook, allowing you to trigger it manually or integrate it with other systems (e.g., a form submission with your desired job title and resume).\n2.  **Resume Extraction:** Your uploaded resume (e.g., PDF) is automatically extracted into a readable text format.\n3.  **Job Search (Adzuna API):** Using the provided job title, the workflow queries the Adzuna API to fetch relevant job postings.\n4.  **Job Filtering:** Duplicate job listings are filtered out to ensure you receive unique opportunities.\n5.  **Job Info Extraction:** Key details like job description, company name, and job URL are extracted from each posting.\n6.  **Skills Extraction (AI):** An AI model (OpenRouter) analyzes the job description to identify the top skills and qualifications required.\n7.  **Resume Match Scoring (AI):** Your resume is compared against the extracted job skills by an AI model, generating a compatibility score (1-5).\n8.  **Conditional Resume & Cover Letter Generation:**\n    * **If the resume match score is satisfactory (≥ 3):**\n        * **Tailored Resume Generation (AI):** An AI model rewrites your resume, specifically highlighting the skills and experience most relevant to the target job, in an ATS-friendly and human-readable JSON/HTML format.\n        * **Personalized Cover Letter Generation (AI):** A custom cover letter is drafted by AI, uniquely tailored to the job description and your newly optimized resume, generated as well-formatted HTML.\n9.  **Google Sheets Integration:** The generated cover letter, tailored resume, job URL, and application status are automatically updated in your designated Google Sheet for easy tracking.\n10. **Gmail Notification:** A personalized email containing the generated cover letter, tailored resume, and a direct link to the job posting on Adzuna is sent to your specified email address.\n11. **Webhook Response:** A final text response is sent back via the webhook, summarizing the sent application materials.\n\n---\n\n**How to use:**\n\n* **Manual Trigger:** The workflow is set up with a manual trigger (Webhook) for initial testing and demonstration. You can easily replace this with an n8n form, a scheduled trigger, or integrate it into your existing tools.\n* **Input:** Provide your desired job search keyword and your resume (e.g., as a PDF) to the webhook.\n* **Review & Apply:** Review the AI-generated cover letter and tailored resume sent to your email, then proceed to apply for the job using the provided Adzuna link.\n\n---\n\n**Requirements:**\n\n* **n8n Instance:** A running n8n instance (self-hosted or cloud).\n* **Adzuna API Key:** A free Adzuna API key (easily obtainable from their developer portal).\n* **OpenRouter Account:** For AI model access (costs apply based on usage).\n* **Google Sheets Account:** To store and track your job applications.\n* **Gmail Account:** To send automated application emails.\n\n---\n\n**Customizing this workflow:**\n\nThis workflow is highly customizable. You can:\n* Integrate with other job boards (e.g., LinkedIn, Indeed) using their APIs.\n* Add more sophisticated AI models or custom prompts for even finer control over resume and cover letter generation.\n* Connect to other services for CRM, calendar management, or applicant tracking.\n* Implement different filtering criteria for job postings.\n* Expand the data stored in your Google Sheet (e.g., interview dates, feedback).\n\nStart automating your job search today and streamline your path to career success!",
  "featuredImage": "/data/workflows/6391/6391.webp",
  "author": {
    "id": 101,
    "slug": "dominixai",
    "name": "Gerald Denor",
    "avatar": ""
  },
  "categories": [
    "HR"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1327,
  "downloads": 132,
  "createdAt": "2025-07-24T17:22:18.496Z",
  "updatedAt": "2026-01-16T08:44:46.486Z",
  "publishedAt": "2025-07-24T17:22:18.496Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6391"
}