{
  "id": 3135,
  "slug": "3135",
  "title": "✨🩷Automated social media content publishing factory + system prompt composition",
  "description": "# Social Media Content Publishing Factory for Streamlined Content Creation Across Platforms\n\n## Who is this for?\nThis workflow is designed for content creators, social media managers, and marketing teams who need to efficiently create and publish content across multiple social media platforms. It's perfect for businesses looking to maintain a consistent presence across X (Twitter), Instagram, Facebook, LinkedIn, Threads, and YouTube Shorts without spending hours crafting platform-specific content manually.\n\n## What problem is this workflow solving?\nCreating tailored content for different social media platforms is time-consuming and requires understanding each platform's unique requirements and audience expectations. This workflow solves the challenge of:\n- Maintaining consistent messaging across platforms while respecting platform-specific formats\n- Generating optimized content that follows best practices for each platform\n- Creating accompanying visuals without graphic design skills\n- Streamlining the approval process before publishing\n- Reducing the time spent on repetitive content creation tasks\n\n## What this workflow does\nThis automated content factory takes your content idea and transforms it into platform-optimized posts for all major social media channels. The workflow:\n\n1. Accepts your content idea or topic through a chat interface\n2. Leverages AI to generate tailored content for each platform (X/Twitter, Instagram, Facebook, LinkedIn, Threads, YouTube Shorts)\n3. Creates appropriate images using AI image generation\n4. Sends content for approval via email before publishing\n5. Publishes approved content to selected platforms\n6. Maintains chat memory to improve future content generation\n\n## Setup\n1. Connect your social media platform credentials (X/Twitter, Instagram, Facebook, LinkedIn)\n2. Set up your email account for the approval process\n3. Configure your OpenAI API key for AI content generation\n4. Update the image generation service credentials (Pollinations.ai is used by default)\n5. Customize the system prompts and schemas in the Google Docs nodes with your brand voice and content requirements\n\n## How to customize this workflow to your needs\n- Modify the system prompts in the Google Docs nodes to match your brand voice and content strategy\n- Adjust the social media schemas to include specific fields relevant to your content\n- Update the approval process to include additional stakeholders if needed\n- Add or remove social media platforms based on your marketing strategy\n- Customize the image generation prompts to better match your visual branding\n- Integrate with your existing content calendar or CRM systems\n\nThis workflow eliminates the need to manually craft different versions of the same content for each platform, saving hours of work while ensuring your social media presence remains consistent and optimized for maximum engagement.\n",
  "featuredImage": "/data/workflows/3135/3135.webp",
  "author": {
    "id": 101,
    "slug": "joe",
    "name": "Joseph LePage",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 70877,
  "downloads": 7087,
  "createdAt": "2025-03-11T16:46:06.931Z",
  "updatedAt": "2026-01-16T08:28:36.613Z",
  "publishedAt": "2025-03-11T16:46:06.931Z",
  "nodes": 100,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3135"
}