{
  "id": 4560,
  "slug": "4560",
  "title": "Build an AI IT support agent with Azure Search, Entra ID & Jira",
  "description": "An intelligent IT support agent that uses Azure AI Search for knowledge retrieval, Microsoft Entra ID integration for user management, and Jira for ticket creation. The agent can answer questions using internal documentation and perform administrative tasks like password resets.\n\n## How It Works\n\nThe workflow operates in three main sections:\n\n**Agent Chat Interface**: A chat trigger receives user messages and routes them to an AI agent powered by Google Gemini. The agent maintains conversation context using buffer memory and has access to multiple tools for different tasks.\n\n**Knowledge Management**: Users can upload documentation files (.txt, .md) through a form trigger. These documents are processed, converted to embeddings using OpenAI's API, and stored in an Azure AI Search index with vector search capabilities.\n\n**Administrative Tools**: The agent can query Microsoft Entra ID to find users, reset passwords, and create Jira tickets when issues need escalation. It uses semantic search to find relevant internal documentation before responding to user queries.\n\nThe workflow includes a separate setup section that creates the Azure AI Search service and index with proper vector search configuration, semantic search capabilities, and the required field schema.\n\n## Prerequisites\n\nTo use this template, you'll need:\n\n- n8n cloud or self-hosted instance\n- Azure subscription with permissions to create AI Search services\n- Microsoft Entra ID (Azure AD) access with user management permissions\n- OpenAI API account for embeddings\n- Google Gemini API access\n- Jira Software Cloud instance\n- Basic understanding of Azure resource management\n\n## Setup Instructions\n\n1. **Import the template into n8n.**\n\n2. **Configure credentials:**\n   - Add Google Gemini API credentials\n   - Add OpenAI API credentials for embeddings\n   - Add Microsoft Azure OAuth2 credentials with appropriate permissions\n   - Add Microsoft Entra ID OAuth2 credentials\n   - Add Jira Software Cloud API credentials\n\n3. **Update workflow parameters:**\n   - Open the \"Set Common Fields\" nodes\n   - Replace `&lt;azure subscription id&gt;` with your Azure subscription ID\n   - Replace `&lt;azure resource group&gt;` with your target resource group name\n   - Replace `&lt;azure region&gt;` with your preferred Azure region\n   - Replace `&lt;azure ai search service name&gt;` with your desired service name\n   - Replace `&lt;azure ai search index name&gt;` with your desired index name\n   - Update the Jira project ID in the \"Create Jira Ticket\" node\n\n4. **Set up Azure infrastructure:**\n   - Run the manual trigger \"When clicking 'Test workflow'\" to create the Azure AI Search service and index\n   - This creates the vector search index with semantic search configuration\n\n5. **Configure the vector store webhook:**\n   - Update the \"Invoke Query Vector Store Webhook\" node URL with your actual webhook endpoint\n   - The webhook URL should point to the \"Semantic Search\" webhook in the same workflow\n\n6. **Upload knowledge base:**\n   - Use the \"On Knowledge Upload\" form to upload your internal documentation\n   - Supported formats: .txt and .md files\n   - Documents will be automatically embedded and indexed\n\n7. **Test the setup:**\n   - Use the chat interface to verify the agent responds appropriately\n   - Test knowledge retrieval with questions about uploaded documentation\n   - Verify Entra ID integration and Jira ticket creation\n\n## Security Considerations\n\n- Use least-privilege access for all API credentials\n- Microsoft Entra ID credentials should have limited user management permissions\n- Azure credentials need Search Service Contributor and Search Index Data Contributor roles\n- OpenAI API key should have usage limits configured\n- Jira credentials should be restricted to specific projects\n- Consider implementing rate limiting on the chat interface\n- Review password reset policies and ensure force password change is enabled\n- Validate all user inputs before processing administrative requests\n\n## Extending the Template\n\nYou could enhance this template by:\n\n- Adding support for additional file formats (PDF, DOCX) in the knowledge upload\n- Implementing role-based access control for different administrative functions\n- Adding integration with other ITSM tools beyond Jira\n- Creating automated escalation rules based on query complexity\n- Adding analytics and reporting for support interactions\n- Implementing multi-language support for international organizations\n- Adding approval workflows for sensitive administrative actions\n- Integrating with Microsoft Teams or Slack for notifications",
  "featuredImage": "/data/workflows/4560/4560.webp",
  "author": {
    "id": 101,
    "slug": "adbertram",
    "name": "Adam Bertram",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1846,
  "downloads": 184,
  "createdAt": "2025-06-01T12:27:26.929Z",
  "updatedAt": "2026-01-16T08:34:59.524Z",
  "publishedAt": "2025-06-01T12:27:26.929Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4560"
}