{
  "id": 3790,
  "slug": "3790",
  "title": "Automated stock analysis reports with technical & news sentiment using GPT-4o",
  "description": "Stock Analysis Agent (Hebrew, RTL, GPT-4o)\n\n\n### Overview ###\n\nGet comprehensive stock analysis with this AI-powered workflow that provides actionable insights for your investment decisions. On a weekly basis, this workflow:\n\n- Analyzes stock data from multiple sources (Chart-img, Twelve Data API, Alphavantage)\n- Performs technical analysis using advanced indicators (RSI, MACD, Bollinger Bands, Resistance and Support Levels)\n- Scans financial news from Alpha Vantage to capture market sentiment\n- Uses OpenAI's GPT-4o to identify patterns, trends, and trading opportunities\n- Generates a fully styled, responsive HTML email (with proper RTL layout) in Hebrew\n- Sends detailed recommendations directly to your inbox\n\n**Perfect for investors, traders, and financial analysts who want data-driven stock insights - combining technical indicators with news sentiment for more informed decisions.**\n\n### Setup Instructions ###\n\n**Estimated setup time:**\n- 15 minutes\n\n**Required credentials:**\n- OpenAI API Key\n- Chart-img API Key (free tier)\n- Twelve Data API Key (free tier)\n- Alpha Vantage API Key (free tier)\n- SMTP credentials (for email delivery)\n\n**Steps:**\n\n1. Import this template into your n8n instance.\n2. Add your API keys under credentials.\n3. Configure the SMTP Email node with: Host (e.g., smtp.gmail.com), Port (465 or 587), Username (your email), Password (app-specific password or login).\n4. Activate the workflow.\n5. Fill in the Form.\n6. **Enjoy!** (Check your Spam mailbox)\n\n### Customization Tips ###\n\n- Modify the analysis timeframe (daily, weekly, monthly)\n- Add integrations with trading platforms or portfolio management tools\n- Adjust the recommendation criteria based on your risk tolerance\n\n### Why Use This? ###\nThis is more than just stock data. It's an intelligent financial assistant that combines technical analysis with market sentiment to provide actionable recommendations - automatically.\n\n### Important Note: ###\nThis report is being generated automatically and does not constitute an investment recommendation. **Please consult a licensed investment advisor before making any investment decisions.**",
  "featuredImage": "/data/workflows/3790/3790.webp",
  "author": {
    "id": 101,
    "slug": "elay96",
    "name": "Elay Guez",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 73353,
  "downloads": 7335,
  "createdAt": "2025-04-29T17:33:05.653Z",
  "updatedAt": "2026-01-16T08:31:28.681Z",
  "publishedAt": "2025-04-29T17:33:05.653Z",
  "nodes": 45,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3790"
}