{
  "id": 7163,
  "slug": "7163",
  "title": "Automate hyper-personalized email outreach with AI, Gmail & Google Sheets",
  "description": "# This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution for hyper-personalized email outreach. \n\nIt powerfully combines AI with Gmail and Google Sheets, using specific keywords and prospect data to automatically craft unique, compelling email content that boosts engagement and secures more replies. \n\nInstead of manually replying to every lead or inquiry, this template does the heavy lifting for you, ensuring every response is relevant, thoughtful, and timely.\n\nIt reads each person's unique inquiry, uses OpenAI to craft a perfectly tailored and human-like response, and sends it directly from your Gmail account. Ideal for sales, marketing, and customer support teams looking to boost engagement and save hours of manual work.\n\n## Use Cases:\n- Sales Teams: Instantly follow up with new leads from your website's contact form with a personalized touch.\n\n- Customer Support: Provide initial, intelligent responses to support tickets, answering common questions or acknowledging receipt of a complex issue.\n\n- Marketing Automation: Nurture leads by responding to content downloads or webinar sign-ups with relevant, non-generic information.\n\n- Founders & Solopreneurs: Manage all incoming business inquiries (partnerships, media, etc.) efficiently without sacrificing quality.\n\n\n## How It Works:\n1. Trigger the Flow (Manual): Start the automation whenever you're ready to process a new batch of inquiries from your sheet.\n\n2. Fetch Inquiries from Google Sheets: The workflow connects to your specified Google Sheet and reads each row. It pulls the contact's First Name, Email ID, the Inquiry Intent (e.g., \"Demo Request,\" \"Pricing Inquiry\"), and the full text of their Original Inquiry.\n\n3. Sync Your Signature: Before writing the email, an HTTP Request node dynamically fetches your display name from your Gmail account settings. This ensures the signature in the generated email (Thanks, {{Your Name}}) is always accurate.\n\n4. Craft a Hyper-Personalized Reply with AI: It uses this context to generate a high-quality, professional, and friendly email reply in HTML format. For example:\n- If the intent is \"Technical Support,\" the AI will generate a helpful, empathetic response addressing the technical issue.\n- If the intent is \"Partnership Proposal,\" it will draft a professional reply acknowledging the proposal and outlining the next steps.\n\n5. Send via Gmail: The final node takes the AI-generated message, adds a relevant subject line (e.g., \"Re: Your Demo Request\"), and sends it directly to the contact's email address from your connected Gmail account.\n\nThis process loops for every single row in your Google Sheet, turning a list of names into a series of meaningful conversations.\n\n## Setup Instructions:\nTo get this workflow running, you'll need to configure a few things:\n\n1. Credentials:\nGoogle: Connect your Google account via OAuth2 and ensure you have enabled access for Google Sheets, Google Drive, and Gmail.\n2. OpenAI: Add your OpenAI API key as a credential.\n3. Google Sheet Setup:\nCreate a Google Sheet with the following exact column headers:\n-First Name\n-Email ID\n-Inquiry Intent (A short category like \"Demo Request\", \"Billing Issue\", etc.)\n-Original Inquiry (The full text of the email or message you received).\n4. Node Configuration:\nGet row(s) in sheet: Select your Google Sheet document and the specific sheet name.\nMessage a model (OpenAI): Choose your preferred OpenAI model (e.g., gpt-4-turbo, gpt-3.5-turbo).\n5. HTTP Request & Send Personalized emails: These nodes should automatically use your configured Gmail credentials. No changes are typically needed.\n\n\n## Connect with us\n\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n\n## For Custom Worflow Automation \n\n\nClick here- [Get Started](https://www.intuz.com/get-started)",
  "featuredImage": "/data/workflows/7163/7163.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 8192,
  "downloads": 819,
  "createdAt": "2025-08-08T07:05:04.754Z",
  "updatedAt": "2026-01-16T08:48:47.940Z",
  "publishedAt": "2025-08-08T07:05:04.754Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7163"
}