{
  "id": 10040,
  "slug": "10040",
  "title": "Create a complete user authentication system with PostgreSQL & webhooks",
  "description": "# Generate Secure User Authentication with One Webhook\n\nStreamline user onboarding and security for your applications using this n8n workflow. This template handles signup, login, and password resets through a single endpoint, making it ideal for developers building MVPs or scaling apps without a full authentication backend.\n\n## Who Is This For?\nThis workflow is designed for:\n\nDevelopers, indie hackers, and teams building web, mobile, or API-driven applications.\nThose who need a quick and secure authentication layer.\nAnyone tired of writing custom auth code or managing third-party services like Auth0 for simple needs.\n\nThis template integrates seamlessly into your n8n setup.\n\n## What Problem Does This Workflow Solve?\nBuilding authentication from scratch is time-consuming and complex:\n\n**User Management:** Managing registration, credential verification, and password recovery can take weeks of development time.\n**Security:** Ensuring secure password hashing, case-insensitive email matching, and robust error handling adds significant complexity.\nIntegration: Creating consistent APIs for apps (e.g., React Native, Next.js, Flutter) is challenging.\n\n**This workflow provides a battle-tested, webhook-based authentication system that is:**\n\nDatabase-agnostic (works with PostgreSQL/Supabase).\nExtensible—deploy once and integrate across all your apps.\n\n\n## **What This Workflow Does**\nThe workflow handles authentication tasks through a single webhook endpoint, offering the following functionality:\n\n**Webhook Entry:**\n\nListens for POST requests at /webhook/auth.\nProcesses a simple JSON payload, routing actions via a \"path\" parameter (signup, signin, forgot).\n\n\n**Signup:**\n\nInserts new users into your database.\nUses bcrypt-hashed passwords (via pgcrypto).\nReturns user details in the response.\n\n\n**Login:**\n\nQueries for case-insensitive email matches.\nVerifies passwords securely.\nReturns user information on successful login.\n\n\n**Forgot Password:**\n\nGenerates a random 8-character password.\nUpdates the password hash in the database.\nReturns the new password (suitable for email delivery).\n\n\n**Routing & Validation:**\n\nUses n8n Switch and IF nodes to securely handle paths and credentials.\n\n\n**Standardized Responses:**\n\nOutputs clean JSON with status, message, and data for easy frontend parsing.\n\n**Error Handling:**\n\nGracefully manages invalid inputs, duplicate entries, or database errors.\n\n\n**No more boilerplate—get authentication up and running in minutes!**\n\n**Setup Instructions**\nFollow these steps to set up the workflow:\n\n**Connect Your Accounts:**\n\nUse PostgreSQL or Supabase for user storage (free tiers are sufficient).\nEnable the following PostgreSQL extensions: uuid-ossp and pgcrypto.\n\n\n**Create the Users Table:**\n\n```\nsqlCREATE TABLE users (\n    id uuid PRIMARY KEY DEFAULT uuid_generate_v4(),\n    full_name text NOT NULL,\n    email text UNIQUE NOT NULL,\n    password_hash text NOT NULL,\n    created_at timestamptz DEFAULT now()\n);\n```\n\n\n**Configure Credentials :**\n\nAdd PostgreSQL credentials to the n8n nodes (\"Signup\", \"Login\", \"Reset Password\").\nImport the JSON workflow into n8n.\nActivate the workflow.\n\n\n**Test the Workflow:**\n\nUse Postman or curl to send requests to the auto-generated webhook URL.\n\n\n**How to Customize This Workflow**\n\nExtend the workflow to fit your specific needs with these modifications:\n\nAdd JWT Sessions:\n\nInsert a node after successful login to generate and sign JWT tokens (e.g., using the Crypto node).\n\n\nEmail Integration:\n\nAdd a SendGrid or Mailgun node to the \"Forgot Password\" flow to automatically send new credentials.\n\n\nRate Limiting:\n\nInclude an HTTP Request node to check usage quotas before processing requests.\n\n\nMulti-Database Support:\n\nReplace PostgreSQL with MySQL or MongoDB by updating the query nodes.\n\n\nFrontend Enhancements:\n\nExtend JSON responses to include user avatars or roles by joining additional tables in SQL queries.\n\n\n**Triggers:**\n\nAdd a Schedule node for batch user imports.\nInclude a webhook for external authentication calls.",
  "featuredImage": "/data/workflows/10040/10040.webp",
  "author": {
    "id": 101,
    "slug": "convosoft",
    "name": "Convosoft",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 192,
  "downloads": 19,
  "createdAt": "2025-10-22T11:46:45.886Z",
  "updatedAt": "2026-01-16T09:03:05.383Z",
  "publishedAt": "2025-10-22T11:46:45.886Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10040"
}