{
  "id": 4640,
  "slug": "4640",
  "title": "Competitor price monitoring with web scraping,Google Sheets & Telegram",
  "description": "## How it works\n\n++Download the google sheet here++ and replace this with the googles sheet node: [Google sheet](https://www.dropbox.com/scl/fi/zaif45nt9uzgz8mrhht9n/competitor_price_drop_automation.xlsx?rlkey=4vj3wz6gqp16dc2hh9hw5o49z&st=i23h513p&dl=1) , upload to google sheets and replace in the google sheets node.\n\n- Scheduled trigger: Runs once a day at 8 AM (server time).\n\n- Fetch product list: Reads your “master” sheet (product_url + last known price) from Google Sheets.\n\n- Loop with delay: Iterates over each row (product) one at a time, inserting a short pause (20 s) between HTTP requests to avoid blocking.\n\n- Scrape current price: Loads each product_url, extracts the current price via a simple CSS selector.\n\n- Compare & normalize: Compares the newly scraped price against the “last_price” from your sheet, calculates percentage change, and tags items where price_changed == true.\n\n**On price change:**\n- Send alert: Formats a Telegram message (“Price Drop” or “Price Hike”) and pushes it to your configured chat.\n\n- Log history: Appends a new row to a separate “price_tracking” tab with timestamp, old price, new price, and % change.\n\n- Update master sheet: After a 1 min pause, writes the updated current_price back to your “master” sheet so future runs use it as the new baseline.\n\n## Set up step\n1. Google Sheets credentials (~5 min)\n2. Create a Google Sheets OAuth credential in n8n. \n3. Copy your sheet’s ID and ensure you have two tabs: \n4. product_data (columns: product_url, price) \n5. price_tracking (columns: timestamp, product_url, last_price, current_price, price_diff_pct, price_changed) \n6. Paste the sheet ID into both Google Sheets nodes (“Read” and “Append/Update”). \n7. Telegram credentials (~5 min) \n8. Create a Telegram Bot token via BotFather. \n9. Copy your chat_id (for your target group or personal chat). \n10. Add those credentials to n8n and drop them into the “Telegram” node.\n\n## Workflow parameters (~5 min)\n\n- Verify the schedule in the Schedule Trigger node is set to 08:00 (or adjust to your preferred run time).\n\n- In the Loop Over Items node, confirm “Batch Size” is 1 (to process one URL at a time).\n \n- Adjust the Delay to avoid Request Blocking node if your site requires a longer pause (default is 20 s).\n \n- In the Parse Data From The HTML Page node, double-check the CSS selector matches how prices appear on your target site.\n \n- Once credentials are in place and your sheet tabs match the expected column names, the flow should be ready to activate. Total setup time is under 15 minutes—detailed notes are embedded as sticky comments throughout the workflow to help you tweak selectors, change timeouts, or adjust sheet names without digging into code.",
  "featuredImage": "/data/workflows/4640/4640.webp",
  "author": {
    "id": 101,
    "slug": "tonydatahut",
    "name": "Tony Paul",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5317,
  "downloads": 531,
  "createdAt": "2025-06-04T03:40:59.974Z",
  "updatedAt": "2026-01-16T08:35:28.656Z",
  "publishedAt": "2025-06-04T03:40:59.974Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4640"
}