{
  "id": 10926,
  "slug": "10926",
  "title": "Generate personalized sales follow-ups from Fireflies transcripts with Gemini & Google Drive",
  "description": "**Automatically Generate AI Follow-Up Messages from Fireflies Transcripts**\n\nThis workflow automates creating personalized follow-up messages for your clients based on meeting transcripts fetched from Fireflies. It ensures the right guest information is captured, the transcript is processed by AI, and the output is stored neatly in Google Drive.\n\n**What it Does**\n\n\n1. **Triggers on New Appointment:** The workflow starts when a new appointment is created in Google Calendar.\n2. **Extracts Guest and Appointment Details:**  The Edit Fields node extract the guest's email, appointment start/end time, status, and creator.\n3. **Fetches Transcript from Fireflies:** The GraphQL node queries Fireflies using the guest email to fetch the meeting transcript, including sentences, participants, and summary.\n4. **Skip IF Empty:** The Filter node skip passing the Info to AI Agent if there is no record in Fireflies\n5. **Generates Follow-Up Messages via AI:** The AI Agent node (powered by Google Gemini) creates 12 personalized follow-up messages/emails for the guest.  \n- Messages are conversational, concise, and reference topics and pain points mentioned in the call.  \n- The messages are tailored to re-engage the client and guide them towards making a purchase.\n6. **Stores Messages in Google Drive:** The Google Drive node saves the AI-generated messages in a specific folder, named after the guest, for easy reference.\n\n**Use Cases**\n\n- **Missed Follow-Ups:** Automatically create personalized follow-ups after client calls without manual effort.\n- **Sales & Customer Engagement:** Ensure every client gets context-specific messages, improving engagement and conversion.\n- **Team Collaboration:** Messages are saved in Google Drive, making it easy for your team to review and send manually if needed.\n\n**Customization**\n\n- **Transcript Source:** The GraphQL node can be customized to fetch transcripts for specific guests or date ranges.\n- **Message Personalization:** The AI prompt in AI Agent can be updated to change the tone, style, or length of messages.\n- **Storage Folder:** You can change the folder in the Google Drive node to organize messages per team, campaign, or client.\n\n**Troubleshooting**\n\n- **AI Messages Not Generated:** Verify AI Agent node is connected to Google Gemini Chat Model and has correct API credentials.\n- **Messages Not Saved:** Check the Google Drive folder ID and access permissions.\n\n**Requirements**\n\n- An N8N instance (self-hosted or cloud).  \n- Google Gemini API credentials.  \n- Google Drive account with proper folder access.  \n- Fireflies API credentials with GraphQL access.\n\n**How to Set Up**\n\n- **Connect Credentials:** In Google Calendar Node, GraphQL, AI Agent, and Google Drive nodes, select your credentials for Google Calendar, Fireflies, Google Gemini, and Google Drive.\n\n- **Set Guest Details Extraction:** Verify the Edit Fields node extracts all required fields (first name, last name, email, appointment times, status).\n- **Update GraphQL Query:** Ensure the query correctly fetches transcripts by guest email. Adjust if your Fireflies workspace uses different fields.\n- **Customize AI Prompt:** Update AI Agent with the exact instructions for message generation (number of messages, tone, context, platform).\n- **Configure Google Drive Storage:** Select the proper folder to save messages, ideally using guest name as file name for easy reference.\n- **Activate Workflow:** Save and activate the workflow.\n\n\n- **Video Tutorial:** Step by step video instructions present here for beginners [https://youtu.be/5t9xXCz4DzM](https://youtu.be/5t9xXCz4DzM)",
  "featuredImage": "/data/workflows/10926/10926.webp",
  "author": {
    "id": 101,
    "slug": "websensepro",
    "name": "Websensepro",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 40,
  "downloads": 4,
  "createdAt": "2025-11-17T13:25:31.662Z",
  "updatedAt": "2026-01-16T09:06:52.824Z",
  "publishedAt": "2025-11-17T13:25:31.662Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10926"
}