{
  "id": 10144,
  "slug": "10144",
  "title": "Detect holiday conflicts & suggest meeting reschedules with Google Calendar and Slack",
  "description": "**Who’s it for**\n\nRemote and distributed teams that schedule across time zones and want to avoid meetings landing on public holidays—PMs, CS/AM teams, and ops leads who own cross-regional calendars.\n\n**What it does / How it works**\n\nThe workflow checks next week’s Google Calendar events, compares event dates against public holidays for selected country codes, and produces a single Slack digest with any conflicts plus suggested alternative dates. Core steps: Workflow Configuration (Set) → Fetch Public Holidays (via a public holiday API such as Calendarific/Nager.Date) → Get Next Week Calendar Events (Google Calendar) → Detect Holiday Conflicts (compare dates) → Generate Reschedule Suggestions (find nearest business day that isn’t a holiday/weekend) → Format Slack Digest → Post Slack Digest.\n\n**How to set up**\n\nOpen Workflow Configuration (Set) and edit: countryCodes, calendarId, slackChannel, nextWeekStart, nextWeekEnd.\n\nConnect your own Google Calendar and Slack credentials in n8n (no hardcoded keys).\n\n(Optional) Adjust the Trigger to run daily or only on Mondays.\n\n**Requirements**\n\nn8n (Cloud or self-hosted)\n\nGoogle Calendar read access to the target calendar\n\nSlack app with permission to post to the chosen channel\n\nA public-holiday API (no secrets needed for Nager.Date; Calendarific requires an API key)\n\n**How to customize the workflow**\n\nTime window: Change nextWeekStart/End to scan a different period.\n\nHoliday sources: Add or swap APIs; merge multiple regions.\n\nSuggestion logic: Tweak the look-ahead window or rules (e.g., skip Fridays).\n\nOutput: Post per-calendar messages, DM owners, or create tentative reschedule events automatically.",
  "featuredImage": "/data/workflows/10144/10144.webp",
  "author": {
    "id": 101,
    "slug": "takuya",
    "name": "Takuya Ojima",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 64,
  "downloads": 6,
  "createdAt": "2025-10-25T06:42:32.150Z",
  "updatedAt": "2026-01-16T09:03:40.980Z",
  "publishedAt": "2025-10-25T06:42:32.150Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10144"
}