{
  "id": 4540,
  "slug": "4540",
  "title": "Create PDF from images for free via Google Slides and Google Drive",
  "description": "This n8n template offers a free and automated way to convert images from a Google Drive folder into a single PDF document. It uses Google Slides as an intermediary, allowing you to control the final PDF's page size and orientation.\n\nIf you're looking for a no-cost solution to batch convert images to PDF and need flexibility over the output dimensions (like A4, landscape, or portrait), this template is for you! It's especially handy for creating photo albums, visual reports, or simple portfolios directly from your Google Drive.\n\n### How it works\n\n1. The workflow first copies a Google Slides template you specify. The page setup of this template (e.g., A4 Portrait) dictates your final PDF's dimensions.\n2. It then retrieves all images from a designated Google Drive folder, sorts them by creation date.\n3. Each image is added to a new slide in the copied presentation.\n4. Finally, the entire Google Slides presentation is converted into a PDF and saved back to your Google Drive.\n\n### How to use\n\n1. Connect your Google Drive and Google Slides accounts in the relevant nodes.\n2. In the \"Set Pdf File Name\" node, define the name for your output PDF.\n3. In the \"CopyPdfTemplate\" node:\n\t1. Select your Google Slides template file (this sets the PDF page size/orientation).\n\t2. Choose the Google Drive folder containing your source images.\n3. Ensure your images are in the specified folder. For best results, images should have an aspect ratio similar to your chosen Slides template.\n4. Run the workflow to generate your PDF by clicking 'Test Workflow'\n\n### Requirements\n\n- Google Drive account.\n\n- Google Slides account.\n\n- Google Slides Template stored on your Google Drive\n\n\n### Customising this workflow\n\nAdjust the \"Filter: Only Images\" node if you use image formats other than PNG (e.g., image/jpeg for JPGs).\n\nModify the image sorting logic in the \"Sort by Created Date\" node if needed.\n",
  "featuredImage": "/data/workflows/4540/4540.webp",
  "author": {
    "id": 101,
    "slug": "nadiap",
    "name": "Nadia Privalikhina",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2570,
  "downloads": 257,
  "createdAt": "2025-05-31T17:46:34.570Z",
  "updatedAt": "2026-01-16T08:34:52.743Z",
  "publishedAt": "2025-05-31T17:46:34.570Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4540"
}