{
  "id": 10891,
  "slug": "10891",
  "title": "Predict and Forecast HDB Flat Prices with GPT-4o and Google Sheets Analytics",
  "description": "## How It Works\nThe workflow runs on a monthly trigger to collect both current-year and multi-year historical HDB data. Once fetched, all datasets are merged with aligned fields to produce a unified table. The system then applies cleaning and normalization rules to ensure consistent scales and comparable values. After preprocessing, it performs pattern mining, anomaly checks, and time-series analysis to extract trends and forecast signals. An AI agent, integrating OpenAI GPT-4, statistical tools, and calculator nodes, synthesizes these results into coherent insights. The final predictions are formatted and automatically written to Google Sheets for reporting and downstream use.\n\n## Setup Steps\n1) Configure fetch nodes to pull current-year HDB data and three years of historical records.\n2) Align and map column names across all datasets.\n3) Set normalization and standardization parameters in the cleaning node.\n4) Add your OpenAI API key (GPT-4) and link the model, forecasting tool, and calculator nodes.\n5) Authorize Google Sheets and configure sheet and cell mappings for automated export.\n \n\n\n## Prerequisites\n- Historical data source with API access (3+ years of records)\n- OpenAI API key for GPT-4 model\n- Google Sheets account with API credentials\n- Basic understanding of time series data\n\n## Use Cases\n**Real Estate:** Forecast property prices using multi-year historical HDB/market data with confidence intervals\n**Finance:** Predict market trends by aggregating years of transaction or pricing records\n\n## Customization\n**Data Source:** Replace HDB/fetch nodes with stock prices, sensor data, sales records, or any historical dataset\n**Analysis Window:** Adjust years fetched (2-5 years) based on data availability and prediction horizon\n\n\n## Benefits\n**Automation:** Monthly scheduling eliminates manual data gathering and analysis\n**Consolidation:** Merges fragmented year-by-year data into unified historical view\n\n",
  "featuredImage": "/data/workflows/10891/10891.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 62,
  "downloads": 6,
  "createdAt": "2025-11-16T16:39:55.550Z",
  "updatedAt": "2026-01-16T09:06:44.589Z",
  "publishedAt": "2025-11-16T16:39:55.550Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10891"
}