{
  "id": 7539,
  "slug": "7539",
  "title": "Extract citation sources from Google AI overview to Google Sheets with DataForSEO",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n![Pull references from Google's AI Overview with DataForSEO.png](fileId:2132)\n\n## Who’s it for\n\nSEOs and digital marketers who want to track the sources Google cites in its AI Overview SERP feature for specific keywords, monitor competitor visibility, or their website’s presence in AI-generated snippets.\n\n***Note: this template uses DataForSEO community node and works for self-hosted n8n instances only.***\n\n## What it does\n\nThis workflow automatically collects all source references from Google’s AI Overview results using the DataForSEO SERP API. It extracts the source title, URL, and domain, and logs that data in Google Sheets for easy filtering and analysis. You can use this template to monitor how often your site appears in AI-generated summaries or to discover high-authority domains mentioned for your target keywords.\n\n## How it works\n\nTriggers on your chosen schedule (default: every 7 days).\nCalls the DataForSEO SERP API for your keyword.\nParses AI Overview results to extract source citations.\nSaves the structured data in a Google Sheet.\n\n## Requirements\n\n* Self-hosted n8n instance \n* DataForSEO account\n* A Google Sheet that contains the Source, Domain, URL, Title, and Text columns (as in the example: [https://docs.google.com/spreadsheets/d/1XCjkjyVxrtpTUQenHeR3B07xfEZ489mhuVidjhGOO7I/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1XCjkjyVxrtpTUQenHeR3B07xfEZ489mhuVidjhGOO7I/edit?usp=sharing)).\n\n## Customization\n\nYou can change the schedule or swap the Google Sheet for BI dashboards or reporting tools.",
  "featuredImage": "/data/workflows/7539/7539.webp",
  "author": {
    "id": 101,
    "slug": "dataforseo",
    "name": "DataForSEO",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 418,
  "downloads": 41,
  "createdAt": "2025-08-18T08:08:56.574Z",
  "updatedAt": "2026-01-16T08:50:56.963Z",
  "publishedAt": "2025-08-18T08:08:56.574Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7539"
}