{
  "id": 7293,
  "slug": "7293",
  "title": "Easy Redmine and Microsoft Teams workflow template",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# Daily Easy Redmine Task Digest to Microsoft Teams Channel\n\n## Overview  \nThis workflow automatically collects newly assigned Easy Redmine tasks for a specific team and sends a concise, formatted summary to a Microsoft Teams channel each weekday morning. It’s designed to keep your team updated without manual copy-pasting or sifting through outdated information.  \n\nPerfect for project managers, team leads, or consultants using Easy Redmine, this automation ensures that no high-priority or recent tasks are missed, improving transparency and daily planning.  \n\n---\n\n## How it works  \n\n- **Daily Trigger (8:30 AM on workdays):** Initiates the automation at a fixed schedule.  \n- **Get Issues by Query:** Easy Redmine node retrieves all issues matching a saved filter   \n- **Split Out Issues:** Breaks the received array of tasks into individual items for separate processing.  \n- **Keep Relevant Fields & Add Link:** Filters to essential data (ID, author, subject, description) and creates a clickable issue link using URL concatenation.  \n- **Run for Each Task:** Iterates over tasks to process and send individually.  \n- **Message into Team Channel:** Uses the Microsoft Teams node to post formatted HTML content into the chosen channel.  \n\n---\n\n## How to Use  \n\n1. **Import the workflow** into your n8n instance.  \n2. **Set up Easy Redmine credentials** with API access. \n-\tAdd or configure your Easy Redmine API credential. \n3. **Set up Microsoft Teams credentials** with API access.  \n- Add or configure your Microsoft Teams OAuth2 API credential.\n4. Adjust the **saved filter in Easy Redmine** to match your team’s needs.  \n5. Update **Teams channel or chat selection** in the final node.  \n6. Modify the **scheduled trigger time** if desired.  \n7. Test with a smaller query before enabling full automation.  \n\n---\n\n## Example Use Cases  \n\n- **Daily Team Stand-ups:** Provide an automated pre-meeting digest of all new or updated tasks.  \n- **Consulting Project Management:** Keep consultants aware of the latest client requests.  \n- **Support Teams:** Quickly distribute newly assigned tickets without manual coordination.  \n\n---\n\n## Requirements  \n\n- Easy Redmine account with API access and permission to use saved filters.  \n- Microsoft Teams account with permission to post to the target channel.    \n\n---\n\n## Customization  \n\n- Adjust the saved filter in Easy Redmine to target different teams, statuses, or update windows.  \n- Change the schedule to match your meeting cadence (daily, twice daily, etc.).  \n- Alter the HTML formatting for better readability or company branding.  \n- Add more fields from Easy Redmine (priority, due date, etc.) for richer summaries.  \n\n---\n\n**Workflow Improvement Suggestions:**  \n- Rename generic nodes like “manual” and “get-manyissues” to descriptive titles (e.g., “Filter Fields & Build Link”).  \n- Remove any real names or project-specific data before publishing.  \n- Consider adding error handling if Easy Redmine or Teams API calls fail.\n",
  "featuredImage": "/data/workflows/7293/7293.webp",
  "author": {
    "id": 101,
    "slug": "easy8ai",
    "name": "Easy8.ai",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 595,
  "downloads": 59,
  "createdAt": "2025-08-12T13:33:52.014Z",
  "updatedAt": "2026-01-16T08:49:32.560Z",
  "publishedAt": "2025-08-12T13:33:52.014Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7293"
}