{
  "id": 4438,
  "slug": "4438",
  "title": "Goodreads quote extraction with Bright Data and Gemini",
  "description": "# Goodreads Quote Extraction with Bright Data and Gemini\n\nThis workflow demonstrates how to fetch data specifically from **Goodreads** web pages using Bright Data and then extract specific information (quotes) from that data using a Google Gemini AI model.\n\n![image2.png](fileId:1408)\n\n## How it works\n\n*   The workflow is triggered manually.\n*   It sends a request to a Bright Data collector to scrape data from a predefined list of **Goodreads** URLs.\n*   The collected text data from **Goodreads** is then passed to a Google Gemini AI node.\n*   The AI node processes the text and extracts quotes based on a specified JSON schema output format.\n\n## Set up steps\n\nSetting up this workflow should take only a few minutes.\n\n*   You will need a Bright Data API key to configure the 'Header Auth' credential.\n*   You will need a Google Gemini API key to configure the 'Google Gemini(PaLM) Api account' credential.\n*   Ensure the correct Bright Data collector ID is set in the 'Perform Bright Data Web Request' node URL.\n*   Make sure the full list of target **Goodreads** URLs is correctly added to the 'Perform Bright Data Web Request' node's body.\n*   Link your created credentials to the respective nodes ('Perform Bright Data Web Request' and 'Quotes Extractor').\n*   Keep detailed descriptions for specific node configurations in sticky notes inside your workflow canvas.",
  "featuredImage": "/data/workflows/4438/4438.webp",
  "author": {
    "id": 101,
    "slug": "dvirsharon",
    "name": "Dvir Sharon",
    "avatar": ""
  },
  "categories": [
    "Miscellaneous",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 222,
  "downloads": 22,
  "createdAt": "2025-05-27T16:36:14.875Z",
  "updatedAt": "2026-01-16T08:34:21.305Z",
  "publishedAt": "2025-05-27T16:36:14.875Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4438"
}