{
  "id": 5376,
  "slug": "5376",
  "title": "Convert RSS feeds into LinkedIn & X posts with GPT-4o & AI images & approval",
  "description": "## 🚀 Overview\n\nStop letting your valuable blog content collect dust! This automation is your 24/7 content repurposing engine. It monitors any blog or news feed you choose. The moment a new article goes live, it instantly creates engaging, platform-aware posts for LinkedIn and X (Twitter), generates a custom image with AI, and packages it all up for your review. You get the final say with a simple approval email, ensuring your brand voice stays perfectly on point.\n\n![Screenshot_2025_07_04_at_21_49_22_0c19860a25.png](fileId:2156)\n\n---\n\n## 😩 The Problem\n\nYou've invested hours writing the perfect blog post. But the work isn't over. Now you have to manually copy, paste, and rewrite that content for different social platforms. You need a professional tone for LinkedIn, something short and snappy for X, and you have to find or create visuals for both. This tedious, repetitive task drains your creative energy and leads to your social media presence becoming stale or inconsistent.\n\n---\n\n## ✨ The Solution\n\nThis workflow acts as your automated content marketing assistant, elegantly solving the problem. Here’s the magic in action:\n\n1. **New Blog Post Detected:** The workflow constantly watches a specific RSS feed (e.g., your company blog).\n2. **AI Content Generation:** When a new post appears, the AI (powered by **OpenAI GPT-4o-mini**) reads the article, performs a quick web search for context (via SerpAPI), and drafts optimized posts for LinkedIn and X. It also generates a brand-new image based on the article’s topic.\n3. **Secure Image Hosting:** The generated image is uploaded to your Imgbb account for a shareable link.\n4. **Approval Workflow:** A notification is sent directly to your email inbox with the generated text and image for review.\n5. **One-Click Go-Live:** If approved, the workflow automatically publishes the content to the correct social media profiles.\n\n---\n\n## ⚙️ Setup Instructions\n\n### **What You'll Need**\n\n* **RSS Feed URL** (e.g., `https://yourwebsite.com/feed`)\n* **OpenAI API key** (for content + image generation)\n* **SerpAPI API key** (optional, for extra context)\n* **Imgbb API key** (for image hosting)\n* **Connected Accounts:** Gmail, LinkedIn, and X (Twitter)\n\n### **Steps**\n\n1. **Upload:** Import the JSON file into n8n.\n2. **Connect:** Link your credentials for Gmail, LinkedIn, X, OpenAI, SerpAPI, and add Imgbb with “Header Auth.”\n3. **Configure:**\n\n   * Add your RSS URL to the `RSS Feed Trigger` node.\n   * Update the **“Send To”** field in both `Gmail User for Approval` nodes with your own email.\n4. **Activate:** Switch on the workflow and let automation handle the heavy lifting.\n\n---\n\n## 🎨 Customizations\n\n* **Expand to More Networks:** Duplicate an existing branch to add Facebook or Instagram.\n* **Add Smart Filters:** Only generate posts for articles containing specific keywords (e.g., “AI” or “Case Study”).\n",
  "featuredImage": "/data/workflows/5376/5376.webp",
  "author": {
    "id": 101,
    "slug": "adamcrafts",
    "name": "Abdellah Homrani",
    "avatar": ""
  },
  "categories": [
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 74,
  "downloads": 7,
  "createdAt": "2025-06-26T14:18:53.234Z",
  "updatedAt": "2026-01-16T08:39:17.790Z",
  "publishedAt": "2025-06-26T14:18:53.234Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5376"
}