{
  "id": 6733,
  "slug": "6733",
  "title": "Automate user onboarding from database to Saleshandy with Google Sheets tracking",
  "description": "Automatically import new user signups from any database, filter by signup date, and enroll users into your Saleshandy email sequence for immediate engagement. Activity is logged to a spreadsheet (e.g., Google Sheets) for tracking and analytics. Fully configurable, no hardcoded values.\n\n## Prerequisites\n\n- A database with a users table (fields: id, full_name, email, created_at)\n- Saleshandy account with API key and an active sequence.\n- Spreadsheet (e.g., Google Sheets) with columns: ID, Name, Email, Created_at\n- Configured OAuth/API credentials for each service\n\n## How It Works\n\n- Fetches new signups from your database within your desired date range (e.g., daily or weekly).\n- Splits user names and formats user data as needed.\n- Adds each user to your Saleshandy sequence using their name and email.\n- Logs every processed record in your spreadsheet for further tracking and analytics.\n- Runs automatically on your defined schedule (example: daily trigger).\n\n## Set Up Steps\n\n- Estimated time: 10–20 minutes\n- Collect your database and Saleshandy access credentials, and spreadsheet info.\n- Edit database node(s) to include your connection and correct date filter.\n- Set your Saleshandy API key and target sequence ID.\n- Enter your spreadsheet link or ID and authenticate as needed.\n- Test the workflow with a small user batch before scheduling it for routine runs.\n- Check sticky notes by each workflow node for details and best practices.\n\n## Requirements\n\n- Database connection credentials and access\n- Saleshandy API key and sequence ID\n- Google Sheets (or alternative) setup credentials\n\n## Customisation Tips\n\n- Edit the date filter to adjust the range (last day, week, month, or custom)\n- Add error-handling nodes to catch issues with API calls or data\n- Set up notifications (email, Slack, etc.) for process success/failure\n- Rename nodes to reflect your business logic or steps\n- Replace the manual trigger with a webhook or scheduled cron if desired\n- Configure workflow variables for all credentials and IDs—avoid hardcoding",
  "featuredImage": "/data/workflows/6733/6733.webp",
  "author": {
    "id": 101,
    "slug": "saleshandy",
    "name": "Dhruv from Saleshandy",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 170,
  "downloads": 17,
  "createdAt": "2025-07-31T09:35:11.470Z",
  "updatedAt": "2026-01-16T08:46:48.100Z",
  "publishedAt": "2025-07-31T09:35:11.470Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6733"
}