{
  "id": 5592,
  "slug": "5592",
  "title": "Process & summarize PDFs from email & messaging apps with OpenAI GPT",
  "description": "# Process PDFs from Gmail, Outlook, Telegram and WhatsApp with OpenAI\n\nTransform PDF documents into actionable insights automatically across multiple platforms. This workflow monitors emails and messaging platforms for PDF attachments, extracts content, and delivers AI-powered summaries.\n\n## Who's it for\n\nBusiness professionals, teams, and organizations needing automated PDF analysis from emails and messaging platforms. Perfect for processing contracts, reports, invoices, and documents requiring quick review.\n\n## How it works\n\nMonitors Gmail and Outlook for PDF attachments while receiving PDFs via Telegram bot and WhatsApp Business API. Uses OpenAI to extract text and generate structured summaries with executive overviews, key points, important details, insights, and document type identification. Automatically routes summaries back to original senders.\n\n## Requirements\n\n- Gmail/Outlook OAuth2 credentials\n- Telegram Bot API token via @BotFather  \n- WhatsApp Business API account\n- OpenAI API key\n\n## How to set up\n\nConfigure API credentials in respective nodes, update configuration variables for phone numbers and notification settings, then test with sample PDFs.\n\n## How to customize\n\nModify AI models, customize prompts, adjust response formatting, extend file support, add notification channels, or integrate with external systems.\n\nPerfect for automating document workflows across communication channels.",
  "featuredImage": "/data/workflows/5592/5592.webp",
  "author": {
    "id": 101,
    "slug": "papcy",
    "name": "papcy",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 460,
  "downloads": 46,
  "createdAt": "2025-07-02T11:37:06.507Z",
  "updatedAt": "2026-01-16T08:40:25.662Z",
  "publishedAt": "2025-07-02T11:37:06.507Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5592"
}