{
  "id": 7480,
  "slug": "7480",
  "title": "Generate personalized startup ideas with Claude analysis and Gmail reports",
  "description": "## Get Started with [n8n](https://n8n.partnerlinks.io/ds9podzjls6d) now!\n\n## Who's it for\nThis workflow is designed for developers, entrepreneurs, and startup enthusiasts who want personalized, AI-driven startup idea generation and analysis. Perfect for solo developers seeking side project inspiration, startup accelerators evaluating concepts, or anyone looking to validate business ideas with professional-grade analysis.\n\n## How it works\nThe workflow uses a three-stage Claude AI agent pipeline to create comprehensive startup analyses. The first agent generates innovative startup ideas based on your technical skills and preferences. The second agent acts as a venture capitalist, critically analyzing market viability, competition, and execution challenges. The third agent performs sentiment analysis and synthesizes a final recommendation with actionable next steps.\n\n## How to set up\n1. Configure Anthropic API credentials for all three Claude AI model nodes\n2. Set up Gmail OAuth2 for email delivery\n3. Fill out the \"My Information\" node with your developer profile\n4. Update the recipient email address in the Gmail node\n5. Test with the manual trigger before enabling daily automation\n\n## Requirements\n- [n8n account](https://n8n.partnerlinks.io/ds9podzjls6d)\n- Anthropic API account for Claude AI access\n- Gmail account with OAuth2 configured\n- Basic understanding of developer skills and market preferences\n\n## How to customize the workflow\nModify the AI agent prompts to focus on specific industries or business models. Adjust temperature settings for different creativity levels. Add database storage to track idea history. Configure the form trigger for team-wide idea generation or integrate with Slack for automated sharing.\n\n\n## Got a good idea?\nVisit my site https://techpoweredgrowth.com to get help getting to the next level\nOr reach out to luka.zivkovic@techpoweredgrowth.com",
  "featuredImage": "/data/workflows/7480/7480.webp",
  "author": {
    "id": 101,
    "slug": "zivkovic58",
    "name": "Luka Zivkovic",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 916,
  "downloads": 91,
  "createdAt": "2025-08-16T22:01:06.982Z",
  "updatedAt": "2026-01-16T08:50:33.973Z",
  "publishedAt": "2025-08-16T22:01:06.982Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7480"
}