{
  "id": 3364,
  "slug": "3364",
  "title": "Build a website customer support chatbot with Groq AI and Google Sheets knowledge base",
  "description": "Build a Website Customer Support Chatbot with Groq AI and Google Sheets as its Knowledge Base.\n\n## Setup Instructions\n\n### Prerequisites\n1. **API Credentials Required:**\n   - Groq API credentials - You'll need a valid API key from Groq\n   - Google Sheets credentials - OAuth authentication required to access your knowledge base sheets\n\n### Step-by-Step Setup\n1. **Add Required Credentials:**\n   - Click on the Credentials menu and add your Groq API credentials\n   - Set up Google OAuth credentials for Google Sheets access\n   \n2. **Configure the Groq Chat Model:**\n   - Click on the \"Groq Chat Model\" node\n   - Select your preferred Groq model (e.g., Llama-3-70b or Mixtral-8x7b)\n   - Set token limits and other parameters as needed\n   \n3. **Set Up Your Knowledge Base:**\n   - Create a Google Sheet with your support information (example structure below)\n   - Note the Google Sheet ID from the URL\n   \n4. **Configure the Google Sheets Node:**\n   - Click on the \"Google Sheets\" node\n   - Select your document ID from the dropdown\n   - Select the specific sheet name containing your knowledge base\n   \n5. **Customize the AI Agent:**\n   - Modify the system message to match your brand's tone and support style\n   - Adjust the context window length in the \"Chat History\" node based on your needs\n   \n6. **Test the Chatbot:**\n   - Click the \"Chat\" button to test with sample customer questions\n   - Verify the AI retrieves correct information from your knowledge base\n   \n7. **Deploy to Your Website:**\n   - Click \"Make Public\" to generate an embed code\n   - Add the embed code to your website HTML\n\n### Knowledge Base Structure Example\nYour Google Sheet should be structured with clear headers and organized data. Example format:\n\n| Question | Answer | Category | Keywords |\n|----------|--------|----------|----------|\n| How do I reset my password? | To reset your password, click the \"Forgot Password\" link on the login page and follow the instructions sent to your email. | Account | password, reset, forgot, login |\n| What are your shipping rates? | Standard shipping is $5.99. Express shipping is $12.99. Orders over $50 qualify for free standard shipping. | Shipping | rates, costs, delivery, free shipping |\n| How do I return an item? | Returns can be initiated within 30 days of purchase by logging into your account and selecting \"Start a Return\" in your order history. | Returns | return policy, exchange, refund |\n\nEach row should contain a complete customer query and response pair, with optional categorization and keywords to help the AI find relevant information quickly.\n\n## Website Embedding \nYou can use and replace the placeholders in the following code: [View on Codepen (external link)](https://codepen.io/olemai/pen/RNwPdVp)\n\nPut the customized Code inside your website's head element (before the `&lt;/head&gt;` tag).",
  "featuredImage": "/data/workflows/3364/3364.webp",
  "author": {
    "id": 101,
    "slug": "gegenfeld",
    "name": "Gegenfeld",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 214,
  "downloads": 21,
  "createdAt": "2025-03-30T04:18:33.813Z",
  "updatedAt": "2026-01-16T08:29:23.260Z",
  "publishedAt": "2025-03-30T04:18:33.813Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3364"
}