{
  "id": 9568,
  "slug": "9568",
  "title": "Auto scrape X image posts & publish to Telegram with Google Sheets storage",
  "description": "## Who’s it for\n\nThis automation template is designed for content creators, social media managers, and automation enthusiasts who want to automatically scrape X (Twitter) posts with images and publish them directly to a Telegram channel — without writing a single line of code.\n\nWith this workflow, you can keep your Telegram community constantly updated with the latest tweets from any account. It collects, cleans, and shares content in a fully automated cycle.\n\n ## How It Works\n\n- Trigger – Start scraping from a specific X (Twitter) account using its unique ID and username.\n- Fetch Data – The workflow calls the Twitter API (or a scraping endpoint) to gather recent tweets.\n- Format & Filter – Extracts key fields (author name, username, text, URL, creation date, images, video) and keeps only tweets containing text and at least one image.\n- Remove Duplicates – Ensures no tweet is processed or posted twice.\n- Save to Google Sheets – Stores cleaned tweet data for backup and future use.\n- Clean Text – Removes unwanted links and hashtags for a polished message.\n- Loop & Publish – Sends each tweet (text + image) to your Telegram channel.\n- Delay – Waits 3 minutes between each post to prevent spamming.\n\n## How to Use\n\n- Enter the Twitter ID and username of the target account.\n- Connect your Google Sheets account to store scraped tweets.\n- Connect your Telegram bot and specify the channel for publication.\n- Run the workflow — tweets will be automatically scraped, filtered, saved, and posted to Telegram.\n\n## Requirements\n\n- A valid Twitter API connection or alternative scraping endpoint.\n- A Google Sheet to store tweet data.\n- A Telegram Bot linked to your channel.\n- n8n (or any compatible automation platform) to run the workflow.\n\n## Need help\n\n**Contact me for consulting and support:** [LinkedIn](https://www.linkedin.com/in/jaures-nya-83a033270/) / [YouTube](https://www.youtube.com/@jauresnya)  \n",
  "featuredImage": "/data/workflows/9568/9568.webp",
  "author": {
    "id": 101,
    "slug": "jauresnya",
    "name": "Jaures NYA",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 220,
  "downloads": 22,
  "createdAt": "2025-10-13T11:08:16.861Z",
  "updatedAt": "2026-01-16T09:00:59.889Z",
  "publishedAt": "2025-10-13T11:08:16.861Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9568"
}