{
  "id": 5991,
  "slug": "5991",
  "title": "Restaurant daily insights with Gemini AI - sales, waste & feedback email summary",
  "description": "In this guide, we’ll walk you through setting up an AI-driven workflow that automatically fetches daily sales, food waste, and customer feedback data from Google Sheets, generates actionable insights using AI, merges them into a comprehensive report, and sends it as an email draft. Ready to automate your restaurant’s daily insights? Let’s dive in!\n\n## What’s the Goal?\n- Automatically retrieve daily sales data, food waste records, and customer feedback from Google Sheets.\n- Use AI to analyze data and generate insights, including top performers, waste reduction recommendations, and feedback summaries.\n- Merge the insights into a structured daily report.\n- Send the report as an AI-generated email draft for review or sending.\n- Enable scheduled automation for daily insights delivery.\n\nBy the end, you’ll have a self-running system that delivers daily restaurant insights effortlessly.\n\n## Why Does It Matter?\nManual data analysis and reporting are time-consuming and error-prone. Here’s why this workflow is a game-changer:\n\n- **Zero Human Error**: AI ensures accurate and consistent insights.\n- **Time-Saving Automation**: Instantly process data and draft reports, boosting efficiency.\n- **Scheduled Delivery**: Receive insights daily without manual effort.\n- **Actionable Insights**: Empower your team with data-driven decisions.\nThink of it as your tireless data analyst that keeps your restaurant informed.\n\n## How It Works\nHere’s the step-by-step magic behind the automation:\n\n### Step 1: Trigger the Workflow\n- Initiate the workflow daily using the Daily Report Scheduler node (e.g., every day at a set time).\n\n### Step 2: Fetch Daily Sales Data\n- Retrieve sales data from the Google Sheet using the Fetch Daily Sales Data node.\n\n### Step 3: Fetch Daily Food Waste Records\n- Retrieve food waste data from the Google Sheet using the Fetch Daily Food Waste Records node.\n\n### Step 4: Fetch Customer Feedback\n- Retrieve customer feedback from the Google Sheet using the Fetch Customer Feedback node.\n\n### Step 5: Normalize Sales Records\n- Process and standardize sales data for AI analysis.\n\n### Step 6: Normalize Waste Data\n- Process and standardize food waste data for AI analysis.\n\n### Step 7: Normalize Feedback Data\n- Process and standardize customer feedback data for AI analysis.\n\n### Step 8: AI Sales Insights Generator\n- Use AI (e.g., Google Chat Model) to analyze sales data, identify top performers, and provide recommendations.\n\n### Step 9: AI Waste Reduction Insights Generator\n- Use AI to analyze waste data and suggest reduction strategies.\n\n### Step 10: AI Feedback Summary\n- Use AI to summarize customer feedback and identify common themes.\n\n### Step 11: Format Sales Output\n- Structure the sales insights into a readable format.\n\n### Step 12: Format Waste Output\n- Structure the waste reduction insights into a readable format.\n\n### Step 13: Format Feedback AI Output\n- Structure the feedback summary into a readable format.\n\n### Step 14: Merge & Create Email\n- Combine all formatted insights into a single daily report email draft.\n\n### Step 15: Prepare Email Content\n- Finalize the email content for sending.\n\n### Step 16: Send Daily Report\n- Send the AI-generated daily summary email via Gmail.\n\n## How to Use the Workflow?\nImporting a workflow in n8n is a straightforward process that allows you to use pre-built workflows to save time. Below is a step-by-step guide to importing the Restaurant Daily Insights Automation workflow in n8n.\n\n### Steps to Import a Workflow in n8n\n\n1. **Obtain the Workflow JSON**\n   - **Source the Workflow**: Workflows are shared as JSON files or code snippets, e.g., from the n8n community, a colleague, or exported from another n8n instance.\n   - **Format**: Ensure you have the workflow in JSON format, either as a file (e.g., workflow.json) or copied text.\n\n2. **Access the n8n Workflow Editor**\n   - Log in to n8n (via n8n Cloud or self-hosted instance).\n   - Navigate to the Workflows tab in the n8n dashboard.\n   - Click Add Workflow to create a blank workflow.\n\n3. **Import the Workflow**\n   - **Option 1: Import via JSON Code (Clipboard)**:\n     - Click the three dots (⋯) in the top-right corner to open the menu.\n     - Select Import from Clipboard.\n     - Paste the JSON code into the text box.\n     - Click Import to load the workflow.\n   - **Option 2: Import via JSON File**:\n     - Click the three dots (⋯) in the top-right corner.\n     - Select Import from File.\n     - Choose the .json file from your computer.\n     - Click Open to import.\n\n### Setup Notes\n- **Google Sheet Columns**:\n  - **Sales Data Sheet**: `Date`, `Item Name`, `Quantity Sold`, `Revenue`, `Cost`, `Profit`.\n  - **Food Waste Records Sheet**: `Date`, `Item Name`, `Waste Quantity`, `Reason`, `Timestamp`.\n  - **Customer Feedback Sheet**: `Date`, `Customer Name`, `Feedback Text`, `Rating`, `Timestamp`.\n- **Google Sheets Credentials**: Configure OAuth2 settings in the fetch nodes with your Google Sheet ID and credentials.\n- **AI Models**: Set up the AI nodes (e.g., Google Chat Model) with appropriate API credentials.\n- **Gmail Integration**: Authorize the Send Daily Report node with Gmail API credentials to send emails.\n- **Scheduling**: Adjust the Daily Report Scheduler node to your preferred time (e.g., daily at 9 AM).",
  "featuredImage": "/data/workflows/5991/5991.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 725,
  "downloads": 72,
  "createdAt": "2025-07-14T10:06:18.813Z",
  "updatedAt": "2026-01-16T08:42:32.604Z",
  "publishedAt": "2025-07-14T10:06:18.813Z",
  "nodes": 33,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5991"
}