{
  "id": 8191,
  "slug": "8191",
  "title": "Automate blog creation from keywords with Dumpling AI, OpenAI, and Google Docs",
  "description": "### Who is this for?  \nThis workflow is perfect for content marketers, bloggers, SEO professionals, and virtual assistants who need to transform keyword research into complete blog posts without spending hours writing and formatting.  \n\n---  \n\n### What problem is this workflow solving?  \nWriting a blog post from scratch requires research, summarizing content, and structuring it into a polished article. This workflow automates that process by taking a single keyword, fetching related news articles, cleaning the data, and generating a professional blog draft automatically in Google Docs.  \n\n---  \n\n### What this workflow does  \nThe workflow begins when a keyword is submitted through a form. It expands the keyword into trending suggestions using Dumpling AI Autocomplete, then fetches recent news articles with Dumpling AI Google News. Articles are filtered to only include those published within the last 1–2 days, then scraped and cleaned for quality text. The aggregated content is sent to OpenAI, which generates a polished blog draft with a clear title. Finally, the draft is saved directly into Google Docs for easy editing and publishing.  \n\n---  \n\n### Nodes Overview  \n\n1. Form Trigger – `Form Submission (Keywords)`  \n   Starts the workflow when a keyword is submitted through a form.  \n\n2. HTTP Request – `Dumpling AI Autocomplete`  \n   Expands the keyword into multiple trending search suggestions.  \n\n3. Split Out – `Split Autocomplete Suggestions`  \n   Breaks the list of autocomplete suggestions into individual items for processing.  \n\n4. Loop – `Loop Suggestions`  \n   Iterates through each suggestion to process articles separately.  \n\n5. Wait – `Delay Between Requests`  \n   Adds a pause to avoid sending too many requests at once.  \n\n6. HTTP Request – `Dumpling AI Google News`  \n   Fetches recent news articles for each suggestion.  \n\n7. Split Out – `Split News Articles`  \n   Splits the returned news results into individual articles.  \n\n8. Code – `Filter Articles (1–2 Days Old)`  \n   Keeps only articles that are between 1 and 2 days old for fresh content.  \n\n9. Limit – `Limit Articles`  \n   Restricts the workflow to the top 2 articles for each suggestion.  \n\n10. HTTP Request – `Dumpling AI Scraper`  \n    Scrapes and cleans the full text content from the article URLs.  \n\n11. Code – `Clean & Prepare Article Content`  \n    Removes clutter like links, images, and unrelated sections to ensure clean input.  \n\n12. Aggregate – `Aggregate Articles`  \n    Combines the cleaned article content into one dataset.  \n\n13. OpenAI – `Generate Blog Draft`  \n    Uses OpenAI to create a polished blog post draft and title in Markdown format.  \n\n14. Google Docs – `Create Blog File`  \n    Creates a new Google Doc with the generated blog title.  \n\n15. Google Docs – `Insert Blog Content`  \n    Inserts the full blog draft into the created document.  \n\n---  \n\n### 📝 Notes  \n\n- Set up Dumpling AI and generate your API key from: [Dumpling AI](https://www.dumplingai.com/)  \n- OpenAI must be connected with an active API key for blog generation.  \n- Google Docs must be connected with write permissions to create and update blog posts.  \n- You can adjust the article filter (currently set to 1–2 days old) in the code node depending on your needs.  \n",
  "featuredImage": "/data/workflows/8191/8191.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 291,
  "downloads": 29,
  "createdAt": "2025-09-02T20:40:54.150Z",
  "updatedAt": "2026-01-16T08:54:33.915Z",
  "publishedAt": "2025-09-02T20:40:54.150Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8191"
}