{
  "id": 7551,
  "slug": "7551",
  "title": "Email management: Auto-delete marketing emails & generate AI replies with Gemini",
  "description": "### Description\nThis workflow intelligently scans your inbox, detects whether an email is marketing or genuine, and takes the right action automatically. \n\n Marketing Emails :  Deleted instantly and logged in Google Sheets for tracking.\n\nNon-Marketing Emails : Receive a customized, polite reply crafted using AI.\n\nTracking : Every action (delete/reply) is recorded for auditing and reference.\n\n### Accounts & Tools\n\n-  n8n instance (self-hosted or cloud).\n-  Google account with:\n\t- Gmail API access (for reading, deleting, and replying).\n\t- Google Sheets API access (for logging deleted/replied emails).\n- IMP/SMTP credentials (if using IMAP trigger instead of Gmail API).\n-  Google Gemini (PaLM) API key to classify emails and generate replies.\n\n### Setup instructions\n- Create a n8N account on cloud or install it locally. follow the quick start guide [this](https://docs.n8n.io/try-it-out/)\n- Define your trigger point for your workflow as how or when this needs to run. Currently IMAP has been used to detect if any email is received and if so, trigger the workflow\n- Now, we need to setup the google account which allows our workflow to read emails. Follow [this](https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.gmail/?utm_source=n8n_app&utm_medium=node_settings_modal-credential_link&utm_campaign=n8n-nodes-base.gmail) guideline to setup gmail account\n- Next step is to add an AI tool which is google gemini here. To set up and use, see [this](https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-langchain.googlegemini/?utm_source=n8n_app&utm_medium=node_settings_modal-credential_link&utm_campaign=%40n8n%2Fn8n-nodes-langchain.googleGemini) guideline\n- Since AI response is in text, we need a parser tool to read a specific value from text\n- Setup a categorization tool like [this](https://docs.n8n.io/integrations/builtin/core-nodes/n8n-nodes-base.switch/?utm_source=n8n_app&utm_medium=node_settings_modal-credential_link&utm_campaign=n8n-nodes-base.switch)\n- Next is to send or delete email and for this, an existing gmail setup is going to work\n- In the last, we need to set a connection for sheet to keep the logs. Adding any sheet to workflow can be seen as [google sheet integration](https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.googlesheets/?utm_source=n8n_app&utm_medium=node_settings_modal-credential_link&utm_campaign=n8n-nodes-base.googleSheets) \n\n### How it work\n- Once any emails is received, IMAP detects and starts the workflow.\n- Now, email is passed to AI model to see if this email is a marketing email or not. Also, is its not a marketing email, it generates a tailored response. Currently, sender, subject and body of email is being scanned and marked as marketing based on model's feedback.\n- Since AI response is in text format, using a **formattor** to parse it\n- Next step is to read its category as if it is a marketing email\n- Based on email type, there are 2 steps:\n\t- delete email if it is a marketing email\n\t- Read the response from previos node and send that as reply \n- Last step is track this activity as which emails is deleted or replied. In terms of structure of sheet, it has 2 tabs\n**deleted emails** & **replied emails**\n and both have 2 columns\n 1. Email ID\n 2. subject\n\n### Future\n- Use it to categories emails for wider range like job applications, bills, customer supprt and tailor replies for each categories seperately\n- Logging can done in wider sources like databases etc\n- In case if we are logging on sheet, a further enhancements like follow up emails etc can be done\n\n\n\n",
  "featuredImage": "/data/workflows/7551/7551.webp",
  "author": {
    "id": 101,
    "slug": "raghav",
    "name": "Raghvendra dixit",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 528,
  "downloads": 52,
  "createdAt": "2025-08-18T16:52:19.749Z",
  "updatedAt": "2026-01-16T08:51:06.149Z",
  "publishedAt": "2025-08-18T16:52:19.749Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7551"
}