{
  "id": 6927,
  "slug": "6927",
  "title": "Automate job search & applications with 5 job boards & AI resume generator",
  "description": "**Automate Your Job Search: Find Job Listings on LinkedIn, Indeed, Glassdoor, Upwork & Adzuna!**\n\nStop wasting time manually searching for jobs! This powerful job search automation workflow for n8n is your secret weapon to finding and preparing for your next career move, effortlessly.\n\nTired of visiting multiple job boards every day, running the same searches, and drowning in a sea of irrelevant listings? \n\nOur Job Search Automation workflow streamlines the entire process for you. It automatically scours top job boards, filters and deduplicates the results, and even helps you craft a tailored resume and cover letter.\n\n**This workflow will automatically pull job listings from:**\n\nLinkedIn: The world's largest professional network.\n\nIndeed: One of the most popular job search engines.\n\nGlassdoor: A leading platform for company reviews and job listings.\n\nUpwork: The go-to marketplace for freelance opportunities.\n\nAdzuna: A comprehensive job search engine with a massive database of listings.\n\n**Key Features:**\n\nMulti-Board Job Sourcing: Never miss an opportunity! This workflow simultaneously searches LinkedIn, Indeed, Glassdoor, Upwork, and Adzuna for your desired job title.\n\n**Intelligent Filtering & Deduplication:** Say goodbye to repetitive listings. The workflow cleans up the results, so you only see unique, relevant job postings.\n\n**AI-Powered Resume & Cover Letter Generation:** Once a promising job is found, the workflow uses AI to analyze the job description, score your resume's match, and then rewrites your resume and generates a tailored cover letter to highlight the right skills and experience.\n\n**Automated Email Delivery:** Receive the tailored resume and cover letter directly in your inbox, ready for you to review and send.\n\n**Google Sheets Integration:** Keep track of every job you're considering. The workflow automatically logs the job details, your tailored documents, and the application status in a Google Sheet.\n\n**Fully Customizable:** Easily adapt the workflow to your specific needs. Change the job titles, locations, and even add or remove job boards.\n\n**Why You Need This Workflow:**\n\n**Save Dozens of Hours:** Automate the most time-consuming parts of your job search.\n\n**Discover More Opportunities:** Cast a wider net by searching multiple platforms at once.\n\n**Apply Faster:** Get a head start with AI-generated, tailored application materials.\n\n**Stay Organized:** Effortlessly track your applications in a centralized location.\n\nTake control of your job search and land your dream job faster. Get the Job Search Automation workflow today!\n\n**============**\n\n**How to configure your new n8n workflow.**\n\nPrerequisites:\n\nAn active n8n instance.\n\nAccounts for the services you want to use (Apify, Google, etc.).\n\nConfiguration Steps:\n\nApify Account & Scrapers:\nThis workflow uses Apify to scrape job listings from Indeed, LinkedIn, Upwork, and Glassdoor.\n\nCreate an Apify Account: If you don't have one, sign up at https://apify.com. A free plan is available.\n\nGet Your Apify API Key: In your Apify account, go to Settings &gt; Integrations to find your API token.\n\nAdd Apify Credentials to n8n:\n\nIn your n8n workflow, navigate to the Apify: Run Indeed Scraper node.\n\nIn the \"Credentials\" section, click to add new credentials.\n\nGive your credentials a name (e.g., \"My Apify Account\") and paste your API token.\n\nApply Credentials to All Apify Nodes: You will need to select your newly created Apify credentials for the following nodes:\n\nApify: Run Indeed Scraper\n\nApify: Get Indeed Results\n\nApify: Run LinkedIn Scraper\n\nApify: Get LinkedIn Results\n\nApify: Run Upwork Scraper\n\nApify: Get Upwork Results\n\nApify: Run Glassdoor Scraper\n\nApify: Get Glassdoor Results\n\nAdzuna API (Optional but Recommended):\n\nThe workflow uses Adzuna for an additional source of job listings. You will need to sign up for a free developer account to get an App ID and App Key.\n\nSign Up: Go to https://developer.adzuna.com/ and register.\n\n**Get Your Credentials:** Once registered, you will find your app_id and app_key in your dashboard.\n\nUpdate the \"Get Jobs from Adzuna\" Node:\n\nClick on this node to open its parameters.\n\nIn the URL field, place app_id and your app_key.\n\nOpenRouter for AI Models:\n\nThis workflow uses OpenRouter to access various AI models for tasks like resume scoring and writing.\n\nCreate an OpenRouter Account: Sign up at https://openrouter.ai/.\n\nGet Your API Key: Find your key in your account settings.\n\nAdd OpenRouter Credentials to n8n:\n\nGo to the OpenRouter Chat Model node.\n\nAdd your OpenRouter API key as new credentials.\n\nGoogle Sheets and Gmail Integration:\n\nCreate a Google Sheet: Create a new Google Sheet to track your job applications. The workflow is pre-configured with the following columns, but you can customize them: job_title, job_description, job_url, company, email, status, tailored_resume, cover_letter.\n\nAdd Google Credentials to n8n: You will need to authenticate your Google account in n8n to allow access to Sheets and Gmail.\n\nIn the Upate sheets node, go to the \"Credentials\" section and follow the prompts to connect your Google account using OAuth2.\n\nDo the same for the 📧Gmail node. It's recommended to use the same credentials for both.\n\nConfigure the \"Upate sheets\" Node:\n\nSelect your Google Sheets credentials.\n\nIn the \"Document ID\" field, enter the ID of the Google Sheet you created. You can find this in the URL of your sheet (it's the long string of characters between /d/ and /edit).\n\nIn the \"Sheet Name\" field, select the correct sheet from the dropdown list.\n\nSetting up the Initial Request (Webhook):\nThis workflow is triggered by a webhook. This means you can start it by sending a POST request from another application or using a tool like Postman.\n\nFind the Webhook URL: In the Webhook node, you will see a \"Test URL\" and a \"Production URL\". Use the production URL for live use.\n\nRequired Data: The webhook expects a JSON body with the following fields:\n\njobSearchKeyword: The job title you want to search for (e.g., \"Software Engineer\").\n\nemail: Your email address where the results will be sent.\n\nYou will also need to upload your resume as a file in the request.\n\nRunning the Workflow:\n\nUpload Your Resume: The workflow is designed to be initiated with your resume. When you trigger the webhook, you need to include the resume file.\n\nActivate the Workflow: Once all credentials are in place, save and activate your workflow.\n\nTrigger the Workflow: Send a POST request to the production webhook URL with the required JSON data and your resume file. **You can use Postman to do this or replace the webhook with a form.**\n\nYou are now all set! The workflow will begin searching for jobs and preparing your application materials.\n\n**Need Help?**\n\nReach me: https://www.linkedin.com/in/gerald-akhidenor-1ab1a45/\n\nWork with me: https://dominixai.com/\n\nMy website: https://jobmonkey.dev\n\nMy email: denorgerald@gmail.com\n\n",
  "featuredImage": "/data/workflows/6927/6927.webp",
  "author": {
    "id": 101,
    "slug": "dominixai",
    "name": "Gerald Denor",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 593,
  "downloads": 59,
  "createdAt": "2025-08-03T08:33:37.394Z",
  "updatedAt": "2026-01-16T08:47:38.861Z",
  "publishedAt": "2025-08-03T08:33:37.394Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6927"
}