{
  "id": 2582,
  "slug": "2582",
  "title": "Automate sales meeting prep with AI &  APIFY sent to WhatsApp",
  "description": "This n8n template builds a meeting assistant that compiles timely reminders of upcoming meetings filled with email history and recent LinkedIn activity of other people on the invite. This is then discreetly sent via WhatsApp ensuring the user is always prepared, informed and ready to impress!\n\n## How it works\n* A scheduled trigger fires hourly to check for upcoming personal meetings.\n* When found, the invite is analysed by an AI agent to pull email and LinkedIn details of the other invitees.\n* 2 subworkflows are then triggered for each invitee to (1) search for last email correspondence with them and (2) scrape their LinkedIn profile + recent activity for social updates.\n* Using both available sources, another AI agent is used to summarise this information and generate a short meeting prep message for the user.\n* The notification is finally sent to the user's WhatsApp, allowing them ample time to review.\n\n## How to use\n* There are a lot of moving parts in this template so in it's current form, it's best to use this for personal rather than team calendars.\n* The LinkedIn scraping method used in this workflow requires you to paste in your LinkedIn cookies from your browser which essentially let's n8n impersonate you. You can retrieve this from dev console or ask someone technical for help!\n\n**Note**: It may be wise to switch to other LinkedIn scraping approaches which do not impersonate your own account for production.\n\n## Requirements\n* OpenAI for LLM\n* Gmail for Email\n* Google Calendar for upcoming events\n* WhatsApp Business account for notifications\n\n## Customising this workflow\n* Try adding information sources which are relevant to you and your invitees. Such as company search, other social media sites etc.\n* Create an on-demand version which doesn't rely on the scheduled trigger. Sometimes you want to know prepare for meetings hours or days in advance where this could help immensely.",
  "featuredImage": "/data/workflows/2582/2582.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 11045,
  "downloads": 1104,
  "createdAt": "2024-11-26T23:00:48.040Z",
  "updatedAt": "2026-01-16T08:25:34.097Z",
  "publishedAt": "2024-11-26T23:00:48.040Z",
  "nodes": 61,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2582"
}