{
  "id": 11772,
  "slug": "11772",
  "title": "Generate AI stock reports w/ fundamental, technical, & news analysis (Free APIs)",
  "description": "### This template deploys a multi-agent system that fully automates advanced stock analysis. It uses a central AI orchestrator to call specialized sub-workflows, synthesizing technical, fundamental, and news sentiment data into a single, actionable report delivered to your inbox. All API Keys can be acquired for free!\n\n**How it Works**\n\n*   **Orchestration:** An AI Agent acts as the central \"brain,\" managing the analysis pipeline. It's triggered either on a schedule for a list of stocks or manually for a single ticker.\n*   **Specialist Agents (Tools):** The orchestrator invokes three sub-workflows as tools to gather intelligence:\n    1.  **Technical Analysis:** Fetches TA data (RSI, MACD, Bollinger Bands) and uses a vision-AI to analyze the stock's chart, identifying trends and patterns.\n    2.  **Fundamental Analysis:** Retrieves financial statements (Income, Balance Sheet) to generate a summary of the company's financial health and valuation.\n    3.  **News Sentiment Analysis:** Aggregates and analyzes market news to determine overall sentiment and identify key discussion topics.\n*   **Synthesis & Delivery:** The main agent synthesizes all findings to formulate a final recommendation (Buy, Hold, Sell), generates a professional HTML report, and delivers it via email.\n\n**Setup (Est. 10-15 mins)**\n\nThis is an advanced, multi-workflow template. Please follow the steps precisely.\n\n1.  **Split Modules:** Separate the 5 color-coded modules on this canvas into 5 new, individual workflows.\n2.  **Acquire APIs:** Acquire the 7 APIs needed for this workflow. These need Credentials: Gemini,, OpenRouter, SMTP, Alpaca. These just need to be pasted in: AlphaVantage, TwelveData, Chart-Img.\n3.  **Configure & Link:** Insert your API keys and email, then re-link the `Execute Workflow` and `Tool` nodes to connect your new workflows.\n4.  **Activate:** Toggle all 5 workflows to \"Active.\"\n\n➡️ **For the complete, detailed guide, visit: https://docs.google.com/document/d/1Ri_GfuIlc0QVm1aDrWJjRCg_2vWRCrw_SjRV9cBoKmw/edit?usp=sharing**\n",
  "featuredImage": "/data/workflows/11772/11772.webp",
  "author": {
    "id": 101,
    "slug": "deveng7",
    "name": "Deven G",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 596,
  "downloads": 59,
  "createdAt": "2025-12-13T22:33:24.786Z",
  "updatedAt": "2026-01-16T09:10:03.933Z",
  "publishedAt": "2025-12-13T22:33:24.786Z",
  "nodes": 85,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11772"
}