{
  "id": 6979,
  "slug": "6979",
  "title": "AI-powered daily LinkedIn post creator with OpenAI feedback loop and Notion",
  "description": "\nThis n8n template automatically creates and publishes high-quality LinkedIn posts using your brand brief, AI-generated ideas, and structured feedback loops — all powered by OpenAI. Perfect for solo creators, marketers, and startup teams building a consistent presence on LinkedIn.\n\n Who's it for\nCreators and freelancers building a personal brand\nSocial media managers at startups or agencies\nMarketing teams that want to scale LinkedIn content\nAnyone tired of manually ideating, writing, and posting daily\n\n What it does\nTriggers daily at a chosen time (default: 9 PM)\nFetches new content ideas from your idea-generation workflow\nLoads your brand brief and previous post feedback\nUses OpenAI to craft a branded, engaging LinkedIn post\nPublishes directly to LinkedIn — no manual copy-paste needed\n\nHow the AI logic works\nThe AI agent follows a consistent, looped prompt strategy to ensure brand alignment:\n\n**++Prompt++**\nYou are a helpful content creator for Nabin Bhandari's personal brand. Use the below steps to create content:\n\n1. Always start by getting the brand brief using the Get_Brand_Brief tool.  \n2. Create a post on the requested topic that aligns with the brand brief.  \n3. Get feedback and a score on the post using the Get_Content_Feedback tool.  \n4. If the score is below 0.8, use the feedback to refine the post and repeat.  \n5. The final output should be the approved post.\n Bonus: You can fine-tune OpenAI on your own brand tone and style by uploading at least 50 examples of approved posts. This will help ensure even more accurate, on-brand outputs.\n\n Requirements\nOpenAI API Key\nLinkedIn API credentials set in the LinkedIn node\nA Notion page (or any storage) with your Brand Brief clearly described\nOptional: Fine-tuned OpenAI model for higher fidelity\n\n How to customize\nAdjust the AI prompt for different tones (e.g., witty, professional)\nSwap the idea source (Airtable, Notion, Webhook, etc.)\nAdd manual approval steps before publishing\nReplace the LinkedIn node with other social media APIs (Twitter/X, Threads)\n\n Tips\nStore a clear and specific brand brief in your Notion page — it directly shapes the AI's tone\nAdd a database of previously approved posts for fine-tuning OpenAI\nUse additional feedback metrics (likes, engagement) for future iterations\n![Screenshot 20250805 at 00.36.05.png](fileId:1938)",
  "featuredImage": "/data/workflows/6979/6979.webp",
  "author": {
    "id": 101,
    "slug": "knabinbhandari",
    "name": "Nabin Bhandari",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2250,
  "downloads": 225,
  "createdAt": "2025-08-04T18:53:14.278Z",
  "updatedAt": "2026-01-16T08:47:57.133Z",
  "publishedAt": "2025-08-04T18:53:14.278Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6979"
}