{
  "id": 8686,
  "slug": "8686",
  "title": "LinkedIn content factory with OpenAI research & Replicate branded images",
  "description": "**Template Description:**\n&gt; Never run out of high-quality LinkedIn content again. This workflow is a complete content factory that takes a simple topic from a Google Sheet, uses AI to research a trending angle, writes a full post, generates a unique and **on-brand** image, and publishes it directly to your LinkedIn profile.\n\nThis template is designed for brands and creators who want to maintain a consistent, high-quality social media presence with minimal effort. The core feature is its ability to generate visuals that adhere to a specific, customizable brand style guide.\n\n---\n\n**🚀 What does this workflow do?**\n\n*   Pulls content ideas from a **Google Sheet** acting as your content calendar.\n*   Uses an **AI Researcher (OpenAI + SerpAPI)** to find the most recent and engaging news or trends related to your topic.\n*   Employs an **AI Writer** to draft a complete, professional LinkedIn post with a catchy title, engaging text, and relevant hashtags.\n*   Generates a **unique, on-brand image** for every post using Replicate, based on a customizable style guide (colors, composition, mood) defined within the workflow.\n*   **Publishes the post with its image** directly to your LinkedIn profile.\n*   **Updates the status** in your Google Sheet to \"done\" to avoid duplicate posts.\n\n**🎯 Who is this for?**\n\n*   **Marketing Teams:** Automate your content calendar and ensure brand consistency across all visuals.\n*   **Social Media Managers:** Save hours of research, writing, and design work.\n*   **Solopreneurs & Founders:** Maintain an active, professional LinkedIn presence without a dedicated content team.\n*   **Content Creators:** Scale your content production and focus on strategy instead of execution.\n\n**✨ Benefits**\n\n*   **End-to-End Automation:** From a single keyword to a published post, the entire process is automated.\n*   **Brand Consistency:** The AI image generator follows a strict, customizable style guide, ensuring all your visuals feel like they belong to your brand.\n*   **Always Relevant Content:** The AI research step ensures your posts are based on current trends and news, increasing engagement.\n*   **Massive Time Savings:** Automates research, copywriting, and graphic design in one seamless flow.\n*   **Content Calendar Integration:** Easily manage your content pipeline using a simple Google Sheet.\n\n**⚙️ How it Works**\n\n1.  **Get Topic:** The workflow fetches the next \"Pending\" topic from your Google Sheet.\n2.  **AI Research:** An AI Agent uses SerpAPI to research the topic and identify a viral angle.\n3.  **AI Writing:** A second AI Agent takes the research and writes the full LinkedIn post.\n4.  **Generate Image Prompt:** A `Code` node constructs a detailed prompt, merging the post's content with your defined brand style guide.\n5.  **Generate Image:** The prompt is sent to Replicate. The workflow waits and checks periodically until the image is ready.\n6.  **Publish:** The generated text and image are published to your LinkedIn account.\n7.  **Update Status:** The workflow archives the image to Google Drive and updates the topic's status in your Google Sheet to \"done\".\n\n**📋 n8n Nodes Used**\n\n*   `Google Sheets`\n*   `Langchain Agent` (with OpenAI & SerpAPI)\n*   `Code`\n*   `HTTP Request`\n*   `Wait` / `If`\n*   `LinkedIn`\n*   `Google Drive`\n\n**🔑 Prerequisites**\n\n*   An active n8n instance.\n*   **Google Account** with Sheets & Drive access (OAuth2 Credentials).\n*   **OpenAI Account & API Key**.\n*   **SerpAPI Account & API Key** (for the research tool).\n*   **Replicate Account & API Token**.\n*   **LinkedIn Account** (OAuth2 Credentials).\n*   **A Google Sheet** with \"Topic\" and \"Status\" columns.\n\n**🛠️ Setup**\n\n1.  **Import the workflow** into your n8n instance.\n2.  **Configure All Credentials:** Go through the workflow and connect your credentials for Google, OpenAI, SerpAPI, Replicate, and LinkedIn in their respective nodes.\n3.  **Link Your Google Sheet:** In the `1. Get Pending Topic...` node, select your spreadsheet and sheet. Do the same for the final `8. ...Update Status` node.\n4.  **Customize Your Brand Style (Highly Recommended):** In the `4. Generate Branded Image Prompt` (`Code`) node, edit the `fixedImageStyleDetails` variable. Change the RAL color codes and descriptive words to match your brand's visual identity.\n5.  **Populate Your Content Calendar:** Add topics to your Google Sheet and set their status to \"Pending\".\n6.  **Activate the workflow!**\n",
  "featuredImage": "/data/workflows/8686/8686.webp",
  "author": {
    "id": 101,
    "slug": "onurpolat05",
    "name": "Onur",
    "avatar": ""
  },
  "categories": [
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 980,
  "downloads": 98,
  "createdAt": "2025-09-17T14:43:22.454Z",
  "updatedAt": "2026-01-16T08:57:12.684Z",
  "publishedAt": "2025-09-17T14:43:22.454Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8686"
}