{
  "id": 8500,
  "slug": "8500",
  "title": "Jarvis: productivity AI agent for tasks, calendar, email & expense using MCPs",
  "description": "## Who’s it for\nThis template is designed for anyone who wants to use **Telegram as a personal AI assistant hub**.  \nIf you often juggle tasks, emails, calendars, and expenses across multiple tools, this workflow consolidates everything into one seamless AI-powered agent.\n\n## What it does\nJarvis listens to your Telegram messages (text or audio) and processes them with OpenAI.  \nBased on your request, it can:\n- ✅ Manage tasks (create, complete, or delete)  \n- 📅 Handle calendar events (schedule, reschedule, or check availability)  \n- 📧 Send, draft, or fetch emails with Gmail  \n- 👥 Retrieve Google Contacts  \n- 💵 Log and track expenses  \n\nAll responses are returned directly to Telegram, giving you a unified command center.\n\n## How to set up\n1. Clone this template into your n8n workspace.  \n2. Connect your accounts (Telegram, Gmail, Google Calendar, Contacts, etc.).  \n3. Add your OpenAI API key in the **Credentials** section.  \n4. Test by sending a Telegram message like “Create a meeting tomorrow at 3pm” or “Add expense $50 for lunch.”  or \"Draft a reply with a project proposal to that email from Steve\"\n\n## Requirements\n- n8n instance (cloud or self-hosted)  \n- Telegram Bot API credentials  \n- Gmail, Google Calendar, and Google Contacts credentials (optional, if using those features)  \n- OpenAI API key  \n- ElevenLabs API Key (optional, if you need audio note support)\n\n## How to customize\n- Swap Gmail with another email provider by replacing the Gmail MCP node.  \n- Add additional MCP integrations (e.g., Notion, Slack, CRM tools).  \n- Adjust memory length to control how much context Jarvis remembers.  \n\nWith this template, you can transform Telegram into your **all-in-one AI assistant**, simplifying workflows and saving hours every week.\n",
  "featuredImage": "/data/workflows/8500/8500.webp",
  "author": {
    "id": 101,
    "slug": "jiteshdugar",
    "name": "Jitesh Dugar",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 27333,
  "downloads": 2733,
  "createdAt": "2025-09-12T06:41:03.347Z",
  "updatedAt": "2026-01-16T08:56:12.229Z",
  "publishedAt": "2025-09-12T06:41:03.347Z",
  "nodes": 52,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8500"
}