{
  "id": 6934,
  "slug": "6934",
  "title": "Daily meeting summaries with Google Calendar & Gemini for Slack-Discord-WhatsApp",
  "description": "This workflow automatically summarizes your team's daily meetings from multiple Google Calendars daily at 9AM and sends the digest to your preferred communication channels. It uses AI to identify and format meeting details, making it easy to see your schedule at a glance.\n\n---\n\n### **Good to Know**\n* **Multi-Calendar Support**: This workflow is designed to pull events from any number of Google Calendars you've connected, providing a single, consolidated summary.\n* **AI-Powered Summaries**: The AI Agent, powered by Google Gemini, is instructed to format the output with key details like title, time, duration, and a link to join the meeting. This saves you from sifting through calendar invites.\n\n### **How It Works**\n1.  A **Schedule Trigger** starts the workflow at a set time each day e.g at 9 AM (or any other time you choose).\n2.  An **AI Agent** with access to the Google Calendar tool is prompted to fetch today's events from all connected calendars.\n3.  The **Google Calendar** nodes retrieve all meetings for the current day.\n4.  The AI Agent processes this information and generates a clean, structured summary.\n5.  Finally, the formatted summary is sent to your team's chosen communication platforms: **Slack**, **Discord**, and **WhatsApp**.\n\n---\n\n### **How to Use**\n1.  **Set the Schedule**: Adjust the **Schedule Trigger** to run at a time that works best for your team—for example, every morning before the workday begins.\n2.  **Connect Your Accounts**: Add your **Google Calendar** credentials to connect all the calendars you want to monitor.\n3.  **Choose Your Channels**: Connect the appropriate **Slack**, **Discord**, and/or **WhatsApp** nodes and configure them to send the message to your desired channels or groups.\n\n---\n\n### **Requirements**\n* **Google Gemini account**: A Google Gemini account is needed for the AI Agent and Chat Model to function.\n* **Google Calendar account(s)**: You'll need to connect the Google Calendar accounts you wish to pull data from.\n* **Communication platform account(s)**: Credentials for the communication apps you want to use (Slack, Discord, WhatsApp).\n\n---\n\n### **Customizing This Workflow**\n* **Modify the Trigger**: You can change the **Schedule Trigger** to a different interval or even trigger the workflow manually with a webhook.\n* **Adjust the AI Prompt**: Fine-tune the AI Agent's prompt to change the summary format, include more details, or even ask it to highlight the most important meetings of the day.\n* **Add More Platforms**: Easily add more communication nodes to send the daily summary to other platforms like Microsoft Teams, email, or even a custom CRM.",
  "featuredImage": "/data/workflows/6934/6934.webp",
  "author": {
    "id": 101,
    "slug": "zain",
    "name": "Zain Khan",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 68,
  "downloads": 6,
  "createdAt": "2025-08-03T12:27:04.994Z",
  "updatedAt": "2026-01-16T08:47:41.276Z",
  "publishedAt": "2025-08-03T12:27:04.994Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6934"
}