{
  "id": 10384,
  "slug": "10384",
  "title": "Automate cancellation feedback collection with Stripe and Google Sheets",
  "description": "Who's it for\nThis template is perfect for any SaaS business or subscription service using Stripe. Product managers, customer success teams, and founders can use this to automatically collect cancellation feedback without manual follow-up. Ideal for companies looking to reduce churn by understanding why customers leave.\nWhat it does\nWhen a customer cancels their Stripe subscription, this workflow instantly:\n\nDetects the cancellation via Stripe webhook\nFetches customer details from Stripe API\nSends a personalized feedback survey email with embedded customer information\nLogs all cancellations to Google Sheets for tracking\nReceives survey responses via webhook\nAutomatically routes feedback to different Google Sheets based on reason (pricing concerns, feature requests, or other feedback)\n\nThis organized approach helps you identify patterns in cancellations and prioritize improvements that matter most.\nHow it works\n\nStripe triggers the workflow when a subscription is canceled\nCustomer data is fetched from the Stripe API (email, name, plan details)\nPersonalized email is sent with a survey link containing customer data as URL parameters\nCancellation is logged to a Google Sheets \"Cancellations\" tab\nWhen the customer submits the survey, a webhook receives the response\nFeedback is routed to dedicated sheets based on cancellation reason:\n\nPrice Concerns → for pricing-related issues\nFeature Requests → for missing functionality\nOther Feedback → for everything else\n\n\n\nSet up steps\nSetup time: ~20 minutes\nPrerequisites\n\nStripe account (test mode recommended for initial setup)\nGoogle account with Google Sheets\nEmail service (Gmail, Outlook, or SMTP)\nSurvey tool with webhook support (Tally or Typeform recommended)\n\nConfiguration\n\nStripe webhook: Copy the webhook URL from the \"Stripe Subscription Canceled\" node and add it to your Stripe Dashboard → Webhooks. Select the customer.subscription.deleted event.\nEmail credentials: Configure Gmail, Outlook, or SMTP credentials in the \"Send Feedback Survey Email\" node. Update the fromEmail parameter.\nSurvey form: Create a survey form with these fields:\n\nHidden fields (auto-populated from URL): email, customer_id, name, plan\nVisible fields: reason dropdown (\"Too Expensive\", \"Missing Features\", \"Other\"), comments textarea\nConfigure webhook to POST responses to the \"Survey Response Webhook\" URL\n\n\nGoogle Sheets: Create a spreadsheet with 4 sheets: \"Cancellations\", \"Price Concerns\", \"Feature Requests\", and \"Other Feedback\". Connect your Google account in the Google Sheets nodes.\nSurvey URL: Replace [SURVEY_URL] in the email template with your actual survey form URL.\nTest: Use Stripe test mode to trigger a test cancellation and verify the workflow executes correctly.\n\nRequirements\n\nStripe account with API access\nGoogle Sheets (free)\nEmail service: Gmail, Outlook, or SMTP server\nSurvey tool: Tally (free), Typeform (paid), or custom form with webhook capability\nn8n instance: Cloud or self-hosted\n\nHow to customize\n\nDifferent surveys by plan: Add an IF node after getting customer details to send different survey links based on subscription tier\nSlack notifications: Add a Slack node after \"Route by Feedback Type\" to alert your team about price concerns in real-time\nDelayed email: Insert a Wait node before sending the email to give customers a 24-hour cooldown period\nCRM integration: Add nodes to sync cancellation data with your CRM (HubSpot, Salesforce, etc.)\nFollow-up workflow: Create a separate workflow that triggers when feedback is received to send personalized follow-up offers\nCustom routing logic: Modify the Switch node conditions to match your specific survey options or add more categories\n\nTips for success\n\nUse Stripe test mode initially to avoid sending emails to real customers during setup\nCustomize the email tone to match your brand voice\nKeep the survey short (2-3 questions max) for higher response rates\nReview feedback weekly to identify patterns and prioritize improvements\nConsider offering a discount or incentive for completing the survey",
  "featuredImage": "/data/workflows/10384/10384.webp",
  "author": {
    "id": 101,
    "slug": "daiki-ai",
    "name": "Daiki Takayama",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 47,
  "downloads": 4,
  "createdAt": "2025-10-31T11:53:13.132Z",
  "updatedAt": "2026-01-16T09:04:49.198Z",
  "publishedAt": "2025-10-31T11:53:13.132Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10384"
}