{
  "id": 12653,
  "slug": "12653",
  "title": "Monitor multi-city weather with OpenWeatherMap, GPT-4o-mini, and Discord",
  "description": "\n## Weather Monitoring Across Multiple Cities with OpenWeatherMap, GPT-4o-mini, and Discord\n\nThis workflow provides an automated, intelligent solution for global weather monitoring. It goes beyond simple data fetching by calculating a custom \"Comfort Index\" and using AI to provide human-like briefings and activity recommendations. Whether you are managing remote teams or planning travel, this template centralizes complex environmental data into actionable insights.\n\n## Who’s it for\n- **Remote Team Leads:** Keep an eye on environmental conditions for team members across different time zones.\n- **Frequent Travelers & Event Planners:** Monitor weather risks and comfort levels for multiple destinations simultaneously.\n- **Smart Home/Life Enthusiasts:** Receive daily morning briefings on air quality and weather alerts directly in Discord.\n\n## How it works\n1. **Schedule Trigger:** The workflow runs every 6 hours (customizable) to ensure data is up to date.\n2. **Data Collection:** It loops through a list of cities, fetching current weather, 5-day forecasts, and Air Quality Index (AQI) data via the **OpenWeatherMap node** and **HTTP Request node**.\n3. **Smart Processing:** A **Code node** calculates a \"Comfort Index\" (based on temperature and humidity) and flags specific alerts (e.g., extreme heat, high winds, or poor AQI).\n4. **AI Analysis:** The **OpenAI node** (using GPT-4o-mini) analyzes the aggregated data to compare cities and recommend the best location for outdoor activities.\n5. **Conditional Routing:** An **If node** checks for active weather alerts. Urgent alerts are routed to a specific Discord notification, while routine briefings are sent normally.\n6. **Archiving:** All processed data is appended to **Google Sheets** for historical tracking and future analysis.\n\n## How to set up\n1. **Credentials:** Connect your OpenWeatherMap, OpenAI, Discord (Webhook), and Google Sheets accounts.\n2. **Locations:** Open the **'Set Monitoring Locations'** node and edit the JSON array with the cities, latitudes, and longitudes you wish to track.\n3. **Google Sheets:** Configure the **'Log to Google Sheets'** node with your specific Spreadsheet ID and Sheet Name.\n4. **Discord:** Ensure your Webhook URL is correctly pasted into the **Discord nodes**.\n\n## Requirements\n- **OpenWeatherMap API Key** (Free tier is sufficient).\n- **OpenAI API Key** (Configured for GPT-4o-mini).\n- **Discord Webhook URL**.\n- **Google Sheet** with headers ready for logging.\n\n## How to customize\n- **Adjust Alert Thresholds:** Modify the logic in the 'Process and Analyze Data' Code node to change what triggers a \"High Wind\" or \"Extreme Heat\" alert.\n- **Refine AI Persona:** Edit the System Prompt in the 'AI Weather Analysis' node to change the tone or focus of the weather briefing.\n- **Change Frequency:** Adjust the Schedule Trigger to run once a day or every hour depending on your needs.",
  "featuredImage": "/data/workflows/12653/12653.webp",
  "author": {
    "id": 101,
    "slug": "naoya-495",
    "name": "荒城直也",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2026-01-12T07:26:54.549Z",
  "updatedAt": "2026-01-16T09:12:51.486Z",
  "publishedAt": "2026-01-12T07:26:54.549Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12653"
}