{
  "id": 5507,
  "slug": "5507",
  "title": "Analyze images from forms using GPT-4o-mini Vision and deliver to Telegram",
  "description": "## This workflow analyzes images submitted via a form using OpenAI Vision, then delivers the analysis result directly to your Telegram chat.\n\n✅ **Use case examples**:\n\t•\tUsers submit screenshots for instant AI interpretation\n\t•\tAutomated document or receipt analysis with Telegram delivery\n\t•\tQuick OCR or image classification workflows\n\n⸻\n\n**⚙️ Setup Guide**\n\t1.\tForm Submission Trigger\n\t•\tConnect your form app (e.g. Typeform, Tally, or n8n’s own webhook form) to the On form submission trigger node.\n\t•\tEnsure it sends the image file or URL as input.\n\t2.\tOpenAI Vision Analysis\n\t•\tIn the OpenAI node, select Analyze Image operation.\n\t•\tProvide your OpenAI API key and configure the prompt to instruct the model on what to analyze (e.g. “Describe this receipt in detail”).\n\t3.\tSet Telegram Chat ID\n\t•\tUse this manual node to input your Telegram Chat ID for delivery.\n\t•\tAlternatively, automate this with a database lookup or user session if building for multiple users.\n\t4.\tTelegram Delivery Node\n\t•\tConnect your Telegram Bot to n8n using your bot token.\n\t•\tSet up the sendMessage operation, using the analysis result from the previous node as the message text.\n\t5.\tTesting\n\t•\tClick Execute workflow.\n\t•\tSubmit an image via your form and confirm it delivers to your Telegram as expected.",
  "featuredImage": "/data/workflows/5507/5507.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3738,
  "downloads": 373,
  "createdAt": "2025-07-01T07:27:52.589Z",
  "updatedAt": "2026-01-16T08:40:02.544Z",
  "publishedAt": "2025-07-01T07:27:52.589Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5507"
}