{
  "id": 8144,
  "slug": "8144",
  "title": "Scrape LinkedIn job listings with Phantombuster & save to Google Sheets",
  "description": "## How it works\nThis workflow automatically scrapes LinkedIn job postings for a list of target companies and organizes the results in Google Sheets. Every Monday morning, it checks your company list, runs a LinkedIn job scrape using Phantombuster, waits for the data to be ready, and then fetches the results. Finally, it formats the job postings into a clean structure and saves them into a results sheet for easy analysis.\n\n## Step-by-step\n\n**Start with Scheduled Trigger**\n- The workflow runs automatically at 9:00 AM every Monday.\n- It reads your “Companies Sheet” in Google Sheets and filters only those marked with Status = Pending.\n\n**Scrape LinkedIn Jobs**\n- The workflow launches your Phantombuster agent with the LinkedIn profile URLs from the sheet.\n- It waits 3 minutes to let the scraper finish running.\n- Then it fetches the output CSV link containing the job posting results.\n\n**Format the Data**\n- The scraped data is cleaned and structured into fields like:\n\n  - Company Name\n\n  - Job Title\n\n  - Job Description\n\n  - Job Link\n\n  - Date Posted\n\n  - Location\n\n   - Employment Type\n\n**Save Everything in Google Sheets**\n- The formatted job data is appended into your “Job Results” Google Sheet.\n\n- Each entry includes a scrape date so you can track when the data was collected.\n\n## Why use this?\n\n- Automates job market research and competitive hiring analysis.\n\n- Collects structured job posting data from multiple companies at scale.\n\n- Saves time by running on a schedule with no manual effort.\n\n- Keeps all results organized in Google Sheets for easy review and sharing.\n\n- Helps HR and recruitment teams stay ahead of competitors’ hiring activity.",
  "featuredImage": "/data/workflows/8144/8144.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 573,
  "downloads": 57,
  "createdAt": "2025-09-02T05:54:19.375Z",
  "updatedAt": "2026-01-16T08:54:21.889Z",
  "publishedAt": "2025-09-02T05:54:19.375Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8144"
}