{
  "id": 8800,
  "slug": "8800",
  "title": "Automate RSS news to multi-platform social media publishing via PostPulse",
  "description": "\n![n8n rss to PostPulse.png](fileId:2667)\nThis automation template allows you to automatically receive news from RSS feeds, process their content, and publish or schedule posts on various social media platforms using [PostPulse](https://post-pulse.com/).\n\n*⚠️**Disclaimer:** This workflow uses the community node **@postpulse/n8n-nodes-postpulse**. Make sure community nodes are enabled in your n8n instance before importing and using this template.*\n👉 **To install it:**\nGo to Settings → Community Nodes → Install and enter:\"@postpulse/n8n-nodes-postpulse\".\n💡 **For more details**, see n8n Integration Guide: [PostPulse Developers – n8n Integration](https://developers.post-pulse.com/n8n-integration).\n\n## Who Is This For?\n- **Marketers** who want to automatically fill their content plan with relevant news.\n\n- **Content creators and editors** who want to effectively distribute news across different platforms without unnecessary effort.\n\n- **Media agencies** that want to maintain a constant presence on social media by republishing content from reliable sources.\n\n## What Problem Does This Workflow Solve?\nInstead of manually searching, copying, and publishing news, you get:\n- **Automated news collection:** The workflow automatically reads the RSS feed and finds new content.\n\n- **Intelligent processing:** It automatically extracts the text and, when possible, images from news articles, adapting the content for different social media platforms.\n\n- **Seamless publishing:** PostPulse publishes posts simultaneously on TikTok, Instagram, YouTube, LinkedIn, Telegram, Bluesky, X, and Threads.\n\n- **Flexibility and customization:** RSS feeds from different websites have unique structures. This workflow is designed as a flexible template that can automatically publish news (even without images) and allows easy adaptation to any news source.\n\n- **Time saving:** Automates routine processes, freeing up your time for more important tasks.\n\n## How It Works\nThis workflow runs on a schedule, reads news, and processes it before sending it to PostPulse.\n- **Scheduled execution:** The workflow is triggered at a set time, for example, daily at 9:00 AM.\n\n- **RSS feed reading:** The RSS Feed Read node connects to the specified RSS feed (default: https://rss.unian.ua/site/gplay_56_ukr.rss) and retrieves the latest news.\n\n- **Filtering and media check:** The If and Media Check IF nodes verify whether the news was published yesterday and whether it contains an image, looking for it in several possible fields (enclosure, media:content, or even <img> tags in the HTML).\n\n- **Media upload:** If an image is found, the PostPulse Upload Media node uploads it to PostPulse. Then the Get Upload Status node checks if the media is ready for publishing.\n\n- **Post creation:** The content (with or without media) is sent to the Publish Post nodes, which create a draft post in PostPulse, adapting the text to each platform’s limits (e.g., 280 characters for X/Twitter).\n\n- **Publishing:** PostPulse automatically publishes or schedules the posts across all connected platforms.\n\n## Setup\n**1. Connect PostPulse to n8n**\n- Request your OAuth client key and secret from PostPulse support at **support@post-pulse.com**.\n\n- Add your PostPulse account in the **Credentials** section in n8n.\n\n**2. Find an RSS Feed that you need**\n\nThe easiest way is to check the page’s source code.\n1. Open the news website you are interested in.\n2. Go to the page with a specific news category (e.g., \"Sports\").\n3. Press **Ctrl + U** (or **Cmd + Option + U** on Mac) to open the page’s source code.\n4. Press **Ctrl + F** (or **Cmd + F** on Mac) to search the text.\n5. Type **\"rss\"** and press Enter. Usually, you will find a link pointing to an XML page, which is the RSS feed.\n\n**3. Configure the RSS Feed Read node**\n- Open the RSS Feed Read node.\n\n- Paste the URL of your RSS feed into the **URL field**.\n\n**4. Configure the Limit to N Post node**\n- This node limits the number of posts generated in a single run.\n\n- By default, const limit = 1;. You can change the value from 1 to any number of posts you want to publish at once.\n\n## Requirements\n\n- **Connected PostPulse accounts** (TikTok, Instagram, YouTube, LinkedIn, Telegram, Bluesky, X, Threads).\n\n- **OAuth client key and secret** obtained from PostPulse.\n\n- **An n8n instance** with community nodes enabled.\n\n✨ With this workflow, PostPulse and n8n become your all-in-one automation hub for publishing news.\n\n## How To Customize The Workflow\nThis workflow is designed to be fully flexible and adaptable to your specific needs. While it works out-of-the-box with the default RSS feed, you can easily optimize it for any news source:\n\n- **Adapt to different RSS feeds:** Each website’s RSS feed can have a unique structure. You can adjust the workflow to extract text, images, or additional fields as needed.\n\n- **Handle missing media:** Some feeds may not include images in standard fields. The workflow is built to publish posts even without images, but you can customize it to extract images from other tags or HTML elements.\n\n- **Extend content extraction:** If a feed stores the full text in a separate link, you can add nodes or logic to pull more content for richer posts.\n\n- **Text trimming and platform-specific formatting:** You can modify the trimming logic in the Publish Post nodes to fit platform limits or adjust content formatting as desired.\n\n- **Flexible scheduling and limits:** Easily change the number of posts per run, the schedule, or date filters to match your workflow and publishing strategy.\n\n**💡 Tip:** The workflow is meant to be a template — fully functional out-of-the-box, but easily customizable to match any RSS feed or content source. Its main strength is flexibility, allowing you to adapt it to different feeds, extract more content, and adjust publishing rules without touching the core workflow.\n\n",
  "featuredImage": "/data/workflows/8800/8800.webp",
  "author": {
    "id": 101,
    "slug": "dmytro-hnatiuk",
    "name": "Dmytro",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 555,
  "downloads": 55,
  "createdAt": "2025-09-21T12:03:58.955Z",
  "updatedAt": "2026-01-16T08:57:43.504Z",
  "publishedAt": "2025-09-21T12:03:58.955Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8800"
}