{
  "id": 3959,
  "slug": "3959",
  "title": "Redesign t-shirt mockups to print-ready files with GPT-4 vision & Imagen 4",
  "description": "🧠 What This Workflow Does\n\nThis n8n workflow allows you to upload a T-shirt mockup design (even if it's rough or outdated), and automatically turns it into a refined, print-ready artwork using the power of AI.\n\nIt starts with an image of a T-shirt design, analyzes it using OpenAI's vision model, and then generates a cleaner, upgraded prompt to be used with OpenAI’s image generation API (gpt-image-1). The final output is a new T-shirt graphic optimized for printing on solid black background, with no visible shirt or mockup framing.\n\n⚙️ How It Works\n\n1. User Sends a T-shirt Mockup Image Link\nThe workflow begins when the user drops an image link (T-shirt mockup) into a chat interface or input trigger.\n\n2. AI Analyzes the Image (OpenAI Vision)\nUsing OpenAI’s GPT-4 vision capabilities, the workflow extracts the key design elements from the image:\n\n- Characters, text, layout\n- Graphic style, composition\n- Visual tone and focus\n- AI Agent Creates a Refined Prompt\n- The extracted details are passed to an AI agent that:\n- Preserves the original layout and message\n- \n- Enhances the visual composition and typography\n- Removes mockup elements like shirt collar, sleeves, shadows.\n- Locks the artwork on a pure black background only\n- Outputs a clean, artistic, JSON-safe one-line prompt for generation\n\n3. Text Escaping for API Compatibility\nA JavaScript function node escapes the prompt (quotes, slashes, line breaks) to make it safe for use in downstream JSON requests.\n\n4. Image Generation via GPT-Image-1 API or IMAGEN 4 from GOOGLE\nThe final prompt is sent to OpenAI’s gpt-image-1 to generate a brand-new artwork — ideal for direct printing on a black T-shirt.\n\n⚠️ Cost Notice for gpt-image-1 Usage\n\nThis workflow uses OpenAI's gpt-image-1 model to generate high-quality T-shirt artwork from refined prompts. Please note that this model is a paid service, and each image generation request may cost approximately $0.25 per design, depending on resolution and usage.\n\nWe strongly recommend users to review their OpenAI API usage plan and be mindful of costs when running this workflow, especially if generating in bulk or integrating into larger automation flows.\n\nYou can monitor your usage at: https://platform.openai.com/docs/models/gpt-image-1\n\n5. (Optional) You can send the result to Telegram, upload to Notion, or store it in your design system.\n\n✅ Key Features\n- \n- Works from any uploaded mockup image\n- Converts design concepts into print-ready artwork prompts\n- Avoids outputting shirt models, collars, or product mockups\n- Optimized for solid black background with no distractions\n- Modular and easy to connect with file delivery or approval flows\n\n🚀 How to Use\n\n- Import the .json workflow into n8n\n- Configure your OpenAI credentials for both vision and image APIs\n- Trigger the flow by sending an image url of a T-shirt mockup\n- Let the workflow generate and return a brand-new design from that concept",
  "featuredImage": "/data/workflows/3959/3959.webp",
  "author": {
    "id": 101,
    "slug": "duythong",
    "name": "Thong",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 5947,
  "downloads": 594,
  "createdAt": "2025-05-09T11:07:57.285Z",
  "updatedAt": "2026-01-16T08:32:22.027Z",
  "publishedAt": "2025-05-09T11:07:57.285Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3959"
}