{
  "id": 4632,
  "slug": "4632",
  "title": "Scrape Google Places via Dumpling AI and auto-save to Google Sheets",
  "description": "### Who is this for?\nThis workflow is perfect for lead generation experts, digital marketers, SEO professionals, and virtual assistants who need to quickly collect local business information based on specific search terms without manually navigating Google Places.\n\n---\n\n### What problem is this workflow solving?\nManually searching Google Places for business leads is time-consuming and inconsistent. This workflow automates the entire process using Dumpling AI’s Google Places search endpoint, helping users collect accurate and structured business data and log it into a Google Sheet automatically.\n\n---\n\n### What this workflow does\nThis workflow runs daily at 1 PM. It starts by reading a list of business-related search terms from a Google Sheet (for example, “dentists in Dallas”). Each term is sent to Dumpling AI’s `search-places` endpoint, which returns local business listings from Google Places. The data is split, structured, and logged row-by-row in a connected Google Sheet.\n\n---\n\n### Nodes Overview\n\n1. **Run Every Day at 1 PM**  \n   A scheduled trigger that executes the workflow daily.\n\n2. **Google Sheets (Input)** – `Fetch Search Terms from Sheet`  \n   Pulls a list of search terms from a Google Sheet. Each term should describe a business category and location (e.g., “coffee shops in Atlanta”).\n\n3. **HTTP Request** – `Scrape Google Places via Dumpling AI`  \n   Sends each search term to Dumpling AI’s `/search-places` endpoint, returning data like business names, phone numbers, websites, ratings, and categories.\n\n4. **Split In Batches** – `Split Places Result`  \n   Breaks the list of businesses returned for each search term into individual items for processing.\n\n5. **Google Sheets (Output)** – `Save Each Business to Sheet`  \n   Saves the scraped data into a second Google Sheet. Each row contains:\n   - `title`\n   - `address`\n   - `rating`\n   - `category`\n   - `phoneNumber`\n   - `website`\n\n\n---\n\n### 📝 Notes\n\n- You must set up Dumpling AI and generate your API key from: [Dumpling AI](https://www.dumplingai.com/)\n- You can change the run schedule in the schedule node to fit your needs (e.g., weekly or hourly).\n",
  "featuredImage": "/data/workflows/4632/4632.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 828,
  "downloads": 82,
  "createdAt": "2025-06-03T22:42:31.611Z",
  "updatedAt": "2026-01-16T08:35:25.848Z",
  "publishedAt": "2025-06-03T22:42:31.611Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4632"
}