{
  "id": 2330,
  "slug": "2330",
  "title": "Enrich property inventory survey with image recognition and AI agent",
  "description": "This n8n workflow assists property managers and surveyors by reducing the time and effort it takes to complete property inventory surveys.\n\nIn such surveys, articles and goods within a property may need to be captured and reported as a matter of record. This can take a sizable amount of time if the property or number of items is big enough.\n\nOur solution is to delegate this task to a capable AI Agent who can identify and fill out the details of each item automatically.\n\n## How it works\n\n* An AirTable Base is used to capture just the image of an item within the property\n* Our workflow monitoring this AirTable Base sends the photo to an AI image recognition model to describe the item for purpose of identification.\n* Our AI agent uses this description and the help of Google's reverse image search in an attempt to find an online product page for the item.\n* If found, the product page is scraped for the item's specifications which are then used to fill out the rest of the details of the item in our Airtable.\n\n## Requirements\n\n* Airtable for capturing photos and product information\n* OpenAI account to for image recognition service and AI for agent\n* SerpAPI account for google reverse image search.\n* Firecrawl.dev account for webspacing.\n\n## Customising this workflow\n\nTry building an internal inventory database to query and integrate into the workflow. This could save on costs by avoiding fetching new each time for common items.",
  "featuredImage": "/data/workflows/2330/2330.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5564,
  "downloads": 556,
  "createdAt": "2024-07-10T12:23:15.128Z",
  "updatedAt": "2026-01-16T08:24:03.787Z",
  "publishedAt": "2024-07-10T12:23:15.128Z",
  "nodes": 29,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2330"
}