{
  "id": 2727,
  "slug": "2727",
  "title": "Display ServiceNow incident details in Slack using slash commands",
  "description": "#### **Who is this for?**\nThis workflow is designed for teams using Slack for communication and ServiceNow for incident management. It simplifies incident lookup by enabling team members to fetch incident details directly within Slack via a Slash Command.\n\n#### **What problem is this workflow solving?**\nManually switching between Slack and ServiceNow to retrieve incident details can be time-consuming and disrupt workflow efficiency. This workflow bridges the two platforms, providing instant access to critical incident information in Slack, saving time, and improving response efficiency.\n\n#### **What this workflow does?**\nThe workflow listens for a Slash Command in Slack that includes an incident ID, extracts the ID from the incoming payload, queries ServiceNow for the corresponding incident details, and sends a formatted response back to Slack. Depending on the query result, it can:\n- Display incident details (e.g., ID, description, severity, and priority).\n- Notify the user if no matching incident is found.\n- Alert the user if there’s an issue connecting to ServiceNow.\n\n#### **Setup**\n1. **Slack Setup:**\n   - Create a Slash Command in Slack with the appropriate endpoint URL.\n   - Configure the command to send a POST request to the webhook endpoint of this workflow.\n   - For details on how to setup the Slack app using Slash commands and n8n, [check out this video](https://youtu.be/z4JuK4qPJ1E). \n\n2. **ServiceNow Setup:**\n   - Create or use an existing account with the necessary permissions to access incident data.\n   - Configure the `ServiceNow` node with your ServiceNow credentials.\n\n3. **n8n Workflow Activation:**\n   - Deploy and activate the workflow in your n8n instance.\n   - Ensure all nodes are properly configured and connected.\n\n#### **How to customize this workflow to your needs**\n- **Modify Incident Query Parameters:** Adjust the query logic in the `Search For Incident in ServiceNow` node to include additional filters or data points based on your organization’s needs.\n- **Slack Response Customization:** Customize the Slack response template to display additional incident details or to match your team’s tone and style.\n- **Error Handling:** Enhance the error handling nodes to include more detailed logs or send alerts to a dedicated Slack channel.",
  "featuredImage": "/data/workflows/2727/2727.webp",
  "author": {
    "id": 101,
    "slug": "djangelic",
    "name": "Angel Menendez",
    "avatar": ""
  },
  "categories": [
    "Ticket Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1076,
  "downloads": 107,
  "createdAt": "2025-01-14T20:55:38.962Z",
  "updatedAt": "2026-01-16T08:26:09.865Z",
  "publishedAt": "2025-01-14T20:55:38.962Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2727"
}