{
  "id": 9636,
  "slug": "9636",
  "title": "Automated customer feedback triage with Gemini, Jotform, Google Sheets & Gmail replies",
  "description": "# Who’s it for\n\nTeams that collect product feedback with Jotform and want automated triage: instant alerts for urgent issues, knowledge-based replies to questions, and a clean backlog for suggestions. \n\n\n# How it works / What it does\n\nNew Jotform submissions are classified by Feedback Type (comments, questions, suggestions) and analyzed for sentiment. Angry or negative messages trigger a Telegram alert to your support channel. Questions are answered automatically using an agent that consults your internal Google Sheet “Q&A” database, then replies via Gmail with a styled HTML email. Suggestions are summarized, sent to a team chat, and appended to a Google Sheets backlog with name, email, summary, and date. All comments are logged to a structured sheet for reporting. \n\n# How to set up\n\n- Connect your Jotform form and map fields (Name, E-mail, feedback text).\n\n- Add credentials for Google Sheets, Gmail, Telegram, and LLM.\n\n- Point the agent to your “Q&A” sheet/tab.\n\n- Test each branch (comments, questions, suggestions) with sample entries. \n\n# Requirements\n\n- Jotform account and live form\n\n- n8n (self-hosted recommended if using community/LLM nodes)\n\n- Google Sheets, Gmail, Telegram bot, and LLM API keys \n\n\n# How to customize the workflow\n\n- Adjust sentiment thresholds or add new categories in the Switch node.\n\n- Edit the Gmail HTML template and subject line.\n\n- Change backlog columns or target sheets/tabs.\n\n- Add rate-limits, SLA timers, or different alert channels.\n\n- Best practice: rename all nodes, add a yellow Sticky Note with this description and per-step notes, and group user-config variables in a Set node. Remove any hard-coded IDs before sharing\n\n## Knowledge base table\n![Screenshot 20251014 202536.png](fileId:2944)\n\n## Suggestions database\n![Screenshot 20251014 202544.png](fileId:2943)\n\n## Sentiment database\n![Screenshot 20251014 202549.png](fileId:2942)",
  "featuredImage": "/data/workflows/9636/9636.webp",
  "author": {
    "id": 101,
    "slug": "rullysaputra15",
    "name": "Rully Saputra",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 196,
  "downloads": 19,
  "createdAt": "2025-10-14T13:44:35.269Z",
  "updatedAt": "2026-01-16T09:01:18.418Z",
  "publishedAt": "2025-10-14T13:44:35.269Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9636"
}