{
  "id": 11285,
  "slug": "11285",
  "title": "Seo blog content automation with GPT-4o-mini and human approval in Google Docs",
  "description": "## Overview\nThis n8n workflow automates the entire content creation process for SEO blog posts, from topic submission and AI drafting to human approval, revision, and final storage in Google Docs. It ensures high-quality, SEO-optimized content is generated efficiently while keeping a human in the loop for quality control.\n\n## Prerequisites\nTo use this workflow, you need the following accounts and credentials:\n\n#### Google Sheets Account: \nTo manage the content tracker. The sheet must contain columns for Topic, Reference URL, Title, Status, and Link to document.\n\n#### OpenAI API Key (for GPT-4o-mini): \nTo power the initial content drafting and subsequent revisions.\n\n#### Gmail Account: \nTo send the content for human approval and wait for feedback.\n\n#### Google Docs Account: \nTo create and store the final approved blog posts.\n\n\n## How It Works\nThe workflow operates in four main stages: Topic Submission, AI Content Creation, Human Approval & Revision Loop, and Final Publishing.\n\n#### Stage 1: Topic Submission and Tracking\nThis stage captures a new blog topic and adds it to the content tracker.\n\nOn form submission (Form Trigger): The workflow is initiated when a user submits a Topic and an optional Reference link through the form.\n\nAppend row in sheet (Google Sheets): The new topic and reference link are added as a new row in your content tracker sheet.\n\nGet Topic from Google Sheets: The workflow fetches the newly added row, including the system-generated row_number for tracking updates.\n\n#### Stage 2: AI Content Creation (Initial Draft)\nThe workflow uses an expert AI agent to generate the first draft of the blog post.\n\nCopywriter AI Agent: Acting as an expert SEO content strategist, the agent receives the topic and reference URL.\n\nThe agent improves the provided topic into an SEO-optimized title.\n\nIt writes a complete, conversational, SEO-friendly blog post (800–1200 words) using proper Markdown headings and lists.\n\nOpenAI Chat Model (GPT-4o-mini): Powers the agent's generation.\n\nStructured Output Parser: Ensures the output is in a JSON format with separate title and content keys.\n\nSet Data: The AI-generated title and content are mapped to workflow variables (Topic Title, Content) for easy use in subsequent nodes.\n\n#### Stage 3: Human Approval and Revision Loop\nThis is the critical quality control step where a human reviews the draft and decides on the next action.\n\nSend Content for Approval (Gmail): The generated title and content are sent via email to the approver (&lt;your email&gt;).\n\nThis uses a custom form that allows the user to choose Yes (Approve), No (Request Revision), or Cancel. The form also includes a Content Feedback textarea.\n\nApproval Result (Switch): The workflow pauses until the approver submits the form, and then directs the flow based on their choice.\n\nIf \"Yes\" (Approved): Proceeds to the final publishing stage. The Update Topic Status on Google Sheets node is executed, setting the Status to Approved and logging the new Title.\n\nIf \"No\" (Revision Requested): Proceeds to the revision loop.\n\nCopywriter Revision Agent: This agent takes the original content, the topic title, and the user's Content Feedback. It is instructed to incorporate the feedback, preserving the existing structure and tone, and outputs a revised blog post.\n\nThe flow loops back through the Set Data node and then returns to the Send Content for Approval node for a new review.\n\nIf \"Cancel\": Stops the workflow, and the Update Topic Status on Google Sheets node is executed.\n\n#### Stage 4: Final Publishing\nOnce approved, the content is stored in Google Docs and the tracker is updated.\n\nCreate Blog file (Google Docs): A new Google Doc is created using the approved Topic Title.\n\nAdd blog content in file (Google Docs): The final Content (in Markdown format) is inserted into the newly created document.\n\nUpdate sheet with blog post link (Google Sheets): The final tracker update logs the Link to document and the Published date.\n\n\n#### Customization Tip\nRecommend using AI humanazier and AI detector tools before approval to make the SEO score better.\n",
  "featuredImage": "/data/workflows/11285/11285.webp",
  "author": {
    "id": 101,
    "slug": "aiagentpriyanka",
    "name": "Priyanka Rana",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 510,
  "downloads": 51,
  "createdAt": "2025-11-27T10:22:01.010Z",
  "updatedAt": "2026-01-16T09:08:17.577Z",
  "publishedAt": "2025-11-27T10:22:01.010Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11285"
}