{
  "id": 11212,
  "slug": "11212",
  "title": "Monitor YouTube channels and send daily updates to Discord via RSS (no API key)",
  "description": "Automatically track your favorite YouTube creators and get a daily summary of new videos delivered to Discord.\n\nUnlike complex YouTube API integrations, this workflow uses efficient RSS feeds, meaning **you don't need a Google Cloud API Key** or worry about quota limits.\n\n## How it works\nThe workflow is scheduled to run daily (default 8:30 AM) to:\n1. **Define Channels:** It takes a list of \"Channel IDs\" you want to monitor.\n2. **Fetch RSS:** It retrieves the latest video feed for each channel.\n3. **Filter:** It applies a strict date filter to pass only videos published in the last 24 hours.\n4. **Notify:** Sends a notification to your Discord server with the Video Title, Date, and Link.\n\n## Setup steps\n### 1. Add your Channels\n1. Open the node named **\"Define Channel IDs\"**.\n2. Replace the example IDs with the Channel IDs you want to track.\n   * *Note: The template comes pre-loaded with some Spanish AI channels as a demo. Feel free to remove them!*\n   * *Tip: If you don't know a Creator's Channel ID (e.g. UC...), use a free online \"YouTube Channel ID Finder\".*\n\n### 2. Connect Discord\n1. Create a Webhook in your Discord Server (Server Settings &gt; Integrations &gt; Webhooks).\n2. Open the **\"Discord Notification\"** node.\n3. Create a new credential and paste your Webhook URL.\n\n*Note: This template is a lightweight alternative to database-backed trackers. It relies on the daily trigger frequency to avoid duplicates.*",
  "featuredImage": "/data/workflows/11212/11212.webp",
  "author": {
    "id": 101,
    "slug": "vasylpavlyuchok",
    "name": "Vasyl Pavlyuchok",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 207,
  "downloads": 20,
  "createdAt": "2025-11-25T09:02:00.287Z",
  "updatedAt": "2026-01-16T09:07:56.283Z",
  "publishedAt": "2025-11-25T09:02:00.287Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11212"
}