{
  "id": 2787,
  "slug": "2787",
  "title": "Backup n8n workflows to Bitbucket",
  "description": "An automated backup solution designed for self-hosted n8n users to automatically backup their workflows to Bitbucket, leveraging Bitbucket's free private repository offering.\n\nPerfect for maintaining version control of your n8n workflows without additional costs.\n\n## How it works:\n* Runs on a regular schedule to check all workflows in your n8n instance\n* Compares each workflow with its version in Bitbucket\n* Only uploads workflows that are new or have changed\n* Uses basic rate limiting to stay within Bitbucket's API limits\n* Formats filenames for easy tracking and includes timestamps in commit messages\n* Handles errors gracefully with automatic retries\n\n## Set up steps (10-15 minutes):\n1. Create a free Bitbucket account and private repository\n2. Create a Bitbucket App Password with repository write access\n3. Add Bitbucket credentials to n8n (using your username and app password)\n4. Set up n8n API access (generate API key in your n8n instance)\n5. Configure your Bitbucket workspace and repository names in the Set node\n6. Optional: Adjust the backup schedule (default: 2 AM daily)\n\n### Perfect for n8n self-hosters who want:\n* Version control for their workflows\n* Automated daily backups\n* Free private repository storage\n* Easy workflow recovery\n* Change tracking over time\n\nThe workflow includes basic error handling and rate limiting to ensure reliable backups even with larger numbers of workflows. Adjust your timing based on https://support.atlassian.com/bitbucket-cloud/docs/api-request-limits/.",
  "featuredImage": "/data/workflows/2787/2787.webp",
  "author": {
    "id": 101,
    "slug": "garethbdavies",
    "name": "Gareth B. Davies",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1495,
  "downloads": 149,
  "createdAt": "2025-01-24T00:25:33.966Z",
  "updatedAt": "2026-01-16T08:26:30.056Z",
  "publishedAt": "2025-01-24T00:25:33.966Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2787"
}