{
  "id": 10762,
  "slug": "10762",
  "title": "Multi-channel customer sentiment tracker with real-time analytics and alerting",
  "description": "## How It Works\nScheduled processes retrieve customer feedback from multiple channels. The system performs sentiment analysis to classify tone, then uses OpenAI models to extract themes, topics, and urgency indicators. All processed results are stored in a centralized database for trend tracking. Automated rules identify high-risk or negative sentiment items and trigger alerts to the relevant teams. Dashboards and workflow automation then visualize insights and support follow-up actions.\n\n## Setup Instructions\n1. **Data Sources:** Connect social media APIs, survey tools, and customer support platforms.\n2. **AI Analysis:** Configure the OpenAI API with sentiment and theme-extraction prompts.\n3. **Database:** Set up a feedback storage schema in your utility database.\n4. **Alerts:** Configure email notifications and CRM triggers for priority issues.\n5. **Dashboards:** Link your analytics and reporting tools for real-time insights.\n\n\n## Prerequisites\nSocial media/survey API credentials; OpenAI API key; database access; CRM system credentials; email notification setup\n\n## Use Cases\nCustomer sentiment tracking; product feedback aggregation; support ticket prioritization; brand monitoring; trend identification\n\n## Customization\nAdjust sentiment thresholds; add new feedback sources; modify categorization rules \n\n## Benefits\nReduces analysis time 85%; captures actionable insights; enables rapid response to issues \n\n",
  "featuredImage": "/data/workflows/10762/10762.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 93,
  "downloads": 9,
  "createdAt": "2025-11-12T15:10:36.307Z",
  "updatedAt": "2026-01-16T09:06:13.159Z",
  "publishedAt": "2025-11-12T15:10:36.307Z",
  "nodes": 40,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10762"
}