{
  "id": 7744,
  "slug": "7744",
  "title": "Generate business ideas & social media content from Reddit with AI analysis to Telegram",
  "description": "Description\n\nAI-Powered Business Idea Generation & Social Media Content Strategy Workflow\n\nThis intelligent content discovery and strategy system features 15 nodes that automatically monitor Reddit communities, analyze business opportunities, and generate targeted social media content for AI automation agencies and entrepreneurs. It leverages AI classification, structured analysis, and automated content creation to transform community discussions into actionable business insights and marketing materials.\n\nCore Components\n\nReddit Intelligence: Multi-subreddit monitoring across AI automation, n8n, and entrepreneur communities with keyword-based filtering.\n\nAI Classification Engine: Intelligent categorization of posts into \"Questions\" vs \"Requests\" using LangChain text classification.\n\nDual Analysis System: Specialized AI agents for educational content (questions) and sales-focused content (service requests).\n\nContent Strategy Generator: Automated creation of LinkedIn and Twitter content tailored to different audience engagement strategies.\n\nTelegram Integration: Real-time delivery of formatted content strategies and business insights.\n\nStructured Output Processing: JSON-formatted analysis with relevancy scores, feasibility assessments, and actionable content recommendations.\n\nTarget Users\n\n•\nAI Automation Agency Owners seeking consistent lead generation and thought leadership content\n\n•\nEntrepreneurs wanting to identify market opportunities and position themselves as industry experts\n\n•\nContent Creators in the automation/AI space needing data-driven content strategies\n\n•\nBusiness Development Professionals looking for systematic opportunity identification\n\n•\nDigital Marketing Agencies serving tech and automation clients\n\nSetup Requirements\n\nTo get started, you'll need:\n\nReddit API Access: OAuth2 credentials for accessing Reddit's API and monitoring multiple subreddits.\n\nRequired APIs:\n\n•\nOpenRouter (for AI model access - supports GPT-4, Claude, and other models)\n\n•\nReddit OAuth2 API (for community monitoring and data extraction)\n\nn8n Prerequisites:\n\n•\nVersion 1.7+ with LangChain nodes enabled\n\n•\nWebhook configuration for Telegram integration\n\n•\nProper credential storage and management setup\n\nTelegram Bot: Create via @BotFather for receiving formatted content strategies and business insights.\n\nDisclaimer: This template uses LangChain nodes and Reddit API integration. Ensure your n8n instance supports these features and verify API rate limits for production use.\n\nStep-by-Step Setup Guide\n\n1.\nInstall n8n: Ensure you're running n8n version 1.7 or higher with LangChain node support enabled.\n\n2.\nSet Up API Credentials:\n\n•\nCreate Reddit OAuth2 application at reddit.com/prefs/apps\n\n•\nSet up OpenRouter account and obtain API key\n\n•\nStore credentials securely in n8n credential manager\n\n\n\n3.\nCreate Telegram Bot:\n\n•\nGo to Telegram, search for @BotFather\n\n•\nCreate new bot and note the token\n\n•\nConfigure webhook pointing to your n8n instance\n\n\n\n4.\nImport the Workflow:\n\n•\nCopy the workflow JSON from the template submission\n\n•\nImport into your n8n dashboard\n\n•\nVerify all nodes are properly connected\n\n\n\n5.\nConfigure Monitoring Settings:\n\n•\nAdjust subreddit targets (currently: ArtificialIntelligence, n8n, entrepreneur)\n\n•\nSet keyword filters for relevant topics\n\n•\nConfigure post limits and sorting preferences\n\n\n\n6.\nCustomize AI Analysis:\n\n•\nUpdate system prompts to match your business expertise\n\n•\nAdjust relevancy and feasibility scoring criteria\n\n•\nModify content generation templates for your brand voice\n\n\n\n7.\nTest the Workflow:\n\n•\nRun manual execution to verify Reddit data collection\n\n•\nCheck AI classification and analysis outputs\n\n•\nConfirm Telegram delivery of formatted content\n\n\n\n8.\nSchedule Automation:\n\n•\nSet up daily trigger (currently configured for 12 PM)\n\n•\nMonitor execution logs for any API rate limit issues\n\n•\nAdjust frequency based on content volume needs\n\n\n\nUsage Instructions\n\nAutomated Discovery: The workflow runs daily at 12 PM, scanning three key subreddits for relevant posts about AI automation, business opportunities, and n8n workflows.\n\nIntelligent Classification: Posts are automatically categorized as either \"Questions\" (educational opportunities) or \"Requests\" (potential service leads) using AI text classification.\n\nDual Analysis Approach:\n\n•\nQuestions → Educational content strategy with relevancy and detail scoring\n\n•\nRequests → Sales-focused content with relevancy and feasibility scoring\n\nContent Strategy Generation: Each analyzed post generates:\n\n•\n3 LinkedIn posts (thought leadership, case studies, educational frameworks)\n\n•\n3 Twitter posts (quick insights, engagement questions, thread starters)\n\nTelegram Delivery: Receive formatted content strategies with:\n\n•\nPost summaries and business context\n\n•\nRelevancy/feasibility scores\n\n•\nReady-to-use social media content\n\n•\nStrategic recommendations\n\nContent Customization: Adapt generated content for different tones (business, educational, technical) and posting schedules.\n\nWorkflow Features\n\nMulti-Platform Monitoring: Simultaneous tracking of 3 key Reddit communities with customizable keyword filters.\n\nAI-Powered Classification: Automatic categorization of posts into actionable content types.\n\nDual Scoring System:\n\n•\nRelevancy scores (0.05-0.95) for business alignment\n\n•\nDetail/Feasibility scores (0.05-0.95) for content quality assessment\n\nContent Variety: Generates both educational and sales-focused social media strategies.\n\nStructured Output: JSON-formatted analysis for easy integration with other systems.\n\nReal-time Delivery: Instant Telegram notifications with formatted content strategies.\n\nScalable Monitoring: Easy addition of new subreddits and keyword filters.\n\nError Handling: Comprehensive validation with graceful failure management.\n\nPerformance Specifications\n\n•\nMonitoring Frequency: Daily automated execution with manual trigger capability\n\n•\nPost Analysis: 5 posts per subreddit (15 total daily)\n\n•\nContent Generation: 6 social media posts per analyzed opportunity\n\n•\nClassification Accuracy: AI-powered with structured output validation\n\n•\nDelivery Method: Real-time Telegram integration\n\n•\nScoring Range: 0.05-0.95 scale for relevancy and feasibility assessment\n\nWhy This Workflow?\n\nSystematic Opportunity Identification: Never miss potential business opportunities or content ideas from key communities.\n\nAI-Enhanced Analysis: Leverage advanced language models for intelligent content categorization and strategy generation.\n\nTime-Efficient Content Creation: Transform community discussions into ready-to-use social media content.\n\nData-Driven Insights: Quantified scoring helps prioritize opportunities and content strategies.\n\nAutomated Lead Intelligence: Identify potential service requests and educational content opportunities automatically.\n\nWorkflow Image\n\n![image.png](fileId:2177)\n\n\n\n\nNeed help customizing this workflow for your specific use case? As a fellow entrepreneur passionate about automation and business development, I'd be happy to consult. Connect with me on LinkedIn: https://www.linkedin.com/in/femi-adedayo-h44/ or email for support. Let's make your AI automation agency even more efficient!\n\n",
  "featuredImage": "/data/workflows/7744/7744.webp",
  "author": {
    "id": 101,
    "slug": "hgray",
    "name": "Femi Ad",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1221,
  "downloads": 122,
  "createdAt": "2025-08-22T13:22:25.781Z",
  "updatedAt": "2026-01-16T08:52:08.975Z",
  "publishedAt": "2025-08-22T13:22:25.781Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7744"
}