{
  "id": 8778,
  "slug": "8778",
  "title": "Workflow for submitting changed sitemap URLs using Google Indexing API and Bing IndexNow",
  "description": "### This n8n template saves you hours of manual SEO work by automatically parsing your sitemap and submitting updated URLs to Google and Bing (IndexNow).\n\n### Who’s it for\n\nSite owners, SEOs, and marketers who want a single automation to notify Google (Indexing API) and Bing (via IndexNow) whenever site URLs are added or updated. No more need to update it manually. Hours saved\n\n### What it does\n\nThis workflow parses your sitemap.xml, and for each URLs that have been changed on the last X days (this is a setting from Config node), submit them to Google and Bing via IndexNow. Before submitting to Google it checks the status. For IndexNow it just submits based on the last updated date it can find on the sitemap.\n\n\n### How it works\n\n* Parses your sitemap(s)to generate a list of urls ordered by lastmod date.\n* Create a batch of the urls updated in the last X days (settings DAYS_BACK from the \"Config\" node)\n* For Google, it first aks the current indexing notification status of this exact URL. If the sitemap shows the page was modified after the last submission, the workflow sends a new \"URL_UPDATED\" notification to Google. If Google has no record (404), it means the URL was never submitted and the workflow treats it as new and submits it. \n* For Bing through IndexNow, it only sends “recently changed URLs” based on the sitemap’s &lt;lastmod&gt; and the variable DAYS_BACK from the Config Node, by batches of 500 (current limit recommendation by Bing). IndexNow doesn't have an API to check the status of the url. \n\nRequirements\n\n* Google Indexing API credentials (Service Account with https://www.googleapis.com/auth/indexing scope, added as Owner in Search Console).\n* IndexNow API key: you can create it here https://www.bing.com/indexnow/getstarted.\n\nHow to use\n\n* Edit the \"Config\" node with your data & preferences (everything explain in the workflow).\n* Edit the \"Check status (Google)\" and \"URL updated (Google)\" node with your Google service account credentials.\n* Execute the workflow to test it \n* Set up a cron with the \"Schedule Trigger\" node depending on your needs",
  "featuredImage": "/data/workflows/8778/8778.webp",
  "author": {
    "id": 101,
    "slug": "jojoq42",
    "name": "Geoffroy",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 574,
  "downloads": 57,
  "createdAt": "2025-09-20T14:59:02.218Z",
  "updatedAt": "2026-01-16T08:57:38.271Z",
  "publishedAt": "2025-09-20T14:59:02.218Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8778"
}