{
  "id": 7189,
  "slug": "7189",
  "title": "AI-powered domain & IP security check automation",
  "description": "![AI5.png](fileId:2001)![AI4.png](fileId:2002)\n\n**Description**\n\nThis workflow is designed to automate the security reputation check of domains and IP addresses using multiple APIs such as VirusTotal, AbuseIPDB, and Google DNS. It assesses potential threats including malicious and suspicious scores, as well as email security configurations (SPF, DKIM, DMARC). The analysis results are processed by AI to produce a concise assessment, then automatically updated into Google Sheets for documentation and follow-up.\n\n**How It Works**\n1. Automatic Trigger – The workflow runs periodically via a Schedule Trigger.\n\n2. Data Retrieval – Fetches a list of domains from Google Sheets with status \"To do\".\n\n3. Domain Analysis – Uses VirusTotal API to get the domain report, perform a rescan, and check IP resolutions.\n\n4. IP Analysis – Checks IP reputation using AbuseIPDB.\n\n5. Email Security Validation – Verifies SPF, DKIM, and DMARC configurations via Google DNS.\n\n6. AI Assessment – Analysis data is processed by AI to produce a short summary in Indonesian.\n\n7. Data Update – The results are automatically updated to Google Sheets, changing the status to \"Done\" or adding notes if potential threats are found.\n\n**How to Setup**\n\n1. Prepare API Keys\n- Sign up and obtain API keys from VirusTotal and AbuseIPDB.\n- Set up access to Google Sheets API.\n\n2. Configure Credentials in n8n\n- Add VirusTotal API, AbuseIPDB API, and Google Sheets OAuth credentials in n8n.\n\n3. Prepare Google Sheets\n- Create a sheet with columns No, Domain, Customer, Keterangan, Status.\n- Ensure initial data has the status \"To do\".\n\n4. Import Workflow\n- Upload the workflow JSON file into n8n.\n\n5. Set Schedule Trigger\n- Define the checking interval as needed (e.g., every 1 hour).\n\n6. Test Run\n- Run the workflow manually to ensure all API connections and Google Sheets output work properly.",
  "featuredImage": "/data/workflows/7189/7189.webp",
  "author": {
    "id": 101,
    "slug": "garri",
    "name": "Garri",
    "avatar": ""
  },
  "categories": [
    "SecOps",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1079,
  "downloads": 107,
  "createdAt": "2025-08-08T17:43:36.147Z",
  "updatedAt": "2026-01-16T08:48:58.265Z",
  "publishedAt": "2025-08-08T17:43:36.147Z",
  "nodes": 50,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7189"
}