{
  "id": 4354,
  "slug": "4354",
  "title": "Legal Case Research Extractor, Data Miner with Bright Data MCP & Google Gemini",
  "description": "![Legal Case Research Extractor.png](fileId:1376)\n\n### Notice\nCommunity nodes can only be installed on self-hosted instances of n8n.\n\n### Who this is for\nThe Legal Case Research Extractor is a powerful automated workflow designed for legal tech teams, researchers, law firms, and data scientists focused on transforming unstructured legal case data into actionable, structured insights.\n\nThis workflow is tailored for:\n\n- Legal Researchers automating case law data mining\n\n- Litigation Support Teams handling large volumes of case records\n\n- LawTech Startups building AI-powered legal research assistants\n\n- Compliance Analysts extracting case-specific insights\n\n- AI Developers working on legal NLP, summarization, and search engines\n\n### What problem is this workflow solving?\nLegal case data is often locked in semi-structured or raw HTML formats, scattered across jurisdiction-specific websites. Manually extracting and processing this data is tedious and inefficient.\n\nThis workflow automates:\n\n- Extraction of legal case data via Bright Data's powerful MCP infrastructure\n\n- Parsing of HTML into clean, readable text using Google Gemini LLM\n\n- Structuring and delivering the output through webhook and file storage\n\n\n### What this workflow does\n\n**Input**\n\n- Set the Legal Case Research URL node is responsible for setting the legal case URL for the data extraction.\n\n**Bright Data MCP Data Extractor**\n\n- Bright Data MCP Client For Legal Case Research node is responsible for the legal case extraction via the Bright Data MCP tool - scrape_as_html\n\n**Case Extractor**\n\n- Google Gemini based Case Extractor is responsible for producing a paginated list of cases\n\n**Loop through Legal Case URLs**\n\n- Receives a collection of legal case links to process\n\n- Each URL represents a different case from a target legal website\n\n**Bright Data MCP Scraping**\n\n- Utilizes Bright Data’s scrape_as_html MCP mode\n\n- Retrieves raw HTML content of each legal case\n\n**Google Gemini LLM Extraction**\n\n- Transforms raw HTML into clean, structured text\n\n- Performs additional information extraction if required (e.g., case summary, court, jurisdiction etc.)\n\n**Webhook Notification**\n\n- Sends extracted legal case content to a configurable webhook URL\n\n- Enables downstream processing or storage in legal databases\n\n**Binary Conversion & File Persistence**\n\n- Converts the structured text to binary format\n\n- Saves the final response to disk for archival or further processing\n\n### Pre-conditions\n\n1. Knowledge of Model Context Protocol (MCP) is highly essential. Please read this blog post - [model-context-protocol](https://www.anthropic.com/news/model-context-protocol)\n2. You need to have the [Bright Data](https://brightdata.com/) account and do the necessary setup as mentioned in the **Setup** section below.\n3. You need to have the Google Gemini API Key. Visit [Google AI Studio](https://aistudio.google.com/)\n3. You need to install the Bright Data MCP Server [@brightdata/mcp](https://www.npmjs.com/package/@brightdata/mcp)\n4. You need to install the [n8n-nodes-mcp](https://github.com/nerding-io/n8n-nodes-mcp)\n\n### Setup\n1. Please make sure to setup n8n locally with MCP Servers by navigating to [n8n-nodes-mcp](https://www.youtube.com/watch?v=NUb73ErUCsA)\n2. Please make sure to install the Bright Data MCP Server [@brightdata/mcp](https://www.npmjs.com/package/@brightdata/mcp)  on your local machine.\n3. Sign up at [Bright Data](https://brightdata.com/).\n4. Create a Web Unlocker proxy zone called mcp_unlocker on Bright Data control panel.\n5. Navigate to Proxies & Scraping and create a new Web Unlocker zone by selecting Web Unlocker API under Scraping Solutions.\n6. In n8n, configure the Google Gemini(PaLM) Api account with the Google Gemini API key (or access through Vertex AI or proxy).\n7. In n8n, configure the credentials to connect with MCP Client (STDIO) account with the Bright Data MCP Server as shown below.\n\n![MCPClientAccount.png](fileId:1375)\n\nMake sure to copy the Bright Data API_TOKEN within the Environments textbox above as API_TOKEN=&lt;your-token&gt;\n\n### How to customize this workflow to your needs\n\n**Target New Legal Portals**\n- Modify the legal case input URLs to scrape from different state or federal case databases\n\n\n**Customize LLM Extraction**\n- Modify the prompt to extract specific fields: case number, plaintiff, case summary, outcome, legal precedents etc.\n\n- Add a summarization step if needed\n\n**Enhance Loop Handling**\n- Integrate with a Google Sheet or API to dynamically fetch case URLs\n\n- Add error handling logic to skip failed cases and log them\n\n**Improve Security & Compliance**\n- Redact sensitive information before sending via webhook\n\n- Store processed case data in encrypted cloud storage\n\n**Output Formats**\n- Save as PDF, JSON, or Markdown\n\n- Enable output to cloud storage (S3, Google Drive) or legal document management systems",
  "featuredImage": "/data/workflows/4354/4354.webp",
  "author": {
    "id": 101,
    "slug": "ranjancse",
    "name": "Ranjan Dailata",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1700,
  "downloads": 170,
  "createdAt": "2025-05-24T04:29:07.388Z",
  "updatedAt": "2026-01-16T08:33:57.064Z",
  "publishedAt": "2025-05-24T04:29:07.388Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4354"
}