{
  "id": 7128,
  "slug": "7128",
  "title": "Classify & enrich contacts with GPT-4o-mini for Google Sheets, Airtable, and HubSpot",
  "description": "### How it works\nThis workflow enhances contact intelligence by retrieving new or updated contact data, enriching it using AI and external APIs, and then updating your CRM or contact management system with intelligent insights. It automates the process of gathering, enriching, and organizing contact information to improve targeting, personalization, and engagement.\n\n### Step-by-step\n**1. Trigger & Input**\n- The workflow is triggered by a scheduler or webhook event.\n\n- It reads a new contact entry (or an updated one) from your source, such as a spreadsheet or form.\n- Basic fields like name, email, and company are used as the starting point for enrichment.\n\n**2. Contact Lookup & Parsing**\n- The contact's domain or company is extracted and used to perform a lookup via an external data source.\n\n- Data such as company details, job title, or LinkedIn profile is retrieved.\n\n- Parsed and cleaned to remove duplicates, missing values, or invalid results.\n\n**3. AI Enrichment**\n- The enriched contact is passed through an AI model (such as GPT or another NLP service).\n\n- The model analyzes job role, seniority, and inferred interests based on available data.\n\n- Insights like intent, persona category, or engagement score are generated.\n\n**4. Validation & Tagging**\n- The AI-enriched data is validated to ensure consistency and accuracy.\n\n- Tags and segments (e.g., \"Decision Maker\", \"Technical Buyer\", etc.) are assigned based on rules or AI inference.\n\n- This enables smart filtering, targeting, and routing later in your CRM or campaigns.\n\n**5. Output & Integration**\n- The final enriched and validated contact is written back to your CRM, sheet, or marketing platform.\n\n**The system also:**\n\n- Sends a Slack/Email alert with a summary.\n\n- Updates the original contact entry with a \"Processed\" or \"Enriched\" status.\n\n- Triggers next steps, such as personalized outreach or nurture sequences.\n\n### Benefits\n- Enhances Contact Profiles with AI-generated insights and third-party data.\n\n- Improves Segmentation & Targeting through smart tags and persona classification.\n\n- Automates Manual Research, saving time and improving accuracy.\n\n- Easily Extendable by adding more AI models, data sources, or CRM integrations.\n\n",
  "featuredImage": "/data/workflows/7128/7128.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 313,
  "downloads": 31,
  "createdAt": "2025-08-07T10:31:47.583Z",
  "updatedAt": "2026-01-16T08:48:37.446Z",
  "publishedAt": "2025-08-07T10:31:47.583Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7128"
}