{
  "id": 8487,
  "slug": "8487",
  "title": "Find perfect jobs & generate tailored cover letters with Gemini & Google Jobs",
  "description": "Say goodbye to endless applications and hello to more time for perfecting your interview skills!\n\nThe JOB Hunter Agent uses the power of Google Gemini and SerpAPI to find the perfect job match and generate a personalized cover letter. \n\nResult example:\n![Screenshot 20250911 at 23.54.20.png](fileId:2612)\n\n## 💡 Why Use JOB Hunter Agent?\n**Save Precious Time:** Stop sifting through countless job boards; this agent does the heavy lifting, saving you hours every week.\n\n**Land Your Dream Job Faster:** Get laser-focused job matches and a custom-crafted cover letter that speaks directly to the hiring manager, increasing your chances of getting noticed.\n\n**Never Miss an Opportunity:** Your personal AI assistant works 24/7, ensuring you're always on top of the latest openings, even while you sleep!\n\n**Stand Out from the Crowd:** A perfectly tailored cover letter generated on the fly gives you an edge over generic applications, making you look like a superstar.\n\n## ⚡ Perfect For\n**Job Seekers:** Anyone actively looking for a new role who wants to streamline their application process.\n**Busy Professionals:** Those with limited time who need an efficient way to find relevant opportunities.\n**Career Changers:** Individuals exploring new industries who need a helping hand in crafting compelling applications.\n\n## 🔧 How It Works\n**⏱ Trigger:** You submit your CV and job preferences through a simple n8n form.\n**📎 Process:** Your CV is extracted from the PDF, and your preferences (location, job type, salary, email) are neatly organized.\n**🤖 Smart Logic:** The \"Job Hunter Agent\" uses Google Gemini and SerpAPI to find the single best job match for you and then drafts a bespoke cover letter based on your CV and the job description. It's like magic, but with more code!\n**💌 Output:** A beautifully formatted HTML email containing your profile summary, the best job match, your personalized cover letter, and handy application tips is sent straight to your inbox.\n**🗂 Storage:** All the initial data from your form submission is processed and used to craft your perfect job application package.\n\n## 🔐 Quick Setup\n1. Import JSON file to your [n8n instances](https://n8n.partnerlinks.io/khmuhtadin)\n2. **Add credentials:** Google Gemini (Gemini 2.5 Pro model) and SerpAPI\n3. **Customize:** Adjust the system prompt in the \"Job Hunter Agent\" to fine-tune the cover letter tone or length, update the email footer, and expand job filters.\n4. **Update:** Ensure your Gmail OAuth2 credentials are valid for sending emails.\n5. **Test:** Run the workflow with your own CV and preferences to see the magic happen!\n\n## 🧩 You'll Need\n- Active [n8n instances](https://n8n.partnerlinks.io/khmuhtadin)\n- Google Gemini API key (for Gemini 2.5 Pro)\n- SerpAPI account for Google Jobs search results\n- A Gmail account for sending personalized job match emails\n\n## 🛠️ Level Up Ideas\n- Integrate with LinkedIn, Jobstreet, or Indeed APIs for a wider range of job sources.\n- Allow the agent to find multiple job matches and present them as a curated list.\n- Add an option to attach a parsed CV summary as a PDF to the email for quick reference.\n\n---\n**Made by:** [khaisa Studio](https://khaisa.studio)  \n**Tags:** AI, Gemini, Google Jobs, Job Search, Automation, Cover Letter  \n**Category:** `job hunter`  \n**Need custom work?** [Contact me](https://khmuhtadin.com/contact)",
  "featuredImage": "/data/workflows/8487/8487.webp",
  "author": {
    "id": 101,
    "slug": "khmuhtadin",
    "name": "Khairul Muhtadin",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1559,
  "downloads": 155,
  "createdAt": "2025-09-11T17:14:46.028Z",
  "updatedAt": "2026-01-16T08:56:06.434Z",
  "publishedAt": "2025-09-11T17:14:46.028Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8487"
}