{
  "id": 11114,
  "slug": "11114",
  "title": "Automatic email classification with Gmail and Claude AI",
  "description": "**How It Works**\n1.Gmail Trigger\n\n- Continuously monitors your Gmail inbox for new messages.\n- Captures the email’s subject, body, and metadata.\n- Sends the extracted content to the Email Content Classifier.\n\n2.Email Content Classification\n\nThe Email Content Classifier analyzes the email content using natural language processing.\n\nCompares the message against predefined Gmail labels:\n- Ads\n- Work\n- Personal\n- Financial\n- Other (fallback label)\n\nUsers can add or rename categories to match their specific needs.\n\nUses context, tone, and keywords to determine the most accurate label.\n\n3.Applying Gmail Labels\n\n- Sends the classification result to the corresponding Gmail label node.\n- Automatically applies the matching Gmail label in your inbox.\n- If the classifier cannot confidently match the message, the Other label is used as a fallback.\n\n**Setup Steps**\n\n- Connect Gmail Accounts\n- Connect your Gmail account in the Gmail Trigger and in each Gmail label node.\n- Configure the Email Content Classifier\n- Map the incoming Gmail message body to inputText.\n- Ensure the classifier node has access to a language model credential (Anthropic or other).\n- Test the Workflow\n- Send a few sample emails to yourself to confirm that labels are correctly applied.\n- Tweak Categories if Needed\n- Adjust category names in the classifier node to match your Gmail labels exactly.\n\n**Customization**\n\n- Add or rename categories in the classifier to reflect your specific email types.\n- Create corresponding Gmail label nodes for each new category.\n- Expand or modify categories as your workflow evolves to improve organization and efficiency.\n\n**Use Cases**\n\n- Automatic inbox organization and sorting.\n- Separation of work, personal, financial, and promotional emails.\n- Improved productivity by making important emails easier to locate.\n- Custom categorization for specialized workflows.\n\n**Troubleshooting Tips**\n\n- Emails not being labeled → check API permissions and message ID references.\n- Wrong label assigned → update classifier examples or refine category descriptions.\n- Classifier not returning a category → confirm fallback category “Other” is configured.\n- Workflow not triggering → reconnect Gmail Trigger authentication and ensure the workflow is active.",
  "featuredImage": "/data/workflows/11114/11114.webp",
  "author": {
    "id": 101,
    "slug": "ayissf",
    "name": "Ayis Saliaris Fasseas",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 251,
  "downloads": 25,
  "createdAt": "2025-11-21T15:40:26.777Z",
  "updatedAt": "2026-01-16T09:07:32.987Z",
  "publishedAt": "2025-11-21T15:40:26.777Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11114"
}