{
  "id": 5407,
  "slug": "5407",
  "title": "🎓 Learn Code Node (JavaScript) with an Interactive Hands-On Tutorial",
  "description": "## How it works\n\nThis workflow is a hands-on tutorial for the **Code node** in n8n, covering both basic and advanced concepts through a simple data processing task.\n\n1.  **Provides Sample Data:** The workflow begins with a sample list of users.\n2.  **Processes Each Item (`Run Once for Each Item`):** The first Code node iterates through each user to calculate their `fullName` and `age`. This demonstrates basic item-by-item data manipulation using `$input.item.json`.\n3.  **Fetches External Data (Advanced):** The second Code node showcases a more advanced feature. For each user, it uses the built-in `this.helpers.httpRequest` function to call an external API (genderize.io) to enrich the data with a predicted gender.\n4.  **Processes All Items at Once (`Run Once for All Items`):** The third Code node receives the fully enriched list of users and runs only once. It uses `$items()` to access the entire list and calculate the `averageAge`, returning a single summary item.\n5. **Create a Binary File:** The final Code node gets the fully enriched list of users once again and creates a binary CSV file to show how to use binary data `Buffer` in JavaScript.\n\n## Set up steps\n\n**Setup time: &lt; 1 minute**\n\nThis workflow is a self-contained tutorial and requires no setup.\n\n1.  **Explore the Nodes:** Click on each of the Code nodes to read the code and the comments explaining each step, from basic to advanced.\n2.  **Run the Workflow:** Click \"Execute Workflow\" to see it in action.\n3.  **Check the Output:** Click on each node after the execution to see how the data is transformed at each stage. Notice how the data is progressively enriched.\n4.  **Experiment!** Try changing the data in the `1. Sample Data` node, or modify the code in the Code nodes to see what happens.",
  "featuredImage": "/data/workflows/5407/5407.webp",
  "author": {
    "id": 101,
    "slug": "lucaspeyrin",
    "name": "Lucas Peyrin",
    "avatar": ""
  },
  "categories": [
    "Miscellaneous"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 40003,
  "downloads": 4000,
  "createdAt": "2025-06-27T11:22:16.781Z",
  "updatedAt": "2026-01-16T08:39:29.141Z",
  "publishedAt": "2025-06-27T11:22:16.781Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5407"
}