{
  "id": 11128,
  "slug": "11128",
  "title": "Monitor Furusato Nozei market trends with Google News, AI analysis and Slack reporting",
  "description": "# Analyze Furusato Nozei trends from Google News to Slack\n\nThis workflow acts as a specialized market analyst for Japan's \"Furusato Nozei\" (Hometown Tax) system. It automates the process of monitoring related news, validating keyword popularity via search trends, and delivering a concise, strategic report to Slack.\n\nBy combining RSS feeds, AI agents, and real-time search data, this template helps marketers and municipal researchers stay on top of the highly competitive Hometown Tax market without manual searching.\n\n## 👥 Who is this for?\n- **Municipal Government Planners:** To track trending return gifts and competitor strategies.\n- **E-commerce Marketers:** To identify high-demand keywords for Furusato Nozei portals.\n- **Content Creators:** To find trending topics for blogs or social media regarding tax deductions.\n- **Market Researchers:** To monitor the seasonality and shifting interests in the Hometown Tax sector.\n\n## ⚙️ How it works\n1. **News Ingestion:** The workflow triggers on a schedule and fetches the latest \"Furusato Nozei\" articles from Google News via RSS.\n2. **AI Analysis & Extraction:** An AI Agent (using OpenRouter) summarizes the news cluster and identifies the most viable search keyword (e.g., \"Scallops,\" \"Travel Vouchers,\" or specific municipalities).\n3. **Data Validation:** The workflow queries the Google Trends API (via SerpApi) to retrieve search volume history for the extracted keyword in Japan.\n4. **Strategic Reporting:** A second AI Agent analyzes the search trend data alongside the keyword to generate a market insight report.\n5. **Delivery:** The final report is formatted and sent directly to a Slack channel.\n\n## 🛠️ Requirements\nTo use this workflow, you will need:\n- **n8n** (Version 1.0 or later recommended).\n- **OpenRouter API Key** (or you can swap the model nodes for OpenAI/Anthropic).\n- **SerpApi Key** (Required to fetch Google Trends data programmatically).\n- **Slack Account** (with permissions to post to a channel).\n\n## 🚀 How to set up\n1. **Configure Credentials:**\n   - Add your OpenRouter API key to the Chat Model nodes.\n   - Add your SerpApi key to the `Google Trends API` node.\n   - Connect your Slack account in the `Send a message` node.\n2. **Check the RSS Feed:**\n   - The `RSS Read` node is pre-configured for \"Furusato Nozei\" (ふるさと納税). You can leave this as is.\n3. **Regional Settings:**\n   - The workflow is pre-set for Japan (`jp` / `ja`). If you need to change this, check the `Workflow Configuration` and `Google Trends API` nodes.\n4. **Schedule:**\n   - Enable the `Schedule Trigger` node to run at your preferred time (default is 9:00 AM JST).\n\n## 🎨 How to customize\n- **Change the Topic:** While this is optimized for Furusato Nozei, you can change the RSS feed URL to track other Japanese market trends (e.g., NISA, Inbound Tourism).\n- **Swap AI Models:** The template uses OpenRouter, but you can easily replace the \"Chat Model\" nodes with OpenAI (GPT-4) or Anthropic (Claude) depending on your preference.\n- **Adjust AI Prompts:** The AI prompts are currently in Japanese to match the content. You can modify the system instructions in the `AI Agent` nodes if you prefer English reports.",
  "featuredImage": "/data/workflows/11128/11128.webp",
  "author": {
    "id": 101,
    "slug": "isakai",
    "name": "飯盛　正幹",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 56,
  "downloads": 5,
  "createdAt": "2025-11-22T07:07:13.526Z",
  "updatedAt": "2026-01-16T09:07:37.801Z",
  "publishedAt": "2025-11-22T07:07:13.526Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11128"
}