{
  "id": 8891,
  "slug": "8891",
  "title": "Sync Productboard features to Linear issues with Telegram notifications",
  "description": "## How it works\n\nThis workflow automatically syncs new Productboard features into Linear as issues and notifies the team via Telegram. It starts on a schedule, fetches Productboard features through API requests, and transforms the raw data into clean, structured fields. Newly created features are filtered, then inserted into Linear, and a success message is sent to Telegram for confirmation.\n\n## Step-by-step\n\n**1. Trigger and fetch data**  \n- **Schedule Trigger** – Starts the workflow at predefined intervals.  \n- **HTTP Request to Productboard** – Pulls the latest features from the Productboard API.  \n\n**2. Transform and clean data**  \n- **Code (Transform Features)** – Strips HTML, formats dates, and extracts clean fields like name, description, status, owner, and link.  \n\n**3. Filter for new items**  \n- **If (Filter New Features)** – Compares createdAt with today’s date, allowing only new features to proceed.  \n\n**4. Create issues in Linear**  \n- **Create Linear Issue** – Opens a new Linear issue using the feature’s name and description.  \n\n**5. Notify via Telegram**  \n- **Success Notification (Telegram)** – Sends a confirmation message once the sync is successful.  \n\n## Why use this?\n\n- Automates the sync of Productboard features into Linear without manual copying.  \n- Ensures only new features are captured, preventing duplicates.  \n- Keeps your team updated instantly through Telegram notifications.  \n- Saves time by standardizing data and formatting before inserting into Linear.  \n- Creates a smooth handoff from product planning to engineering execution.  \n",
  "featuredImage": "/data/workflows/8891/8891.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Project Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 68,
  "downloads": 6,
  "createdAt": "2025-09-24T06:25:47.997Z",
  "updatedAt": "2026-01-16T08:58:12.367Z",
  "publishedAt": "2025-09-24T06:25:47.997Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8891"
}