{
  "id": 11448,
  "slug": "11448",
  "title": "Automated B2B lead management and AI outreach",
  "description": "This workflow is a comprehensive, production-grade automation for B2B lead management and multichannel outreach, designed for Sales Development Representatives (SDRs), growth teams, and sales operations. It covers the entire SDR pipeline: from lead ingestion and validation, through enrichment, scoring, AI-powered outreach, reply handling, analytics, and reporting.\n\n**Key Features:**\n- Lead validation (email, suppression, geo/GDPR)\n- Multi-source data enrichment\n- Lead scoring and tiering (HIGH/MEDIUM/LOW)\n- AI-generated personalized cold emails (with A/B subject testing)\n- Multichannel outreach (Email, LinkedIn, WhatsApp) with rate limiting and compliance\n- AI-based reply simulation and intent classification\n- Automated routing (qualification, follow-up, manual review)\n- Full event logging to database\n- Aggregated analytics and daily reporting\n- Human-readable AI summary and Slack notifications\n\n---\n\n## What This Workflow Does\n\n### 1. Lead Ingestion & Validation\n- Loads leads from a source (test data, CRM, webhook, etc.)\n- Validates email format and checks against suppression lists (blocked domains/emails)\n- Applies geo and GDPR compliance logic (blocks/flags leads from restricted countries)\n\n### 2. Data Enrichment\n- Enriches each lead via one or more external APIs (company info, tech stack, revenue, etc.)\n- Handles enrichment failures gracefully and logs them for analytics\n\n### 3. Lead Scoring & Segmentation\n- Scores leads based on industry, country, company size, revenue, and pain points\n- Segments leads into HIGH, MEDIUM, or LOW tiers for tailored outreach\n\n### 4. AI-Powered Outreach Generation\n- Uses OpenAI (or compatible LLM) to generate personalized cold email content\n- Creates A/B tested subject lines for each email\n- Generates LinkedIn and WhatsApp message variants for multichannel outreach\n\n### 5. Multichannel Outreach Execution\n- Sends emails via SMTP (with rate limiting and quiet hours)\n- Simulates LinkedIn and WhatsApp sends (can be replaced with real integrations)\n- Logs all outreach events to a Postgres database\n\n### 6. Reply Simulation & AI Classification\n- Simulates a variety of lead replies (interested, not interested, follow-up, unclear)\n- Uses AI to classify reply intent and suggest next actions\n\n### 7. Automated Routing & Follow-up\n- Routes leads based on AI classification:\n  - **Interested:** Schedules meeting, logs qualification, proposes follow-up\n  - **Follow-up Later:** Schedules future follow-up\n  - **Not Interested:** Marks as closed/lost\n  - **Unclear:** Flags for manual review and notifies team via Slack\n\n### 8. Event Logging & Analytics\n- Logs every significant event (enrichment, outreach, reply, status change) to a database\n- Aggregates results by lead score, channel, and status\n- Calculates key metrics (qualification rate, enrichment success, multichannel rate, etc.)\n\n### 9. Reporting & Team Notification\n- Generates a daily analytics row and stores it in the database\n- Uses AI to create a human-readable summary of the run\n- Posts a detailed summary to a Slack channel\n\n---\n\n## Use Cases\n\n- **Automated SDR Workflows:** Replace manual lead research, outreach, and follow-up with a fully automated, auditable process.\n- **Growth Experiments:** Run A/B tests on messaging, subject lines, and channels at scale.\n- **Sales Analytics:** Get transparent, granular reporting on every step of the SDR funnel.\n- **Compliance-First Outreach:** Ensure all outreach respects geo, GDPR, and suppression rules.\n- **AI-Driven Personalization:** Use LLMs to generate highly relevant, non-generic outreach at scale.\n\n---\n\n## Installation & Setup\n\n### 1. Import the Workflow\n- Download or copy the workflow from the n8n Template Store.\n- In your n8n editor, click **Import** and paste the workflow JSON, or use the \"Use Template\" button.\n\n### 2. Configure Required Credentials\n- **Postgres:** Set up a Postgres credential for event and analytics logging.\n- **SMTP:** Add your email provider's SMTP credentials for sending emails.\n- **OpenAI:** Add your OpenAI API key for AI-powered nodes.\n- **Slack:** Add your Slack API credential for notifications.\n- **Enrichment APIs:** Add credentials for any external enrichment APIs you use.\n\n### 3. Customize Lead Source\n- Replace the test data in the `Load Test Leads` node with your real lead source (e.g., webhook, CRM, Google Sheets, etc.).\n\n### 4. Adjust Compliance & Suppression Logic\n- Update the suppression lists and geo/GDPR logic in the relevant nodes to match your organization's requirements.\n\n### 5. Review Multichannel Logic\n- The workflow simulates LinkedIn and WhatsApp sends. Replace these with real integrations if needed.\n\n### 6. Database Preparation\n- Ensure your Postgres database has the following tables (or adjust node configs):\n  - `lead_events` (for all event logs)\n  - `analytics_daily` (for daily summary rows)\n  - `meetings` (for scheduled meetings)\n  - `execution_runs` (for workflow run metadata)\n\n### 7. Test the Workflow\n- Run the workflow manually with sample data.\n- Check the database and Slack for logs and notifications.\n- Review AI-generated content for tone and compliance.\n\n---\n\n## Configuration Details\n\n- **Rate Limiting:** Email, LinkedIn, and WhatsApp sends are rate-limited and respect quiet hours.\n- **A/B Testing:** Each email uses a randomly selected subject variant for ongoing optimization.\n- **AI Models:** Uses OpenAI GPT-4o-mini by default; can be swapped for other models.\n- **Event Logging:** Every action (enrichment, outreach, reply, status change) is logged with timestamp and payload for full traceability.\n- **Analytics:** Aggregates by lead score, channel, and status; calculates rates and averages.\n- **Slack Notifications:** Posts a summary of each run, including key metrics and AI-generated insights.\n\n---\n\n## Advanced Customization\n\n- **Add/Replace Enrichment APIs:** Plug in any HTTP-based enrichment service.\n- **Custom Lead Scoring:** Adjust the scoring logic in the `Compute Lead Score` node to fit your ICP.\n- **Custom AI Prompts:** Edit the system messages in AI nodes for your brand voice.\n- **Additional Channels:** Integrate SMS, phone, or other channels as needed.\n- **Webhook Triggers:** Replace manual trigger with webhook for real-time automation.\n\n---\n\n## Requirements\n\n- n8n version **1.123.0** or later\n- Postgres database (or adapt for your DB)\n- SMTP email provider\n- OpenAI API key (or compatible LLM)\n- Slack workspace (for notifications)\n- (Optional) Enrichment API keys\n\n---\n\n## Template Store Submission Notes\n\n- All credentials are handled via n8n's credential system (no hardcoded secrets).\n- The workflow is modular, well-commented, and ready for production use.\n- All event and analytics logging is auditable and GDPR-compliant.\n- Please review and test all integrations in your environment before using in production.\n\n---\n\n## Example Analytics Output\n\n| Metric                | Value   |\n|-----------------------|---------|\n| Total Leads           | 100     |\n| Qualified             | 22      |\n| Follow-up Scheduled   | 15      |\n| Closed Lost           | 40      |\n| Manual Review         | 3       |\n| Qualification Rate    | 22%     |\n| Enrichment Success    | 90%     |\n| Multichannel Rate     | 60%     |\n\n---\nReady to automate your SDR pipeline? Import this workflow and start scaling your B2B outreach today!",
  "featuredImage": "/data/workflows/11448/11448.webp",
  "author": {
    "id": 101,
    "slug": "tuguidragos",
    "name": "Țugui Dragoș",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 205,
  "downloads": 20,
  "createdAt": "2025-12-03T04:49:17.528Z",
  "updatedAt": "2026-01-16T09:08:45.144Z",
  "publishedAt": "2025-12-03T04:49:17.528Z",
  "nodes": 113,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11448"
}