{
  "id": 2971,
  "slug": "2971",
  "title": "Automated faceless YouTube video generator using Leonardo AI and Creatomate",
  "description": "# Automate Your Video Content Creation: AI-Powered Video Generation\n\nThis n8n template streamlines the creation of high-quality, faceless videos, automating the entire process from scriptwriting to final video production. Leveraging AI tools like Leonardo AI and Creatomate, this workflow empowers content creators to efficiently produce engaging videos without on-camera presence.\n\n## Who is this for?\n\nThis template is ideal for:\n\n* Content creators looking to scale their presence on YouTube, Instagram, and TikTok.\n* Marketers seeking to automate video marketing campaigns.\n* Anyone wanting to produce professional-looking videos quickly and easily.\n* Individuals wishing to create faceless video content.\n\n## What problem is this workflow solving?\n\nCreating engaging videos can be time-consuming and resource-intensive. This workflow eliminates the manual effort involved in scripting, image sourcing, and video editing, allowing creators to focus on strategy and content ideation. It addresses the challenge of consistent video production by automating repetitive tasks.\n\n## What this workflow does:\n\nThis workflow automates the following steps:\n\n* **AI-Driven Scriptwriting:** Uses an LLM (default: DeepSeek V3) to generate a compelling video script based on your system prompt and desired number of scenarios.\n* **AI Image Generation:** Integrates with Leonardo AI to create visually appealing images for each scenario in the script. You define the image style and resolution.\n* **Automated Video Editing:** Connects to Creatomate to assemble the script and images into a polished video, ready for upload. You’ll use a pre-created “AI generated story template” within Creatomate.\n\n## Setup:\n\n* **Video Script Generation:** Provide a detailed system prompt describing your video’s topic, target audience, and key message. Specify the number of scenarios. Select your preferred LLM (DeepSeek V3 is the default).\n* **Image Generation:** Connect your Leonardo AI account. Choose your preferred image generation model and set the video resolution. Craft a detailed prompt for Leonardo AI, defining the image style (e.g., “cinematic,” “cartoon,” “realistic”).\n* **Video Editing:** Link your Creatomate account. Create an empty “AI generated story template” in Creatomate. Copy the cURL from the Creatomate template to the video generation node. Link your ElevenLabs account to Creatomate and choose the desired voice.\n\n## How to customize this workflow:\n\n* **Script Customization:** Refine the system prompt to guide the AI. Experiment with different LLMs.\n* **Image Style:** Adjust the Leonardo AI prompt. Explore different image generation models.\n* **Video Editing:** Modify the Creatomate template to customize transitions, text overlays, and other elements. Add voiceover using the ElevenLabs integration in Creatomate.\n\n## Category:\n\nMarketing, Social Media, Content Creation",
  "featuredImage": "/data/workflows/2971/2971.webp",
  "author": {
    "id": 101,
    "slug": "muzi",
    "name": "Tianyi",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 13896,
  "downloads": 1389,
  "createdAt": "2025-02-22T07:20:26.447Z",
  "updatedAt": "2026-01-16T08:27:28.119Z",
  "publishedAt": "2025-02-22T07:20:26.447Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2971"
}