{
  "id": 4066,
  "slug": "4066",
  "title": "Track hourly weather conditions with OpenWeatherMap and Google Sheets",
  "description": "This n8n template allows you to monitor hourly weather conditions in a specific city using OpenWeatherMap and log the results to a Google Sheet. It’s perfect for anyone needing periodic weather tracking—whether you're managing logistics, travel planning, or environmental monitoring.\n\n---\n\n# 🔧 How it works\n- A Schedule Trigger activates the workflow every hour.\n\n- The Get Weather Data from OpenWeatherMap node fetches real-time weather details using the city name you specify.\n\n- An IF node checks if the weather description contains \"rain\" or the temperature is below a set threshold.\n\n- If the condition is true, the data is formatted with city, temperature, humidity, and conditions.\n\n- The Google Sheets node appends this formatted information to your designated sheet.\n\n---\n\n# 👤 Who is it for?\n### This workflow is ideal for:\n\n- Operations teams monitoring weather-sensitive logistics\n\n- Researchers collecting climate data\n\n- Developers and hobbyists learning how to connect APIs with Google Sheets\n\n---\n\n# 🗂️ Google Sheet Structure\n### Your Google Sheet should have the following columns:\n\n- city (string)\n\n- temperature (K) (number)\n\n- humidity (number)\n\n- conditions (string)\n\n- status (string)\n\n---\n\n# ⚙️ Setup Instructions\n- Create a Google Sheet with the above columns.\n\n- Set up your Google Service Account credentials in n8n.\n\n- Replace the API key in the HTTP Request node with your own OpenWeatherMap credential.\n\n- Specify your target city and ensure your OpenWeatherMap account is active.\n\n- Adjust the frequency in the Schedule Trigger as needed (default: every hour).\n",
  "featuredImage": "/data/workflows/4066/4066.webp",
  "author": {
    "id": 101,
    "slug": "ist00dent",
    "name": "ist00dent",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 694,
  "downloads": 69,
  "createdAt": "2025-05-15T04:33:05.417Z",
  "updatedAt": "2026-01-16T08:32:51.407Z",
  "publishedAt": "2025-05-15T04:33:05.417Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4066"
}