{
  "id": 11186,
  "slug": "11186",
  "title": "Automate real estate client folder creation with Google Sheets and Drive",
  "description": "## What this workflow does\n\nThis workflow automates backend setup tasks for real estate client portals. When a new property transaction is added to your Google Sheets database with a buyer email but no document folder assigned, the workflow automatically creates a dedicated Google Drive folder, updates the spreadsheet with the folder URL, and adds an initial task prompting the client to upload documents.\n\nThis automation eliminates manual folder creation and task assignment, ensuring every new transaction has its documentation infrastructure ready from day one. Your clients can access their dedicated folder directly from the portal, keeping all property-related documents organized and accessible in one place.\n\n## Key benefits\n\n- **Eliminate manual setup**: No more creating folders and tasks individually for each transaction\n- **Consistent client experience**: Every buyer gets the same professional onboarding process\n- **Organized documentation**: Each transaction has its own Google Drive folder automatically shared with the client\n- **Time savings**: Focus on closing deals instead of administrative setup\n\n## Setup requirements\n\n**Important:** You must make a copy of the [reference Google Sheets spreadsheet](https://docs.google.com/spreadsheets/d/1UJPaBd_qHsNgInA2mrYaq7wgXLHzFw9jcTUoSpTxMDk/edit?usp=sharing) to your own Google account before using this workflow.\n\nYour spreadsheet needs at minimum two tabs:\n- **Transactions tab**: Columns for ID, Buyer Email, Documents URL, Property Address, and Status\n- **Tasks tab**: Columns for Transaction ID, Task Name, Task Description, and Status\n\n## Configuration steps\n\n1. Authenticate your Google Sheets and Google Drive accounts in n8n\n2. Update the Google Sheets trigger node to point to your copied spreadsheet\n3. Set the parent folder ID in the \"Create Client Documents Folder\" node (where transaction folders should be created)\n4. Customize the initial task name and description in the \"Add Initial Upload Task\" node\n5. Verify all sheet names match your spreadsheet tabs\n\nThe workflow triggers every minute checking for new transactions that meet the criteria (has buyer email, missing documents URL).",
  "featuredImage": "/data/workflows/11186/11186.webp",
  "author": {
    "id": 101,
    "slug": "vasarmilan",
    "name": "Milan Vasarhelyi - SmoothWork",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 190,
  "downloads": 19,
  "createdAt": "2025-11-24T12:06:13.559Z",
  "updatedAt": "2026-01-16T09:07:51.050Z",
  "publishedAt": "2025-11-24T12:06:13.559Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11186"
}