{
  "id": 8122,
  "slug": "8122",
  "title": "Automate marketing agency client onboarding: Typeform to GDrive + OpenAI research",
  "description": "## Who's it for\n\nMarketing agencies, digital agencies, and freelancers who need to streamline their client onboarding process and create consistent, professional documentation for new clients. Perfect for teams handling multiple client intakes who want to save hours of manual setup work while maintaining quality standards.\n\n## What it does\n\nThis workflow automates the entire client onboarding journey from the moment a prospect fills out your Typeform intake questionnaire. It instantly creates a complete Google Drive folder structure with 6 main folders and 15+ subfolders tailored for marketing projects, sends the intake information to your team via Slack, generates an AI-powered marketing research brief using OpenAI, implements an approval workflow with revision capabilities, and delivers a professional welcome email to the client. The system ensures nothing falls through the cracks while maintaining consistent quality across all client projects.\n\n## How it works\n\n1. **Intake Trigger**: When a client submits your Typeform intake form, the workflow automatically initiates\n2. **Folder Creation**: Creates a branded client folder in Google Drive with organized subfolders for ads, raw footage, product images, research, drafts, and archives\n3. **Team Notification**: Posts detailed intake responses to your designated Slack channel for immediate team visibility\n4. **AI Brief Generation**: Uses OpenAI to analyze intake responses and generate a comprehensive marketing research document including customer personas, pain points, positioning strategies, and marketing angles\n5. **Approval Process**: Sends the brief for team review with built-in approve/revise functionality\n6. **Document Creation**: Upon approval, creates a Google Doc with the finalized research brief\n7. **Client Communication**: Sends a personalized welcome email to the client confirming their onboarding\n\n## How to set up\n\n1. **Configure the workflow**: Start by filling in all values in the \"⚙️ Configuration\" node:\n   - Your Typeform ID from your intake form\n   - Google Drive parent folder ID where client folders will be created\n   - Slack channel IDs for new client notifications and internal reviews\n   - OpenAI model preference (GPT-4 recommended)\n   - Welcome email template with your agency branding\n\n2. **Connect your accounts**: \n   - Typeform: Create credentials and connect your account\n   - Google: Authenticate with Drive, Docs, and Gmail permissions\n   - Slack: Add the n8n bot to your workspace and relevant channels\n   - OpenAI: Add your API key for AI content generation\n\n3. **Test the workflow**: \n   - Submit a test entry through your Typeform\n   - Verify folder creation in Google Drive\n   - Check Slack notifications are posting correctly\n   - Confirm the approval process works as expected\n\n## Requirements\n\n- **Typeform** account with a client intake form created\n- **Google Workspace** account with Drive, Docs, and Gmail access\n- **Slack** workspace with appropriate channels created\n- **OpenAI API** key with credits for content generation\n- **n8n** instance (self-hosted or cloud) version 1.0+\n\n## How to customize the workflow\n\n- **Folder Structure**: Modify the subfolder nodes to match your agency's project organization needs\n- **Intake Fields**: Update the Slack message blocks and AI prompt to match your specific Typeform fields\n- **Research Brief Template**: Customize the OpenAI prompt to generate briefs aligned with your agency's format\n- **Approval Logic**: Add additional approval stages or skip approval for certain client types\n- **Welcome Email**: Personalize the email template with your branding, links, and next steps\n- **Notification Channels**: Route different types of notifications to specific Slack channels based on client tier or project type",
  "featuredImage": "/data/workflows/8122/8122.webp",
  "author": {
    "id": 101,
    "slug": "chrisrudy",
    "name": "Chris Rudy",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 447,
  "downloads": 44,
  "createdAt": "2025-09-01T14:41:42.278Z",
  "updatedAt": "2026-01-16T08:54:16.886Z",
  "publishedAt": "2025-09-01T14:41:42.278Z",
  "nodes": 45,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8122"
}