{
  "id": 3151,
  "slug": "3151",
  "title": "Build an AI-powered tech radar advisor with SQL DB, RAG, and routing agents",
  "description": "# AI-Powered Tech Radar Advisor\n\nThis project is built on top of the famous open source [ThoughtWorks Tech Radar](https://radar.thoughtworks.com/).  \n\nYou can use this template to build your own AI-Powered Tech Radar Advisor for your company or group of companies.\n\n![Tech Constellation](https://raw.githubusercontent.com/dragonjump/techconstellation/refs/heads/gh-pages/build-your-own-radar-master/src/images/image.png)\n\n![Tech Radar Constellation](https://raw.githubusercontent.com/dragonjump/techconstellation/refs/heads/gh-pages/build-your-own-radar-master/src/images/demo.png)\n\n## Target Audience\n\nThis template is perfect for:\n- **Tech Audit & Governance Leaders:** Those seeking to build a tech landscape AI platform portal.\n- **Tech Leaders & Architects:** Those aiming to provide modern AI platforms that help others understand the rationale behind strategic technology adoption.\n- **Product Managers:** Professionals looking to align product innovation with the company's current tech trends.\n- **IT & Engineering Teams:** Teams that need to aggregate, analyze, and visualize technology data from multiple sources efficiently.\n- **Digital Transformation Experts:** Innovators aiming to leverage AI for actionable insights and strategic recommendations.\n- **Data Analysts & Scientists:** Individuals who want to combine structured SQL analysis with advanced semantic search using vector databases.\n- **Developers:** Those interested in integrating RAG chatbot functionality with conversation storage.\n\n---\n\n# 1. Description\n\n**Tech Constellation** is an AI-powered Tech Radar solution designed to help organizations visualize and steer their technology adoption strategy.  \nIt seamlessly ingests data from a Tech Radar Google Sheet—converting it into both a MySQL database and a vector index—to consolidate your tech landscape in one place.\n\nThe platform integrates an interactive AI chat interface powered by four specialized agents:\n- **AI Agent Router:** Analyzes and routes user queries to the most suitable processing agent.\n- **SQL Agent:** Executes precise SQL queries on structured data.\n- **RAG Agent:** Leverages semantic, vector-based search for in-depth insights.\n- **Output Guardrail Agent:** Validates responses to ensure they remain on-topic and accurate.\n\nThis powerful template is perfect for technology leaders, product managers, engineering teams, and digital transformation experts looking to make data-driven decisions aligned with strategic initiatives across groups of parent-child companies.\n\n---\n\n# 2. Features\n \n### Data Ingestion\n- A Google Sheet containing tech radar data is used as the primary source.\n  - The data is ingested and converted into a MySQL database.\n  - Simultaneously, the data is indexed into a vector database for semantic (vector-based) search.\n  \n### Interactive AI Chat\n- **Chat Integration:** An AI-powered chat interface allows users to ask questions about the tech radar.\n- **Customizable AI Agents:**\n  1. **AI Agent Router:** Determines the query type and routes it to the appropriate agent.\n  2. **SQL Agent:** Processes queries using SQL on structured data.\n  3. **RAG Agent:** Performs vector-based searches on document-like data.\n  4. **Output Guardrail Agent:** Validates queries and ensures that the responses remain on-topic and accurate.\n\n---\n\n## Usage Examples\n1. Tell me, is TechnologyABC adopted or on hold, and why?\n2. List all the tools that are considered part of the strategic direction for company3 but are not adopted.\n\n---\n\n## Project Links & Additional Details\n\n- **GitHub Repository (Frontend Interface Source Code):** [github.com/dragonjump/techconstellation](https://github.com/dragonjump/techconstellation)\n- **Try It:** [https://scaler.my](https://scaler.my)\n",
  "featuredImage": "/data/workflows/3151/3151.webp",
  "author": {
    "id": 101,
    "slug": "seanlon",
    "name": "Sean Lon",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 14647,
  "downloads": 1464,
  "createdAt": "2025-03-13T13:37:14.192Z",
  "updatedAt": "2026-01-16T08:28:23.351Z",
  "publishedAt": "2025-03-13T13:37:14.192Z",
  "nodes": 53,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3151"
}