{
  "id": 11698,
  "slug": "11698",
  "title": "Generate content strategy insights from Reddit & X using Gemini AI analysis",
  "description": "## Who’s it for\nThis template is perfect for content creators, marketers, solopreneurs, agencies, and social media strategists who want to understand what audiences are talking about online. It helps teams quickly turn broad topics into structured insights, trend opportunities, and actionable content ideas.\n\n## What it does / How it works\nThis workflow begins with a form where the user enters a single topic.  \nAn AI agent expands the topic into subtopics and generates multiple relevant keywords.  \nFor each keyword, the workflow automatically gathers content from Reddit and X (formerly Twitter), extracting posts, titles, text, engagement metrics, and links.\n\nEach collected post is then analyzed by an AI model to determine:\n\n- Trend potential  \n- Audience relevance  \n- Platform suitability  \n- Recommended content formats  \n- Categories and keywords  \n\nOnce all posts are processed, a final AI agent synthesizes the results, identifies the strongest emerging trends, groups similar insights, and generates strategic content recommendations.\n\n## Requirements\n- Google Gemini (PaLM) API credentials  \n- X / Twitter OAuth2 credentials  \n- Access to the n8n Form Trigger (publicly accessible URL)\n\n## How to set up\n1. Connect your Gemini API and Twitter API credentials.  \n2. Make sure the Form Trigger node is accessible.  \n3. Review and adjust the AI prompts if you want different output formats.  \n4. Run the form, enter a topic, and execute the workflow.\n\n## How to customize the workflow\n- Add more platforms (YouTube, TikTok, Instagram, Hacker News)  \n- Add sentiment scoring or engagement ranking  \n- Export insights to Google Sheets or Notion  \n- Generate ready-to-post content from the trends  ",
  "featuredImage": "/data/workflows/11698/11698.webp",
  "author": {
    "id": 101,
    "slug": "pixcelsthemes",
    "name": "Pixcels Themes",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 149,
  "downloads": 14,
  "createdAt": "2025-12-11T11:26:47.966Z",
  "updatedAt": "2026-01-16T09:09:45.557Z",
  "publishedAt": "2025-12-11T11:26:47.966Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11698"
}