{
  "id": 11189,
  "slug": "11189",
  "title": "Find & score LinkedIn leads with GPT-4 AI and export to Google Sheets CRM",
  "description": "# Search LinkedIn Companies, Score Them with AI, and Add to Google Sheets CRM\n\n\n## Who is this for?\n\nThis template is designed for sales teams, business development reps, and marketers who need a reliable, automated way to build targeted prospect lists. It’s especially useful for agencies, consultants, and B2B companies that want to identify, qualify, and prioritize high-value leads.\n\n## What problem does this workflow solve?\n\nResearching companies on LinkedIn, evaluating whether they fit your ideal customer profile, and manually updating your CRM can be slow, inconsistent, and labor-intensive. This workflow replaces that entire process with a fully automated system that finds, qualifies, and organizes leads for you.\n\n## What this workflow does\n\nThe workflow searches LinkedIn for companies based on your chosen filters, gathers in-depth company details, applies qualification rules, uses AI to score how well each company matches your ICP, and then adds them to your Google Sheets CRM while automatically preventing duplicates.\n\n## Setup\n\nCreate a Ghost Genius API account and generate your API key\n\nAdd your API credentials to the HTTP Request nodes\n\nMake a copy of the included Google Sheets template\n\nSet up Google Sheets and OpenAI credentials as described in the n8n documentation\n\nCustomize the Set Variables node to define your audience and AI scoring parameters\n\n## How to customize this workflow\n\nUpdate your search filters to target specific industries, regions, or company sizes\n\nChange the follower count threshold to match your qualification rules\n\nModify the AI scoring prompt to better reflect your product or service\n\nAdd notifications (email, Slack, etc.) to alert you when high-scoring leads are found",
  "featuredImage": "/data/workflows/11189/11189.webp",
  "author": {
    "id": 101,
    "slug": "gamedia",
    "name": "Ghulam Ahmad",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 141,
  "downloads": 14,
  "createdAt": "2025-11-24T14:43:07.886Z",
  "updatedAt": "2026-01-16T09:07:51.233Z",
  "publishedAt": "2025-11-24T14:43:07.886Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11189"
}