{
  "id": 6020,
  "slug": "6020",
  "title": "Create a context-aware Slack assistant with Google Sheets, Pinecone & GPT-4o",
  "description": "This advanced n8n automation template empowers your Slack bot to act as an intelligent assistant: when a user asks a question or requests a suggestion (by mentioning the bot), it automatically retrieves the user’s historical data and previous interactions from both Google Sheets and Pinecone. Using GPT-4o, the bot analyzes past updates, status reports, and context to generate a personalized, context-aware response—directly in Slack.\nPerfect for teams seeking instant, data-driven support, this workflow transforms your Slack bot into a smart knowledge assistant that references your own organizational history to provide relevant answers and suggestions.\n\n**What This Template Does (Step-by-Step)**\n\n**Slack Bot Mention Trigger**\n- Listens for message or app_mention events where a user asks a question or requests a suggestion.\n- Captures the message body and user ID.\n\n**User Profile & Data Fetch**\n\n- Uses the Slack API to retrieve the user’s profile.\n- Queries Google Sheets and Pinecone to collect the user’s historical updates and interactions.\n\n**Contextual AI Lookup**\n- GPT-4o reviews the user’s past status reports, messages, and activity.\n- Synthesizes a contextually relevant answer or suggestion based on prior data.\n\n**Personalized Response Generation**\n\n- The bot replies in Slack with a tailored answer, referencing the user’s previous updates and current context.\n\n**Auto-Fix & Schema Validation**\n- Ensures the generated response is well-structured and matches your organization’s data schema.\n\n**Document Update (Optional)**\n- Optionally logs the new interaction or suggestion back to Pinecone for future reference.\n\n**Required Integrations**\n- Slack Bot with channels:history, app_mentions:read, and users.profile:read\n- Google Sheets OAuth2 (for lead or user status records)\n- Pinecone Vector Store (for storing user status documents)\n- Azure OpenAI or OpenAI GPT-4o (for document generation and merging)\n- Cohere API (optional) for reranking relevance in vector search\n\n**Ideal For**\n- Remote teams running async daily standups\n- People ops tracking onboarding or churn signals\n- Founders building internal GPT-powered tools\n- Managers consolidating Slack-based updates across teams\n- Teams wanting a Slack bot that provides personalized answers and suggestions based on past activity\n- Managers and team members seeking quick, AI-powered support and insights from their own work history\n- Organizations aiming to leverage internal data for smarter, context-aware assistance in Slack\n",
  "featuredImage": "/data/workflows/6020/6020.webp",
  "author": {
    "id": 101,
    "slug": "rahul08",
    "name": "Rahul Joshi",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 281,
  "downloads": 28,
  "createdAt": "2025-07-15T08:58:25.553Z",
  "updatedAt": "2026-01-16T08:42:43.053Z",
  "publishedAt": "2025-07-15T08:58:25.553Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6020"
}