{
  "id": 4880,
  "slug": "4880",
  "title": "Segment WooCommerce customers for targeted marketing with RFM analysis",
  "description": "## Overview\n\nThis workflow is designed for eCommerce store owners and marketing teams who use WooCommerce. It helps segment customers based on their purchasing behavior using the RFM (Recency, Frequency, Monetary) model. By identifying high-value customers, new buyers, and at-risk segments, you can tailor your marketing strategies and improve customer retention.\n\n## How It Works\n\n1. **Trigger**: The workflow can be started manually or on a scheduled basis (e.g., weekly).\n2. **Retrieve Orders**: It fetches completed orders from your WooCommerce store from the past year.\n3. **RFM Analysis**: It groups orders by customer and calculates their RFM scores.\n4. **Customer Segmentation**: Based on RFM scores, customers are categorized into marketing segments (e.g., Champions, At Risk, Lost).\n5. **Summary Report**: Generates a styled HTML report with a table summarizing customer segments and suggested marketing actions.\n\n## Setup Instructions\n\n1. **Connect WooCommerce**:\n\n   * Go to the WooCommerce node.\n   * Add or select your WooCommerce API credentials. You need the Base URL, Consumer Key, and Consumer Secret.\n   * Ensure API access is enabled in your WooCommerce settings.\n\n2. **Customize Segmentation (Optional)**:\n\n   * In the \"Calculate RFM Scores\" code node, you can adjust the logic that assigns segment labels based on score combinations.\n   * You can also update the marketing suggestions in the second \"Code\" node.\n\n3. **Run the Workflow**:\n\n   * Use the \"Manual Start\" node for testing.\n   * Enable the \"Weekly Trigger\" node to automate execution.\n\n4. **View Report**:\n\n   * The final HTML node outputs a complete styled report.\n   * You can send this via email or integrate it with other services.\n\n## Requirements\n\n* WooCommerce store with API access enabled.\n* Valid API credentials (Base URL, Consumer Key, Consumer Secret).\n* n8n instance with access to the internet.",
  "featuredImage": "/data/workflows/4880/4880.webp",
  "author": {
    "id": 101,
    "slug": "mrazari",
    "name": "Mohammadreza azari",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1089,
  "downloads": 108,
  "createdAt": "2025-06-11T17:58:53.119Z",
  "updatedAt": "2026-01-16T08:36:42.573Z",
  "publishedAt": "2025-06-11T17:58:53.119Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4880"
}