{
  "id": 11117,
  "slug": "11117",
  "title": "Automated product health monitor with anomaly detection & AI root cause analysis",
  "description": "## Description\n\nThis workflow transforms raw SaaS metrics into a fully automated Product Health Monitoring & Incident Management system.\n\nIt checks key revenue and usage metrics every day (such as churn MRR and feature adoption), detects anomalies using a statistical baseline, and automatically creates structured incidents when something unusual happens.\n\nWhen an anomaly is found, the workflow logs it into a central incident database, alerts the product team on Slack and by email, enriches the incident with context and AI-generated root-cause analysis, and produces a daily health report for leadership.\n\nIt helps teams move from passive dashboard monitoring to a proactive, automated system that surfaces real issues with clear explanations and recommended next steps.\n\n## Context\n\nMost SaaS teams struggle with consistent product health monitoring:\n\n- Metrics live in dashboards that people rarely check proactively\n\n- Spikes in churn or drops in usage are noticed days later\n\n- There is no unified system to track, investigate, and report on incidents\n\n- Post-mortems rely on memory rather than structured data\n\n- Leadership often receives anecdotal updates instead of reliable daily reporting\n\nThis workflow solves that by:\n\n- Tracking core health metrics daily (revenue and usage)\n\n- Detecting anomalies based on recent baselines, not arbitrary thresholds\n\n- Logging all incidents in a consistent format\n\n- Notifying teams only when action is needed\n\n- Generating automated root-cause insights using AI + underlying database context\n\n- Producing a daily “Product Health Report” for decision-makers\n\nThe result:\n\nFaster detection, clearer understanding, and better communication across product, growth, and leadership teams.\n\n## Target Users\n\nThis template is ideal for:\n\n- Product Managers & Product Owners\n\n- SaaS founders and early-stage teams\n\n- Growth, Analytics, and Revenue Ops teams\n\n- PMO / Operations teams managing product performance\n\nAny organization wanting a lightweight incident monitoring system without building internal tooling\n\n## Technical Requirements\n\nYou will need:\n\n- A Postgres / Supabase database containing your product metrics\n\n- Slack credentials for alerts\n\n- Gmail credentials for email notifications\n\n- (Optional) Notion credentials for incident documentation and daily reports\n\n- An OpenAI / Anthropic API key for AI-based root cause analysis\n\n## Workflow Steps\n![image.png](fileId:3414)\nThe workflow is structured into four main sections:\n\n1) Daily Revenue Health\n\nRuns once per day, retrieves recent revenue metrics, identifies unusual spikes in churn MRR, and creates incidents when needed.\nIf an anomaly is detected, a Slack alert and email notification are sent immediately.\n\n2) Daily Usage Health\n\nMonitors feature usage metrics to detect sudden drops in adoption or engagement.\nIncidents are logged with severity, context, and alerts to the product team.\n\n3) Root Cause & Summary\n\nFor every open incident, the workflow:\n\nCollects additional context from the database (e.g., churn by country or plan)\n\nUses AI to generate a clear root cause hypothesis and suggested next steps\n\nSends a summarized report to Slack and email\n\nUpdates the incident status accordingly\n\n4) Daily Product Health Report\n\nEvery morning, the workflow compiles all incidents from the previous day into:\n\n- A daily summary email for leadership\n\n- A Notion page for documentation and historical tracking\n\n- This ensures stakeholders have clear visibility into product performance trends.\n\n## Key Features\n\n- Automated anomaly detection across revenue and usage metrics\n\n- Centralized incident logging with metadata and raw context\n\n- Severity scoring based on deviation from historical baselines\n\n- Slack and email alerts for fast response\n\n- AI-generated root cause analysis with recommended actions\n\n- Daily product health reporting for leadership and PM teams\n\n- Optional Notion integration for incident documentation\n\n- System logging for observability and auditability\n\n- Fully modular: you can add more metrics, alert channels, or analysis steps easily\n\n## Expected Output\n\n- When running, the workflow will generate:\n\n- Structured incident records in your database\n\n- Slack alerts for revenue or usage anomalies\n\n- Email notifications with severity, baseline vs actual, and context\n\n- AI-generated root cause summaries\n\n- A daily health report summarizing all incidents\n\n- (Optional) Notion pages for both incidents and daily reports\n\n- System logs recording successful executions\n\n## Tutorial video:\n[Watch the Youtube Tutorial video](https://www.youtube.com/watch?v=JWHOyftEetA)\n\n\n## About me\n\nI’m Yassin a Project & Product Manager  Scaling tech products with data-driven project management.\n📬 Feel free to connect with me on [Linkedin](https://www.linkedin.com/in/yassin-zehar)",
  "featuredImage": "/data/workflows/11117/11117.webp",
  "author": {
    "id": 101,
    "slug": "yassinzehar",
    "name": "Yassin Zehar",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 57,
  "downloads": 5,
  "createdAt": "2025-11-21T16:53:00.611Z",
  "updatedAt": "2026-01-16T09:07:34.521Z",
  "publishedAt": "2025-11-21T16:53:00.611Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11117"
}