{
  "id": 11754,
  "slug": "11754",
  "title": "Build a WhatsApp assistant for text, audio & images using GPT-4o & Evolution API",
  "description": "Build an intelligent WhatsApp assistant that automatically responds to customer messages using AI. This template uses the Evolution API community node for WhatsApp integration and OpenAI for natural language processing, with built-in conversation memory powered by Redis to maintain context across messages.\n\n&gt; ⚠️ **Self-hosted requirement:** This workflow uses the Evolution API community node, which is only available on self-hosted n8n instances. It will not work on n8n Cloud.\n\n## What this workflow does\n\n1. Receives incoming WhatsApp messages via Evolution API webhook\n2. Filters and processes text, audio, and image messages\n3. Transcribes audio messages using OpenAI Whisper\n4. Analyzes images using GPT-4 Vision\n5. Generates contextual responses with conversation memory\n6. Sends replies back through WhatsApp\n\n## Who is this for?\n\n- Businesses wanting to automate customer support on WhatsApp\n- Teams needing 24/7 automated responses with AI\n- Developers building multimodal chat assistants\n- Companies looking to reduce response time on WhatsApp\n\n## Setup instructions\n\n1. **Evolution API**: Install and configure Evolution API on your server. Create an instance and obtain your API key and instance name.\n2. **Redis**: Set up a Redis instance for conversation memory. You can use a local installation or a cloud service like Redis Cloud.\n3. **OpenAI**: Get your API key from platform.openai.com with access to GPT and Whisper models.\n4. **Webhook**: Configure your Evolution API instance to send webhooks to your n8n webhook URL.\n\n## Customization options\n\n- Modify the system prompt in the AI node to change the assistant's personality and responses\n- Adjust the Redis TTL to control how long conversation history is retained\n- Add additional message type handlers for documents, locations, or contacts\n- Integrate with your CRM or database to personalize responses\n\n## Credentials required\n\n- Evolution API credentials (self-hosted)\n- OpenAI API key\n- Redis connection",
  "featuredImage": "/data/workflows/11754/11754.webp",
  "author": {
    "id": 101,
    "slug": "akav",
    "name": "Antonio Gasso",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1223,
  "downloads": 122,
  "createdAt": "2025-12-12T21:12:02.514Z",
  "updatedAt": "2026-01-16T09:09:59.904Z",
  "publishedAt": "2025-12-12T21:12:02.514Z",
  "nodes": 54,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11754"
}