{
  "id": 8998,
  "slug": "8998",
  "title": "Edit images with text prompts using Gemini AI and Telegram Bot",
  "description": "Transform your Telegram chats into a creative powerhouse with this AI-driven image editing bot. Send an image document with a descriptive caption, and watch it get intelligently edited in seconds—no design skills required!\n\n## 📋 What This Template Does\nThis workflow powers a Telegram bot that automatically processes incoming image documents with text prompts. It downloads the file, uses Google Gemini AI to edit the image based on your caption, and instantly replies with the enhanced version.\n- Triggers on new messages containing documents and captions\n- Securely downloads and validates files before AI processing\n- Leverages Gemini for precise, prompt-based image edits\n- Sends the polished result back to the chat seamlessly\n\n## 🔧 Prerequisites\n- A Telegram bot created via @BotFather\n- Google AI Studio account for Gemini API access\n- n8n instance with Telegram and Google Gemini nodes enabled\n\n## 🔑 Required Credentials\n\n### Telegram API Setup\n1. Open Telegram and message @BotFather\n2. Use `/newbot` to create your bot and note the token\n3. In n8n, go to Credentials → Add Credential → Search \"Telegram API\"\n4. Paste the token and save as \"Telegram Bot\"\n\n### Google Gemini API Setup\n1. Visit aistudio.google.com and sign in with Google\n2. Click \"Get API key\" → Create API key in a new project\n3. In n8n, go to Credentials → Add Credential → Search \"Google Gemini API\"\n4. Enter the API key and save as \"Gemini API\"\n\n## ⚙️ Configuration Steps\n1. Import the provided JSON into your n8n workflows\n2. Assign the Telegram Bot credential to the trigger and Telegram nodes\n3. Assign the Gemini API credential to the Edit Image node\n4. Activate the workflow and note your bot's username\n5. Test by sending an image document with a caption like \"add a sunset background\" to your bot\n\n## 🎯 Use Cases\n- **Personal creativity boost**: Send a selfie with \"make me a superhero\" for fun edits during downtime\n- **Social media content**: Upload product photos with \"enhance lighting and add text overlay\" for quick marketing visuals\n- **Educational sketches**: Share drawings with \"colorize and detail\" to turn student ideas into professional illustrations\n- **Team collaboration**: In group chats, prompt \"remove background\" for instant design feedback loops\n\n## ⚠️ Troubleshooting\n- **Bot not responding**: Verify token in credentials and ensure \"message\" updates are enabled in the trigger\n- **File download fails**: Check if the sent file is a document/image; Telegram expires links after 1 hour—resend if needed\n- **AI edit errors**: Confirm Gemini API key quotas; shorten prompts if over 100 words for better results\n- **No edited image sent**: Inspect execution log for binary data flow; ensure \"binaryData\" is toggled on in send node",
  "featuredImage": "/data/workflows/8998/8998.webp",
  "author": {
    "id": 101,
    "slug": "daniel-automates",
    "name": "Daniel Nkencho",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1041,
  "downloads": 104,
  "createdAt": "2025-09-26T23:43:06.965Z",
  "updatedAt": "2026-01-16T08:58:38.828Z",
  "publishedAt": "2025-09-26T23:43:06.965Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8998"
}