{
  "id": 11842,
  "slug": "11842",
  "title": "Automated credentials backup to Google Drive via SSH and Docker",
  "description": "This workflow automates the backup of decrypted n8n credentials from a self-hosted Docker instance to Google Drive. It allows you to export credentials on n8n versions 2.x.x (where old CLI commands may not work) without accessing the server terminal manually.\n\n## How it works\n* **Configuration**: Defines the Docker container name and file paths using a centralized variables node.\n* **SSH Execution**: Connects to the host machine via SSH and executes the `n8n export:credentials` command inside the specified Docker container.\n* **File Retrieval**: Reads the newly created decrypted JSON file from the host filesystem.\n* **Cloud Upload**: Uploads the JSON file to a specified folder in Google Drive with a timestamped filename.\n\n## Set up steps\n* **Configure Variables**: Open the \"Variables\" node and enter your `Docker Container name` (usually `n8n` or an ID).\n* **SSH Connection**: Configure the \"Execute a command\" (SSH) node with your host machine's IP, username, and SSH key/password.\n* **Google Drive Auth**: Authenticate the \"Google Drive Upload File\" node with your Google credentials.\n* **Select Folder**: In the \"Google Drive Upload File\" node, select the specific folder on your Drive where you want the backups to be saved.\n* **Schedule**: (Optional) Adjust the \"Schedule Trigger\" to your preferred backup frequency (default is set to run periodically).",
  "featuredImage": "/data/workflows/11842/11842.webp",
  "author": {
    "id": 101,
    "slug": "elitiv",
    "name": "Alexandru Florea",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 113,
  "downloads": 11,
  "createdAt": "2025-12-16T01:52:34.689Z",
  "updatedAt": "2026-01-16T09:10:20.420Z",
  "publishedAt": "2025-12-16T01:52:34.689Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11842"
}