{
  "id": 10519,
  "slug": "10519",
  "title": "Daily AI research summary from arXiv with Gemini AI, Notion & Telegram alerts",
  "description": "## What this template does\n\nThis workflow turns the arXiv AI feed into a daily research assistant.\nEvery morning it fetches the latest Artificial Intelligence papers from [arXiv.org](arXiv.org), deduplicates them, stores one page per paper in Notion (with metadata + PDF link), generates a **Deep Research Summary** of each PDF using Gemini, and finally posts a short update to a Telegram channel with links to both the paper and the Notion summary.\n\n## Who is this for & what problem it solves\n\nThis template is designed for founders, researchers, builders and curious professionals who want to stay up-to-date with AI research without reading every paper in full.\nIt solves the “information overload” problem: instead of manually checking arXiv and skimming PDFs, you get a curated daily feed with human-style explanations stored in your own Notion database.\n\n## Use Cases\n\n* Daily AI research digest for solo founders or small teams.\n* Private “AI research hub” in Notion for your company or lab.\n* Telegram channel that shares the latest AI papers plus plain-English summaries.\n* Personal learning pipeline: track, tag and revisit important papers over time.\n\n## How it works (workflow overview)\n\n1. Scheduled trigger runs every day at 08:00.\n2. HTTP Request pulls the latest AI papers from arXiv’s API.\n3. Results are converted from XML to JSON and cleaned.\n4. A time-window filter keeps only recent papers and removes duplicates.\n5. For each paper, a Notion page is created (metadata + PDF URL).\n6. Gemini reads the PDF and returns a structured, multi-chunk summary.\n7. Each chunk is appended to the same Notion page as rich-text blocks.\n8. A Telegram message is sent with title, short abstract, PDF link and Notion link.\n\n## Setup (step-by-step)\n\n1. Create a Notion database and connect your Notion integration.\n2. Map the properties in the **Register to Notion Database** node (title, arxiv_id, abstract, authors, categories/tags, published date, pdf URL).\n3. Add your Gemini API key and model in the **Analyze doc (Prompt Ultra-Pro)** node.\n4. Add your Telegram bot token and **chat_id** in the **Send a text message** node.\n5. (Optional) Adjust the arXiv query in **HTTP Request** to focus on your preferred AI categories or keywords.\n6. Enable the **Scheduled Daily Trigger** when you’re ready to run it in production.\n\n## Customization options\n\n* Change the arXiv search query (keywords, categories, max_results).\n* Modify the time window logic (e.g. 24h, 48h, or no filter).\n* Adapt the Notion properties to your own schema (status, tags, priority, etc.).\n* Switch the messaging channel (Telegram, Discord, Slack) using similar nodes.\n",
  "featuredImage": "/data/workflows/10519/10519.webp",
  "author": {
    "id": 101,
    "slug": "vasylpavlyuchok",
    "name": "Vasyl Pavlyuchok",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 332,
  "downloads": 33,
  "createdAt": "2025-11-05T03:22:08.183Z",
  "updatedAt": "2026-01-16T09:05:19.887Z",
  "publishedAt": "2025-11-05T03:22:08.183Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10519"
}