{
  "id": 12014,
  "slug": "12014",
  "title": "Automate job search & resume matching with LinkedIn, Gemini AI & Google Sheets",
  "description": "## Description\n\nThis workflow helps you find and evaluate job opportunities automatically, without spending hours searching and comparing roles. It uses your resume to look for relevant jobs on LinkedIn, checks how well each role matches your profile, and organises everything neatly in Google Sheets so you can focus on applying to the best opportunities.\n\n## How it works\n\nOn a schedule, the workflow downloads your resume from Google Drive and analyses it to understand your skills and experience. Based on this, it creates LinkedIn job searches and pulls in recent job listings. Each job is then reviewed using AI to compare the job description with your resume, produce a match score, suggest resume improvements, and generate a tailored cover letter. All results are saved to Google Sheets, and you’re notified by email when the run finishes.\n\n## How to use\n\n1. Make a copy of the Google Sheets template and keep it for your own job tracking.  \n2. Upload your resume (PDF) to Google Drive.  \n3. Connect your Google Drive, Google Sheets, Gmail, and AI credentials in n8n.  \n4. Update the **Config** node with your preferences (remote work, Easy Apply, job limit).  \n5. Paste your copied Google Sheet IDs into the workflow.  \n6. Turn on the Schedule Trigger and activate the workflow.\n\n## Requirements\n\n- Google Drive account for storing your resume  \n- Google Sheets account for tracking results  \n- Gmail account for notifications  \n- AI model access (Google Gemini or similar)  \n- n8n (cloud or self-hosted)\n\n## Customising this workflow\n\nYou can easily adapt this workflow to suit your goals. Change the job limits, locations, or remote preferences in the **Config** node. Update the AI prompts to target different roles or industries, or extend the workflow to send results to tools like Notion, a CRM, or your own application tracker.\n\n## Good to know\n\nThis workflow is designed to help you screen and prepare for jobs, not to apply automatically. Match scores are a guide, not a guarantee, so it’s always worth reviewing roles manually. Also, since LinkedIn pages can change over time, you may occasionally need to update HTML selectors to keep things running smoothly.\n",
  "featuredImage": "/data/workflows/12014/12014.webp",
  "author": {
    "id": 101,
    "slug": "jamesdinakar",
    "name": "Dinakar Selvakumar",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 564,
  "downloads": 56,
  "createdAt": "2025-12-22T09:33:17.730Z",
  "updatedAt": "2026-01-16T09:11:00.639Z",
  "publishedAt": "2025-12-22T09:33:17.730Z",
  "nodes": 33,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12014"
}