{
  "id": 6679,
  "slug": "6679",
  "title": "Generate multi-period financial reports from Google Sheets with AI analysis",
  "description": "Description:\n1. Overview\nThis workflow generates automated revenue and expense comparison reports from a structured Google Sheet. It enables users to compare financial data across the current period, last month, and last year, then uses an AI agent to analyze and summarize the results for business reporting.\n\n2. Prerequisites\nA connected Google Sheets OAuth2 credential.\n\nA valid DeepSeek AI API (or replaceable with another Chat Model).\n\nA sub-workflow (child workflow) that handles processing logic.\n\nProperly structured Google Sheets data (see below).\n\n3. Required Google Sheet Structure\nColumn headers must include at least: Date, Amount, Type.\n\n4. Setup Steps\nImport the workflow into your n8n instance.\n\nConnect your Google Sheets and DeepSeek API credentials.\n\nUpdate:\n\nSheet ID and Tab Name (already embedded in node: Get revenual from google sheet).\n\nCustom sub-workflow ID (in the Call n8n Workflow Tool node).\n\nOptionally configure chatbot webhook in the When chat message received node.\n\n5. What the Workflow Does\nAccepts date inputs via AI chat interface (ChatTrigger + AI Agent).\n\nFetches raw transaction data from Google Sheets.\n\nSegments and pivots revenue by classification for:\n\nCurrent period\n\nLast month\n\nLast year\n\nAggregates totals and applies custom titles for comparison.\n\nMerges all summaries into a final unified JSON report.\n\n6. Customization Options\nReplace DeepSeek with OpenAI or other LLMs.\n\nChange the date fields or cycle comparisons (e.g., quarterly, weekly).\n\nAdd more AI analysis steps such as sentiment scoring or forecasting.\n\nModify the pivot logic to suit specific KPI tags or labels.\n\n7. Troubleshooting Tips\nIf Google Sheets fetch fails: ensure the document is shared with your n8n Google credential.\n\nIf parsing errors: verify that all dates follow the expected format.\n\nSub-workflow must be active and configured to accept the correct inputs (6 dates).\n\n8. SEO Keywords:\nGoogle Sheets report, AI financial report, compare revenue by month, expense analysis automation, chatbot n8n report generator, n8n Google Sheet integration\n\nMore template: https://auton8n.pw/product_info.php?cPath=5&sort=1a&products_id=13",
  "featuredImage": "/data/workflows/6679/6679.webp",
  "author": {
    "id": 101,
    "slug": "duytran82",
    "name": "DuyTran",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 830,
  "downloads": 83,
  "createdAt": "2025-07-30T08:06:27.976Z",
  "updatedAt": "2026-01-16T08:46:25.923Z",
  "publishedAt": "2025-07-30T08:06:27.976Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6679"
}