{
  "id": 11462,
  "slug": "11462",
  "title": "Complete appointment system with Supabase and AI assistants for scheduling & management",
  "description": "## Who’s it for\nThis workflow is designed for organizations or services managing appointments, such as interview scheduling, class enrollments, or client meetings. It’s ideal for users who want to automate appointment creation, rescheduling, cancellation, and data retrieval from a single webhook endpoint.\n\n## How it works / What it does\n● Receives incoming appointment requests via a Webhook node.\n● Processes requests in the Set Fields node, handling multiple actions:\n        • Set Appointment: Adds a new appointment and assigns an available interviewer.\n        • Reschedule: Changes the appointment date based on availability.\n        • Cancel: Deletes an appointment and frees the interviewer’s slot.\n        • Get List: Returns a user’s list of classes.\n        • Get User Info: Retrieves detailed information about a specific user.\nAll actions follow strict instructions to check tables, update rows, and return structured JSON responses.\n\n## How to set up\n1. Add the Webhook node and set the HTTP method to POST.\n2. Connect it to the Set Fields node.\n3. Configure the Set Fields node with the desired assignments (set_appointment, reschedule, cancel, get_list, get_user_info).\n4. Ensure your database tables (interviewers, enrollers) are properly configured and accessible.\n\n## Requirements\n• n8n environment\n• Database or table access for interviewers and enrollers\n• Properly formatted incoming JSON requests with necessary fields (e.g., name, nationality number, preferred date).\n\n## How to customize the workflow\n• Add or modify assignment actions to handle additional appointment scenarios.\n• Adjust table names or database connections based on your environment.\n• Extend JSON responses for custom client-side handling.",
  "featuredImage": "/data/workflows/11462/11462.webp",
  "author": {
    "id": 101,
    "slug": "isight",
    "name": "Optimum Office Solution",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 241,
  "downloads": 24,
  "createdAt": "2025-12-03T13:39:38.057Z",
  "updatedAt": "2026-01-16T09:08:50.554Z",
  "publishedAt": "2025-12-03T13:39:38.057Z",
  "nodes": 49,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11462"
}