{
  "id": 10285,
  "slug": "10285",
  "title": "Send severe weather alerts from Visual Crossing to Telegram",
  "description": "## How it works\nThis workflow automates the process of fetching weather forecasts for your home location, including severe weather alerts, and sends timely notifications. It uses the Visual Crossing API for detailed weather data and integrates with Telegram (or other messaging services) for messaging and alerts.\n\n## Step-by-step\nIn summary, the workflow runs every hour, grabs the current day's weather conditions for [your city/location of interest], and returns only those items that truly contain one or more weather alerts.\n\n📅 Step 1: **Hourly Trigger**\nThe workflow begins with the Hourly Trigger node, which is a scheduleTrigger. This node acts as the clock that initiates the entire process at regular hourly intervals.\n\n🌤️ Step 2: **Fetch Weather Data**\nImmediately after the trigger, the workflow moves to the Meteo node, an httpRequest. This node makes an external API call to fetch weather data for your specified location.\n\nAPI Used: Visual Crossing Web Services\n\nAuthentication: Uses your API key (key=[API KEY])\n\nResponse format: JSON\n\n🌪🌀 Step 3: **Check for Severe Weather**\nThe JSON weather data output is analyzed, and if severe weather conditions or alerts are detected, the workflow sends the alert via your preferred communication channel(s).\n\n## Optional\nYou can replace the Telegram node with email, WhatsApp, SMS notifications, or add multiple notification nodes to receive severe weather alerts across all desired channels.",
  "featuredImage": "/data/workflows/10285/10285.webp",
  "author": {
    "id": 101,
    "slug": "amzneer",
    "name": "Razvan Bara",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 30,
  "downloads": 3,
  "createdAt": "2025-10-29T15:25:56.347Z",
  "updatedAt": "2026-01-16T09:04:18.484Z",
  "publishedAt": "2025-10-29T15:25:56.347Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10285"
}