{
  "id": 9226,
  "slug": "9226",
  "title": "Automate DEI eligibility screening with Azure GPT-4o, Google Drive and Sheets",
  "description": "## Description\nThis workflow is designed to evaluate newly added CVs for Diversity, Equity, and Inclusion (DEI) eligibility. It automatically ingests CVs from Google Drive, extracts key fields, analyzes them with Azure OpenAI, logs structured DEI outcomes in Google Sheets, and sends a concise DEI-focused summary email to the hiring manager. The entire flow prioritizes consistent, auditable DEI checks and controlled logic paths.\n\n## What This Template Does\n- Watches Google Drive for new CV files to trigger DEI evaluation.\n- Downloads and extracts text/structured fields from PDF CVs.\n- Assesses DEI eligibility using Azure OpenAI, following defined criteria and prompts.\n- Appends DEI results (eligible/not eligible, rationale, confidence) to Google Sheets for tracking.\n- Generates and sends a DEI-focused summary email to the hiring manager for review.\n\n## Key Benefits\n- Standardized DEI screening to support equitable hiring decisions.\n- Centralized, structured logging in Sheets for transparency and audits.\n- Automated DEI summaries for faster, consistent manager review.\n- Reliable routing with true/false logic to enforce DEI evaluation steps.\n\n## Features\n- Google Drive trigger (fileCreated) for CV intake tied to DEI checks.\n- PDF extraction mapped to fields relevant for DEI evaluation.\n- Azure OpenAI Chat Model prompts tuned for DEI criteria and rationale.\n- Google Sheets append with eligibility status, notes, and timestamps.\n- Email node that delivers DEI summaries and next-step guidance.\n- Logic branching (true/false) to control DEI evaluation and notifications.\n\n## Requirements\n- n8n instance (cloud or self-hosted).\n- Google Drive access to the CV intake folder.\n- Google Sheets access for DEI results logging.\n- Azure OpenAI access and configured prompts reflecting DEI criteria.\n- Email node credentials to send DEI summaries to managers.\n\n## Step-by-Step Setup Instructions\n- Connect Google Drive and select the CV folder for the fileCreated trigger.\n- Configure the Download CV and Extract From PDF nodes to capture fields needed for DEI checks.\n- Add Azure OpenAI credentials and set DEI-specific prompts (criteria, rationale, confidence).\n- Connect Google Sheets and select the target sheet; map columns for status, rationale, and timestamps.\n- Configure the Email to Manager node with a DEI-focused subject and template.\n- Test with sample CVs, verify sheet entries and email content, then enable the workflow.\n\n## DEI-Focused Best Practices\n- Clarify DEI criteria and document them in your prompt and sheet schema.\n- Avoid including sensitive PII in emails; store only necessary fields for DEI decisions.\n- Use n8n Credentials; never hardcode API keys or private data.\n- Maintain an audit trail (timestamps, model version, prompt version, decision rationale).\n- Periodically review prompts and sheet schema to align with policy updates.",
  "featuredImage": "/data/workflows/9226/9226.webp",
  "author": {
    "id": 101,
    "slug": "rahul08",
    "name": "Rahul Joshi",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 41,
  "downloads": 4,
  "createdAt": "2025-10-03T10:38:40.974Z",
  "updatedAt": "2026-01-16T08:59:33.496Z",
  "publishedAt": "2025-10-03T10:38:40.974Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9226"
}