{
  "id": 10925,
  "slug": "10925",
  "title": "Automated Amazon price monitoring & alerts with Decodo, Google Sheets & Telegram",
  "description": "\n[Sign up for Decodo — get better pricing here](https://visit.decodo.com/MA90zY)\n## Who’s it for\nThis workflow is designed for e-commerce operators, pricing analysts, retail founders, and procurement teams who need reliable, automated price intelligence without manual tracking. If you manage competitive pricing across Amazon or multiple product URLs stored in Google Sheets, this workflow gives you consistent monitoring and automated alerts.\n\n## What it does\nThis automation checks product prices on a schedule, scrapes real-time Amazon data using Decodo, compares it with your baseline price, and routes alerts depending on whether the price increases, stays normal, or drops.\nHigh increases trigger Telegram alerts and automatically create a Google Calendar meeting. Price drops send a rich HTML email to stakeholders. All items are processed in controlled batches to avoid rate limits.\n\n## How it works\n\nReads product URLs + baseline prices from Google Sheets\n\nUses Decodo to extract current Amazon price, title, and product data\n\nCalculates percentage difference via Code node\n\nRoutes items through the Switch node (High / Normal / Low)\n\nSends alerts or emails accordingly\n\nLoops continuously until all rows are processed\n\n## Requirements\n\n\n- Google Sheets, Gmail, Google Calendar, and - Telegram credentials\n- Active Decodo API credentials\n- A sheet containing URL + baseline columns\n\n\n## How to customize\nYou can adjust alert thresholds, add more channels (Slack, WhatsApp, Notion), change batch size, modify email templates, or extend the Google Sheet with additional product metadata. The routing logic is easily expandable for more pricing scenarios.",
  "featuredImage": "/data/workflows/10925/10925.webp",
  "author": {
    "id": 101,
    "slug": "rullysaputra15",
    "name": "Rully Saputra",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 114,
  "downloads": 11,
  "createdAt": "2025-11-17T13:12:01.020Z",
  "updatedAt": "2026-01-16T09:06:50.896Z",
  "publishedAt": "2025-11-17T13:12:01.020Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10925"
}