{
  "id": 9458,
  "slug": "9458",
  "title": "Daily workflow backup to GitLab with Slack notifications",
  "description": "## How it Works\n\nThis workflow creates automated daily backups of your n8n workflows to a GitLab repository:\n\n1. **Scheduled Trigger** - Runs automatically at noon each day to initiate the backup process\n2. **Fetch Workflows** - Retrieves all active workflows from your n8n instance, filtering out archived ones\n3. **Compare & Process** - Checks existing files in GitLab and compares them with current workflows\n4. **Smart Upload** - For each workflow, either updates the existing file in GitLab (if it exists) or creates a new one\n5. **Notification System** - Sends success/failure notifications to a designated Slack channel with execution details\n\n&gt;The workflow intelligently handles each file individually, cleaning up unnecessary metadata before converting workflows to formatted JSON files ready for version control.\n\n## Set up Steps\n\n**Estimated setup time: 15-20 minutes**\n\nYou'll need to configure three credential connections and customize the Configuration node:\n\n- **GitLab API**: Create a project access token with write permissions to your backup repository\n- **n8n Internal API**: Generate an API key from your n8n user settings\n- **Slack Bot**: Set up a Slack app with bot token permissions for posting messages to your notification channel\n\n&gt; Once credentials are configured, update the Configuration node with your GitLab project owner, repository name, and target branch. The workflow includes detailed setup instructions in the sticky notes for each credential type. After setup, activate the workflow to begin daily automated backups.",
  "featuredImage": "/data/workflows/9458/9458.webp",
  "author": {
    "id": 101,
    "slug": "mookielian",
    "name": "Meelioo",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 593,
  "downloads": 59,
  "createdAt": "2025-10-10T08:06:14.229Z",
  "updatedAt": "2026-01-16T09:00:36.364Z",
  "publishedAt": "2025-10-10T08:06:14.229Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9458"
}