{
  "id": 8010,
  "slug": "8010",
  "title": "Automate Twitter posting with GPT-4 content generation & Google Sheets tracking",
  "description": "## This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution for creating an autonomous social media manager. \nThis workflow uses an AI agent to intelligently generate unique, high-quality content, check for duplicates, and post it on a consistent schedule to automate your entire Twitter presence.\n\n## Who's this workflow for?\n- Social Media Managers\n- Marketing Teams & Agencies\n- Startup Founders & Solopreneurs\n- Content Creators\n\n## How it works\n**1. Runs on a Schedule:** The workflow automatically starts at a set interval (e.g., every 6 hours), ensuring a consistent posting schedule.\n\n**2. AI Generates a New Tweet:** An advanced AI Agent, powered by OpenAI, uses a detailed prompt to craft a new, engaging tweet. The prompt defines the tone, topics, character limits, and hashtags.\n\n**3. Checks for Duplicates:** Before finalizing the tweet, the AI Agent is equipped with a tool to read a Google Sheet containing a log of all previously published posts. This allows it to ensure the new content is always unique.\n\n**4. Posts to Twitter (X):** The final, unique tweet is automatically posted to your connected Twitter account.\n\n**5. Logs the New Post:** After posting, the workflow logs the new tweet back into the Google Sheet, updating the history for the next run. This completes the autonomous loop.\n\n## Setup Instructions\n1. Schedule Your Posts: In the Start Workflow (Schedule Trigger) node, set the frequency you want the workflow to run (e.g., every 6 hours).\n\n2. Connect OpenAI:\n- Add your OpenAI API key in the OpenAI Chat Model node.\n- Customize the prompt in the AI Agent node to match your brand's voice, target keywords, and specific URLs.\n\n3. Configure Google Sheets:\n- Connect your Google Sheets account.\n- Create a sheet with two columns: Tweet Content and Status.\n- In both the Get Data from Google Sheet and Add new Tweet to Google sheet nodes, select your credentials and specify the Document ID and Sheet Name.\n\n4. Connect Twitter (X):\n- In the Create Tweet node, connect the Twitter account where you want to post.\n\n5. Activate Workflow:\n- Save the workflow and toggle the \"Active\" switch to ON. Your AI social media manager is now live!\n\n## Key Requirements to Use This Template\nBefore you start, please ensure you have the following accounts and assets ready:\n\n- An n8n Instance: An active n8n account (Cloud or self-hosted) where you can import and run this workflow.\n\n- OpenAI Account: An active OpenAI account with an API Key. You will need to have billing enabled to use the language models for tweet generation.\n\n- Google Account & Sheet: A Google account and a pre-made Google Sheet. The sheet must have two specific columns: Tweet Content and Status.\n\n- Twitter (X) Developer Account: A Twitter (X) account with an approved Developer profile. You need an App created within the Developer Portal with the necessary permissions (v2 API access with Write scopes) to post tweets automatically.\n\n## Connect with us\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n## For Custom Worflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n\n",
  "featuredImage": "/data/workflows/8010/8010.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 886,
  "downloads": 88,
  "createdAt": "2025-08-29T04:24:04.290Z",
  "updatedAt": "2026-01-16T08:53:32.842Z",
  "publishedAt": "2025-08-29T04:24:04.290Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8010"
}