{
  "id": 5161,
  "slug": "5161",
  "title": "Enrich LinkedIn profiles with Ghost Genius and Google Sheets (no account needed)",
  "description": "# LinkedIn Profile Enrichment Automation\n\n**Who is this for?**\nThis template is perfect for sales teams, recruiters, marketing professionals, and business development specialists who need to gather comprehensive LinkedIn profile data at scale. Ideal for lead generation teams building prospect databases, recruiters sourcing candidate information, sales professionals researching prospects, and marketing teams creating targeted outreach campaigns.\n\n**What problem does this workflow solve?**\nManually collecting detailed information from LinkedIn profiles is incredibly time-consuming and prone to inconsistency. Visiting each profile individually to extract names, job titles, experience, education, skills, and contact details can take hours for even small prospect lists. This automation eliminates the tedious manual data entry while ensuring consistent, comprehensive profile enrichment.\n\n**What this workflow does**\nThis workflow automatically enriches a list of LinkedIn profile URLs by extracting comprehensive professional data including:\n* **Personal details** (first name, last name, headline, location)\n* **Professional status** (hiring status, open to work indicators)\n* **Network metrics** (connections, followers count)\n* **Work experience** (up to 5 most recent positions with company details, dates, and roles)\n* **Education background** (up to 3 educational institutions with degrees and dates)\n* **Skills and languages** (complete skill sets and language proficiencies)\n* **Professional summary** (profile description and bio)\n\nThe enriched data is automatically organized and updated in your Google Sheets database with structured formatting for easy analysis and outreach.\n\n**Setup**\n1. **Create a Ghost Genius API account** and obtain your API key for cookieless LinkedIn profile scraping\n2. **Configure HTTP Request credentials** with Header Auth using your Ghost Genius API key\n3. **Set up your Google Sheets database** using the provided template with columns:\n   * URL, Firstname, Lastname, Tagline, Location\n   * Connections, Followers, Hiring?, Open to work?\n   * Summary, Languages, Skills\n   * Experience 1-5, Education 1-3\n4. **Configure Google Sheets OAuth2 credentials** following n8n's authentication setup guide\n5. **Add LinkedIn profile URLs** to the first column of your Google Sheet to begin enrichment\n6. **Test the workflow** with a small batch before processing larger lists\n\n**How to customize this workflow**\n* **Adjust batch processing settings** to handle larger volumes by modifying the batch size and interval timing\n* **Add data validation rules** to filter out incomplete or invalid profiles before processing\n* **Integrate with CRM systems** like HubSpot or Salesforce to automatically sync enriched data\n* **Set up automated scheduling** to regularly re-enrich profiles and capture profile updates\n* **Add email notifications** to alert when enrichment batches are completed or encounter errors\n* **Customize data mapping** to include additional profile fields or reorganize the output structure\n* **Add duplicate detection** to prevent re-processing the same profiles multiple times",
  "featuredImage": "/data/workflows/5161/5161.webp",
  "author": {
    "id": 101,
    "slug": "yaznow",
    "name": "Matthieu",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 551,
  "downloads": 55,
  "createdAt": "2025-06-23T17:03:19.850Z",
  "updatedAt": "2026-01-16T08:38:01.350Z",
  "publishedAt": "2025-06-23T17:03:19.850Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5161"
}