{
  "id": 10413,
  "slug": "10413",
  "title": "AI-powered content analysis with Decodo scraping & GPT-4o insights",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# AI-Powered Content Analysis System\n\nElevate your content quality with this AI-powered Content Analysis System!  \nThis workflow automatically evaluates website content using advanced scraping and AI analysis, providing comprehensive SEO insights, readability scores, and actionable improvement recommendations. Perfect for content teams ensuring optimal performance and engagement across digital properties.\n\n## What This Template Does\n1. Triggers via form submission for on-demand content analysis requests.  \n2. Checks previous analyses to prevent duplicate processing.  \n3. Scrapes target URLs using Decodo for comprehensive content extraction.  \n4. Uses AI to evaluate content quality, SEO effectiveness, and readability.  \n5. Saves analysis results to Google Sheets for historical tracking.  \n6. Generates professional Google Docs reports with actionable insights.  \n7. Sends email notifications with formatted analysis summaries.  \n8. Alerts teams via Slack for both normal and urgent findings.  \n9. Creates remediation plans and Trello tasks for low-quality content.\n\n## Key Benefits\n- Automated content quality assessment with AI-powered insights  \n- Prevents duplicate analyses to optimize resource usage  \n- Comprehensive SEO and readability scoring for data-driven decisions  \n- Professional reporting with Google Docs and email integration  \n- Immediate team alerts for urgent content improvements  \n- Historical tracking and trend analysis capabilities  \n\n## Features\n- Form-based trigger for easy content analysis requests  \n- Duplicate detection and prevention system  \n- AI-powered content evaluation using GPT-4o  \n- Real-time web scraping with Decodo integration  \n- Automated Google Docs report generation  \n- Multi-channel notifications (Slack, Gmail)  \n- Quality threshold monitoring and alerting  \n- Remediation plan generation for low-quality content  \n- Trello integration for task management  \n- Historical analysis database in Google Sheets  \n\n## Requirements\n- OpenAI API credentials for AI analysis  \n- Decodo API credentials for web scraping  \n- Google Sheets OAuth2 credentials with edit access  \n- Google Docs OAuth2 credentials for report generation  \n- Gmail OAuth2 credentials for email notifications  \n- Slack Bot Token with chat:write permission  \n- Trello credentials (optional for task management)  \n- Environment variables for configuration settings  \n\n## Target Audience\n- Content marketing and strategy teams  \n- SEO specialists and digital marketers  \n- Content quality assurance teams  \n- Digital agencies managing multiple clients  \n- Website owners and publishers  \n- Content operations managers  \n\n## Step-by-Step Setup Instructions\n1. Connect OpenAI credentials for AI content analysis capabilities  \n2. Set up Decodo API credentials for web scraping functionality  \n3. Configure Google Sheets with required analysis headers  \n4. Add Google Docs credentials for automated report generation  \n5. Set up Gmail and Slack credentials for notifications  \n6. Optional: Configure Trello integration for task management  \n7. Customize the analysis form with your industry and focus areas  \n8. Test with sample URLs to verify all integrations and data flow  \n9. Deploy for ongoing content quality monitoring and optimization  \n\n**Pro Tip:** Use coupon code \"YARON\" to get 23K requests for testing the workflow with the Decodo scraper\n\nThis workflow ensures your content maintains high quality standards with automated analysis, professional reporting, and immediate improvement alerts!\n",
  "featuredImage": "/data/workflows/10413/10413.webp",
  "author": {
    "id": 101,
    "slug": "yaron-nofluff",
    "name": "Yaron Been",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 139,
  "downloads": 13,
  "createdAt": "2025-11-01T17:23:20.342Z",
  "updatedAt": "2026-01-16T09:04:56.600Z",
  "publishedAt": "2025-11-01T17:23:20.342Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10413"
}