{
  "id": 9203,
  "slug": "9203",
  "title": "Add user authorization layer to your Telegram bot with admin alerts",
  "description": "# 🛡️ BotGuard - Telegram Bot Authorization Layer\n\n## What This Workflow Does\n\nEver noticed how most Telegram bot tutorials assume everyone can just... use your bot? No questions asked, no protection, nothing. That's fine for a simple \"Hello World\" bot, but the moment you connect AI APIs, paid services, or sensitive operations - you're in trouble. Anyone who discovers your bot can drain your API credits, overload your systems, or access things they shouldn't.\n\nBotGuard fixes this in the simplest way possible: a whitelist. Only User IDs you explicitly allow can interact with your bot. Everyone else gets a polite \"access denied\" message. Plus, you get instant notifications when someone unauthorized tries to use your bot - complete with their User ID, so you can add them if they're legit.\n\nThink of it as a bouncer for your bot. No fancy authentication flows, no databases, no complexity. Just a clean authorization check that sits between the Telegram trigger and your actual workflow. Your expensive AI calls, paid API requests, and sensitive operations stay protected.\n\n## 🚀 Getting Started in 2 Minutes\n\n### Step 1: Import and Configure\nImport this workflow into n8n and connect your Telegram bot credentials. You'll see a clean workflow with sticky notes explaining everything.\n\n### Step 2: Add Your User ID\nDon't know your Telegram User ID? No problem. Just message your bot - you'll get denied, but the message will show: `Your User ID: 123456789`. Copy that number.\n\nOpen the \"BotGuard Authorization\" node and add yourself:\n```javascript\nconst AllowedUsers = [\n  { userId: 222222222, userName: 'allowed_user_name', subscriptionType: 'admin' },\n  { userId: YOUR_USER_ID_HERE, userName: 'your_username', subscriptionType: 'premium' }\n];\n```\n\n### Step 3: Test It\nSave, activate the workflow, and message your bot again. You're in! Try from another account - denied. Check your admin account for the unauthorized access notification.\n\n## 🎨 Making It Yours\n\n### Want to Change the Messages?\nAll user-facing messages are in the BotGuard Authorization node. Look for these lines:\n- `authorizedMessage` - What approved users see (default: \"✅ Authorization Successful...\")\n- `userMessage` - What denied users see (default: \"🚫 Access Denied...\")\n- `adminMessage` - What you receive for each unauthorized attempt\n\nMake them friendlier, add your support contact, suggest a `/request` command - whatever fits your bot's personality.\n\n### Need Subscription Tiers?\nThe workflow already supports it! Each user has a `subscriptionType` field (basic/premium/admin). Use this in your main workflow to enable/disable features based on their tier. The BotGuard passes all this data forward in the `botGuard` object.\n\n### Want Multiple Admins?\nJust add more entries to the `Administrators` array. Every admin receives notifications when unauthorized users attempt access:\n```javascript\nconst Administrators = [\n  { userId: 111111111, userName: 'admin_user_name', chatId: 111111111 },\n  { userId: 333333333, userName: 'your_cofounder', chatId: 333333333 }\n];\n```\n\n## 💡 Why This Workflow Exists\n\nI built this after watching someone's OpenAI credits get drained in 3 hours because their bot went viral on a Telegram group. No authorization, no rate limiting, nothing. Just a helpful bot that cost them $200 before they noticed.\n\nMost tutorials skip authorization entirely - it's not sexy, not what people want to learn. But the moment you deploy something real, you need it. Instead of everyone reinventing the wheel with complex databases and auth systems, here's a simple pattern you can copy-paste into any bot workflow.\n\nThe multi-admin notification system came from needing to know WHO was trying to access our bots. Sometimes it's legitimate users who found your bot organically. Sometimes it's automated scanners. Either way, if you want to know, now you can.\n\n## 🔧 Real-World Tips\n\nAfter protecting dozens of production bots:\n\n**Do:**\n- Keep the User ID list in code for small teams (5-50 users) - it's simple and works\n- Set up admin notifications - you'll catch legitimate users before they give up\n- Include the User ID in denial messages - makes it easy for users to request access\n- Test with an unauthorized account first - make sure the denial flow is clear\n\n**Don't:**\n- Hard-code thousands of users - if you're that big, use a database instead\n- Skip the admin notifications - they're your early warning system\n- Forget to update the placeholder IDs (111111111, etc.) - those won't work!\n- Share your workflow publicly with real User IDs - privacy matters",
  "featuredImage": "/data/workflows/9203/9203.webp",
  "author": {
    "id": 101,
    "slug": "relishev",
    "name": "Ruslan Elishev",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 691,
  "downloads": 69,
  "createdAt": "2025-10-02T19:09:19.430Z",
  "updatedAt": "2026-01-16T08:59:28.287Z",
  "publishedAt": "2025-10-02T19:09:19.430Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9203"
}