{
  "id": 2985,
  "slug": "2985",
  "title": "AI-powered chatbot workflow with MySQL database integration",
  "description": "# AI-Powered Chatbot Workflow with MySQL Integration\n\nThis guide shows you how to deploy a chatbot that lets you query your database using natural language. You will build a system that accepts chat messages, retains conversation history, constructs dynamic SQL queries, and returns responses generated by an AI model. By following these instructions, you will have a working solution that integrates n8n’s AI Agent capabilities with MySQL.\n\n---\n\n## Prerequisites\n\nBefore you begin, ensure that you have the following:\n\n1. An active n8n instance (self-hosted or cloud) running version 1.50.0 or later.\n2. Valid MySQL credentials configured in n8n.\n3. API credentials for the Groq Chat Model (or your preferred AI language model).\n4. Basic familiarity with SQL and n8n node concepts such as chat triggers and memory buffers.\n5. Access to the [n8n Docs on AI Agents](https://docs.n8n.io/advanced-ai/) for further reference.\n\n---\n\n## Workflow Setup\n\n### 1. Chat Interface & Trigger\n\n- **When Chat Message Received**  \n  This node listens for incoming chat messages via a webhook. When a message arrives, it triggers the workflow immediately.\n\n### 2. Conversation Memory\n\n- **Chat History**  \n  This memory buffer node stores the last 10 interactions. It supplies conversation context to the AI Agent, ensuring that responses consider previous messages.\n\n### 3. AI Agent Core\n\n- **AI Agent (Tools Agent)**  \n  The AI Agent node orchestrates the conversation by receiving the chat input and conversation history. It dynamically generates SQL queries based on your requests and coordinates calls to external tools (such as MySQL nodes).\n\n### 4. Database Interactions\n\n- **MySQL Node**  \n  This node executes the SQL query generated by the AI Agent. You reference the query using an expression (e.g., `{{$node[\"AI Agent\"].json.sql_query}}`), allowing the agent’s output to control data retrieval.\n\n- **MySQL Schema Node**  \n  This node retrieves a list of base tables from your MySQL database (excluding system schemas). The agent uses this information to understand the available tables.\n\n- **MySQL Definition Node**  \n  This node fetches detailed metadata (such as column names, data types, and relationships) for a specific table. The table and schema names are supplied dynamically by the AI Agent.\n\n### 5. Language Model Processing\n\n- **Groq Chat Model**  \n  This node connects to the Groq Chat API to generate text completions. It processes the combined input (chat message, context, and data fetched from MySQL) and produces the final response.\n\n### 6. Guidance & Customization\n\n- **Sticky Notes**  \n  These nodes provide guidance on:\n  - Switching the chat model if you wish to use another provider (e.g., OpenAI or Anthropic).\n  - Adjusting the maximum token count per interaction.\n  - Customizing the SQL queries and the context window size.\n  \nThey help you modify the workflow to suit your environment and requirements.\n\n### Workflow Connections\n\n- The **Chat Trigger** passes the incoming message to the **AI Agent**.\n- The **Chat History** node supplies conversation context to the AI Agent.\n- The **AI Agent** calls the MySQL nodes as external tools, generating and sending dynamic SQL queries.\n- The **Groq Chat Model** processes the consolidated input from the agent and outputs the natural language response delivered to the user.\n\n### Testing the Workflow\n\n1. Send a chat message using the chat interface.\n2. Observe how the AI Agent processes the input and generates a corresponding SQL query.\n3. Verify that the MySQL nodes execute the query and return data.\n4. Confirm that the Groq Chat Model produces a coherent natural language response.\n5. Refer to the sticky notes for guidance if you need to fine-tune any node settings.\n\n---\n\n## Next Steps and References\n\n- **Customize Your AI Model**  \n  Replace the Groq Chat Model with another language model (such as the OpenAI Chat Model) by updating the node credentials and configuration.\n\n- **Enhance Memory Settings**  \n  Adjust the Chat History node’s context window to retain more or fewer messages based on your needs.\n\n- **Modify SQL Queries**  \n  Update the SQL queries in the MySQL nodes to match your specific database schema and desired data.\n\n- **Further Reading**  \n  Consult the [n8n Docs on AI Agents](https://docs.n8n.io/advanced-ai/) for additional details and examples to expand your workflow’s capabilities.\n\n- **Set Up a Website Chatbot**\n  Copy & Paste and replace the placeholders in the following code to embed the chatbot into your personal or company's website: [View in CodePen 🡥](https://codepen.io/olemai/pen/RNwPdVp)\n\n---\n\nBy following these steps, you will deploy a robust AI chatbot workflow that integrates with your MySQL database, allowing you to query data using natural language.\n",
  "featuredImage": "/data/workflows/2985/2985.webp",
  "author": {
    "id": 101,
    "slug": "gegenfeld",
    "name": "Gegenfeld",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 6726,
  "downloads": 672,
  "createdAt": "2025-02-23T06:09:53.667Z",
  "updatedAt": "2026-01-16T08:27:31.249Z",
  "publishedAt": "2025-02-23T06:09:53.667Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2985"
}