{
  "id": 12205,
  "slug": "12205",
  "title": "Escalate product UAT critical bugs with OpenAI, Jira and Slack",
  "description": "## Description\n\nAutomatically detect and escalate Product UAT critical bugs using AI, create Jira issues, notify engineering teams, and close the feedback loop with testers.\n\nThis workflow analyzes raw UAT feedback submitted via a webhook, classifies it with an AI model, validates severity, and automatically escalates confirmed critical bugs to Jira and Slack. Testers are notified, and the original webhook receives a structured response for full traceability.\n\nIt is designed for teams that want fast, reliable critical bug handling during UAT without manual triage.\n\n## Context\n\nDuring Product UAT and beta testing, critical bugs are often buried in unstructured feedback coming from forms, Slack, or internal tools.\n\nMissing or delaying these issues can block releases and create friction between Product and Engineering.\n\nThis workflow ensures:\n\n- Faster detection of critical bugs\n\n- Immediate escalation to engineering\n\n- Clear ownership and visibility\n\n- Consistent communication with testers\n\nIt combines AI-based classification with deterministic routing to keep UAT feedback actionable and production-ready.\n\n## Who is this for?\n\n- Product Managers running UAT or beta programs\n\n- Project Managers coordinating QA and release readiness\n\n- Engineering teams who need fast, clean bug escalation\n\n- Product Ops teams standardizing feedback workflows\n\n- Any team handling high-volume UAT feedback\n\n- Perfect for teams that want speed, clarity, and traceability during UAT.\n\n## Requirements\n\n- Webhook trigger (form, Slack integration, internal tool, etc.)\n\n- OpenAI account (for AI triage)\n\n- Jira (critical bug tracking)\n\n- Slack (engineering alerts)\n\n- Gmail or Slack (tester notifications)\n\n## How it works\n![image.png](fileId:3834)\n- Trigger\nThe workflow starts when UAT feedback is submitted via a webhook.\n\n- Normalize & Clean\nIncoming data is normalized (tester, build, page, message) and cleaned to ensure a consistent, AI-ready structure.\n\n- AI Triage & Validation\nAn AI model analyzes the feedback and returns a structured triage result (type, severity, summary, confidence), which is parsed and validated.\n\n- Critical Bug Escalation\nValidated critical bugs automatically:\n\n\t- create a Jira issue with full context\n\n\t- trigger an engineering Slack alert\n\n- Closed Loop\nThe tester is notified via Slack or email, and the workflow responds to the original webhook with a structured status payload.\n\n## What you get\n\n- Automated critical bug detection during UAT\n\n- Instant Jira ticket creation\n\n- Real-time engineering alerts in Slack\n\n- Automatic tester communication\n\n- Full traceability via structured webhook responses\n\n## About me :\nI’m Yassin a Product Manager  Scaling tech products with a data-driven mindset.\n📬 Feel free to connect with me on [Linkedin](https://www.linkedin.com/in/yassin-zehar)\n",
  "featuredImage": "/data/workflows/12205/12205.webp",
  "author": {
    "id": 101,
    "slug": "yassinzehar",
    "name": "Yassin Zehar",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 20,
  "downloads": 2,
  "createdAt": "2025-12-27T10:54:26.324Z",
  "updatedAt": "2026-01-16T09:11:44.326Z",
  "publishedAt": "2025-12-27T10:54:26.324Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12205"
}