{
  "id": 6004,
  "slug": "6004",
  "title": "Daily Google Search Console SEO pulse: Catch top movers across keyword segments",
  "description": "### This workflow helps SEO teams catch top movers in Google Search Console by comparing daily performance across keyword segments like brand, nonbrand, and content categories. \n\nInstead of serving as a routine check, it highlights the queries and pages with the biggest jumps or drops, making it ideal for spotting wins, losses, or unexpected shifts early.\n\n### How It Works\n1. Runs daily on a scheduled trigger (e.g. every morning).\n2. Pulls GSC data for the prior two days (e.g. yesterday vs. day before).\n3. Segments traffic by keyword type or URL pattern (e.g. brand, nonbrand, recipes, blogs, etc.).\n4. Calculates changes in clicks, impressions, CTR, and average position.\n5. Flags top movers with the biggest positive or negative deltas.\n6. Sends structured reports via Slack or email, grouped by segment and sorted by impact.\n\n### Setup Steps\n- Connect your Google Search Console account and optionally Gmail or Slack.\n- Swap in your own domain(s) and customize segmentation logic (e.g. brand terms, path filters).\n- By default, the workflow includes Slack alerts, but these can be easily switched to or combined with email, webhook, or other channels.\n- Full setup takes around 15–20 minutes with working GSC credentials.\n\n*Note: The “recipes” segment is included as an example of how to segment content. This can be changed to match blog, FAQ, product pages, or any other category.*",
  "featuredImage": "/data/workflows/6004/6004.webp",
  "author": {
    "id": 101,
    "slug": "the-curious-automator",
    "name": "MattF",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 437,
  "downloads": 43,
  "createdAt": "2025-07-14T16:42:30.988Z",
  "updatedAt": "2026-01-16T08:42:38.223Z",
  "publishedAt": "2025-07-14T16:42:30.988Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6004"
}