{
  "id": 4086,
  "slug": "4086",
  "title": "Ai agent to chat with files in Supabase Storage and Google Drive",
  "description": "### Video Guide\n\nI prepared a detailed guide that illustrates the entire process of building an AI agent using Supabase and Google Drive within N8N workflows.\n\n[![Youtube Thumbnail](https://res.cloudinary.com/de9jgixzm/image/upload/rv0bmq7vr691gfmqn3yw)](https://youtu.be/NB6LhvObiL4)\n\n[Youtube Link](https://youtu.be/NB6LhvObiL4)\n\n### Who is this for?\nThis workflow is designed for developers, data scientists, and business users who wish to automate document management and enable AI-powered interactions over their stored files. It's especially beneficial for scenarios where users need to process, analyze, and retrieve information from uploaded documents rapidly.\n\n### What problem does this workflow solve?\nManaging files across multiple platforms often involves tedious manual processes. This workflow facilitates automated file handling, making it easier for users to upload, parse, and interact with documents through an AI agent. It reduces redundancy and enhances the efficiency of data retrieval and management tasks.\n\n### What this workflow does\nThis workflow integrates Supabase storage with Google Drive and employs an AI agent to manage files effectively. The agent can:\n- Upload files to Supabase storage and activate processes based on file changes in Google Drive.\n- Retrieve and parse documents, converting them into a structured format for easy querying.\n- Utilize an AI agent to answer user queries based on saved document data.\n\n1. **Data Collection**: The workflow initially gathers files from Supabase storage, ensuring no duplicates are processed in the 'files' table.\n2. **File Handling**: It processes files to be parsed based on their type, leveraging LlamaParse for effective data transformation.\n3. **Google Drive Integration**: The workflow monitors a designated Google Drive folder to upload files automatically and refresh document records in the database with new data.\n4. **AI Interaction**: A webhook is established to enable the AI agent to converse with users, facilitating queries and leveraging stored document knowledge.\n\n### Setup\n\n1. **Supabase Storage Setup**:\n   - Create a private bucket in Supabase storage, modifying the default name in the URL.\n   - Upload your files using the provided upload options.\n\n2. **Database Configuration**:\n   - Establish the 'file' and 'document' tables in Supabase with the necessary fields.\n   - Execute any required SQL queries for enabling vector matching features.\n\n3. **N8N Workflow Logic**:\n   - Start with a manual trigger for the initial workflow segment or consider alternative triggers like webhooks.\n   - Replace all relevant credentials across nodes with your own to ensure seamless operation.\n\n4. **File Processing and Google Drive Monitoring**:\n   - Set up file processing to take care of downloading and parsing files based on their types.\n   - Create triggers to monitor the designated Google Drive folder for file uploads and updates.\n\n5. **Integrate AI Agent**:\n   - Configure the webhook for the AI agent to accept chat inputs while maintaining session context for enhanced user interactions.\n   - Utilize PostgreSQL to store user interactions and manage conversation states effectively.  \n\n6. **Testing and Adjustments**:\n   - Once everything is set up, run tests with the AI agent to validate its responses based on the documents in your database.\n   - Fine-tune the workflow and AI model as needed to achieve desired performance.",
  "featuredImage": "/data/workflows/4086/4086.webp",
  "author": {
    "id": 101,
    "slug": "lowcodingdev",
    "name": "Mark Shcherbakov",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 8707,
  "downloads": 870,
  "createdAt": "2025-05-15T20:44:33.064Z",
  "updatedAt": "2026-01-16T08:32:58.624Z",
  "publishedAt": "2025-05-15T20:44:33.064Z",
  "nodes": 62,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4086"
}