{
  "id": 4882,
  "slug": "4882",
  "title": "Ai prospect researcher +ISCP only need company name and domain",
  "description": "# AI Prospect Researcher +ISCP only from Domain and Company Name \n\n## This workflow finds available email addresses, researches the company using public data (LinkedIn, website scraping, etc.), calculates the ISCP score, and delivers a complete, ready-to-use report.\n\nThis workflow is designed for professionals and teams seeking to scale their B2B research with comprehensive company intelligence. It automates the full prospect analysis process — from extracting contact data and scraping website content to gathering market insights and generating structured reports with GPT-4.\n\nUsing a combination of Hunter.io, Perplexity AI, Airtop, and OpenAI, this system creates a detailed Google Doc profile for each company, complete with decision-maker identification and ISCP scoring. Whether you're conducting market research, qualifying leads, or preparing investor briefings — this tool delivers actionable business intelligence in minutes, without manual data collection.\n\nThe process is battle-tested, with built-in error handling, and suitable for sales teams, market researchers, or founders conducting competitive analysis.\n\n## How it works\n\nOnce triggered (via form or spreadsheet), the workflow:\n1. Uses Hunter.io to discover professional emails associated with the domain\n2. Leverages Perplexity AI to gather web-wide company intelligence and industry context\n3. Scrapes the company website using Airtop to extract services, products, and key pages\n4. Optionally enriches with LinkedIn data via Apify (company size, specialties)\n5. Processes all inputs through GPT-4 to:\n   - Generate an executive summary\n   - Identify potential decision-makers\n   - Calculate an Ideal Service Customer Profile (ISCP) match score\n6. Produces a finalized report in Google Docs with:\n   - Company overview\n   - Key contacts\n   - Market positioning\n   - Recommended outreach approach\n\nThis is a turnkey solution for teams who need deep company profiles without the hours of manual research and data stitching.",
  "featuredImage": "/data/workflows/4882/4882.webp",
  "author": {
    "id": 101,
    "slug": "lukaszb",
    "name": "LukaszB",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 621,
  "downloads": 62,
  "createdAt": "2025-06-11T20:46:18.131Z",
  "updatedAt": "2026-01-16T08:36:44.255Z",
  "publishedAt": "2025-06-11T20:46:18.131Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4882"
}