{
  "id": 6812,
  "slug": "6812",
  "title": "Generate YouTube SEO content & thumbnail from video scripts with GPT-4o & Runway",
  "description": "## Who’s it for\nThis template is ideal for YouTube video creators who spend a lot of time manually generating SEO assets like descriptions, tags, titles, keywords, and thumbnails. If you're looking to automate your YouTube SEO workflow, this is the perfect solution for you.\n\n## How it works / What it does\nConnect a Google Sheet to n8n and pull in the Hindi script (or any language).\nUse OpenAI to generate SEO content:\n- Video description\n- Tags\n- Keywords\n- Titles\n- Thumbnail titles etc.\n\nUse the generated description as input to create a thumbnail image using an image generation API.\nStore all outputs in the same Google Sheet in separate columns.\nOptionally, use tools like VidIQ or TubeBuddy to test the SEO strength of generated titles, tags, and keywords.\n```\n💡 Note: This example uses Runway’s image generation API, but you can plug in any other image-generation service of your choice.\n\n```\n## Requirements\n1. A Google Sheet with clearly named columns\n2. Hindi, English, or other language scripts in the sheet\n3. OpenAI API key\n4. Runway API key (or any other image generation API)\n\n## How to set up\n- You can set up this workflow in 15 minutes by following the pre-defined steps.\n- Replace the manual Google Sheet trigger with a scheduled trigger for daily or timed automation.\n- You may also swap Google Sheets with any database or data source of your choice.\n- No Google Sheets API required.\n- Requires minimal JavaScript or Python knowledge for advanced customizations.",
  "featuredImage": "/data/workflows/6812/6812.webp",
  "author": {
    "id": 101,
    "slug": "dolphyai",
    "name": "Janak Patel",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1381,
  "downloads": 138,
  "createdAt": "2025-08-01T14:22:24.399Z",
  "updatedAt": "2026-01-16T08:47:08.655Z",
  "publishedAt": "2025-08-01T14:22:24.399Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6812"
}