{
  "id": 8538,
  "slug": "8538",
  "title": "Post long-form threads to X / Twitter, Threads, and Bluesky",
  "description": "## Description\nFully automated pipeline where you send an email to yourself with a rough idea (subject contains “thread”), n8n’s Gmail trigger picks it up, OpenAI ChatGPT rewrites/apply a viral-thread template, and Blotato posts the long-form thread to X/Twitter, Bluesky, and Meta Threads (optionally schedule or include images/videos). Template is easily extensible to other social platforms.\n\n## Who Is This For?\nDigital creators, content marketers, social media managers, agencies, entrepreneurs, and influencers who want fast, automated long-form thread posting.\n\n## 📄 Documentation\n[Full Step-by-Step Tutorial](https://help.blotato.com/api/templates/2-email-to-long-form-thread)\n\n## How It Works\n\n**1. Trigger: Gmail**\n- Connect your Gmail account.\n- n8n monitors emails sent from you and filters for subjects containing the word “thread”.\n\n**2. AI Thread Writer: OpenAI ChatGPT**\n- Connect your OpenAI account.\n- Prompt ChatGPT to clean up your draft and format a long-form viral thread.\n\n**3. Publish to Social Media via Blotato**\n- Connect your Blotato account and choose social accounts (X/Twitter, Threads, Bluesky).\n- Schedule or post immediately.\n- Supports optional image/video URLs via a `mediaUrls` array (publicly accessible URLs).\n\nExample email to trigger the workflow:\n\n**Email Subject:** thread\n**Email Body:** I'm obsessed with voice AI apps. Super Whisper is my current favorite because it runs locally and keeps my voice data private. I talk to it instead of typing. Way faster.\n\n## Setup & Required Accounts\n- Gmail account (used as trigger)\n  - n8n Gmail OAuth doc: https://docs.n8n.io/integrations/builtin/credentials/google/oauth-single-service\n- OpenAI Platform account (access to ChatGPT)\n- Blotato account: https://blotato.com\n  - Generate Blotato API Key: Settings &gt; API &gt; Generate API Key (paid feature only)\n  - Sign in to Blotato and create an API Key (required for posting)\n- n8n:\n  - Ensure \"Verified Community Nodes\" enabled in your n8n Admin Panel\n  - Install the \"Blotato\" community node and create Blotato credentials\n\n## Optional: Media & Style Tweaks\n- Attach images/videos: insert publicly accessible URLs into the `mediaUrls` array (advanced).\n- To emulate a specific tone/structure, provide ChatGPT examples of your favorite viral threads or replace the example viral-thread prompt with your preferred example.\n- Voice-to-text tip: record ideas (e.g., Superwhispr) and send the transcript by email — ChatGPT will clean it up.\n\n## Tips & Tricks\n- During testing, use “Scheduled Time” in Blotato instead of immediate posting to preview before going live.\n- Start with a single social platform while testing.\n- If your script is long or includes media, processing may take longer.\n- Many users prefer speaking their ideas (voice notes) then letting AI edit — faster than typing.\n\n## Troubleshooting\nCheck your [Blotato API Dashboard](https://my.blotato.com/api-dashboard) to inspect each request, response, and error. Confirm API key validity, n8n node credentials, and that emails sent have subject containing “thread”.\n\n## Need Help?\nIn the Blotato web app, click the orange support button in the bottom right to access Blotato support.",
  "featuredImage": "/data/workflows/8538/8538.webp",
  "author": {
    "id": 101,
    "slug": "sabrina-ramonov",
    "name": "Sabrina Ramonov 🍄",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 264,
  "downloads": 26,
  "createdAt": "2025-09-12T16:02:03.328Z",
  "updatedAt": "2026-01-16T08:56:23.134Z",
  "publishedAt": "2025-09-12T16:02:03.328Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8538"
}