{
  "id": 12447,
  "slug": "12447",
  "title": "Extract text from PDFs and images in Google Drive and post to WordPress and social media with OpenAI GPT-4.1 and DALL·E",
  "description": "## Who is this for?\nThis workflow is designed for content creators, social media managers, digital marketers, and business owners who want to automate their content creation and distribution process across multiple platforms. It's perfect for those who regularly create content from PDFs or images and want to streamline their social media posting workflow.\n\n## Key Features\n* Monitors a specific Google Drive folder for new PDFs or images\n* Extracts text from PDFs or images using AI\n* Optionally generates new images from text using OpenAI's DALL-E\n* Automatically posts content with images to multiple platforms\n* Sends notifications about successful posts\n* Handles different file types with specialized extraction methods\n\n## Workflow Does\nThis workflow automates monitoring a Google Drive folder for new PDFs and images, extracting content using AI, and distributing it across social media platforms like WordPress, Facebook, Telegram, LinkedIn, and Discord. It can also generate new images from text and sends notifications about successful posts. The process ensures efficient handling of different file types and streamlines content sharing across multiple channels.\n\n## Requirements\n- Google Drive account with a dedicated folder for content\n- OpenAI API credentials for image generation\n- WordPress API credentials for website posting\n- Social media API credentials:\n  * Facebook Graph API\n  * Telegram Bot API\n  * LinkedIn OAuth2 API\n  * Discord Bot API\n  * X/Twitter OAuth2 API\n- Gmail credentials for email notifications\n- Rapiwa account for WhatsApp notifications\n\n## Important Notes\n- Make sure all API credentials are properly configured before running the workflow\n- The workflow handles both PDF and image files differently based on their MIME type\n- Image generation is optional and can be disabled if not needed\n- All social media posting nodes can be individually enabled or disabled based on your needs\n- The workflow includes rate limiting to avoid API restrictions\n\n\n## Support & Help\n- **WhatsApp**: [Chat on WhatsApp](https://wa.me/8801322827799)\n- **Discord**: [SpaGreen Community](https://discord.gg/SsCChWEP)\n- **Facebook Group**: [SpaGreen Support](https://www.facebook.com/groups/spagreenbd)\n- **Website**: [https://spagreen.net](https://spagreen.net)\n- **Developer Portfolio**: [Codecanyon SpaGreen](https://codecanyon.net/user/spagreen/portfolio)",
  "featuredImage": "/data/workflows/12447/12447.webp",
  "author": {
    "id": 101,
    "slug": "spagreen",
    "name": "SpaGreen Creative",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 45,
  "downloads": 4,
  "createdAt": "2026-01-04T09:39:16.673Z",
  "updatedAt": "2026-01-16T09:12:27.074Z",
  "publishedAt": "2026-01-04T09:39:16.673Z",
  "nodes": 44,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12447"
}