{
  "id": 4505,
  "slug": "4505",
  "title": "Automate meeting prep & lead enrichment with Bright Data, Cal.com & Airtable",
  "description": "This workflow makes it easier to prepare for meetings and calls by researching your lead right before the call and creates a high-level meeting prep that is sent to your email. This removes the extra steps needed by teams to learn their leads, research, and prepare for the upcoming calls.\n\n\n## How does it work\n\nThis workflow starts when We Capture the webhook from cal.com for new bookings.\n\nEnsure you have a field on the form to collect LinkedIn posts. This can be optional or mandatory depending on your preferences.\n\nWhen a new event is booked, we will add the leads to an Airtable CRM for appointments and new bookings. This table will contain all the items and items needed to enrich and maintain your CRM.\n\nIf the lead has linkedin then we do research on LinkedIn for their content and posts and perform a lead enrichment to get as much info as we can about the leads and create a new meeting prep.\n\n## What you need\n1. Bright data API\n2. Cal.com account/calendar. Other calendars can be used too for this eg calendly, Google Calendar, etc with a few tweaks\n3. CRM - This can be anything not just airtable\n\n\n## Setting it up\n1. Create/update your calendar to allow collecting users LinkedIn profiles/bios\n2. Add a new webhook to and subscribe to the desired events like below\n![image.png](fileId:1420)\n\n\n3. Map the fields from the webhook to match your CRM. If you have no CRM make a copy of this [Airtable CRM](https://airtable.com/appiSZ70ow7uVxv7t/shrvmFKqRYGX6iUZY) and map the fields to your account. We will be using the Base and table ID to make the mapping easier\n4.  Setup your Bright Data API and select the data source as linkedin for the scraping\n5. You can edit more data on the bio as needed \n6. Update this info to the CRM under the table lead enrichment and map accordingly\n7. You can update the prompt on the AI models or work with them as is. \n8. Update the Gmail node to send the meeting preps to you and finally update the CRM with the generated  Meeting prep\n\nThis automated process can save your team a couple of minutes each day otherwise spent on other client fulfillment items.\n\nIf you would like to learn more about n8n templates like this, feel free to reach out via [Linkedin](https://www.linkedin.com/in/zacharia-kimotho/) \n\nHappy productivity!!\n",
  "featuredImage": "/data/workflows/4505/4505.webp",
  "author": {
    "id": 101,
    "slug": "imperolq",
    "name": "Zacharia Kimotho",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 591,
  "downloads": 59,
  "createdAt": "2025-05-30T06:25:28.290Z",
  "updatedAt": "2026-01-16T08:34:42.468Z",
  "publishedAt": "2025-05-30T06:25:28.290Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4505"
}