{
  "id": 10619,
  "slug": "10619",
  "title": "Automated YouTube publishing from Drive with GPT & Gemini metadata generation",
  "description": "# How it works\nThis workflow turns a Google Drive folder into a fully automated YouTube publishing pipeline. Whenever a new video file is added to the folder, the workflow generates all YouTube metadata using AI, uploads the video to your YouTube channel, deletes the original file from Drive, sends a Telegram confirmation, and can optionally post to Instagram and Facebook using permanent system tokens.\n## High-level flow:\nDetects new video uploads in a specific Google Drive folder.\n\nDownloads the file and uses AI to generate:\n• a polished first-person YouTube description\n• an SEO-optimized YouTube title\n• high-ranking YouTube tags\n\nUploads the video to YouTube with the generated metadata.\n\nDeletes the original Drive file after upload.\n\nSends a Telegram notification with video details.\n\n(Optional) Posts to Instagram & Facebook using permanent system user tokens.\n\n## Set up steps\nSetup usually takes a few minutes.\n\nAdd Google Drive OAuth2 credentials for the trigger and download/delete nodes.\n\nAdd your OpenAI (or Gemini) API credentials for title/description/tag generation.\n\nAdd YouTube OAuth2 credentials in the YouTube Upload node.\n\nAdd Facebook/Instagram Graph API credentials if enabling cross-posting.\n\nReplace placeholder IDs (Drive folder ID, Page ID, IG media endpoint).\n\nReview sticky notes in the workflow—they contain setup guidance and token info.\n\nActivate the Google Drive trigger to start automated uploads.",
  "featuredImage": "/data/workflows/10619/10619.webp",
  "author": {
    "id": 101,
    "slug": "muhammadnouman",
    "name": "Ai x Nouman",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 392,
  "downloads": 39,
  "createdAt": "2025-11-08T04:58:51.248Z",
  "updatedAt": "2026-01-16T09:05:41.807Z",
  "publishedAt": "2025-11-08T04:58:51.248Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10619"
}