{
  "id": 7512,
  "slug": "7512",
  "title": "Automated workflow backup to Google Drive with smart cleanup",
  "description": "**How it works**\n\nThis workflow provides a complete, automated backup solution for your n8n instance, running on a daily schedule to ensure your automations are always safe.\n\n* **Automatic cleanup:** It first connects to your Google Drive to find and delete old backup folders, keeping your storage clean and organized based on a retention number you set.\n* **Daily folder creation:** It then creates a new, neatly dated folder to store the current day's backup.\n* **Fetches & saves workflows:** Finally, it uses the n8n API to get a list of all your workflows, converts each one to a `.json` file, and uploads them to the newly created folder in Google Drive.\n\n**Set up steps**\n\n**Setup time: ~3 minutes**\n\nThis template is designed to be as plug-and-play as possible. All configurations are grouped in a single node for quick setup.\n\n* **Connect your accounts:** Authenticate the `Google Drive` and `n8n API` nodes with your credentials.\n* **Configure main settings:** Open the `Set` node named **\"CONFIG - Set your variables here\"** and:\n    * Paste the ID of your main Google Drive folder where backups will be stored.\n    * Adjust the number of recent backups you want to keep.\n* **Activate workflow:** Turn on the workflow. Your automated backup system is now active.\n\nFor more detailed instructions, including how to find your Google Drive folder ID, please refer to the sticky notes inside the workflow.",
  "featuredImage": "/data/workflows/7512/7512.webp",
  "author": {
    "id": 101,
    "slug": "lucaolovrap",
    "name": "Luca Olovrap",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2286,
  "downloads": 228,
  "createdAt": "2025-08-17T11:17:55.476Z",
  "updatedAt": "2026-01-16T08:50:40.512Z",
  "publishedAt": "2025-08-17T11:17:55.476Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7512"
}