{
  "id": 7721,
  "slug": "7721",
  "title": "Analyze form feedback with GPT-4 & sync tasks to Monday, ClickUp & HubSpot",
  "description": "## How it works\nThis workflow automates customer feedback management by capturing reviews through a form, analyzing them with AI for sentiment and insights, and then creating structured tasks across Monday.com, ClickUp, and HubSpot. It ensures that customer concerns are categorized, prioritized, and assigned to the right teams with actionable metadata.\n\n## Step-by-step\n\n**Trigger & Input**\n\n- The workflow starts when a customer submits the Feedback Form containing their Name, Message, Rating, and Product/Service.\n \n- The submitted data is pre-processed with a Code node to cleanly extract fields for analysis.\n\n**AI Analysis & Processing**\n\n- The extracted review is sent to OpenAI GPT-4 for analysis.\n\n- AI identifies sentiment, sentiment score, category (e.g., product, service, support, delivery, pricing), department, priority, required actions, keywords, and suggested response tone.\n\n- A Data Processing node enriches the output with due dates, task titles, structured descriptions, and fallback handling in case of parsing issues.\n\n**Structured Output Generation**\n\n- An AI Agent and OpenAI Chat model transform the enriched data into a strict JSON format that is compatible with Monday.com, ClickUp, and HubSpot.\n\n- This ensures consistent field order, formatting, and metadata for all downstream integrations.\n\n**Task Creation in Platforms**\n\n- The structured task data is automatically pushed to:\n\n  - Monday.com → Creates an item in a specified board.\n\n  - ClickUp → Creates a task with mapped fields and priority.\n\n  - HubSpot → Creates an engagement task in CRM with due date and priority.\n\n## Benefits\n\n- Automates end-to-end customer feedback analysis and task creation.\n\n- Ensures structured, AI-driven insights for actionable responses.\n\n- Reduces manual work in categorizing and assigning reviews.\n\n- Keeps customer feedback synchronized across multiple platforms (Monday.com, ClickUp, HubSpot).\n\n- Improves response time by prioritizing high-impact feedback with due dates.",
  "featuredImage": "/data/workflows/7721/7721.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "AI Summarization",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 144,
  "downloads": 14,
  "createdAt": "2025-08-22T04:59:55.558Z",
  "updatedAt": "2026-01-16T08:52:01.130Z",
  "publishedAt": "2025-08-22T04:59:55.558Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7721"
}