{
  "id": 10218,
  "slug": "10218",
  "title": "Analyze event feedback with sentiment analysis, Google Sheets, Slack & Email",
  "description": "This n8n workflow automates the collection and analysis of real-time attendee feedback and engagement data during sessions or live polls. It generates actionable insights for organizers, streamlining the process of gathering, processing, and delivering feedback to enhance event management and attendee experience.\n\n### Key Features\n- Collects session feedback and live poll responses in real-time.\n- Analyzes sentiment and extracts key trends for actionable insights.\n- Delivers summarized reports and recommendations to organizers via multiple channels.\n- Supports seamless integration with external tools for data logging and communication.\n\n### Workflow Process\n- The **Webhook Trigger** node captures incoming feedback or poll data from attendees, initiating the workflow.\n- The **Extract Feedback Data** node processes the raw input to organize and prepare it for analysis.\n- The **Analyze Sentiment** node uses AI to evaluate feedback sentiment and identify key themes or trends.\n- The **Aggregate Feedback** node compiles the analyzed data into a cohesive summary.\n- The **Calculate Insights** node generates actionable insights and recommendations based on the aggregated data.\n- The **Check Urgency** node assesses the priority of the feedback for timely responses or actions.\n- The **Log to Google Sheets** node records the feedback and insights for future reference.\n- The **Webhook Response** node sends real-time updates or acknowledgments back to the source.\n- The **Post to Slack** node delivers summary messages to organizers via Slack.\n- The **Email Report to Organizers** node sends detailed reports to organizers via email.\n\n### Setup Instructions\n- Import the workflow into n8n and configure the Webhook Trigger with your event platform's API credentials.\n- Set up the AI service for sentiment analysis and insight generation with a suitable language model.\n- Configure Google Sheets integration for logging feedback data.\n- Set up Slack and email credentials for notifications and reports.\n- Test the workflow by sending sample feedback or poll responses to ensure proper data flow and analysis.\n- Monitor the output and adjust AI parameters or node settings as needed for optimal performance.\n\n### Prerequisites\n- Webhook integration with the event platform or polling system.\n- AI/LLM service for sentiment analysis and insight generation.\n- Google Sheets account for data logging.\n- Slack workspace and email service for notifications and reports.\n- Access to real-time attendee data from the event platform.\n\n### Modification Options\n- Modify the **Extract Feedback Data** node to include specific data fields or custom parsing rules.\n- Adjust the **Analyze Sentiment** node to focus on particular sentiment metrics or keywords.\n- Customize the **Calculate Insights** node to prioritize certain types of recommendations.\n- Add additional notification channels (e.g., Microsoft Teams) to the **Post to Slack** or **Email Report** nodes.\n- Configure the **Check Urgency** node to include custom urgency criteria based on event needs.",
  "featuredImage": "/data/workflows/10218/10218.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 69,
  "downloads": 6,
  "createdAt": "2025-10-27T14:44:09.633Z",
  "updatedAt": "2026-01-16T09:03:59.448Z",
  "publishedAt": "2025-10-27T14:44:09.633Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10218"
}