{
  "id": 8438,
  "slug": "8438",
  "title": "Automate Calendly to HubSpot: contact updates & meeting logging",
  "description": "## How it works\n\nThis workflow automatically syncs Calendly meeting bookings into HubSpot CRM by checking if the invitee already exists as a contact. It extracts attendee details, creates or updates contacts in HubSpot, and logs the meeting engagement with all relevant information. This ensures that every booked meeting is properly tracked, linked to the right contact, and enriched with context from Calendly.\n\n## Step-by-step\n**1. Trigger & Input**\n\n- Calendly Trigger (Invitee Created) – Fires whenever a new meeting is booked in Calendly.\n\n- Captures attendee details: name, email, meeting start/end time, and responses to any custom questions.\n\n**2. Contact Search**\n\n- Search Contact (HubSpot) – Looks up HubSpot to see if a contact with the invitee’s email already exists.\n\n**3. Contact Decision**\n\n- Contact Exists?\n\n- Yes → Proceeds to log the meeting against the existing HubSpot contact.\n\n- No → Creates a new contact in HubSpot with the attendee’s name and email.\n\n**4. Engagement Logging**\n\n- Log Meeting (Existing Contact) – Creates a HubSpot meeting engagement tied to the existing contact.\n\n- Create Contact + Log Meeting (New Contact) – If no contact is found, a new one is created, and the meeting is immediately logged against it.\n\n- Engagement includes: meeting title, start/end times, attendee details, and custom question notes.\n\n## Benefits\n\n- Automated CRM Sync – No more manual data entry between Calendly and HubSpot.\n\n- Accurate Contact Management – Ensures meetings are always linked to the right person, creating new contacts when needed.\n\n- Context-Rich Engagements – Logs attendee details and custom question responses for better follow-ups.\n\n- Seamless Sales Tracking – Keeps HubSpot updated with every meeting for pipeline visibility.\n\n- Hands-Free Workflow – Runs automatically whenever a Calendly invitee books a meeting.",
  "featuredImage": "/data/workflows/8438/8438.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 162,
  "downloads": 16,
  "createdAt": "2025-09-10T06:58:12.370Z",
  "updatedAt": "2026-01-16T08:55:47.890Z",
  "publishedAt": "2025-09-10T06:58:12.370Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8438"
}