{
  "id": 7233,
  "slug": "7233",
  "title": "Automate lead enrichment & personalized outreach with HubSpot, Phantombuster & GPT",
  "description": "### How it works\nThis workflow enriches and personalizes your lead profiles by integrating HubSpot contact data, scraping social media information, and using AI to generate tailored outreach emails. It streamlines the process from contact capture to sending a personalized email — all automatically.\n\nThe system fetches new or updated HubSpot contacts, verifies and enriches their Twitter/LinkedIn data via Phantombuster, merges the profile and engagement insights, and finally generates a customized email ready for outreach.\n\n### Step-by-step\n**1. Trigger & Input**\n- HubSpot Contact Webhook: Fires when a contact is created or updated in HubSpot.\n\n- Fetch Contact: Pulls the full contact details (email, name, company, and social profiles).\n\n- Update Google Sheet: Logs Twitter/LinkedIn usernames and marks their tracking status.\n\n**2. Validation**\n- Validate Twitter/LinkedIn Exists: Checks if the contact has a valid social profile before proceeding to scraping.\n\n**3. Social Media Scraping (via Phantombuster)**\n- Launch Profile Scraper & 🎯 Launch Tweet Scraper: Triggers Phantombuster agents to fetch profile details and recent tweets.\n\n- Wait Nodes: Ensures scraping completes (30–60 seconds).\n\n- Fetch Profile/Tweet Results: Retrieves output files from Phantombuster.\n\n- Extract URL: Parses the job output to extract the downloadable .json or .csv data file link.\n\n**4. Data Download & Parsing**\n- Download Profile/Tweet Data: Downloads scraped JSON files.\n\n- Parse JSON: Converts the raw file into structured data for processing.\n\n**5. Data Structuring & Merging**\n- Format Profile Fields: Maps stats like bio, followers, verified status, likes, etc.\n\n- Format Tweet Fields: Captures tweet data and associates it with the lead’s email.\n\n- Merge Data Streams: Combines tweet and profile datasets.\n\n- Combine All Data: Produces a single, clean object containing all relevant lead details.\n\n**6. AI Email Generation & Delivery**\n- Generate Personalized Email: Feeds the merged data into OpenAI GPT (via LangChain) to craft a custom HTML email using your brand details.\n\n- Parse Email Content: Cleans AI output into structured subject and body fields.\n\n- Sends Email: Automatically delivers the personalized email to the lead via Gmail.\n\n### Benefits\n- Automated Lead Enrichment — Combines CRM and real-time social media data with zero manual research.\n\n- Personalized Outreach at Scale — AI crafts unique, relevant emails for each contact.\n\n- Improved Engagement Rates — Targeted messages based on actual social activity and profile details.\n\n- Seamless Integration — Works directly with HubSpot, Google Sheets, Gmail, and Phantombuster.\n\n- Time & Effort Savings — Replaces hours of manual lookup and email drafting with an end-to-end automated flow.",
  "featuredImage": "/data/workflows/7233/7233.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 337,
  "downloads": 33,
  "createdAt": "2025-08-11T07:11:45.991Z",
  "updatedAt": "2026-01-16T08:49:11.520Z",
  "publishedAt": "2025-08-11T07:11:45.991Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7233"
}