{
  "id": 9643,
  "slug": "9643",
  "title": "Extract business card data & generate follow-ups with Google Vision OCR & GPT-4 Mini",
  "description": "This n8n template helps you turn business cards into qualified sales opportunities — instantly.\n\nNo more lost leads after events or networking meetups. Just send a business card photo via Telegram, and let AI handle the rest.\n\nThe workflow extracts details (name, company, role, email, phone) using Google Vision OCR, analyzes context with OpenAI, and then generates personalized WhatsApp or email messages to help you follow up faster.\n\n## Use Cases\n\nCapture leads instantly from events or meetups.\n\nAuto-analyze business card data into structured CRM entries.\n\nSend hyper-personalized WhatsApp messages or emails within minutes.\n\nIdeal for founders, marketers, and business development teams.\n\n## How it Works\n\nTrigger: Send a photo of a business card via Telegram.\n\nExtract: Google Vision OCR reads and extracts all text from the image.\n\nProcess: The extracted text is sent to an AI agent (OpenAI GPT-4.1-mini) for:\n\nContact parsing (name, company, role, email, phone)\n\nBusiness/industry inference\n\nAI-generated personalized follow-up messages\n\nOutput: The system returns structured JSON containing:\n\nEmail subject & body\n\nWhatsApp draft message\n\nFit score, opportunities, and next action steps\n\n## How to Use\n\nImport the JSON template into n8n.\n\nAdd your Telegram Bot Token to the “Telegram Trigger” node.\n\nAdd your Google Cloud Vision API key in the HTTP Request node.\n\nAdd your OpenAI credentials in the “OpenAI Chat Model” node.\n\n(Optional) Connect the output to Google Sheets, Airtable, or your CRM.\n\nRun the workflow — take a photo of a business card and watch the magic happen!\n\n## Requirements\n\nTelegram Bot for image input\n\nGoogle Vision API Key\n\nOpenAI API Key\n\n(Optional) Integration with CRM or WhatsApp API\n\n## Customization Ideas\n\nReplace Telegram with Email or WhatsApp triggers.\n\nPush qualified leads directly into HubSpot or Notion.\n\nAutomate multi-step sequences based on AI fit scores.",
  "featuredImage": "/data/workflows/9643/9643.webp",
  "author": {
    "id": 101,
    "slug": "aditya-malur",
    "name": "Aditya Malur",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 399,
  "downloads": 39,
  "createdAt": "2025-10-14T14:38:24.111Z",
  "updatedAt": "2026-01-16T09:01:19.859Z",
  "publishedAt": "2025-10-14T14:38:24.111Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9643"
}