{
  "id": 3642,
  "slug": "3642",
  "title": "Customer feedback analysis with AI, QuickChart & HTML report generator",
  "description": "## Generative Customer Insights from Feedback Data using AI Agents & Charts\n\nThis workflow automates the analysis of customer feedback or social media data from Google Sheets using DeepSeek LLM, transforming raw text into structured semantic insights. The workflow also generates data visualizations and produces a final HTML report, ready for email delivery.\n\n---\n\n## Table of Contents\n- [What This Workflow Does](#what-this-workflow-does)\n- [Pre-conditions and Requirements](#pre-conditions-and-requirements)\n- [Step-by-Step Workflow Explanation](#step-by-step-workflow-explanation)\n- [Example Results](#Example-Results)\n- [Customization Guide](#customization-guide)\n\n---\n\n## What This Workflow Does\n\nThis workflow performs automated semantic analysis on unstructured feedback data (from Google Sheets), using LLM-based agents and a sequence of transformations. It achieves:\n\n- **Prompt proposal generation**: AI generates generalizable prompts for various analysis dimensions.\n- **Row-level analysis**: Each row of data is evaluated against all prompts.\n- **Output merging and refinement**: Raw analysis outputs are merged, deduplicated, and semantically clustered.\n- **Visualization and report generation**: QuickChart is used to create graphs, and an HTML report is produced.\n- **Email delivery**: The full report is sent automatically via Gmail.\n\n---\n\n## Pre-conditions and Requirements\n\n- **API Keys**\n  - DeepSeek API Key\n  - Gmail OAuth2 (for sending results)\n\n- **Google Sheet Access**\n  - A preformatted Google Sheet containing social listening feedback\n  - The sheet must include at least 20 rows for sample prompt generation\n\n- **n8n Configuration**\n  - Nodes used: Google Sheets, LangChain (LLM/Agent/Parser), Function, Merge, QuickChart (via URL), Gmail\n  - Ensure all credentials are configured properly in n8n’s credential manager\n\n---\n\n## Step-by-Step Workflow Explanation\n\n1. **Google Sheet Import**\n   - Retrieves feedback rows from a specific Google Sheet tab\n   - Filters to the first 20 rows for prompt generation\n\n2. **Prompt Proposal Agent**\n   - AI generates 3–6 row-level analysis prompts in a structured JSON format\n   - Prompts must be agnostic to product names and column headers\n\n3. **Prompt Injection and Pairing**\n   - Each row is paired with all prompts\n   - Combined into a single dataset for row-by-row LLM evaluation\n\n4. **First Iteration of Analysis**\n   - An LLM answers all injected prompts row-by-row\n   - Output is parsed and transformed into structured fields\n\n5. **Semantic Merging and Refinement**\n   - Merged lists of values from all rows\n   - AI clusters synonyms and regenerates improved prompt definitions\n\n6. **Second Iteration of Analysis**\n   - The refined prompts are used to re-analyze each row\n   - A new structured output per row is generated and merged into one object\n\n7. **Summarization and Visualization**\n   - AI generates summaries per dimension (e.g., sentiment)\n   - QuickChart visualizations are created and URL-encoded\n   - Cross-dimensional insights and a global narrative are generated\n\n8. **Final Report Generation and Emailing**\n   - A final HTML report is generated\n   - Sent to the specified email using Gmail node\n\n---\n## Example Results\n![WeChat Image_20250421171518.png](fileId:1152)\n## Customization Guide\n\n### 1. Modify Data Source\n- Change the Google Sheet ID or sheet tab\n- Add filters for specific time periods or product names\n\n### 2. Adjust Prompt Definitions\n- Refine the initial prompt agent instruction to tailor the type of analysis\n\n### 3. Swap LLM Models\n- Replace DeepSeek with OpenAI or another LLM via LangChain nodes\n\n### 4. Visual Styling\n- Customize QuickChart configurations to adjust chart types, colors, legends\n\n### 5. Report Format\n- Update the final HTML prompt to reflect brand design or restructure sections\n\n### 6. Add Report Destinations\n- Replace Gmail with Google Drive upload, Notion page creation, or Slack post\n\n---\n\nThis end-to-end AI-powered social listening workflow enables scalable, repeatable, and customizable insights generation from unstructured customer feedback.",
  "featuredImage": "/data/workflows/3642/3642.webp",
  "author": {
    "id": 101,
    "slug": "hippolyte-hu",
    "name": "hippolyte-hu",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1007,
  "downloads": 100,
  "createdAt": "2025-04-21T15:24:43.394Z",
  "updatedAt": "2026-01-16T08:30:48.561Z",
  "publishedAt": "2025-04-21T15:24:43.394Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3642"
}