{
  "id": 8615,
  "slug": "8615",
  "title": "Build a Telegram chatbot with Gemini",
  "description": "## Overview\n- This workflow connects a Telegram bot to OpenAi/Google Gemini (PaLM API) so the bot can reply to users with AI-generated answers.\n- Useful for FAQs, assistants, classroom helpers, or bots that fetch document content to answer questions.\n\nWho is this for\n- Educators, creators, developers, and support teams who want a low-code Telegram chatbot powered by Gemini.\n\nWhat it does (quick)\n- Listens for messages sent to your Telegram bot.\n- Sends incoming text to Google Gemini and receives a generated reply.\n- Optionally fetches content from Google Docs or an external API to enrich replies.\n- Sends the reply back to the original Telegram user.\n- Processes messages in batches and adds short delays to avoid spamming.\n\nQuick setup (5 steps)\n1. Create a Telegram bot with @BotFather and copy the bot token.  \n2. Add Telegram credentials to n8n (Telegram node).  \n3. OpenAi API key and add it to n8n.\n3. Get a Google Gemini (PaLM) API key and add it to n8n.  \n4. (Optional) Connect Google Docs OAuth2 if you want the bot to read documents.  \n5. Activate the workflow and test by messaging the bot.\n\nRequired items\n- Telegram bot token\n- OpenAi API key\n- Google Gemini (PaLM) API key\n- n8n instance with Telegram and HTTP nodes enabled\n- (Optional) Google Docs OAuth2 credential\n\nHow it works (step-by-step)\n1. Telegram message arrives → Trigger node.  \n2. Workflow extracts message and user info.  \n3. (Optional) Pull supporting content from Google Docs or an API.  \n4. Send prompt + context to Gemini → receive reply.  \n5. Send reply back to the Telegram user.  \n6. Add small delays and batch processing to handle volume safely.\n\nHow to customize\n- Edit the Gemini prompt to change response style and behavior.  \n- OpenAi Chat model\n- Switch Gemini model (Flash vs Pro) for speed vs. quality.  \n- Add conditions (If / Switch) to route different inputs to different behaviors.  \n- Append more data sources (Sheets, external APIs) to enrich replies.  \n- Add error handling to retry or log failed requests.\n\nTesting checklist\n- Send a test message to the bot and confirm a reply.  \n- If using Google Docs, confirm the bot can read the target document.  \n- Check logs and node outputs in n8n for any errors.\n\nTips and best practices\n- Keep prompts concise and include only needed context to reduce costs.  \n- Use rate limiting (Wait node) and batching to avoid API throttling.  \n- Store API keys securely in n8n credentials.  \n- Start with small tests before enabling automated production runs.\n\n## 🙋 For Help & Community\n- 👾 Discord: [n8n channel](https://discord.gg/9SDFKGnh2Y)\n- 🌐 Website: [devcodejourney.com](https://devcodejourney.com)\n- 🔗 LinkedIn: [Connect with Shakil](https://www.linkedin.com/in/shakilpg/)\n- 📱 WhatsApp Channel: [Join Now](https://whatsapp.com/channel/0029Vb5l6JuDTkK5BRORNn0B)\n- 💬 Direct Chat: [Message Now](https://wa.me/8801316320957)",
  "featuredImage": "/data/workflows/8615/8615.webp",
  "author": {
    "id": 101,
    "slug": "devcodejourney",
    "name": "DevCode Journey",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1869,
  "downloads": 186,
  "createdAt": "2025-09-15T19:15:37.573Z",
  "updatedAt": "2026-01-16T08:56:49.857Z",
  "publishedAt": "2025-09-15T19:15:37.573Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8615"
}