{
  "id": 11617,
  "slug": "11617",
  "title": "Automate YouTube Shorts creation from Telegram prompts using Gemini and VEO",
  "description": "## Who this workflow is for\n\nThis workflow is designed for content creators, marketing teams, and automation builders who want to produce short-form video content at scale without manual editing.\n\nIt is especially useful for teams posting consistently to YouTube Shorts, Instagram Reels, or TikTok who want a repeatable, automated content pipeline driven by AI.\n\n---\n\n## What this workflow does\n\nThis n8n automation converts a single Telegram message into a fully generated short-form video using AI.\n\nWhen a message is sent to a Telegram bot, the workflow:\n- Generates a structured short-form video script using Gemini\n- Creates multiple cinematic video clips using VEO\n- Merges clips into a single short video\n- Generates a title, description, and hashtags optimized for short-form platforms\n- Delivers the finished video asset and metadata back to Telegram or storage\n\nThe entire process runs automatically without requiring manual scripting, editing, or clip assembly.\n\n---\n\n## How the workflow works\n\n1. A Telegram message triggers the workflow with a short content idea\n2. An AI model generates a multi-part script optimized for short-form video\n3. Video clips are generated for each script segment using VEO\n4. Clips are merged into a final vertical video\n5. Metadata (title, description, hashtags) is generated and attached\n6. The completed short is delivered for review or publishing\n\n---\n\n## How to set up the workflow\n\n1. Connect your Telegram bot credentials\n2. Configure your Gemini and VEO credentials\n3. Review the prompt templates used for script and clip generation\n4. Adjust output destinations (Telegram, Google Drive, or manual upload)\n5. Activate the workflow\n\nAll required credentials are stored securely using n8n credential management.\n\n---\n\n## Requirements\n\n- Telegram Bot\n- Google Gemini credentials\n- VEO video generation access\n- n8n instance (cloud or self-hosted)\n\n---\n\n## How to customize the workflow\n\n- Modify the AI prompts to match your content style or niche\n- Change clip length or number of generated scenes\n- Add automatic posting to YouTube Shorts or other platforms\n- Extend the workflow with analytics or scheduling steps\n\n---\n\n**Author:** Hyrum Hurst  \n**Company:** QuarterSmart  \n**Contact:** hyrum@quartersmart.com\n",
  "featuredImage": "/data/workflows/11617/11617.webp",
  "author": {
    "id": 101,
    "slug": "hyrum-hurst",
    "name": "Hyrum Hurst",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 932,
  "downloads": 93,
  "createdAt": "2025-12-09T01:52:15.475Z",
  "updatedAt": "2026-01-16T09:09:23.316Z",
  "publishedAt": "2025-12-09T01:52:15.475Z",
  "nodes": 45,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11617"
}