{
  "id": 6813,
  "slug": "6813",
  "title": "Build a comprehensive multimodal assistant on Telegram with OpenAI, SERP and Vector Store",
  "description": "## J.A.R.V.I.S.\n\n## Multimodal AI assistant on Telegram with OpenAI\n\nThis workflow transforms your Telegram bot into J.A.R.V.I.S., a powerful, multimodal AI assistant. It can understand and process text, voice messages, images, and documents. The assistant can search the web, scrape websites, generate images, perform calculations, and reference uploaded documents to provide comprehensive and context-aware responses in either text or audio format.\n\n### 🧑‍💻 Who’s it for\n\nThis workflow is for developers, AI enthusiasts, and businesses who want to create an advanced, interactive AI assistant on Telegram. It’s perfect for automating customer support, creating a personal AI helper, or exploring the capabilities of multimodal large language models (LLMs) in a practical application.\n\n### ⚙️ How it works\n\nThe workflow begins when a message is received by your Telegram bot. A Switch node then directs the data based on the message type:\n\n*   **Text:** The message is formatted and sent directly to the main AI agent.\n*   **Voice:** The audio file is downloaded from Telegram and transcribed into text using the OpenAI API.\n*   **Image:** The image is downloaded and analyzed by an OpenAI vision model to understand its content.\n*   **Document:** The file is downloaded and its content is stored in a temporary vector store, making it searchable for the AI.\n\nThe processed input is then passed to the core \"J.A.R.V.I.S.\" Agent node. This agent uses an OpenAI model, conversational memory, and a suite of tools (Google Search, Web Scraper, Image Generator, Calculator, and the document vector store) to formulate a response. Finally, the workflow checks if the initial message was a voice note; if so, it generates an audio response. Otherwise, it sends the answer as a text message back to the user.\n\n### 🛠️ How to set up\n\n1.  **Telegram:** \n  - Create a Telegram Bot - Use @BotFather to create a bot and obtain your bot token;\n  - Add Telegram API credentials in n8n with your bot token to the `Receive Message` Trigger node and all other Telegram nodes. In the `Receive Message` node, enter the `chatId` of the user or group authorized to interact with the bot.\n2.  **OpenAI:** Add your OpenAI API credentials to all OpenAI, AI Agent, and AI tool nodes.\n3.  **SerpAPI:** Add your SerpAPI credentials to the `Basic Google Search` node to enable web search functionality.\n4.  **Jina AI:** Add your Jina AI API key to the Setup Node - The API Key is used on the `Webpage Scraper` node.\n\n### ✅ Requirements\n\n*   Telegram Bot API credentials and Bot token.\n*   OpenAI API credentials.\n*   SerpAPI API credentials.\n*   Jina.ai API credentials\n\n### 🎨 How to customize the workflow\n\n*   **Change the AI model:** You can select a different OpenAI model in the `OpenAI Chat Model` node (e.g., switch from `gpt-4.1` to `gpt-4o`) or in the `Analyze Image` and `Transcribe` nodes.\n*   **Modify the AI's personality:** Edit the system prompt in the `J.A.R.V.I.S.` Agent node to change its name, tone, instructions, or default language.\n*   **Expand its tools:** Connect more tools to the `J.A.R.V.I.S.` Agent node to extend its capabilities, such as connecting to a database or another third-party API.\n*   **Adjust the response format:** Modify the `If Audio Response` node to change the conditions for sending text or audio messages. For example, you could configure it to always respond with text.\n\n### 💬 Need Help?\nJoin the [Discord](https://discord.com/invite/XPKeKXeB7d) or ask in the [Forum](https://community.n8n.io/)",
  "featuredImage": "/data/workflows/6813/6813.webp",
  "author": {
    "id": 101,
    "slug": "fabiointech",
    "name": "FabioInTech",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1034,
  "downloads": 103,
  "createdAt": "2025-08-01T15:11:34.447Z",
  "updatedAt": "2026-01-16T08:47:09.156Z",
  "publishedAt": "2025-08-01T15:11:34.447Z",
  "nodes": 48,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6813"
}