{
  "id": 8034,
  "slug": "8034",
  "title": "Automate HS code lookup & enrichment with Google Sheets and customs API (beta)",
  "description": "\"*I used to spend hours every week just copy-pasting product descriptions to find the right tariff codes for our international shipments. It was tedious and prone to errors.*\" - Accounting specialist.\n\n\nThis workflow eliminates that manual work entirely. It automatically finds customs tariff numbers (also known as HS Codes or \"Zolltarifnummern\") for your products and enriches your data in Google Sheets. It offers two powerful modes: bulk processing for entire product lists and an on-demand chat interface for quick single lookups.\n\n## new features\n- added the API score in percentage (80 to 100% is perfect, 70-80% still good)\n- added description of the found HS Code to better verify the accuracy\n-please keep in mind, that is still a **beta**\nhttps://www.zolltarifnummern.de/services/api \n\n![Zoll2.png](fileId:2312)\n\n\n## What this workflow does\n- **Bulk Enrichment from Google Sheets:** Reads a list of product descriptions from a specified Google Sheet.\n- **External API Lookup:** For each product, it queries the zolltarifnummern.de API to find the most relevant customs tariff number.\n- **Automated Data Update:** Writes the found tariff numbers back into the correct row in your Google Sheet.\n- **On-Demand Single Lookup:** Use the integrated Chat Trigger to instantly look up a tariff number for a single product description without leaving n8n.\n- **Completion Notification:** Sends a confirmation email via Gmail once the bulk processing job is finished.\n\n\n## Nodes Used\n1. Google Sheets\n2. HTTP Request\n3. Loop Over Items (Split in Batches)\n4. Set\n5. Gmail\n6. Chat Trigger\n7. Manual Trigger\n\n\n## Preparation\nA Google Sheet prepared with at least two columns: one for your product descriptions (e.g., ProductDescription) and an empty one for the results (e.g., TariffCode).\nHow to set up this workflow\nConfigure Google Sheets (Read):\n\nOpen the \"Read Item Descriptions\" node.\nSelect your Google Sheets credentials.\nEnter your Spreadsheet ID and the name of the sheet containing your product data.\nMake sure the \"Columns to Read\" field includes the name of your product description column.\nConfigure Google Sheets (Update):\n\nOpen the \"Write Customs Tariff to Sheet\"  node.\nSelect the same Google Sheets credentials.\nEnter the same Spreadsheet ID and Sheet Name.\nUnder Columns, set Matching Columns to your product description column name. This is crucial for updating the correct rows.\nConfigure Email Notification:\n\nOpen the \"Send Completion Email\" (Gmail) node.\nSelect your Gmail credentials.\nIn the Send To field, enter the email address where you want to receive the completion notification.\n\n## Run the Workflow:\n\n**For Bulk Processing**: Activate the workflow and execute the \"Abfrage starten\" (Start Query) Manual Trigger.\n**For a Single Lookup**: Use the Chat Trigger. Open the chat pane, type a product description, and hit send. The workflow will return the suggested tariff number.\n",
  "featuredImage": "/data/workflows/8034/8034.webp",
  "author": {
    "id": 101,
    "slug": "thomas-z",
    "name": "Thomas",
    "avatar": ""
  },
  "categories": [
    "Document Extraction"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 431,
  "downloads": 43,
  "createdAt": "2025-08-29T16:38:21.850Z",
  "updatedAt": "2026-01-16T08:53:45.619Z",
  "publishedAt": "2025-08-29T16:38:21.850Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8034"
}