{
  "id": 2849,
  "slug": "2849",
  "title": "Content generator for WordPress v3",
  "description": "# UPDATE\nThis is an updated version of the previous Ultimate Content Generator for WordPress v2.\nhttps://n8n.io/workflows/2737-ultimate-content-generator-for-wordpress/\n\nIt includes an additional workflow to generate content using Anthropic Claude in addition to OpenAI 4o.\n\nI also mofidied it to use the AI Agent Tool node with structured output for more consistent outputs.\n\nLastly, the workflow updates a new table in AirTable with the published blog post url and featured image url.\n\n# Overview- \nThis workflow automates the end-to-end process of creating, optimizing, and publishing content on WordPress.\n\nIt integrates AI-powered tools, Airtable, and WordPress plugins to generate high-quality, on-brand posts effortlessly.\n\nPerfect for content creators, marketers, and business owners looking to save time and scale their content strategy.\n\n## Features\n### Content Creation:\n**AI-Powered Content:** Generates SEO-friendly blog posts with structured headings, relevant keywords, and meta descriptions.\n**Custom Prompts:** Tailor the AI-generated content to match your brand’s tone and voice.\n**SEO Optimization:** RankMath Plugin Integration: Updates RankMath SEO with focus keywords and meta descriptions, ensuring your content is search-engine optimized.\n**Content Management:** \nAirtable Integration: Organizes content ideas, drafts, and publishing schedules in one place. Easily scalable for teams or solo creators.\n**Visuals:** \nBranded Featured Images: Automatically generates on-brand images for every post.\n**Publishing:**\nEffortless Formatting: Adapts content to fit your WordPress theme and schedules it for publication.\n### Workflow Steps\n**Trigger:** Initiated manually or on a schedule.\n**Content Management:** Retrieves and organizes ideas from Airtable.\n**Content Generation:** Generates AI-driven blog content tailored to your audience.\n**SEO Optimization:** Automatically updates RankMath with SEO details.\n**Featured Image Creation:** Produces on-brand images for the post.\n**Publishing:** Formats and schedules the post on WordPress.\n## Prerequisites\n**API Keys:**\n- OpenAI\n- Claude\n- Airtable\n- WordPress REST API\n\n### Custom Code:\nAdd a small update to your WordPress theme’s functions.php file to enable seamless automation.\n\n### Customization\n- Replace Airtable with another content management system if preferred.\n- Adjust AI prompts to reflect different tones, styles, or industries.\n- Add integrations for additional plugins, analytics, or storage services.\n### Usage\n- Import the workflow into your n8n instance.\n- Configure API credentials for WordPress, Airtable, OpenAI, Claude and Slack.\n- Update your functions.php file with the provided code snippet.\n- Customize prompts and Airtable structure for your content needs.\n- Trigger the workflow manually or set it on a schedule.\n### Notes\n- Experiment with Airtable views or add filters for more granular control over your content pipeline.\n- Extend the workflow to include social media posting or analytics tracking.\n\nFeel free to adapt and extend this workflow to meet your specific needs! 🎉",
  "featuredImage": "/data/workflows/2849/2849.webp",
  "author": {
    "id": 101,
    "slug": "alexk1919",
    "name": "Alex Kim",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 3548,
  "downloads": 354,
  "createdAt": "2025-02-05T04:03:29.558Z",
  "updatedAt": "2026-01-16T08:26:49.738Z",
  "publishedAt": "2025-02-05T04:03:29.558Z",
  "nodes": 102,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2849"
}