{
  "id": 9687,
  "slug": "9687",
  "title": "Create viral storytelling videos with GPT, Gemini & JsonCut from text prompts",
  "description": "## Generate ready-to-publish short-form videos from text prompts using AI\n\n[![Video ansehen](fileId:2951)](https://drive.google.com/file/d/1Cl0KwgRgcuBPVdGgL-nqAcheyvfVXttD/view)\n*Click on the image to see the Example output in google drive*\n\nTransform simple text concepts into professional short-form videos complete with AI-generated visuals, narrator voice, background music, and dynamic text overlays - all automatically generated and ready for Instagram, TikTok, or YouTube Shorts.\n\nThis workflow demonstrates a cost-effective approach to video automation by combining AI-generated images with audio composition instead of expensive AI video generation. Processing takes 1-2 minutes and outputs professional 9:16 vertical videos optimized for social platforms.\n\nThe template serves as both a showcase and building block for larger automation systems, with sticky notes providing clear guidance for customization and extension.\n\n## Who's it for\n\nContent creators, social media managers, and marketers who need consistent, high-quality video content without manual production work. Perfect for motivational content, storytelling videos, educational snippets, and brand campaigns.\n\n## How it works\n\nThe workflow uses a form trigger to collect video theme, setting, and style preferences. [ChatGPT](https://platform.openai.com/docs/guides/chat) generates cohesive scripts and image prompts, while [Google Gemini](https://ai.google.dev/) creates themed background images and [OpenAI TTS](https://platform.openai.com/docs/guides/text-to-speech) produces narrator audio. Background music is sourced from [Openverse](https://openverse.org/) for CC-licensed tracks. All assets are uploaded to [JsonCut API](https://jsoncut.com) which composes the final video with synchronized overlays, transitions, and professional audio mixing. Results are stored in [NocoDB](https://nocodb.com/) for management.\n\n## How to set up\n\n1. **JsonCut API**: Sign up at [jsoncut.com](https://jsoncut.com) and create an API key at [app.jsoncut.com](https://app.jsoncut.com). Configure HTTP Header Auth credential in n8n with header name `x-api-key`\n2. **OpenAI API**: Set up credentials for script generation and text-to-speech\n3. **Google Gemini API**: Configure access for Imagen 4.0 image generation  \n4. **NocoDB** (Optional): Set up instance for video storage and configure database credentials\n\n## Requirements\n\n- [JsonCut](https://jsoncut.com) free account with API key\n- [OpenAI API](https://platform.openai.com/) access for GPT and TTS\n- [Google Gemini API](https://ai.google.dev/) for image generation\n- [NocoDB](https://nocodb.com/) (optional) for result storage\n\n## How to customize the workflow\n\nThis template is designed as a foundation for larger automation systems. The modular structure allows easy modification of AI prompts for different content niches (business, wellness, education), replacement of the form trigger with RSS feeds or database triggers for automated content generation, integration with social media APIs for direct publishing, and customization of visual branding through [JsonCut configuration](https://docs.jsoncut.com). \n\nThe workflow can be extended for bulk processing, A/B testing multiple variations, or integration with existing content management systems. Sticky notes throughout the workflow provide detailed guidance for common customizations and scaling options.",
  "featuredImage": "/data/workflows/9687/9687.webp",
  "author": {
    "id": 101,
    "slug": "kesim0",
    "name": "8Automator",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 689,
  "downloads": 68,
  "createdAt": "2025-10-15T07:22:07.843Z",
  "updatedAt": "2026-01-16T09:01:29.866Z",
  "publishedAt": "2025-10-15T07:22:07.843Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9687"
}