{
  "id": 8860,
  "slug": "8860",
  "title": "Pdf RAG agent with Telegram chat & auto-ingestion from Google Drive",
  "description": "\n## How it works\n\nThis workflow creates an intelligent document assistant called \"Mookie\" that can answer questions based on your uploaded documents. Here's how it operates:\n\n- **Document Ingestion:** The system can automatically load PDF files from Google Drive or accept PDFs uploaded directly through Telegram, then processes and stores them in a PostgreSQL vector database using Mistral embeddings\n- **Smart Retrieval:** When users ask questions via Telegram or a web chat interface, the AI agent searches through the stored documents to find relevant information using vector similarity matching\n- **Contextual Responses:** Using GPT-4 and the retrieved document context, Mookie provides accurate answers based solely on the ingested documents, avoiding hallucination by refusing to answer questions not covered in the stored materials\n- **Memory & Conversation:** The system maintains conversation history for each user, allowing for natural follow-up questions and contextual discussions\n\n## Set up steps\n\n**Estimated setup time:** 30-45 minutes\nYou'll need to configure several external services and credentials:\n\n- Set up a PostgreSQL database with PGVector extension for document storage\n- Create accounts and API keys for Azure OpenAI (GPT-4), Mistral Cloud (embeddings), and Google Drive access\n\t- Connect your own LLM's if you don't have these credentials.\n- Configure a Telegram bot and obtain API credentials for chat functionality\n- Update webhook URLs throughout the workflow to match your n8n instance\n- Test the document ingestion pipeline with sample PDFs\n- Verify the chat interfaces (both Telegram and web) are responding correctly\n\n&gt;The workflow includes approval mechanisms for PDF ingestion and handles both automated bulk processing from Google Drive and real-time document uploads through Telegram. Read the sticky notes provided in the template code for clear instructions.",
  "featuredImage": "/data/workflows/8860/8860.webp",
  "author": {
    "id": 101,
    "slug": "mookielian",
    "name": "Meelioo",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 683,
  "downloads": 68,
  "createdAt": "2025-09-23T10:13:36.936Z",
  "updatedAt": "2026-01-16T08:57:59.660Z",
  "publishedAt": "2025-09-23T10:13:36.936Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8860"
}