{
  "id": 9953,
  "slug": "9953",
  "title": "Plant care reminder with OpenWeather, Sheets and Telegram",
  "description": "This workflow automates plant care reminders and records using Google Sheets, Telegram, and OpenWeather API.\n\nIt checks when each plant needs watering or fertilizing, sends a personalized reminder, and lets you confirm the task with a single button.\nWhen confirmed, it updates your Google Sheet and shows a confirmation HTML page.\n\n## Who is it for?\n\nHome gardeners who want to automate watering and fertilizing schedules. \n\nAnyone managing a plant collection, greenhouse, or garden and wanting a lightweight, no-code reminder system.\n\n## How it works\n\n1. Schedule Trigger starts the workflow once per day.\n2. Read Settings (Google Sheets) checks if vacation_mode is active.\n3. Read Plants (Google Sheets) retrieves all plants with columns such as id, plant, last_water, water_freq, etc.\n4. DecideDue (Code Node) compares today’s date with the last watering/fertilizing date and marks which plants are due.\n5. OpenWeather Request (optional) fetches local forecast for plants with coordinates and weather_delay = true.\n6. WeatherGate (Code Node) skips or delays watering if it recently rained or if rain is expected soon.\n7. Telegram Send Message sends a reminder for each due task.\n8. The message contains an inline button “Mark as done” linking to your webhook URL (opens confirmation window).\n9. Webhook – Confirm Done receives the click, update dates on Google Sheets, appends an optional log entry, and returns an HTML confirmation page.\n\n## Setup steps Principal Workflow\n1. Spreadsheet- Create a Google Sheets document with:\n\t1. plants sheet: (id, plant, last_water, water_freq, last_fert, fert_freq, lat, lon, weather_delay , indoor, thirst_level)\n\t2. settings sheet: (vacation_mode, timezone)\n\t3. log sheet: (ts, plant_id, action\tmessage_id)\n2. Connect your Google account\n3. Configure the Schedule Trigger\n4. Enable weather integration (Get a free OpenWeather API key) and add it to the HTTP Request node parameters **appid**. **https://openweathermap.org/api**\n5. Configure Telegram with your credential and your chat id on **{YOUR_CHAT_ID}**.\n6. Configure \"Send Dues\" node with your custom url https://**{YOUR_PROJECT_URL}**.app.n8n...\n\n## Setup steps Sub-Workflow (Webhook)\n\n1. Trigger: Configure your custom Path.\n\n2. Google Sheets: Connect your Google Account and Map sheets and columns.\n\n## Requirements\n\n· A Google account with access to Google Sheets.\n. A spreadsheet containing three sheets with headers matching the field names used in the workflow.\n. A telegram bot.\n. OpenWeather API key for climate-aware watering.\n\n## How to customise it\n\nAdd plant photos: Include a photo URL column and show it in the Telegram message.\n\nExtend actions: Add pruning, repotting or any other periodic task by duplicating the existing logic.",
  "featuredImage": "/data/workflows/9953/9953.webp",
  "author": {
    "id": 101,
    "slug": "nafri",
    "name": "Adrian",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 240,
  "downloads": 24,
  "createdAt": "2025-10-20T18:37:15.247Z",
  "updatedAt": "2026-01-16T09:02:44.444Z",
  "publishedAt": "2025-10-20T18:37:15.247Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9953"
}