{
  "id": 1898,
  "slug": "1898",
  "title": "Send a ChatGPT email reply and save responses to Google Sheets",
  "description": "This workflow sends a OpenAI GPT reply when an email is received from specific email recipients. It then saves the initial email and the GPT response to an automatically generated Google spreadsheet. Subsequent GPT responses will be added to the same spreadsheet.\n\nAdditionally, when feedback is given for any of the GPT responses, it will be recorded to the spreasheet, which can then be used later to fine-tune the GPT model.\n\n## Prerequisites\n\n- [OpenAI credentials](https://docs.n8n.io/integrations/builtin/credentials/openai/)\n- [Google credentials](https://docs.n8n.io/integrations/builtin/credentials/google/)\n\n## How it works\n\nThis workflow is essentially a two-in-one workflow. It triggers off from two different nodes and have very different functionality from each trigger.\n\nThe flow triggered from `On email received` node is as follows:\n\n1. Triggers off on the `On email received` node.\n2. Extract the email body from the email.\n3. Generate a response from the email body using the `OpenAI` node.\n4. Reply to the email sender using the `Send reply to recipient` node. A feedback link is also included in the email body which will trigger the `On feedback given` node. This is used to fine-tune the GPT model.\n5. Save the email body and OpenAI response to a Google Sheet. If a sheet does not exist, it will be created.\n\nThe flow triggered from `On feedback given` node is as follows:\n\n1. Triggers off when a feedback link is clicked in the emailed GPT response.\n2. The feedback, either positive or negative, for that specific GPT response is then recorded to the Google Sheet.",
  "featuredImage": "/data/workflows/1898/1898.webp",
  "author": {
    "id": 101,
    "slug": "n8n-team",
    "name": "n8n Team",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 18721,
  "downloads": 1872,
  "createdAt": "2023-03-10T15:30:33.270Z",
  "updatedAt": "2026-01-16T08:22:13.410Z",
  "publishedAt": "2023-03-10T15:30:33.270Z",
  "nodes": 49,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/1898"
}