{
  "id": 7927,
  "slug": "7927",
  "title": "ScrapingBee and Google Sheets integration template",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n![Screenshot 20250904 at 9.57.43 AM.png](fileId:2311)\n\nThis workflow allows users to extract sitemap links using ScrapingBee API. It only needs the domain name www.example.com and it automatically checks robots.txt and sitemap.xml to find the links. It is also designed to recursively run the workflow when new .xml links are found while scraping the sitemap.\n\n## How It Works\n1. Trigger: The workflow waits for a webhook request that contains `domain=www.example.com`\n2. It then looks for `robots.txt` file, if not found it checks `sitemap.xml`\n3. Once it finds xml links, it recursively scrapes them to extract the website links\n4. For each xml file, first it checks whether it's a binary file and whether it's a compressed xml\n5. If it's a text response, it directly runs a code that extracts normal website link and another code to extract xml links\n6. If it's a binary that is not compressed, it just extracts text from the binary and then extract webiste links and xml links\n7. If it's a compressed binary, it first decompresses it and then extracts the text and then the links and xml\n8. After extracting website links, it appends those links directly to a sheet\n9. After extracting xml links, it scrapes them recursively until it finds all website links\n\nWhen the workflow is finished, you will see the output in the `links` column of the Google Sheet that we added to the workflow.\n\n![Screenshot 20250904 at 10.08.42 AM.png](fileId:2310)\n\n\n## Set Up Steps\n1. Get your ScrapingBee API Key [here](https://www.scrapingbee.com/?utm_source=n8n&utm_medium=template)\n2. Create a new google sheet with an empty column named `links`. Connect to the sheet by signing in using your Google Credential and add the link to your sheet.\n3. Copy the webhook url, and send a GET request with `domain` as query parameter. Example:\n```\ncurl \"https://webhook_link?domain=scrapingbee.com\"\n```\n----\n\n## Customisation Options\n1. If the website you are scraping is blocking your request, you can try using premium or stealth proxy in `Scrape robots.txt file`, `Scrape sitemap.xml file`, and `Scrape xml file` nodes.\n2. If you wish to store the data in a different app/tool or store it as a file, you would just need to replace `Append links to sheet` node with a relevant node.\n----\n\n## Next Steps\nIf you wish to scrape the pages using the extracted links, then you can implement a new workflow that reads the sheet or file (output generated by this workflow) for links and for each link send a request to ScrapingBee's `HTML API` and save the returned data.\n\n----\n**NOTE:** Some heavy sitemaps could result in a crash if the workflow consumes more memory than what is available in your n8n plan or self-hosted system. If this happens, we would recommend you to either upgrade your plan or use a self-hosted solution with a higher memory.\n",
  "featuredImage": "/data/workflows/7927/7927.webp",
  "author": {
    "id": 101,
    "slug": "scrapingbee",
    "name": "Sahil Sunny",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 189,
  "downloads": 18,
  "createdAt": "2025-08-27T01:40:57.663Z",
  "updatedAt": "2026-01-16T08:53:02.980Z",
  "publishedAt": "2025-08-27T01:40:57.663Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7927"
}