{
  "id": 11095,
  "slug": "11095",
  "title": "Automate Pokemon card stock monitoring with Apify, AI, and Slack alerts",
  "description": "# Pokemon Card Sales & Stock Monitor Workflow\n\n## Who’s it for\nThis workflow is designed for **Pokemon Card Game (Pokéca)** players, collectors, or resellers in Japan who want to automate the discovery of new card releases and restock information. It is particularly useful for those who want to filter through social media noise and cross-reference rumors with official inventory data.\n\n## How it works / What it does\n1.  **Social Media Scraping:** The workflow triggers manually and uses **Apify** (specifically the \"Tweet Scraper V2\" actor) to search X (formerly Twitter) for Japanese keywords like \"Pokemon Card\" (ポケモンカード), \"Sales Info\", and \"Pokeca\".\n2.  **Data Processing:** It splits the scraped tweets into batches to process them individually.\n3.  **AI Analysis (Step 1 - Social Verification):** An **AI Agent** (powered by OpenRouter) analyzes the tweet text to determine if it contains valid sales or stock information. It utilizes an **HTTP Request Tool** to access the official Pokemon Card Map (`map.pokemon-card.com`) to identify mentioned retailers.\n4.  **AI Analysis (Step 2 - Official Stock Check):** A second **AI Agent** takes the filtered information and checks official sources. It uses **HTTP Request Tools** to browse the official Pokemon Card Product page and the Pokemon Center Online store to verify if products are actually purchasable.\n5.  **Notification:** Finally, the workflow compiles the findings into a \"Sales Flash Report\" and sends it to a specified **Slack** channel.\n\n## How to set up\n1.  **Import the Workflow:** Copy the JSON code block below and paste it into your n8n editor.\n2.  **Configure Credentials:**\n    *   **Apify:** Create an account on Apify, subscribe to the \"Tweet Scraper V2\" actor, and add your API Token to the n8n credential store.\n    *   **OpenRouter:** Add your OpenRouter API key to power the LLM Chat Models.\n    *   **Slack:** Connect your Slack account using OAuth2 or a Bot Token.\n3.  **Configure Apify Node:** Ensure the `actorId` in the \"Run an Actor\" node matches the ID for the Tweet Scraper you intend to use.\n4.  **Set Slack Destination:** Open the \"Send a message\" node. You will need to select the **Channel** where you want the alerts to appear.\n\n## Requirements\n*   **n8n Version:** A recent version of n8n that supports the `@n8n/n8n-nodes-langchain` (AI Agent) nodes.\n*   **Apify Account:** Paid or free tier with enough compute units to run the scraper.\n*   **OpenRouter Account:** To provide the Language Model (LLM) intelligence.\n*   **Slack Workspace:** To receive the notifications.\n\n## How to customize the workflow\n*   **Automate Execution:** Currently, the workflow uses a \"Manual Trigger\". Replace this with a **Schedule Trigger** node (e.g., set to run every 30 minutes) to make it a fully automated monitoring bot.\n*   **Adjust Search Terms:** In the **Apify** node, modify the `searchTerms` array in the JSON input to look for specific sets (e.g., \"Shiny Treasure\", \"151\") or other trading card games.\n*   **Change Notification Channel:** If you prefer Discord, Line, or Telegram, remove the Slack node and replace it with the corresponding messaging node.\n*   **Modify AI Logic:** You can adjust the system prompt in the **AI Agent** nodes to change how strict the AI is about what counts as \"stock available\" versus just \"news\".",
  "featuredImage": "/data/workflows/11095/11095.webp",
  "author": {
    "id": 101,
    "slug": "furuidoreandoro",
    "name": "furuidoreandoro",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 49,
  "downloads": 4,
  "createdAt": "2025-11-21T11:13:20.273Z",
  "updatedAt": "2026-01-16T09:07:33.313Z",
  "publishedAt": "2025-11-21T11:13:20.273Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11095"
}