{
  "id": 8928,
  "slug": "8928",
  "title": "Generate SEO anchor texts from Google Sheets with Claude 4 Sonnet",
  "description": "# SEO Anchor Text Generator with n8n and Claude AI\nGenerate optimized SEO anchor texts for internal linking using AI automation. This workflow processes your website pages and creates diverse, SEO-compliant anchor variations automatically.\n## Who's it for\n- SEO specialists managing large websites with extensive internal linking needs\n- Content managers looking to automate anchor text creation for better search rankings\n- Digital marketers seeking to optimize internal linking strategies at scale\n- Web agencies handling multiple client websites with SEO requirements\n## What it does\nThis workflow automatically generates 10 unique SEO anchor texts with 3-5 linguistic variations each (40-50 total variations per page) using Claude AI. It analyzes your page content, applies advanced SEO criteria, and creates diverse anchor types including exact match, brand anchors, long-tail keywords, contextual phrases, and call-to-action variants.\n## How it works\nThe system connects to your Google Sheets document containing page information, filters pages needing anchor generation, processes each page individually through Claude AI, and updates your spreadsheet with generated anchor texts. The workflow ensures semantic relevance, keyword optimization, natural language flow, and linguistic diversity while avoiding over-optimization penalties.\n## Requirements\n- Google Sheets with OAuth2 authentication configured in n8n\n- Anthropic API key for Claude AI model access\n- Template spreadsheet with proper column structure (Page, URL, Description, Anchors)\n- Pages must have URL and description but empty anchor fields to trigger processing\n## How to set up\n### Step 1: Prepare Your Data\n\nDuplicate the template spreadsheet: https://docs.google.com/spreadsheets/d/1VNl8xLYgRrNcKrmN9hCdfov1dMnwD44tAALJZAlagCo\nFill in your page information in the \"Anchor\" sheet:\n- Page: Name/title of your page (can use hierarchical levels Niv 0-3)\n- URL: Complete URL of the page\n- Description: Brief description of page content to help AI generate relevant anchors\nLeave the \"Anchors\" column empty for pages needing anchor generation\n\n### Step 2: Configure n8n Credentials\n\nSet up Google Sheets OAuth2:\n- Go to n8n credentials settings\n- Add new Google Sheets OAuth2 API credential\n- Follow OAuth flow to authenticate with Google\n- Test connection with your spreadsheet\nConfigure Anthropic API:\n- Obtain API key from Anthropic Console\n- Add new Anthropic API credential in n8n\n- Enter your API key and test connection\n\n### Step 3: Import and Activate Workflow\n\nImport the workflow from the provided JSON\nUpdate credential references to match your configured credentials\nTest the Chat Trigger webhook to ensure it's accessible\nActivate the workflow in n8n\n\n### Step 4: Execute the Workflow\n\nSend a chat message with your Google Sheets URL to trigger the workflow\nMonitor execution through n8n interface to track progress\nCheck your spreadsheet for automatically generated anchor texts\nReview and customize generated anchors as needed for your content\n\n## How to customize the workflow\n### Modify AI Prompt Instructions\nUpdate the \"Générateur d'ancres\" node prompt to:\n- Change the number of anchor variations generated\n- Adjust SEO criteria and anchor types\n- Modify linguistic variation requirements\n- Customize language style and tone\n- Add specific industry terminology\n### Adjust Data Processing\nCustomize the \"Filter\" node conditions to:\n- Change criteria for pages requiring anchor generation\n- Add additional validation rules\n- Modify column names to match your spreadsheet structure\n### Enhance Output Formatting\nModify the \"Import Sheets\" code node to:\n- Change data transformation logic\n- Add additional processing steps\n- Customize how results are formatted for Google Sheets\n- Include timestamp or processing metadata\n### Scale for Large Datasets\nOptimize the \"Loop Over Items\" batch processing:\n- Adjust batch sizes for better performance\n- Add error handling for failed API calls\n- Implement retry logic for robustness\n- Add progress tracking mechanisms\n### Integration Extensions\nExtend functionality by adding nodes for:\n- Slack notifications when processing completes\n- Email reports with generation statistics\n- Integration with content management systems\n- Automated content publishing with generated anchors\n## Advanced Customization Tips\n- Language Adaptation: Modify the AI prompt for different languages by adjusting linguistic variation rules\n- Industry Specialization: Add domain-specific terminology and SEO best practices to the prompt\n- Quality Control: Implement additional filtering to review generated anchors before updating sheets\n- Analytics Integration: Connect with Google Analytics to prioritize high-traffic pages for anchor generation\n- Content Integration: Add nodes to automatically insert generated anchors into CMS or static site generators",
  "featuredImage": "/data/workflows/8928/8928.webp",
  "author": {
    "id": 101,
    "slug": "growthai",
    "name": "Growth AI",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 122,
  "downloads": 12,
  "createdAt": "2025-09-25T14:42:12.794Z",
  "updatedAt": "2026-01-16T08:58:23.010Z",
  "publishedAt": "2025-09-25T14:42:12.794Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8928"
}