{
  "id": 8563,
  "slug": "8563",
  "title": "Create LinkedIn content from Telegram voice/text using Whisper, GPT-4 & Dumpling AI",
  "description": "## 🧾 What this workflow does\n\nThis automation turns a **Telegram voice or text message** into a high-quality LinkedIn post using OpenAI’s Whisper, Dumpling AI and GPT-4, and then repurposes that same message into a content idea with visual inspiration using Dumpling AI. All outputs are saved to Airtable for review, approval, and scheduling.\n\n---\n\n## 👤 Who is this for\n\n- Founders or creators sharing ideas while walking or multitasking  \n- Content teams turning voice memos into carousel content  \n- Personal brands posting on LinkedIn with minimal manual work  \n- Virtual assistants or SMMs handling voice-driven content tasks  \n\n---\n\n## ⚙️ How to set up\n\n### ✅ Requirements\n\nYou’ll need active accounts for:\n- Telegram Bot (via n8n’s Telegram Trigger node)\n- OpenAI (for Whisper and GPT-4)\n- Dumpling AI (to search Google and create Image)\n- Airtable (to log your posts)\n\nIn Airtable, create a table with the following fields:\n- `Ideas` (Single line text)\n- `Context` (Long text)\n- `Image URL` (URL)\n\n---\n\n### 🔧 Setup steps\n\n1. **Set up your Telegram bot**\n   - Use BotFather to create a bot and get your token\n   - Add the bot to a private group or channel\n\n2. **Connect all credentials in n8n**\n   - Telegram Trigger (Bot Token)\n   - OpenAI (for Whisper + GPT-4)\n   - Dumpling AI (HTTP Auth)\n   - Airtable (OAuth or Personal Token)\n\n3. **Update node parameters**\n   - In the Telegram Trigger node, specify your bot and listening chat\n   - In the HTTP node for Dumpling AI, add your API key via header\n   - In Airtable nodes, map to your base and table correctly\n\n4. **Optional prompt customization**\n   - In the GPT-4 node, you can update the prompt for tone, formatting, or CTA style\n5. **Optional**: Adjust the Dumpling AI prompt to suit your niche (e.g., health, tech, finance).\n---\n\n## 🧠 How it works\n\n1. The Telegram bot receives a voice message.\n2. Whisper transcribes the voice into clean text.\n3. GPT-4 formats the text into a polished LinkedIn post.\n4. Dumpling AI:\n   - Generates a short-form **content idea** from the transcript.\n   - Creates a branded **image prompt** and renders a matching image.\n5. The full set of outputs (text, idea, image) is saved to Airtable.\n6. You can now review and schedule the post manually or via another automation. \n\n---\n\n## 🛠️ Customization ideas\n\n- Swap Telegram for WhatsApp or voice memos via Google Drive  \n- Add moderation or approval steps before saving to Airtable  \n- Send the LinkedIn post directly to Buffer or Hootsuite for auto-posting  \n- Generate post captions or hashtags using GPT-4 before publishing  \n- Extend the workflow to auto-create carousel slides from the content idea \n---\n\nThis workflow makes it easy to share your voice with your audience — literally. Whether you're walking, thinking out loud, or sending team updates, this automation turns your spoken ideas into professional content, ready to post or polish.\n",
  "featuredImage": "/data/workflows/8563/8563.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 203,
  "downloads": 20,
  "createdAt": "2025-09-13T20:20:50.989Z",
  "updatedAt": "2026-01-16T08:56:29.727Z",
  "publishedAt": "2025-09-13T20:20:50.989Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8563"
}