{
  "id": 6116,
  "slug": "6116",
  "title": "Extract LinkedIn profiles with Apify & auto-generate lead data for Google Sheets CRM",
  "description": "# Overview\n\n\nThis professional n8n automation suite transforms LinkedIn prospecting from manual drudgery into intelligent automation. Instead of spending hours copying profile data into spreadsheets, simply paste LinkedIn URLs and get complete lead intelligence with email patterns, lead scoring, and CRM-ready data in minutes. The system supports multiple input methods from simple Google Sheets to advanced webhook integrations, making it perfect for individual sales reps, teams, or agencies. Built with enterprise-grade Apify integration and smart lead scoring algorithms, this replaces expensive tools like ZoomInfo while providing better customization and unlimited usage.\nUse cases: Sales prospecting, recruitment sourcing, business development research, networking event follow-up, competitive intelligence gathering, agency client prospecting.\n\n\n# How it works\n\nThe workflow supports three input methods and automatically processes LinkedIn profiles via Apify scraper. When you provide LinkedIn URLs through Google Sheets, manual trigger, or webhook, the system extracts complete profile data including name, company, position, and connections. It then generates multiple email pattern variations and calculates lead scores based on authority indicators like job title, connection count, and location. All processed data is automatically added to your Google Sheets CRM with lead quality ratings and email guesses ready for outreach.\n\n**Input Sources:** Google Sheets monitoring, manual trigger, or webhook API  \n**Processing:** Apify LinkedIn scraper + intelligent data enrichment  \n**Output:** Complete CRM-ready lead profiles with email intelligence  \n**Timing:** Real-time processing or batch every 5 minutes\n\n# Set up instructions\n\n* Set up Apify account and get API token for LinkedIn profile scraper access\n* Copy the provided Google Sheets template to your Google Drive account\n* Configure Google Sheets credentials in n8n and update sheet IDs in workflow nodes\n* Replace \"YOUR_APIFY_API_TOKEN\" placeholder with your actual Apify API key\n* The schedule trigger checks for new entries every 5 minutes but feel free to adjust timing\n* Test the workflow by adding LinkedIn URLs to input sheet with Status set to \"new\"\n* For webhook usage, configure the endpoint URL and test with sample POST requests\n* Customize lead scoring criteria in the code node based on your target market",
  "featuredImage": "/data/workflows/6116/6116.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 125,
  "downloads": 12,
  "createdAt": "2025-07-18T04:57:39.346Z",
  "updatedAt": "2026-01-16T08:43:14.977Z",
  "publishedAt": "2025-07-18T04:57:39.346Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6116"
}