{
  "id": 7406,
  "slug": "7406",
  "title": "Generate leads from Google Maps with email",
  "description": "## Google Maps Lead Generation and Email Scraper\n**Categories:** Lead Generation, Web Scraping, Business Automation\n\nThis workflow creates a completely free Google Maps email scraping system that extracts unlimited business emails without requiring expensive third-party APIs. Built entirely in N8N using simple HTTP requests and JavaScript, this system can generate thousands of targeted leads for any industry or location while operating at 99% free cost structure.\n\n---\n### Benefits\n* **Zero API Costs** - Operates entirely through free Google Maps scraping without expensive third-party services\n* **Unlimited Lead Generation** - Extract emails from thousands of Google Maps listings across any industry\n* **Geographic Targeting** - Search by specific cities, regions, or business types for precise lead targeting\n* **Built-in Data Cleaning** - Automatic duplicate removal, filtering, and data validation\n* **Scalable Processing** - Handle hundreds of businesses per search with intelligent rate limiting\n\n### How It Works\n\n1.  **Lead Ingestion**: I have given a free browser extension to scrape leads from **Google Maps** and import them directly into a **Google Sheet**.\n\t1. Business Name\n\t2. Business Phone Number\n\t3. Business Emails (From Step 3)\n\t3. Rating\n\t4. Reviews Count\n\t5. Industry\n\t6. Address\n\t7. Website\n\t8. Google Map Link\n2.  **Website Crawling**: The n8n workflow reads the leads from your sheet and automatically crawls each website to find all internal pages.\n3.  **Email Extraction**: For each page, the workflow intelligently scrapes for email addresses, filtering out image files and other non-relevant data.\n4.  **Enrich and Update**:\n    * If an email is found, the workflow updates the corresponding row in your Google Sheet with the new email address.\n    * If no email is found after crawling the main page and all sub-pages, it marks the lead as \"Not Found\" so you can easily track your progress.\n\n---\n\n### Requirements\n\n* **n8n**: A self-hosted or cloud instance of n8n.\n* **Google Sheets**: A Google account with a designated spreadsheet for your Google Maps leads.\n* **Browser Extension**: A free Google Maps scraping extension to get your initial lead data into the Google Sheet.\n\n---\n\n### How to Use\n\n1.  **Set up your spreadsheet**: Use the browser extension to scrape leads from Google Maps and populate your Google Sheet. Make sure the sheet has a column named **\"Website\"** and a column named **\"Processed for Email\"** (with an initial value of \"Pending\").\n2.  **Configure the workflow**: Import this n8n workflow JSON into your n8n instance and connect your **Google Sheets** credentials.\n3.  **Run the workflow**: Click the \"Execute workflow\" button to start the process. The workflow will automatically begin crawling websites and enriching your lead list with emails.\n\n### Business Use Cases\n* Local Service Providers - Find competitors and potential partners in specific geographic areas\n* B2B Sales Teams - Generate targeted prospect lists for cold outreach campaigns\n* Marketing Agencies - Build industry-specific lead databases for client campaigns\n* Real Estate Professionals - Identify businesses in target neighborhoods for commercial opportunities\n* Franchise Development - Research potential markets and existing competition\n* Market Research - Analyze business density and contact information across regions\n\n### Revenue Potential\nThis system transforms lead generation economics:\n\n* $0 per lead vs. $2-5 per lead from paid databases\n* Process 1,000+ leads daily without hitting API limits\n* Sell as a service for $500-2,000 per industry/location\n* Perfect for agencies offering lead generation to local businesses\n* Difficulty Level: Intermediate\n* Estimated Setup Time: 30 min\nMonthly Operating Cost: $0 (completely free)\n\n### Advanced Optimizations we have\nScale the system with:\n\n* Multi-Page Scraping: Extract URLs from homepages, then scrape contact pages for more emails\n* Proxy Integration: Add residential proxies for unlimited scraping without rate limits",
  "featuredImage": "/data/workflows/7406/7406.webp",
  "author": {
    "id": 101,
    "slug": "zain",
    "name": "Zain Khan",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 237,
  "downloads": 23,
  "createdAt": "2025-08-14T23:03:21.857Z",
  "updatedAt": "2026-01-16T08:50:12.429Z",
  "publishedAt": "2025-08-14T23:03:21.857Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7406"
}