{
  "id": 5678,
  "slug": "5678",
  "title": "Automate email filtering & AI summarization. 100% free & effective, works 7/24",
  "description": "![dddss.png](fileId:1796)\n## Good to know:\nThis workflow automatically processes incoming emails (you can filter them base on your needs) and creates concise AI-powered summaries, then logs them to a Google Sheets spreadsheet for easy tracking and analysis.\n\n## Who is this for?\n\n➖Business professionals who receive many emails and need quick summaries\n➖Customer service teams tracking email communications\n➖Project managers monitoring email correspondence\n➖Anyone who wants to automatically organize and summarize their email communications\n\n## What problem is this workflow solving?\n\nThis workflow solves the problem of email overload by automatically reading incoming emails, generating concise summaries using AI, and organizing them in a structured format. It eliminates the need to manually read through every email to understand the key points and maintains a searchable record of communications.\n\n## What this workflow does:\n\n✅Monitors your Gmail inbox for new emails\n✅Filters emails based on specific criteria (sender validation)\n✅Extracts key information (sender, date, subject, content)\n✅Uses AI to generate concise summaries of email content\n✅Automatically logs all data including the AI summary to a Google Sheets spreadsheet\n\n## How it works:\n\n1️⃣Gmail trigger monitors for new emails at specified intervals\n2️⃣Email data is processed and formatted using JavaScript\n3️⃣A conditional check validates the sender\n4️⃣AI agent (powered by Groq's language model) reads the email content and generates a summary\n5️⃣All information is automatically appended to a Google Sheets document\n\n## How to use:\n\nSet up Gmail OAuth2 credentials in n8n\nConfigure Google Sheets OAuth2 credentials\nSet up Groq API credentials for AI processing\nCreate a Google Sheets document and update the document ID\nCustomize the sender validation criteria as needed\nActivate the workflow\n\n## Requirements:\n\n✅n8n instance (cloud or self-hosted)\n✅Gmail account with OAuth2 access\n✅Google Sheets account\n✅AI API\n✅Basic understanding of n8n workflow\n\n## Customizing this workflow:\n\n🟢Modify the Gmail trigger filters to target specific labels or criteria\n🟢Adjust the sender validation logic in the conditional node\n🟢Customize the AI prompt to change summary style or focus\n🟢Add additional data fields to the Google Sheets output\n🟢Change the polling frequency for checking new emails\n🟢Switch to different AI models by replacing the Groq node\n",
  "featuredImage": "/data/workflows/5678/5678.webp",
  "author": {
    "id": 101,
    "slug": "arre",
    "name": "ARRE",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 27442,
  "downloads": 2744,
  "createdAt": "2025-07-04T16:45:16.027Z",
  "updatedAt": "2026-01-16T08:40:52.330Z",
  "publishedAt": "2025-07-04T16:45:16.027Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5678"
}