{
  "id": 4973,
  "slug": "4973",
  "title": "Automated SSL Certificate Monitoring and Renewal with Notion and Telegram",
  "description": "Automatically fetch existing domains from Notion's Database and verify the validity of SSL certificates through [SSL-Checker](https://ssl-checker.io/). If the validity period is less than 14 days, send a Telegram message notification and trigger SSH remote automatic refresh. Successful refresh notification will be sent through Telegram.\nThis can prevent problems with the server-side automatic refresh program, which may cause unexpected service interruptions.\n\n**Main use cases:**\n- Notion store domain.\n- Telegram receives warning messages.\n- Remotely trigger [Certbot](certbot) to refresh SSL.\n\n**How it works:**\n- Record who triggered this workflow, because if there is a credential that is about to expire, this workflow will be triggered repeatedly.\n- After getting all the domains from Notion, send an http request to SSL-Checker.\n- After getting all the SSL-Checker results, add the validity label. And use the IF node to check if there are any certificates that are about to expire.\n\nThen there are two workflows:\n- If there is a certificate that is about to expire: send an SSH command to the remote control server to refresh the certificate, notify through Telegram, and call this workflow again to re-verify the validity of the SSL certificate.\n- If the validity period of SSL is normal: then refresh the data on Notion, and if a re-called workflow is detected, Telegram will be used to notify that the SSL has been updated.\n\n\n",
  "featuredImage": "/data/workflows/4973/4973.webp",
  "author": {
    "id": 101,
    "slug": "frankchen",
    "name": "Frank Chen",
    "avatar": ""
  },
  "categories": [
    "SecOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1446,
  "downloads": 144,
  "createdAt": "2025-06-16T14:20:52.859Z",
  "updatedAt": "2026-01-16T08:37:06.769Z",
  "publishedAt": "2025-06-16T14:20:52.859Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4973"
}