{
  "id": 8520,
  "slug": "8520",
  "title": "Lead analysis & personalized email generation with OpenAI, Firecrawl & gotoHuman",
  "description": "![wflow pic.jpg](fileId:2625)\n## 💼 Lead Outreach Agent\nThis AI workflow helps you quickly react to new leads with an initial personalized outreach. A great start of your lead nurturing sequence to avoid loosing precious leads that could turn into paying customers.\nMost importantly it uses **gotoHuman** so you can review the AI-analysis and the AI-generated editable email draft before it is sent out in your name.\n\n### How it works\n1. We receive a new form submission incl. the email address and company name of the prospect and extract the website URL from the address. We proceed only for company email addresses.\n2. We scrape the website using Firecrawl and summarize it with OpenAI\n3. Our AI agent runs an analysis based on the lead information and documents describing our own company and the defined Ideal Customer Profiles.\nIt also fetches previously approved examples from **gotoHuman** so you're effectively creating a **self-learning** agent.\nIt responds with the analysis and the drafted outreach email.\n4. Human Approval in **gotoHuman**. Allows editing the drafted email.\n5. We can now send our email including any edits made during the review and be sure that we are using high-quality content instead of AI slop.\n\n### How to set up\n\n1. **Most importantly, [install the gotoHuman node](https://docs.gotohuman.com/Integrations/n8n#add-the-node) before importing this template!**\n(Just add the node to a blank canvas before importing)\n2. Set up your credentials for the different services\n3. In gotoHuman, select and create the pre-built review template \"Lead Outreach Agent\" or import the ID: `T873fI1Xli5nt3eh33Rj`\n4. Select this template in the gotoHuman node\n\n## Requirements\n\nYou need accounts for\n- gotoHuman (Human Supervision)\n- OpenAI (AI Agent)\n- Typeform (Lead Form Submissions)\n- Firecrawl (Website Scraping)\n- Gmail\n- Google Docs (Company Wiki)\n\n## How to customize\n\n- Replace the Typeform trigger with any other way you might receive or find new leads\n- Provide the _AI Sales Agent_ with more context to properly analyze the lead and create better personalized emails. Consider adding tools that allow the agent to fetch more infos about the prospect's company or personal profile, or to find out more about your specific product/service offerings and how your sales pitches look like.",
  "featuredImage": "/data/workflows/8520/8520.webp",
  "author": {
    "id": 101,
    "slug": "gotohuman",
    "name": "gotoHuman",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 344,
  "downloads": 34,
  "createdAt": "2025-09-12T11:59:05.431Z",
  "updatedAt": "2026-01-16T08:56:17.533Z",
  "publishedAt": "2025-09-12T11:59:05.431Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8520"
}