{
  "id": 7885,
  "slug": "7885",
  "title": "Subscription tracker & reminders with GPT-4 nano, Telegram & Google Sheets",
  "description": "This workflow manages subscription billing reminders and data updates via Telegram. It runs daily at 8:00 AM to check for upcoming due subscriptions, formats relevant information, and sends reminders to users. It also processes user messages for subscription management—adding, updating, or retrieving billing info—using AI-powered natural language understanding.\n\nMain outcomes include automated subscription tracking, timely reminders, and conversational interaction through Telegram, reducing manual tracking efforts and improving billing accuracy.\n\nAutomation Benefits\nTime & Cost Savings\nManual Process: Several hours/week spent managing subscriptions and reminders manually.\nAutomated Process: Workflow completes checks, reminders, and data updates in under a minute.\nTime Savings: Saves approximately 5 hours weekly, translating to significant productivity gains and cost reduction.\n\nROI: Automation pays for itself within the first month due to saved labor.\nError Reduction: Minimized manual entry errors, ensuring accurate billing records and timely reminders.\n\nBusiness Impact\nSolves the problem of manual subscription tracking and reminders.\nScales effortlessly as subscription list grows.\nOpens new opportunities for proactive customer engagement, personalized messaging, and integrated billing insights.\n\nSetup Guide\n\nPrerequisites\nGoogle Sheets account with subscription data sheet.\nOpenAI API key with access to GPT-4.\nTelegram bot token with messaging permissions.\nEmail SMTP setup if email reminders are used.\n\nAPI Configuration\nGoogle Sheets: Generate OAuth2 credentials, enable Sheets API, and authorize access.\nOpenAI: Create API key, set model to GPT-4, and test connectivity.\nTelegram: Create bot via BotFather, retrieve token, and set webhook URL.\nWebhook URL: Use the provided URL in the Telegram bot settings.\n\nNode-by-Node Setup\nOpenAI Chat Model: Enter API credentials, select GPT-4 model.\nGoogle Sheets: Input spreadsheet ID, sheet name, and ensure correct permissions.\nTelegram Nodes: Insert chat ID, message parsing, and response formatting.\nSchedule Trigger: Confirm cron expression for daily execution.\nFor AI nodes, test with sample messages to verify formatting and extraction.\n\nTesting & Validation\nRun workflow manually.\nConfirm data is retrieved, processed, and responses sent.\nVerify subscription updates in Google Sheets.\nCheck Telegram chats for correct message flow.\n\nN8N Documentation References\nGoogle Sheets Node\nOpenAI Node\nTelegram Node\nSchedule Trigger\n\nMaintenance & Troubleshooting\n\nRegular Maintenance (Monthly)\nCheck API credentials and renew tokens if expired.\nMonitor workflow logs for errors.\nReview Google Sheets data for consistency.\nUpdate API keys when new versions or permissions are granted.\nVerify currency conversion accuracy periodically.\n\nCommon Issues & Solutions\nWorkflow not triggering: check schedule settings and webhook URLs.\nData not updating: verify Google Sheets credentials and permissions.\nIncorrect responses: test AI prompt inputs and outputs.\nAPI failures: regenerate API keys or check quota limits.\nReconfigure nodes if external API changes.\nMonitoring & Alerts\nSet up email or Slack alerts for failures.\nRegularly review execution logs.\nTrack key metrics like successful runs, error rates, and response times.\nSupport & Escalation\nCheck n8n logs first for errors.\nExport workflow for support if needed.\nUse n8n community forums for common issues.\nContact API providers for account-specific problems.\nEmergency procedures: restart workflow, regenerate tokens.\n\nUpdates & Improvements\nReview workflow performance quarterly.\nOptimize AI prompts for better accuracy.\nBackup workflow configurations before major changes.\nIncorporate user feedback for feature enhancements.",
  "featuredImage": "/data/workflows/7885/7885.webp",
  "author": {
    "id": 101,
    "slug": "mondavid16",
    "name": "Ramon David",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 508,
  "downloads": 50,
  "createdAt": "2025-08-26T08:01:41.754Z",
  "updatedAt": "2026-01-16T08:52:50.974Z",
  "publishedAt": "2025-08-26T08:01:41.754Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7885"
}