{
  "id": 8738,
  "slug": "8738",
  "title": "Daily topic news digest with Gemini AI, Decodo MCP and Slack",
  "description": "## Try It Out!\n\nThis n8n template demonstrates how to build an autonomous AI news agent using Decodo MCP that automatically finds, scrapes, and delivers fresh industry news to your team via Slack. \n\nUse cases are many – automated news monitoring for your industry, competitive intelligence gathering, startup monitoring, regulatory updates, research automation, or daily briefings for your organization.\n\n### How it works\n\n- Define your news topics using the Set node – AI, MCP, web scraping, whatever matters to your business.\n- The AI Agent processes those topics using the Gemini Chat Model, determining which tools to use and when.\n- Here's where it gets interesting: Decodo MCP gives your AI agent the tools to search Google, scrape websites, and parse content automatically – all while bypassing geo-restrictions and anti-bot measures.\n- The agent hunts for fresh articles from the last 48 hours, extracts clean data, and returns structured JSON results.\n- Format Results cleans up the AI's messy output and removes duplicates.\n- Your polished news digest gets delivered to Slack with clickable links and summaries.\n\n### How to use\n\n- Schedule trigger runs daily at 9 AM – adjust timing or swap for webhook triggers as needed.\n- Customize topics in the Set node to match your industry.\n- Scales effortlessly: add more topics, tweak search criteria, done.\n\n### Requirements\n\n- Decodo MCP credentials ([free trial available](https://dashboard.decodo.com/)) – grab the [Smithery connection URL with keys](https://decodo.com/blog/how-to-set-up-mcp-server#h2-step_4:_configure_the_mcp_server_) and paste it straight into your n8n MCP node. Done.\n- [Gemini API key](https://aistudio.google.com/app/apikey) for the AI processing – drop it into the Google Gemini Chat Model node and pick whichever [Gemini model](https://ai.google.dev/gemini-api/docs/models) fits your needs.\n- Slack workspace for delivery – [n8n's Slack integration docs](https://docs.n8n.io/integrations/builtin/app-nodes/n8n-nodes-base.slack/) have you covered.\n\n### What the final output looks like\n\nHere's what your team receives in Slack every morning:\n\n![gemini_decodo_mcp_news_automationresults.png](fileId:2663)\n\n### Need help?\n\nJoin the [Discord](https://discord.com/invite/gvJhWJPaB4) or email [support@decodo.com](mailto:support@decodo.com) for questions.\n\nHappy Automating!",
  "featuredImage": "/data/workflows/8738/8738.webp",
  "author": {
    "id": 101,
    "slug": "triposat",
    "name": "Satyam Tripathi",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 307,
  "downloads": 30,
  "createdAt": "2025-09-19T06:20:40.108Z",
  "updatedAt": "2026-01-16T08:57:27.772Z",
  "publishedAt": "2025-09-19T06:20:40.108Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8738"
}