{
  "id": 7536,
  "slug": "7536",
  "title": "Automate website tool analysis with Telegram, Apify, AI & Google Sheets",
  "description": "#### Description\nThis powerful workflow automates the evaluation of new digital tools, websites, or platforms with the goal of assessing their potential impact on your business. By leveraging Telegram for user input, Apify for deep content extraction, advanced AI for contextual analysis, and Google Sheets for personalized data integration and record-keeping, this tool delivers clear, actionable verdicts that help you determine whether a tool is worth adopting or exploring further.\n\n#### Key Features and Workflow\nUser-Friendly Input: Submit URLs of tools or websites directly through Telegram for quick and easy evaluation requests.\n\n- Dynamic Content Extraction: The workflow retrieves detailed content from the submitted URLs using the Apify web crawler, capturing rich data for analysis.\n \n- AI-Powered Cleaning & Analysis: Sophisticated AI models filter out noise, distill meaningful insights, and contextualize findings based on your business profile and goals stored in Google Sheets.\n \n- Personalized Business Context: Integration with Google Sheets brings in your company’s specialization, current focus, and strategic objectives to tailor the analysis specifically to your needs.\n\n- Structured Analysis Output: Receive a thorough, structured report including concise summaries, key considerations, business impact, benefits, risks, actionable insights, and an easy-to-understand final verdict on the tool’s relevance.\n \n- Decision Support: The tool estimates effort, time to value, urgency, and confidence levels, enabling informed prioritization and strategic decision-making.\n \n- Seamless Communication: Results are sent back via Telegram, ensuring you get timely and direct feedback without needing to leave your messaging app.\n\n- Record Keeping & Tracking: All analyses and decisions are logged automatically into Google Sheets, creating a searchable knowledge base for ongoing reference and reporting.\n\n#### Setup Instructions for Key Nodes\nTelegram Trigger Node:\n1. Configure your Telegram bot API credentials here.\n2. Link the bot to your Telegram account to receive messages for URL submissions.\n\nURL Extraction Node:\nNo credentials needed. This node extracts URLs from incoming messages for processing.\n\nApify Web Crawler Node Setup Guide:\nGo to Apify's website, sign up for an account if you don’t have one, and get your API token from your profile’s API tokens section. Then, paste this token into the Apify Node’s API Key field in n8n.\n\nAI Cleaning and Analysis Nodes:\n1. Configure OpenRouter or compatible AI service API keys for content processing.\n2. Customize prompts or models if desired to align analysis style.\n\nGoogle Sheets Nodes:\n1. Connect using your Google account and provide access to the specified Google Sheet.\n2. Ensure sheets for Company Details and Analysis Results exist with proper columns as per this workflow.\n\nTelegram Reply Node:\nUse the Telegram bot API credentials to send analysis summaries and verdicts back to users.\n\n###### Access and Edit the Google Sheet\nYou can access the Google Sheet used by this workflow here:\n[Access the google sheet here](https://docs.google.com/spreadsheets/d/1RCMapKv9IPdwNz4Rp-Ma2iKzdWDEbxggYrq9K2_pU-w/edit?usp=sharing)\nPlease make a copy of the sheet to your own Google Drive before connecting it with this workflow. This allows you to customize the sheets, update company information, and manage analysis results securely without affecting the original template.\n\n#### Extendibility\nBeyond manual URL submissions, you can enhance this workflow by scheduling automated daily checks of new product launches from platforms like Product Hunt. The system can proactively analyze emerging tools and deliver timely updates via Telegram, email, or other channels, helping you stay ahead of innovation effortlessly.",
  "featuredImage": "/data/workflows/7536/7536.webp",
  "author": {
    "id": 101,
    "slug": "ajmalmirza",
    "name": "Mirza Ajmal",
    "avatar": ""
  },
  "categories": [
    "AI Summarization",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 310,
  "downloads": 31,
  "createdAt": "2025-08-18T06:43:14.612Z",
  "updatedAt": "2026-01-16T08:50:57.273Z",
  "publishedAt": "2025-08-18T06:43:14.612Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7536"
}