{
  "id": 3814,
  "slug": "3814",
  "title": "Generate AI songs + music videos using Suno API, Flux, Runway and Creatomate",
  "description": "This automation is designed to help you generate AI-powered music tracks, cover art, and fully rendered music videos — all triggered from a simple Telegram chat and managed via Google Sheets.\n\nSample Audio Generated: [Youtube Link](https://youtu.be/61MEf6MJEAM)\n\n⚠️ **Note:** This is only a summary. The full setup guide (with detailed steps, API setup, code snippets, and integrations) is included in a **PDF** on the Gumroad **download page**. Follow it to configure everything seamlessly.\n\n---\n\n## ⚙️ What This Workflow Does\n\n- Lets users interact with an AI agent on Telegram to submit song ideas.\n- Automatically logs ideas in Google Sheets.\n- Generates lyrics, music, cover images, and looping video backgrounds using AI APIs.\n- Merges audio + video into a polished final clip.\n- Uploads everything to Google Drive and sends a final video link back to the Telegram user.\n\n---\n\n## 🔗 Built with 3 Modular Workflows\n\n1. **Telegram & Sheet Logger**  \n   Collects ideas from users, stores them in a Google Sheet, and saves their chat ID for later notifications.\n\n2. **AI Generation Engine**  \n   Handles lyrics creation, music generation, image prompts, artwork, video background generation, and uploads.\n\n3. **Final Render + Delivery**  \n   Merges audio and video, uploads to cloud storage, updates the Sheet, and sends the finished video to Telegram.\n\n---\n\n## 🧩 Integrations Used\n\n- Google Sheets  \n- Telegram Bot API  \n- Multiple AI APIs (for music, images, video, and compression)  \n- Google Apps Script  \n- Creatomate for video rendering  \n- Cloud storage (via Google Drive)\n\n---\n\n## 🚀 How to Set It Up\n\n- Import the `.json` file into your n8n instance.\n- Copy the included Google Sheets and Creatomate templates.\n- Set up the Google Apps Script using the included code.\n- Replace all placeholder API keys and folder IDs.\n- Test everything end-to-end using your Telegram bot.\n\n---\n\n✅ **Tip:** No coding experience needed — just follow the step-by-step documentation PDF provided in your Gumroad download. Everything is laid out clearly to get you running fast.\n\n💰**Costs** Song generation costs (suno): $5 gets you 1000 credits, 1 song generation costs 12 credits, every api call for one song generates two versions by default. Check the song generation node to see the two versions. You can update the GSheet to append the two versions and send back to you to choose one. Flux Image gen cost is $0.04 per image. Runway cost is $0.16 per 10 seconds of video.\n\n---",
  "featuredImage": "/data/workflows/3814/3814.webp",
  "author": {
    "id": 101,
    "slug": "mjomba",
    "name": "Joseph",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2592,
  "downloads": 259,
  "createdAt": "2025-05-01T07:13:34.261Z",
  "updatedAt": "2026-01-16T08:31:36.494Z",
  "publishedAt": "2025-05-01T07:13:34.261Z",
  "nodes": 60,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3814"
}