{
  "id": 9930,
  "slug": "9930",
  "title": "Auto-generate & polish professional bios with GPT-5 and Google Docs",
  "description": "![Screenshot 20251024 210852.png](fileId:3106)\n\nAutomatically create, evaluate, and optimize professional biographies with the Bio-Graphy Agent.  \nThis workflow uses a multi-agent system powered by GPT-5 to write, review, and enhance bios — then saves the final version directly to Google Docs.\n\n---\n\n## Who’s it for\nFor professionals, creators, and marketers who want high-quality biographies for their profiles, portfolios, or LinkedIn — without spending hours writing or editing.\n\n---\n\n## How it works\n1. The user sends a chat message with details like **name**, **age**, and **location**.  \n2. The **Biography Agent** generates a complete biography using the GPT-5 Chat Model.  \n3. The **Evaluator Agent** reviews the bio and provides structured feedback.  \n4. The **Optimizer Agent** refines tone, structure, and clarity based on that feedback.  \n5. The final biography is saved automatically to **Google Docs** for easy access or publishing.\n\n---\n\n## How to set up\n1. Connect your **Google account** in n8n to enable document saving.  \n2. Add your **OpenAI (GPT-5 or compatible)** credentials to the agent nodes.  \n3. Customize prompts in the Biography, Evaluator, and Optimizer agents for your preferred writing style.  \n4. Test the workflow by sending a chat message with basic personal details.  \n5. Your completed bio will be generated, improved, and saved to your connected Google Docs.\n\n---\n\n## Requirements\n- n8n Cloud or Self-hosted instance  \n- Google Docs integration  \n- OpenAI (GPT-compatible) credentials  \n\n---\n\n## How to customize\n- 🎯 **Add personality:** Adjust the prompts to make bios sound more friendly, formal, or humorous.  \n- 🌐 **Change output:** Send the result to Notion, Airtable, or Gmail instead of Google Docs.  \n- 🪄 **Add another agent:** Include a Grammar or Tone Correction agent for extra polish.  \n- 🧩 **Extend use:** Adapt it for “About Us” pages, resumes, or brand storytelling.\n\n---\n\n**Use this workflow to instantly generate professional, polished bios — powered by GPT-5 and automated through n8n.**",
  "featuredImage": "/data/workflows/9930/9930.webp",
  "author": {
    "id": 101,
    "slug": "asfandyar-malik",
    "name": "Asfandyar Malik",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 53,
  "downloads": 5,
  "createdAt": "2025-10-20T08:40:30.385Z",
  "updatedAt": "2026-01-16T09:02:39.350Z",
  "publishedAt": "2025-10-20T08:40:30.385Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9930"
}