{
  "id": 7330,
  "slug": "7330",
  "title": "AI-powered lead email classification & auto-reply with GPT-4o and Gmail",
  "description": "## How it works\nThis workflow automatically responds to incoming emails identified as potential leads using AI-generated text.  \nIt connects to your email inbox via IMAP, classifies incoming messages with an AI model, filters out non-leads, and sends a personalized reply to relevant messages.\n\n## Steps\n1. **Email Trigger (IMAP):** Watches your inbox for new emails in real time.\n2. **Is Lead? (Message Model):** Uses AI to determine whether the sender is a lead.\n3. **Filter:** Passes only lead emails to the next step.\n4. **Write Customized Reply (Message Model):** Generates a personalized response using AI.\n5. **Get Message:** Retrieves original email details to ensure correct threading.\n6. **Reply to Message:** Sends the AI-generated reply to the sender.\n\n## Setup Instructions\n- Connect your **IMAP Email** credentials to the first node and set the folder to watch (e.g., INBOX).\n- In the \"Filter leads\" node, adjust the AI prompt to match your lead qualification criteria.\n- In the \"Reply with customized message\" node, edit the AI prompt to reflect your product, service, or business tone.\n- Connect your **Gmail** (or other email provider) credentials in the Get Message and Reply to Message nodes.\n- Test with a few sample emails before activating.\n\n## Requirements\n- IMAP-enabled email account (for receiving messages)\n- Gmail API access (or modify to your email provider)\n- OpenAI or other AI model credentials for message analysis and reply generation\n\nThis template is ready to use, with all steps documented inside sticky notes for easy customization.\n",
  "featuredImage": "/data/workflows/7330/7330.webp",
  "author": {
    "id": 101,
    "slug": "rodrigonzalezsyncra",
    "name": "Rodrigo",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1234,
  "downloads": 123,
  "createdAt": "2025-08-13T14:02:06.918Z",
  "updatedAt": "2026-01-16T08:49:44.878Z",
  "publishedAt": "2025-08-13T14:02:06.918Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7330"
}