{
  "id": 6588,
  "slug": "6588",
  "title": "Automated email triage with Gmail, GPT-4o, and Slack urgency notifications",
  "description": "Hourly Email Summary:\nThis agent scans your inbox every 4 hour and summarizes new emails into a clean, actionable Slack message. Powered by GPT-4, it classifies emails by Urgency (High, Medium, Low) and Intent (Awaiting Reply, To Respond, Comment, Notification, Marketing). No more inbox FOMO — just what you need to act fast.\n\nMain Use Cases:\n• Stay on top of important threads without refreshing your inbox constantly\n• Prioritize tasks and replies based on urgency and context\n• Catch missed follow-ups by surfacing emails that need a response\n• Filter out noise like marketing emails or low-priority notifications\n• Enable async decision-making by keeping the team updated on critical emails via Slack\n• Reduce cognitive load by letting AI handle sorting and triaging\n⸻\n\n✅ Steps to Use\n1. Connect Your Accounts: Add your Gmail, Slack, Google Sheets, and OpenAI credentials inside n8n.\n2. Create Gmail Labels (Required): Go to your Gmail settings and create labels matching the following format:\nAI Agent/To Respond, AI Agent/Awaiting Reply, AI Agent/Notification, AI Agent/Marketing, etc.\nThese are used by the workflow to auto-tag emails based on intent.\n3. Create a Google Sheet with 2 Tabs\n• Name the sheet something like “N8N - Emails”.\n• Add two sheets/tabs inside:\n• Sheet1 → stores all processed emails\n• Sheet2 → stores only the latest batch for digest view\n• In both sheets, add these columns (first row): From | Summary | Intent | Category | TimeStamp | Urgency\n4. Import the Workflow: Upload or paste the .json file into your n8n instance. Make sure each node is linked to your active credentials.\n4. Configure Slack Channel: In the Slack node, select the channel where you want urgent alerts and digest summaries to be posted.\n5. Adjust Schedule (Optional): Default: runs every hour. You can tweak this to suit your preference (e.g., every 30 min or 2 hours).\n6. Run a Test: Execute manually once to check:\n• Emails are getting processed\n• Labels are added correctly in Gmail\n• Slack notifications are triggered\n• Data is logged in Google Sheets\n7. Turn It On\n• Once everything looks good, activate the workflow.\n• Your inbox will now be triaged in real-time — sorted, labeled, summarized.\n\n\nStep-by-Step Breakdown:\n1. ⏰ Schedule Trigger: Runs every hour to kick off the workflow automatically.\n2. 📩 Fetch Emails & Labels\n• Pulls all Gmail messages received in the last 4 hours.\n• Also fetches Gmail labels to use for tagging messages based on intent.\n3. 🤖 Analyze with GPT-4\n• Each email is analyzed using GPT-4.\n• Output includes:\n• Summary\n\t• Urgency: High, Medium, Low\n\t• Intent: To Respond, Awaiting Reply, Marketing, Notification, etc.\n\t• Category: Customer, Investor, Spam, etc.\n4. Classify and Label\n• Emails are tagged with the right intent label inside Gmail.\n5.🚨 Slack Alerts for High Urgency\n• If an email is marked High Urgency, it sends an alert to a designated Slack channel with all key details.\n6. 📊 Google Sheets Logging\n• All emails are logged to two Google Sheets:\n• Sheet1: All messages, for long-term record.\n• Sheet2: Temporary sheet to collect latest batch for digest.\n7. ⏳ Wait + Digest Preparation\n• After logging, the workflow waits 30 seconds.\n• It then fetches recent entries from Sheet2, filters out older messages, and groups them by Medium and Low urgency.\n8. 📬 Slack Digest Summary\n• A clean digest is posted on Slack showing only the Medium and Low urgency messages from the past hour — helping you catch up without inbox overload.\n\nUses a System Prompt to define its role as an AI Chief of Staff.\n\nUses a User Prompt that instructs GPT-4 to analyze each email and return a structured JSON with the following:\n• summary – One-line summary of the email\n• urgency – High / Medium / Low\n• category – Investor, Customer, Support, Spam, Other\n• Intent – One of:\n\t• To Respond: Needs your reply\n\t• Awaiting Reply: You’re waiting for a response\n\t• Notification: Auto-updates from tools or services\n\t• Meeting Update: Calendar or schedule changes\n\t• Marketing: Promotional or cold emails\n\t• FYI: Informational emails that don’t need action\n\nThe output is clean JSON with built-in guardrails to avoid hallucinations or irrelevant content. Only real message data is used for summaries and classification.\n\nSections with no relevant data are omitted to keep it concise.\n\n🧩 What’s Next\n\nThis agent already cuts through inbox noise and gives you clarity — but there’s more you can build on top:\n\n💡 Suggestions to Improve:\n• Train on your past threads to make prioritization even smarter\n• Allow custom rules per sender or domain (e.g. always mark investor emails as High)\n• Add emoji tags or reactions in Slack to quickly mark emails as done or follow-up\n• Support voice summary via Slack audio snippet or Loom integration\n\n🚀 Next Features You Could Add:\n• Reply-from-Slack: One-click smart reply suggestions that can be sent right from Slack\n• Cross-inbox support: Add Outlook or multiple Gmail accounts\n• Weekend Digest: A weekly email or Slack drop with trends (top senders, most flagged categories)\n• Daily Timeline View: Generate a Notion page that logs the day’s most critical communication",
  "featuredImage": "/data/workflows/6588/6588.webp",
  "author": {
    "id": 101,
    "slug": "siddhant",
    "name": "Siddhant",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1194,
  "downloads": 119,
  "createdAt": "2025-07-28T16:23:20.301Z",
  "updatedAt": "2026-01-16T08:45:50.162Z",
  "publishedAt": "2025-07-28T16:23:20.301Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6588"
}