{
  "id": 10605,
  "slug": "10605",
  "title": "Summarize Google Play Store reviews with GPT-4-mini, Pinecone & Slack alerts",
  "description": "This workflow automatically fetches reviews for one or more Google Play Store apps, summarizes the feedback using OpenAI, stores and manages review data with Pinecone, and posts the summary to a Slack channel. It is designed for product teams, community managers, or anyone who wants to keep track of app sentiment and review trends without manually reading each review.\n\n**Features:**\n\n- Fetches daily reviews for specified Google Play Store app bundle IDs using a Google Service Account.\n- Stores reviews in a Pinecone vector database for efficient retrieval and summarization.\n- Uses OpenAI to generate a summary, including:\n  - Positive and negative review highlights\n  - Star rating breakdown and average rating\n  - Total number of reviews processed\n- Posts the summary to a Slack channel of your choice.\n- Supports both daily and weekly triggers.\n- Automatically clears old reviews from the vector store weekly to keep data fresh.\n\n**Setup Instructions:**\n\n- Add your Google Play app bundle IDs in the “Set the bundle ids” node.\n- Configure your Google Service Account, Pinecone, OpenAI, and Slack credentials.\n- Set your preferred Slack channel in the “Send to Slack channel” node.\n- Enable the workflow and customize the schedule as needed.\n\n**Use Cases:**\n\n- Monitor app sentiment and user feedback trends.\n- Share review insights with your team in Slack.\n- Automate reporting for product or support teams.",
  "featuredImage": "/data/workflows/10605/10605.webp",
  "author": {
    "id": 101,
    "slug": "ertay",
    "name": "Ertay Kaya",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1149,
  "downloads": 114,
  "createdAt": "2025-11-07T18:06:27.519Z",
  "updatedAt": "2026-01-16T09:05:39.836Z",
  "publishedAt": "2025-11-07T18:06:27.519Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10605"
}