{
  "id": 5703,
  "slug": "5703",
  "title": "Real-time forex sentiment analysis & alerts with Gemini AI to Discord",
  "description": "# Purpose & Audience\nForex Market AI Analyst is an advanced n8n workflow template designed for Forex traders, analysts, prop firms, brokers, and trading communities who need real-time, actionable market intelligence. By combining multi-source news aggregation and AI-powered sentiment analysis, this workflow delivers both quick alerts and comprehensive sentiment reports for any currency pair—directly to your Discord or chat platform. Stay ahead of market shifts and reduce manual research with automated, context-rich updates.\n\n## What It Does\n1. Aggregates breaking news and analysis from top Forex and macroeconomic sources for your selected currency pair.\n2. Filters news by recency and relevance, ensuring only the most current and impactful headlines are included.\n3. Analyzes market sentiment (bullish, bearish, or neutral) using a state-of-the-art language model (LLM).\n4. Summarizes key themes, technical levels, and economic drivers in a clear, structured format with visual cues.\n5. Delivers updates to your chosen Discord channel or chat group, with two distinct modes:\n**Quick Alerts:** Fast, headline-focused updates for daily trading.\n**Full Reports:** Detailed, multi-section sentiment breakdowns for weekly or in-depth review.\n\nCustomizable date filters let you control how recent news must be for inclusion in sentiment analysis.\n\n## Who Is It For?\n- Forex traders seeking an edge with instant, unbiased market sentiment.\n- Analysts and prop firms needing reliable, automated news curation and structured reporting.\n- Brokers and trading communities looking to enrich their channels with high-quality, automated market insights.\n- Anyone who wants a “set it and forget it” solution for monitoring any FX pair—no coding required.\n\n## Setup Once, Use Forever\n- Deploy the workflow once and use it for a lifetime. \n- Duplicate for as many currency pairs as you need—customize the news sources or filters as you wish. \n- No recurring fees, no complex setup, and you control the update frequency and delivery channels.\n\n## How to Set Up\n1. Select your currency pair and adjust the news filter settings as desired.\n2. Connect your AI model (Google Gemini or OpenAI) and Discord (or other chat) credentials.\n3. Choose your alert mode: quick daily alerts, full weekly reports, or both.\n4. Set your preferred schedule for updates.\n5. Go live: Receive real-time, actionable FX news and sentiment in your Discord or chat, automatically.\n\nForex Market AI Analyst—the all-in-one workflow for automated Forex news, sentiment, and technical updates. Perfect for traders, analysts, teams, and anyone who values timely, structured market intelligence.",
  "featuredImage": "/data/workflows/5703/5703.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 341,
  "downloads": 34,
  "createdAt": "2025-07-05T16:57:07.448Z",
  "updatedAt": "2026-01-16T08:41:00.148Z",
  "publishedAt": "2025-07-05T16:57:07.448Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5703"
}