{
  "id": 5787,
  "slug": "5787",
  "title": "From Google Drive to Instagram, TikTok & YouTube with AI descriptions & Airtable tracking",
  "description": "## Description\n\n![Captura de pantalla 20250708 a las 18.45.22.png](fileId:1713)\n\nThis automation template is designed for content creators, social media managers, and influencers who want to streamline their video publishing workflow. It automatically detects new videos uploaded to a specific Google Drive folder, generates AI-powered descriptions based on video audio content, and simultaneously publishes them across Instagram, TikTok, and YouTube while tracking everything in Airtable.\n\n***Note: This workflow uses upload-post.com API (free trial no credit card required) for multi-platform video distribution and requires API tokens for each service. The AI-generated descriptions are created using OpenAI's transcription and chat models to analyze video audio content.***\n\n## Who Is This For?\n- **Content Creators & Influencers:** Automatically publish your videos across all major social platforms without manual work.\n- **Social Media Managers:** Maintain consistent posting schedules across multiple platforms with AI-generated, platform-optimized descriptions.\n- **Marketing Teams:** Scale video content distribution with automated workflows that include tracking and status monitoring.\n- **Video Producers:** Focus on creating content while the system handles the tedious task of multi-platform publishing and description generation.\n\n## What Problem Does This Workflow Solve?\nPublishing the same video content across Instagram, TikTok, and YouTube is time-consuming and repetitive. You need to manually upload each video, write unique descriptions, and track publication status. This workflow addresses these challenges by:\n- **Automated Video Distribution:** Detects new videos in Google Drive and automatically uploads them to all three platforms simultaneously.\n- **AI-Powered Content Generation:** Uses OpenAI to transcribe video audio and generate engaging, platform-appropriate descriptions automatically.\n- **Centralized Tracking:** Maintains detailed records in Airtable including upload status, URLs, and metadata for each platform.\n- **Error Monitoring:** Provides real-time error notifications via Telegram to ensure you're always aware of any issues.\n\n## How It Works\n1. **Video Upload Detection:** The workflow monitors a specific Google Drive folder for new video uploads using automated triggers.\n2. **Content Analysis:** Downloads the video, extracts audio, and uses OpenAI to transcribe and generate compelling descriptions.\n3. **Airtable Integration:** Creates and updates records to track video metadata, descriptions, and publication status.\n4. **Multi-Platform Publishing:** Simultaneously uploads the video to Instagram, TikTok, and YouTube using the upload-post.com API.\n5. **Status Tracking:** Updates Airtable records with publication status and platform-specific URLs for each successful upload.\n\n## Setup\n1. **Google Drive Configuration:** \n   - Set up the Google Drive trigger to monitor your specific folder\n   - Configure OAuth2 credentials for Google Drive access\n2. **OpenAI Integration:** Add your OpenAI API key to enable audio transcription and description generation\n3. **Airtable Setup:** \n   - Create an Airtable base with fields for Video Name, Description, Platform Status, URLs, and Upload Date\n   - Add your Airtable API token and configure base/table IDs in the \"Set Variables\" node\n4. **Upload-Post.com Account:** \n   - Create an account at upload-post.com to get your API token\n   - Configure the token in the HTTP request nodes for each platform\n   - Set your user ID in the variables section\n5. **Platform Accounts:** Ensure your Instagram, TikTok, and YouTube accounts are connected to upload-post.com\n6. **Error Notifications:** (Optional) Configure Telegram bot credentials for error notifications\n\n## Requirements\n- **Accounts:** Google Drive, OpenAI, Airtable, upload-post.com, Telegram (optional)\n- **API Keys & Credentials:** Google Drive OAuth2, OpenAI API Key, Airtable API Token, upload-post.com API Token\n- **Platform Setup:** Instagram, TikTok, and YouTube accounts connected to upload-post.com\n\nTransform your video publishing workflow from hours of manual work to a fully automated system that handles everything from content analysis to multi-platform distribution and tracking.",
  "featuredImage": "/data/workflows/5787/5787.webp",
  "author": {
    "id": 101,
    "slug": "carlosgracia",
    "name": "Juan Carlos Cavero Gracia",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 14065,
  "downloads": 1406,
  "createdAt": "2025-07-08T16:46:00.998Z",
  "updatedAt": "2026-01-16T08:41:25.184Z",
  "publishedAt": "2025-07-08T16:46:00.998Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5787"
}