{
  "id": 8553,
  "slug": "8553",
  "title": "Auto-generate & post social media content with GPT-4, Notion & Instagram API",
  "description": "**How It Works**\n\nThis workflow automates social media content creation and posting. It starts by receiving raw text input through a Webhook (for example, from LINE Bot) and saves the content into a Notion database for centralized storage. Next, GPT-4 generates platform-specific captions for Instagram, Threads, X/Twitter, and Blog. Instagram captions are prepared for automatic publishing, while Threads, X, and Blog drafts are stored in Notion for later review and manual posting.\n\nThe workflow then fetches book cover images or other visuals from external APIs such as Google Books, OpenBD, or OpenLibrary. The chosen image is uploaded to Cloudinary to generate a secure, optimized URL. Finally, the Instagram Graph API is used to create a media container and publish the post automatically with the caption and image. This way, the workflow provides both automation for Instagram and reusable drafts for other platforms.\n\n**Requirements**\n\n- Notion account with a database configured for text and captions\n- Cloudinary account for image hosting\n- Instagram Business account connected to the Meta Developer Platform\n- GPT-4 (via OpenAI or LangChain node in n8n)\n\n**Setup Instructions**\n\n1. Configure the Webhook node to capture text input.\n2. Update the Notion database ID and property keys to match your schema.\n3. Add Cloudinary credentials (【cloud_name】, 【upload_preset】) in the HTTP Request node.\n4. Set 【IG_ACCESS_TOKEN】 as an environment variable.\n5. Activate the workflow and test with a sample input.\n\n**Customization**\n\n- Adjust caption prompts for style, hashtags, or character limits.\n- Add additional GPT nodes for more platforms.\n- Replace or extend image sources as needed.\n- Integrate a scheduler (Cron node) to post at specific times.",
  "featuredImage": "/data/workflows/8553/8553.webp",
  "author": {
    "id": 101,
    "slug": "supira",
    "name": "Supira Inc.",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1513,
  "downloads": 151,
  "createdAt": "2025-09-13T10:58:34.819Z",
  "updatedAt": "2026-01-16T08:56:28.461Z",
  "publishedAt": "2025-09-13T10:58:34.819Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8553"
}