{
  "id": 12544,
  "slug": "12544",
  "title": "Consolidate and report monthly financial PDFs with Google Drive and Slack",
  "description": "# Consolidate and report monthly financial documents using Google Drive and Slack\n\n## 🎯 Description\nStreamline your month-end accounting processes with this enterprise-grade automation designed to aggregate, validate, and merge fragmented financial documents into a single, professional reporting bundle. This workflow transforms manual document chaos into a structured, touchless system using Google Drive and Slack.\n\n\n\n### ✨ How to achieve automated document consolidation\nYou can achieve a fully autonomous financial reporting cycle by using the available tools to:\n\n1. **List and scan folders** — Automatically retrieve all documents from a designated Google Drive folder at the end of each month.\n2. **Validate file formats** — Use an **IF Node** to ensure only PDF documents (invoices, receipts, statements) are processed, preventing workflow crashes from incompatible file types.\n3. **Aggregate binary data** — Gather separate file streams into a unified data array using the **Aggregate Node** to ensure stable processing for the merge engine.\n4. **Merge into master reports** — Utilize the **HTML to PDF** engine to consolidate individual files into one \"Monthly Finance Pack\" with professional naming conventions.\n5. **Secure and archive** — Upload the consolidated master file back to a secure archive folder in Google Drive.\n6. **Notify the team** — Send a real-time **Slack** alert with the final filename, ensuring the accounting team knows exactly when the report is ready.\n\n### 💡 Key features\n\n**Intelligent filtering and validation**\nThe workflow auto-detects MIME types to filter out non-PDF noise and system files. This ensures a consistent input for the merge engine and prevents processing errors.\n\n**Advanced data aggregation**\nBy utilizing the **Aggregate Node**, the workflow handles multiple binary files simultaneously. This architecture prevents the \"looping errors\" common in basic PDF workflows and maintains document order during the merge process.\n\n**Dynamic time-stamping with Luxon**\nA critical technical feature of this template is the use of **Luxon expressions** for professional document naming. By utilizing `{{ $now.setZone('America/New_York').toFormat('MMMM yyyy') }}` within the Slack and upload nodes, the workflow automatically generates accurate timestamps. This eliminates manual renaming and ensures your archives are perfectly organized by month and year.\n\n### 🎯 Perfect for\n* **Finance departments** — Consolidate hundreds of monthly vendor invoices into one audit-ready file.\n* **Property managers** — Bundle monthly utility bills and maintenance receipts for property owners.\n* **Freelancers and agencies** — Collate all business expenses for the month to send to a tax preparer.\n\n### 📦 What you will need\n\n**Required integrations:**\n1. **Google Drive** — Source folder for documents and destination for the final bundle.\n2. **HTML to PDF Node** — The core engine for PDF merging operations.\n3. **Slack** — For automated team notifications and status updates.\n\n### 📈 Expected results\n* **90% time savings** — Reduce manual report creation from 30 minutes to seconds.\n* **Zero lost documents** — Maintain a complete digital trail with automatic archival.\n* **Audit readiness** — Ensure a consistent naming and storage structure for all past financial reports.\n\n***\n\n**Ready to automate your reporting?** Import this template, connect your credentials, and turn your monthly document collection into a 100% automated workflow.",
  "featuredImage": "/data/workflows/12544/12544.webp",
  "author": {
    "id": 101,
    "slug": "jiteshdugar",
    "name": "Jitesh Dugar",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2026-01-07T11:16:57.704Z",
  "updatedAt": "2026-01-16T09:12:38.672Z",
  "publishedAt": "2026-01-07T11:16:57.704Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12544"
}