{
  "id": 11711,
  "slug": "11711",
  "title": "AI-powered multi-channel customer journey with email, SMS & retargeting using OpenAI",
  "description": "## How It Works\nThis workflow automates personalized customer journeys by analyzing CRM data, purchase history, chat interactions, and performance metrics to intelligently route customer actions through multiple channels (email, SMS, retargeting) via AI-optimized schemas. A webhook trigger initiates the process by fetching CRM customer data, which is then merged with historical records and interactions. OpenAI builds comprehensive customer state profiles, enabling intelligent routing to appropriate channels using optimized journey logic. The system aggregates performance metrics in real-time and updates the database to maintain synchronized customer information across all systems. \n\n## Setup Steps\n1. Connect CRM credentials (source system)\n2. Add OpenAI API key for state builder\n3. Configure Gmail/SMS provider credentials\n4. Add Google Sheets connection for performance tracking\n5. Set Touchpoint Event Webhook URL\n6. Map database connection for customer state persistence\n\n## Prerequisites\nOpenAI API key, CRM access, Gmail/SMS provider accounts, Google Sheets, database (PostgreSQL/MySQL), n8n instance with webhook enabled.\n\n## Use Cases\nE-commerce personalization, SaaS customer retention, multi-touch marketing automation \n\n## Customization\nModify journey schemas in Journey Optimizer AI, adjust routing rules in Action Type Router \n\n## Benefits\nReduces manual campaign management 80%, improves conversion via AI personalization ",
  "featuredImage": "/data/workflows/11711/11711.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 194,
  "downloads": 19,
  "createdAt": "2025-12-11T15:39:28.323Z",
  "updatedAt": "2026-01-16T09:09:50.939Z",
  "publishedAt": "2025-12-11T15:39:28.323Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11711"
}