{
  "id": 11276,
  "slug": "11276",
  "title": "Generate & publish AI videos with Sora 2, Veo 3.1, Gemini & Blotato",
  "description": "## Overview\n\nThis workflow automatically generates short-form AI videos using both OpenAI Sora 2 Pro and Google Veo 3.1, enhances your idea with Google Gemini, and publishes content across multiple platforms through Blotato.\nIt’s perfect for creators, brands, UGC teams, and anyone building a high-frequency AI video pipeline.\n\nYou can turn a single text idea into fully rendered videos, compare outputs from multiple AI models, and publish everywhere in one automated flow.\n\n---\n\n## Good to know\n\n* Generating Sora or Veo videos may incur API costs depending on your provider.\n* Video rendering time varies by prompt complexity.\n* Sora & Veo availability depends on region and account access.\n* Blotato must be connected to your social accounts before publishing.\n* The workflow includes toggles so you can turn Sora, Veo, or platforms on/off easily.\n\n---\n\n## How it works\n\n* Your text idea enters through the Chat Trigger.\n* Google Gemini rewrites your idea into a detailed, high-quality video prompt.\n* The workflow splits into two branches:\n\n  * **Sora Branch**: Generates video via OpenAI Sora 2 Pro, downloads the MP4, and uploads/publishes to YouTube, TikTok, and Instagram.\n  * **Veo Branch**: Generates a video using Google Veo 3.1 (via Wavespeed), retrieves the output link, emails it to you, and optionally uploads it to Blotato for publishing.\n* A Config – Toggles node lets you enable or disable models and platforms.\n* Optional Google Sheets logging can store video history and metadata.\n\n---\n\n## How to use\n\n* Send a message to the Chat Trigger to start the workflow.\n* Adjust toggles to choose whether you want Sora, Veo, or both.\n* Add or remove publishing platforms inside the Blotato nodes.\n* Check your email for Veo results or monitor uploads on your social accounts.\n* Ideal for automation, batch content creation, and AI-powered video workflows.\n\n---\n\n## Requirements\n\n* **Google Gemini** API key (for prompt enhancement)\n* **OpenAI Sora 2** API key\n* **Wavespeed (Veo 3.1)** API key\n* **Blotato** account + connected YouTube/TikTok/Instagram channels\n* **Gmail OAuth2** (for sending video result emails)\n* **Google Sheets** (optional logging)\n\n---\n\n## Customizing this workflow\n\n* Add a title/description generator for YouTube Shorts.\n* Insert a thumbnail generator (image AI model).\n* Extend logging with Sheets or a database.\n* Add additional platforms supported by Blotato.\n* Use different prompt strategies for cinematic, viral, or niche content styles.\n",
  "featuredImage": "/data/workflows/11276/11276.webp",
  "author": {
    "id": 101,
    "slug": "amitxd",
    "name": "Amit Kumar",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 746,
  "downloads": 74,
  "createdAt": "2025-11-27T05:12:58.750Z",
  "updatedAt": "2026-01-16T09:08:12.935Z",
  "publishedAt": "2025-11-27T05:12:58.750Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11276"
}