{
  "id": 12298,
  "slug": "12298",
  "title": "Notify Redmine project members in Slack about teammates’ approved Odoo leave",
  "description": "## 📌Who is this for?\nThis workflow is designed for engineering teams, project managers, and IT operations who need consistent visibility into team availability across multiple projects.\nIt’s perfect for organizations that use Odoo for leave management and Redmine for project collaboration, and want to ensure that everyone involved gets timely, automated Slack notifications whenever a team member will be absent the next day.\n\n## 📌The problem\nWhen team members go dark, everything grinds to a halt. You're stuck with:\n- Last-minute meeting reschedules (and frustrated stakeholders)\n- Tasks assigned to people who aren't there\n- No time to redistribute workload\n- Bottlenecks affecting multiple projects\n\n## 📌How it works\n1. **Runs** daily at 17:15 - Set it and forget it. Executes every afternoon, giving teams time to prepare.\n2. **Fetches** Tomorrow's Approved Leaves from Odoo - Pulls all leave records with tomorrow's start date and \"approved\" status.\n3. **Maps** Employee & Project Data - Grabs the employee's details and identifies every Redmine project they're assigned to.\n4. **Finds** All Teammates on the Same Projects - Deduplicates across overlapping projects to avoid notification spam.\n5. **Sends** Targeted Slack Notifications - Only notifies people who actually work with the absent member, plus optional manager alerts.\n\n## 📌Quick setup\nBefore you start, you’ll need:\n- Odoo API key\n- Redmine API key\n- Slack Bot Token (or Incoming Webhook URL)\n- Subflows need to be created within a new flow; the main flow will call these subflows.\n\n## 📌Results\nWhat changes immediately:\n- Zero surprises - teams know absences 24 hours ahead\n- Workload rebalancing happens before the person goes off\n- Managers make proactive decisions, not reactive ones\n- No more wasted Slack messages to irrelevant people\n- This creates a more predictable and transparent workflow across your engineering and project teams.\n\n## 📌Take it further\nReady to supercharge it? Add:\n- Auto-assign backup owners for critical tasks\n- Sync absences to Google Calendar/Outlook\n- Log notifications to a database for auditing\n- Conditional alerts (key roles, high-priority projects only)\n- Daily summary digest of all upcoming absences\n\n## 📌Need help customizing?\nContact me for consulting and support:\n[Linkedin](https://www.linkedin.com/company/bac-ha-software/posts/?feedView=all) / [Website](https://bachasoftware.com/bhsoft-contacts)",
  "featuredImage": "/data/workflows/12298/12298.webp",
  "author": {
    "id": 101,
    "slug": "bhsoft",
    "name": "BHSoft",
    "avatar": ""
  },
  "categories": [
    "Project Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 4,
  "downloads": 0,
  "createdAt": "2025-12-30T09:24:48.455Z",
  "updatedAt": "2026-01-16T09:12:01.585Z",
  "publishedAt": "2025-12-30T09:24:48.455Z",
  "nodes": 54,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12298"
}