{
  "id": 3053,
  "slug": "3053",
  "title": "Technical stock analysis with Telegram, Airtable and a GPT-powered AI agent",
  "description": "### Video Guide\n\nI prepared a detailed guide that demonstrates the complete process of building a trading agent automation using n8n and Telegram, seamlessly integrating various functions for stock analysis.\n\n[![Youtube Thumbnail](https://res.cloudinary.com/de9jgixzm/image/upload/v1740845597/Youtube%20Thumbs/Video%2022%20-%20Philipp%20Trading%20Blur.png)](https://youtu.be/94vh6hSiP9s)\n\n[Youtube Link](https://youtu.be/94vh6hSiP9s)\n\n### Who is this for?\nThis workflow is perfect for traders, financial analysts, and developers looking to automate stock analysis interactions via Telegram. It’s especially valuable for those who want to leverage AI tools for technical analysis without needing to write complex code.\n\n### What problem does this workflow solve?\nMany traders desire real-time analysis of stock data but lack the technical expertise or tools to perform in-depth analysis. This workflow allows users to easily interact with an AI trading agent through Telegram for seamless stock analysis, chart generation, and technical evaluation, all while eliminating the need for manual interventions.\n\n### What this workflow does\nThis workflow utilizes n8n to construct an end-to-end automation process for stock analysis through Telegram communication. The setup involves:\n- Receiving messages via a Telegram bot.\n- Processing audio or text messages for trading queries.\n- Transcribing audio using OpenAI API for interpretation.\n- Gathering and displaying charts based on user-specified parameters.\n- Performing technical analysis on generated charts.\n- Sending back the analyzed results through Telegram.\n\n\n### Setup\n\n1. **Prepare Airtable**:\n    - Create simple table to store tickers.\n\n2. **Prepare Telegram Bot**:\n    - Ensure your Telegram bot is set up correctly and listening for new messages.\n\n3. **Replace Credentials**:\n    - Update all nodes with the correct credentials and API keys for services involved.\n\n4. **Configure API Endpoints**:\n    - Ensure chart service URLs are correctly set to interact with the corresponding APIs properly.\n\n5. **Start Interaction**:\n    - Message your bot to initiate analysis; specify ticker symbols and desired chart styles as required.",
  "featuredImage": "/data/workflows/3053/3053.webp",
  "author": {
    "id": 101,
    "slug": "lowcodingdev",
    "name": "Mark Shcherbakov",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 21531,
  "downloads": 2153,
  "createdAt": "2025-03-01T17:09:30.445Z",
  "updatedAt": "2026-01-16T08:27:51.776Z",
  "publishedAt": "2025-03-01T17:09:30.445Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3053"
}