{
  "id": 5809,
  "slug": "5809",
  "title": "Automated product inquiry responder with GPT-4 and Google Sheets",
  "description": "## **AI-Powered Product Assistant for E-commerce**\n\nTransform your online store customer service with an intelligent AI assistant that automatically processes customer inquiries, searches your product database, and provides personalized responses about product availability, pricing, and specifications. Perfect for shoe stores, fashion retailers, and any business with extensive product catalogs - this workflow eliminates manual customer service while increasing response speed and accuracy.\n\n**How it works**\n* Customer sends product inquiry via webhook (Instagram DM, website chat, or messaging app)\n* AI extracts key product details (brand, model, size, color) from natural language text\n* System searches your Google Sheets product database with smart filtering\n* AI generates friendly, personalized response with availability, pricing, and stock information\n* Automatic response sent back to customer with product details or alternatives\n\n**Screenshots:**\n- Customer inquiry: \"Do you have Nike Air Max 40 size?\"\n- AI response: \"Nike Air Max 90, size 40 - in stock 3 pieces, price 120$\"\n\n**Set up steps**\n1. **Prepare your product database** - Create Google Sheets with columns: Brand, Model, Size, Color, Price, Quantity\n2. **Configure AI settings** - Connect OpenAI API for natural language processing  \n3. **Set up webhook endpoint** - Configure trigger for your messaging platform (Instagram, Telegram, website chat)\n4. **Test with sample inquiries** - Verify AI correctly parses requests and finds products\n5. **Deploy and monitor** - Launch your automated assistant and track performance\n\n**Time investment:** 30-45 minutes setup, works immediately with any product catalog up to 1000+ items.",
  "featuredImage": "/data/workflows/5809/5809.webp",
  "author": {
    "id": 101,
    "slug": "dima-ai",
    "name": "Dmytro",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1743,
  "downloads": 174,
  "createdAt": "2025-07-09T08:18:47.539Z",
  "updatedAt": "2026-01-16T08:41:31.109Z",
  "publishedAt": "2025-07-09T08:18:47.539Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5809"
}