{
  "id": 9595,
  "slug": "9595",
  "title": "Create a factual learning assistant with RAG, Gemini, Telegram & MongoDB",
  "description": "## Who's it for?\nThis template is perfect for educational institutions, coaching centers (like UPSC, GMAT, or specialized technical training), internal corporate knowledge bases, and SaaS companies that need to provide instant, accurate, and source-grounded answers based on proprietary documents.\n\nIt's designed for users who want to leverage Google Gemini's powerful reasoning but ensure its answers are strictly factual and based only on their verified knowledge repository.\n\n## How it works / What it does\nThis workflow establishes a Retrieval-Augmented Generation (RAG) pipeline to build a secure, fact-based AI Agent. It operates in two main phases:\n\n### 1. Knowledge Ingestion: \nWhen a new document (e.g., a PDF, lecture notes, or policy manual) is uploaded via a form or Google Drive, the Embeddings Google Gemini node converts the content into numerical vectors. These vectors are then stored in a secure MongoDB Atlas Vector Store, creating a private knowledge base.\n\n \n### 2. AI Query & Response: \nA user asks a question via Telegram. The AI Agent uses the question to perform a semantic search on the MongoDB Vector Store, retrieving the most relevant, source-specific passages. It then feeds this retrieved context to the Google Gemini Chat Model to generate a precise, factual answer, which is sent back to the user on Telegram.\n\nThis process ensures the agent never **\"hallucinates\"** or uses general internet knowledge, making the responses **accurate and trustworthy**.\n\n## Requirements\nTo use this template, you will need the following accounts and credentials:\n\n1. **n8n Account**\n2. **Google Gemini API Key:** For generating vector embeddings and powering the AI Agent.\n3. **MongoDB Atlas Cluster:** A free-tier cluster is sufficient, configured with a Vector Search index.\n4. **Telegram Bot:** A bot created via BotFather and a Chat ID where the bot will listen for and send messages.\n5. **Google Drive Credentials** (if using the Google Drive ingestion path).\n\n## How to set up\n- **Set up MongoDB Atlas:** Create a free cluster and a database. Create a Vector Search Index on your collection to enable efficient searching.\n- **Configure Ingestion Path:**\n  - **Set up the Webhook trigger** for your \"On form submission\" or connect your Google Drive credentials.\n  - Configure the **Embeddings Google Gemini node** with your API Key.\n  - Connect the **MongoDB Atlas Vector Store node** with your database credentials, collection name, and index name.\n- **Configure Chat Path:**\n  - Set up the **Telegram Trigger** with your Bot Token to listen for incoming messages.\n  - Configure the **Google Gemini Chat Model** with your API Key.\n  - Connect the MongoDB Atlas Vector Store 1 node as a Tool within the AI Agent. Ensure it points to the same vector store as the ingestion path.\n- **Final Step:** Configure the Send a text message node with your **Telegram Bot Token and the Chat ID**.\n\n## How to customize the workflow\n- **Change Knowledge Source:** Replace the Google Drive nodes with nodes for Notion, SharePoint, Zendesk, or another document source.\n- **Change Chat Platform:** Replace the Telegram nodes with a Slack, Discord, or WhatsApp Cloud trigger and response node.\n- **Refine the Agent's Persona:** Open the AI Agent node and edit the System Instruction to give the bot a specific role (e.g., \"You are a senior UPSC coach. Answer questions politely and cite sources.\").\n\n## 💡 Example Use Case\n\n- An **UPSC/JEE/NEET** coaching uploads NCERT summaries and previous year notes to Google Drive.\n- Students ask questions in the Telegram group — the bot instantly replies with **contextually accurate answers** from the uploaded materials.\n- The same agent can generate **daily quizzes or concise notes** from this curated content automatically.",
  "featuredImage": "/data/workflows/9595/9595.webp",
  "author": {
    "id": 101,
    "slug": "gladiator",
    "name": "Pawan",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 345,
  "downloads": 34,
  "createdAt": "2025-10-14T00:02:24.486Z",
  "updatedAt": "2026-01-16T09:01:07.321Z",
  "publishedAt": "2025-10-14T00:02:24.486Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9595"
}