{
  "id": 10182,
  "slug": "10182",
  "title": "Automate Reddit brand monitoring & responses with GPT-4o-mini, Sheets & Slack",
  "description": "## How it Works\n\nThis workflow automates intelligent Reddit marketing by monitoring brand mentions, analyzing sentiment with AI, and engaging authentically with communities. Every 24 hours, the system searches Reddit for posts containing your configured brand keywords across all subreddits, finding up to 50 of the newest mentions to analyze.\n\nEach discovered post is sent to OpenAI's GPT-4o-mini model for comprehensive analysis. The AI evaluates sentiment (positive/neutral/negative), assigns an engagement score (0-100), determines relevance to your brand, and generates contextual, helpful responses that add genuine value to the conversation. It also classifies the response type (educational/supportive/promotional) and provides reasoning for whether engagement is appropriate.\n\nThe workflow intelligently filters posts using a multi-criteria system: only posts that are relevant to your brand, score above 60 in engagement quality, and warrant a response type other than \"pass\" proceed to engagement. This prevents spam and ensures every interaction is meaningful.\n\nSelected posts are processed one at a time through a loop to respect Reddit's rate limits. For each worthy post, the AI-generated comment is posted, and complete interaction data is logged to Google Sheets including timestamp, post details, sentiment, engagement scores, and success status. This creates a permanent audit trail and analytics database.\n\nAt the end of each run, the workflow aggregates all data into a comprehensive daily summary report with total posts analyzed, comments posted, engagement rate, sentiment breakdown, and the top 5 engagement opportunities ranked by score. This report is automatically sent to Slack with formatted metrics, giving your team instant visibility into your Reddit marketing performance.\n\n---\n\n## Who is this for?\n\n- **Brand managers and marketing teams** needing automated social listening and engagement on Reddit\n- **Community managers** responsible for authentic brand presence across multiple subreddits\n- **Startup founders and growth marketers** who want to scale Reddit marketing without hiring a team\n- **PR and reputation teams** monitoring brand sentiment and responding to discussions in real-time\n- **Product marketers** seeking organic engagement opportunities in product-related communities\n- **Any business** that wants to build authentic Reddit presence while avoiding spammy marketing tactics\n\n---\n\n## Setup Steps\n\n- **Setup time:** Approx. 30-40 minutes (credential configuration, keyword setup, Google Sheets creation, Slack integration)\n- **Requirements:**\n    - Reddit account with OAuth2 application credentials (create at reddit.com/prefs/apps)\n    - OpenAI API key with GPT-4o-mini access\n    - Google account with a new Google Sheet for tracking interactions\n    - Slack workspace with posting permissions to a marketing/monitoring channel\n    - Brand keywords and subreddit strategy prepared\n\n1. **Create Reddit OAuth Application:** Visit reddit.com/prefs/apps, create a \"script\" type app, and obtain your client ID and secret\n2. **Configure Reddit Credentials in n8n:** Add Reddit OAuth2 credentials with your app credentials and authorize access\n3. **Set up OpenAI API:** Obtain API key from platform.openai.com and configure in n8n OpenAI credentials\n4. **Create Google Sheet:** Set up a new sheet with columns: timestamp, postId, postTitle, subreddit, postUrl, sentiment, engagementScore, responseType, commentPosted, reasoning\n5. **Configure these nodes:**\n    - **Brand Keywords Config:** Edit the JavaScript code to include your brand name, product names, and relevant industry keywords\n    - **Search Brand Mentions:** Adjust the limit (default 50) and sort preference based on your needs\n    - **AI Post Analysis:** Customize the prompt to match your brand voice and engagement guidelines\n    - **Filter Engagement-Worthy:** Adjust the engagementScore threshold (default 60) based on your quality standards\n    - **Loop Through Posts:** Configure max iterations and batch size for rate limit compliance\n    - **Log to Google Sheets:** Replace YOUR_SHEET_ID with your actual Google Sheets document ID\n    - **Send Slack Report:** Replace YOUR_CHANNEL_ID with your Slack channel ID\n6. **Test the workflow:** Run manually first to verify all connections work and adjust AI prompts\n7. **Activate for daily runs:** Once tested, activate the Schedule Trigger to run automatically every 24 hours\n\n---\n\n## Node Descriptions (10 words each)\n\n1. **Daily Marketing Check** - Schedule trigger runs workflow every 24 hours automatically daily\n2. **Brand Keywords Config** - JavaScript code node defining brand keywords to monitor Reddit\n3. **Search Brand Mentions** - Reddit node searches all subreddits for brand keyword mentions\n4. **AI Post Analysis** - OpenAI analyzes sentiment, relevance, generates contextual helpful comment responses\n5. **Filter Engagement-Worthy** - Conditional node filters only high-quality relevant posts worth engaging\n6. **Loop Through Posts** - Split in batches processes each post individually respecting limits\n7. **Post Helpful Comment** - Reddit node posts AI-generated comment to worthy Reddit discussions\n8. **Log to Google Sheets** - Appends all interaction data to spreadsheet for permanent tracking\n9. **Generate Daily Summary** - JavaScript aggregates metrics, sentiment breakdown, generates comprehensive daily report\n10. **Send Slack Report** - Posts formatted daily summary with metrics to team Slack channel",
  "featuredImage": "/data/workflows/10182/10182.webp",
  "author": {
    "id": 101,
    "slug": "tomax",
    "name": "Daniel Shashko",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 574,
  "downloads": 57,
  "createdAt": "2025-10-25T21:00:15.098Z",
  "updatedAt": "2026-01-16T09:03:51.969Z",
  "publishedAt": "2025-10-25T21:00:15.098Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10182"
}