{
  "id": 7269,
  "slug": "7269",
  "title": "Gmail and QuickBooks Online workflow",
  "description": "## Automatically Forward Email Receipts to QuickBooks Online\n\n## What It Does  \nAre you tired of manually uploading email receipts to QuickBooks Online (QBO)? Are your email forwarding rules difficult to set up or unreliable? This n8n workflow automatically forwards your email receipts to QuickBooks Online with minimal configuration.\n\n## Example Use Cases  \n- Online purchase and subscription receipts  \n- E-transfer confirmations  \n- Bills and invoices received from suppliers  \n- Expense reports sent by vendors  \n- Payment confirmation emails\n- Send other people's emails to QBO, bypassing the forwarding restrictions\n\n## Prerequisites  \nTo use this workflow, you'll need:  \n- A Gmail account with credentials configured in n8n  \n- QuickBooks Online account with receipt forwarding enabled  \n\n## How to Set Up Gmail  \n1. Search for emails that contain receipts (e.g., subject contains \"Interac E-transfer\")  \n2. Create a Gmail filter that automatically applies a specific label to those emails (e.g., \"New E-Transfer\")  \n3. Create another label for processed emails to prevent duplicate processing (e.g., \"Processed\")  \n\n## How It Works  \n1. **Trigger:** The workflow runs when a new receipt is received; a scheduled trigger acts as a failsafe to catch missed emails.  \n2. The first Gmail node retrieves emails with the \"new receipt\" label.  \n3. The second Gmail node forwards the exact email contents to QuickBooks Online, mimicking a forwarded email.  \n4. The workflow removes the original \"new receipt\" label and applies the \"processed\" label to avoid duplicate forwarding.  \n\n## How to Use  \n- Configure each Gmail node with your Gmail credentials in n8n.  \n- Enter your QuickBooks Online receipt forwarding email address in the second Gmail node (e.g., example@qbdocs.com).  \n- Set up the appropriate labels in each Gmail node to match your Gmail filter and workflow logic.  \n\n## Customization Options  \n- Modify the Gmail nodes to download and forward attachments if necessary.  \n- Create separate workflows for different types of emails; for example, include vendor information in the subject line (e.g., \"Your Instacart Order Receipt\") to help QuickBooks categorize expenses.  \n- Add error handling and notifications to monitor workflow execution.  \n\n## Why It's Useful  \n- Saves time by automating manual forwarding of receipts to QuickBooks Online.  \n- Reduces errors and missed receipts that can occur with manual processing.  \n- Keeps your QuickBooks records up-to-date automatically.  \n- Provides a scalable solution for handling various receipt types and vendors.  \n- Easily customizable to fit your specific email and accounting workflows.\n",
  "featuredImage": "/data/workflows/7269/7269.webp",
  "author": {
    "id": 101,
    "slug": "roshragel",
    "name": "Rosh Ragel",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 291,
  "downloads": 29,
  "createdAt": "2025-08-12T01:58:16.635Z",
  "updatedAt": "2026-01-16T08:49:24.806Z",
  "publishedAt": "2025-08-12T01:58:16.635Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7269"
}