{
  "id": 10345,
  "slug": "10345",
  "title": "Multi-channel task reminder system with Telegram, Email and Slack",
  "description": "This n8n workflow automates task creation and scheduled reminders for users via a Telegram bot, ensuring timely notifications across multiple channels like email and Slack. It streamlines task management by validating inputs, storing tasks securely, and delivering reminders while updating statuses for seamless follow-up.\n\n### Key Features\n- Enables users to create tasks directly in chat via webhook integration.\n- Triggers periodic checks for due tasks and processes them individually for accurate reminders.\n- Routes reminders to preferred channels (Telegram, email, or Slack) based on user settings.\n- Validates inputs, handles errors gracefully, and logs task data for persistence and auditing.\n\n### Workflow Process\n- The **Webhook Entry Point** node receives task creation requests from users via chat (e.g., Telegram bot), including details like user ID, task description, and channel preferences.\n- The **Input Validation** node checks for required fields (e.g., user ID, task description); if validation fails, it routes to the **Error Response** node.\n- The **Save to Database** node stores validated task data securely in a database (e.g., PostgreSQL, MongoDB, or MySQL) for persistence.\n- The **Success Response** node (part of Response Handlers) returns a confirmation message to the user in JSON format.\n- The **Schedule Trigger** node runs every 3 minutes to check for pending reminders (with a 5-minute buffer for every hour to avoid duplicates).\n- The **Fetch Due Tasks** node queries the database for tasks due within the check window (e.g., reminders set for within 3 minutes).\n- The **Tasks Check** node verifies if fetched tasks exist and are eligible for processing.\n- The **Split Items** node processes each due task individually to handle them in parallel without conflicts.\n- The **Channel Router** node directs reminders to the appropriate channel based on task settings (e.g., email, Slack, or Telegram).\n- The **Email Sender** node sends HTML-formatted reminder emails with task details and setup instructions.\n- The **Slack Sender** node delivers Slack messages using webhooks, including task formatting and user mentions.\n- The **Telegram Sender** node sends Telegram messages via bot API, including task ID, bot setup, and conversation starters.\n- The **Update Task Status** node marks the task as reminded in the database (e.g., updating status to \"sent\" with timestamp).\n- The **Workflow Complete!** node finalizes the process, logging completion and preparing for the next cycle.\n\n### Setup Instructions\n- Import the workflow into n8n and configure the **Webhook Entry Point** with your Telegram bot's webhook URL and authentication.\n- Set up database credentials in the **Save to Database** and **Fetch Due Tasks** nodes (e.g., connect to PostgreSQL or MongoDB).\n- Configure channel-specific credentials: Telegram bot token for **Telegram Sender**, email SMTP for **Email Sender**, and Slack webhook for **Slack Sender**.\n- Adjust the **Schedule Trigger** interval (e.g., every 3 minutes) and add any custom due-time logic in **Fetch Due Tasks**.\n- Test the workflow by sending a sample task creation request via the webhook and simulating due tasks to verify reminders and status updates.\n- Monitor executions in n8n dashboard and tweak validation rules or response formats as needed for your use case.\n\n### Prerequisites\n- Telegram bot setup with webhook integration for task creation and messaging.\n- Database service (e.g., PostgreSQL, MongoDB, or MySQL) for task storage and querying.\n- Email service (e.g., SMTP provider) and Slack workspace for multi-channel reminders.\n- n8n instance with webhook and scheduling enabled.\n- Basic API knowledge for bot configuration and channel routing.\n\n### Modification Options\n- Customize the **Input Validation** node to add fields like priority levels or recurring task flags.\n- Extend the **Channel Router** to include additional channels (e.g., Microsoft Teams or SMS via Twilio).\n- Modify the **Schedule Trigger** to use dynamic intervals based on task urgency or user preferences.\n- Enhance the **Update Task Status** node to trigger follow-up actions, like archiving completed tasks.\n- Adjust the **Telegram Sender** node for richer interactions, such as inline keyboards for task rescheduling.\n\n\n\n**Explore More AI Workflows: [Get in touch with us](https://www.oneclickitsolution.com/contact-us/) for custom n8n automation!**",
  "featuredImage": "/data/workflows/10345/10345.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 92,
  "downloads": 9,
  "createdAt": "2025-10-30T12:32:14.905Z",
  "updatedAt": "2026-01-16T09:04:39.338Z",
  "publishedAt": "2025-10-30T12:32:14.905Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10345"
}