{
  "id": 12004,
  "slug": "12004",
  "title": "Restaurant GPT-4 receptionist for bookings & delivery using Vapi, Telegram, Airtable",
  "description": "## This AI receptionist handles restaurant bookings and delivery orders with Vapi, Telegram, and Airtable\n\n## Who’s it for\nThis n8n template is built for **restaurants** that want to automate table bookings and delivery or takeaway orders using an AI receptionist. It’s suitable for small to mid-sized restaurants that receive bookings and orders via voice calls or Telegram and want a structured, reliable backend without manual handling.\n\n## How it works\nThe workflow powers an AI receptionist that operates through **Vapi (voice)** and **Telegram (chat)**.  \nFor table bookings, it collects party size and preferred time, checks table availability within the requested time range, and returns available options or a “no availability” response.  \nFor orders, the menu is fetched from **Airtable**, items are validated, prices are calculated, and order details are collected. Delivery addresses are validated and checked against supported areas. If delivery is unavailable, the system automatically offers takeaway. All confirmed bookings and orders are saved to Airtable.\n\n## How to set up\n1. Download JSON flows from the Dropbox folder, copy Airtable base with template tables to your account.\n2. Get Airtable, OpenAI, Telegram Bot, Google Maps API credentials. \n3. Set up credentials and test.\n\n## How to customize the workflow\nYou can plug a VAPI assistant. Copy the prompt from the AI agent and paste it into VAPI system prompt section. Also add MCP tool and call it `restaurant tool`. You can adjust booking rules, table capacity logic, menu structure, restaurant location, delivery zones, pricing calculations, and message wording to match your restaurant’s operations.\n",
  "featuredImage": "/data/workflows/12004/12004.webp",
  "author": {
    "id": 101,
    "slug": "maksik",
    "name": "Max",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 358,
  "downloads": 35,
  "createdAt": "2025-12-21T13:41:39.961Z",
  "updatedAt": "2026-01-16T09:10:57.554Z",
  "publishedAt": "2025-12-21T13:41:39.961Z",
  "nodes": 122,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12004"
}