{
  "id": 2402,
  "slug": "2402",
  "title": "Telegram bot starter template setup & AI agent chatbot",
  "description": "## Telegram Bot Starter template workflow + n8n AI Agent Chatbot \nprovides a foundational setup for creating powerful Telegram bots with n8n. It handles incoming messages, photos, files, and voice notes, making it an excellent starting point for developers looking to create bots for customer engagement, support, or interactive services.\n\n[Sign up to n8n now →](https://n8n.partnerlinks.io/u4hgi2j8tqnr) and try it!\n\n## Key Features:\n- Dynamic Message Handling: Respond to text messages, photos, files, and more.\n- Modular Design: Easily integrate additional workflows such as user registration, payment modules, or custom commands.\n- Error Handling: Ensure the bot gracefully manages errors and user inputs.\n\n\n## Extensibility:\nThis workflow is the base for building any Telegram bot. Additional modules, such as a user registration module, payment integration, and user profile management, are available for easy connection to expand the bot’s functionality.\n- ✍🏻[Use the Telegram user registration workflow →](https://viktorgubanov.gumroad.com/l/n8n-telegram-payment-workflow-stars) \n- 💵[Use the Telegram Payment, Invoicing and Refund Workflow for Stars →](https://viktorgubanov.gumroad.com/l/n8n-telegram-payment-workflow-stars)\n\n## Who Can Use This Workflow?\n- Developers looking for a quick way to build and customize Telegram bots.\n- Businesses and service providers who need customer interaction automation.\n\n## Setup Instructions:\n1. Replace Telegram credentials with your own API credentials.\n2. Customize responses for different message types (text, photo, file).\n3. If integrating with external services (like Google Sheets), update the necessary credentials and links.\n\n \n## UPDATES:\n[🔥 Get the most up-to-date and expanded version →](https://viktorgubanov.gumroad.com/l/telegram-bot-starter-template) \n\n\n\n**June 25**:\n- New! AI Agent + Setup Instructions\n- Simple setup instructions and examples are included inside the workflow as sticky notes.\n \n**Sep 24**:\n- Improved message handler: Updated logic to handle various types of messages using Switch (text, photo, file, voice, and callback).\n- Payment processing: Added new nodes for sending invoices and handling payments via Telegram\n\n**Aug 24**:\n- Changed processing of system events: “new user” and ‘user who blocked bot’ events\n\n\n\n\nPlease reach out to [Victor](https://www.linkedin.com/in/gubanovvictor/) if you need further assistance with your n8n workflows and automations! [Sign up to n8n →](https://n8n.partnerlinks.io/u4hgi2j8tqnr), you have to try it!",
  "featuredImage": "/data/workflows/2402/2402.webp",
  "author": {
    "id": 101,
    "slug": "victorlucky",
    "name": "Victor Gold",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 35034,
  "downloads": 3503,
  "createdAt": "2024-09-04T15:33:05.306Z",
  "updatedAt": "2026-01-16T08:24:30.916Z",
  "publishedAt": "2024-09-04T15:33:05.306Z",
  "nodes": 48,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2402"
}