{
  "id": 5804,
  "slug": "5804",
  "title": "Daily Reddit posts digest to Gmail",
  "description": "**This n8n workflow automatically scrapes the latest posts from a specified Reddit subreddit every day at 9 AM and sends a neatly formatted HTML email summary to your inbox. It highlights new community posts, including post details like title, author, flair, upvotes, comments, and a brief preview — making it ideal for content curators, community managers, or Reddit enthusiasts who want daily updates.**\n\n## How It Works\nTrigger: The schedule node runs the workflow once every 24 hours at 9:00 AM.\n\nReddit Scrape: A request is made to the desired subreddit (defined in the HTTP Request node) to pull post data.\n\nFilter & Format: JavaScript code filters posts created in the last 24 hours and transforms the data into structured summaries.\n\nEmail Composition: A dynamic HTML email is generated summarizing the post details. If no new posts are found, a fallback message is displayed.\n\nEmail Delivery: Gmail node sends the email with subject, content, and timestamp.\n\n## Use Cases\n✅ Stay informed about the latest subreddit activity.\n\n✅ Automate daily newsletters for Reddit topics.\n\n✅ Monitor niche communities for engagement trends.\n\n## Requirements\nReddit subreddit link (set in the HTTP Request node).\n\nGmail account with OAuth2 credentials set up in n8n.\n\nUser-Agent string customized for your Reddit scraping.\n\nAdjust schedule as per your preferred timezone.\n\nGoogle Sheet Setup (Not required for this workflow)\nNo sheet integration is involved here.\n\n## Customizing the Workflow\nYou can personalize this workflow by:\n\nReplacing the User-Agent value with a meaningful identifier to avoid Reddit rate-limiting.\n\nUpdating the subreddit URL in the HTTP Request node.\n\nChanging the Gmail recipient address in the Send Gmail node.\n\nTweaking the HTML email styling in the Prepare Email Content node.\n\nAdjusting schedule time/frequency in the Trigger node.\n\n",
  "featuredImage": "/data/workflows/5804/5804.webp",
  "author": {
    "id": 101,
    "slug": "arpanjain29",
    "name": "Agentick AI",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 283,
  "downloads": 28,
  "createdAt": "2025-07-09T06:23:42.342Z",
  "updatedAt": "2026-01-16T08:41:29.303Z",
  "publishedAt": "2025-07-09T06:23:42.342Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5804"
}