{
  "id": 9860,
  "slug": "9860",
  "title": "Automatically save Kindle handwritten notes to Google Drive with DeepSeek AI",
  "description": "### Summary:\n\n\nThis n8n workflow addresses the manual and cumbersome process of **exporting handwritten notes from Kindle devices, such as the Kindle Scribe**. It is designed to automate the extraction of the note's PDF download link from an email and subsequently save the file to your Google Drive.\n\n### The Problem\nKindle devices that support handwritten notes (e.g., Kindle Scribe) allow users to export a notebook as a PDF file. However, there is no centralized repository or automated export function. The current process requires the user to:\n\n1. Manually request an export for each file on the device.\n2. Receive an auto-generated email containing a temporary, unique download URL (rather than the attachment itself).\n3. This manual process represents a significant vendor lock-in challenge and a poor user experience.\n\n### How This Workflow Solves It\nThis template automates the following steps:\n\n1. Email Ingestion: Monitors your Gmail account for the specific export email from Amazon.\n2. Link Extraction: Utilizes an LLM service (like DeepSeek, or any other suitable large language model) to accurately parse the email content and extract the unique PDF download URL.\n3. PDF Retrieval & Storage: Executes a request to the extracted URL to download the PDF file and then uploads it directly to your Google Drive.\n\n### Prerequisites\nTo implement and run this workflow, you will need:\n\n1. Kindle Device: A Kindle model that supports handwritten notes and PDF export (e.g., Kindle Scribe).\n2. Gmail Account: The account configured on your Kindle device to receive the export emails.\n3. LLM Account: Access to an LLM API (e.g., DeepSeek, OpenAI, etc.) to perform the necessary text extraction.\n4. Google Drive Credentials: Configured n8n credentials for your Google Drive account.\n\n*This workflow is designed for easy and quick setup, providing a reliable, automated solution for backing up your valuable handwritten notes.*",
  "featuredImage": "/data/workflows/9860/9860.webp",
  "author": {
    "id": 101,
    "slug": "geneishchuk",
    "name": "Gene Ishchuk",
    "avatar": ""
  },
  "categories": [
    "File Management",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 173,
  "downloads": 17,
  "createdAt": "2025-10-18T10:42:32.084Z",
  "updatedAt": "2026-01-16T09:02:20.927Z",
  "publishedAt": "2025-10-18T10:42:32.084Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9860"
}