{
  "id": 2938,
  "slug": "2938",
  "title": "Googleform submission to create a Github issue bug report",
  "description": "# Automated Workflow for Google Form Submissions, GitHub Issues, and Discord Notifications\n\nThis workflow streamlines how new Google Form submissions are processed by automatically creating GitHub issues and sending real-time notifications to a Discord channel through a webhook.\n\n---\n\n## Who Is This Template For?\n- **Developers** looking to centralize bug reporting and issue tracking.  \n- **Project Managers** seeking an efficient way to log tasks and updates.  \n- **QA Teams** that need a fast, automated process for reporting and resolving issues.  \n\n---\n\n## Workflow Overview\n\n1. **Google Form Trigger**  \n   - The workflow begins with a **Google Sheets Trigger** node that checks for new form submissions every minute.\n\n2. **Add New Form Submissions to Google Sheets**  \n   - Each new submission is recorded in a dedicated Google Sheet for easy reference and archiving.\n\n3. **Filter Out Already Posted Issues**  \n   - An **If** node checks if the issue is already posted on GitHub by looking for an existing GitHub link in the sheet.\n\n4. **Format Message / Output Parsing**  \n   - If the issue is new, an **OpenAI Chat Model** node generates a structured output, including a title, description, and suggested fix.\n\n5. **Add Issue to GitHub**  \n   - The structured output is used to create a new issue in the specified GitHub repository.\n\n6. **Send Notification to Discord**  \n   - A Discord webhook is triggered to send a notification to your chosen channel, including a link to the newly created GitHub issue.\n\n7. **Add GitHub Link to the Sheet**  \n   - The GitHub issue link is added back to the Google Sheet for easy cross-referencing.\n\n---\n\n## Setup Steps\n\n### 1. Google Sheets Setup\n- **Create/Designate a Google Sheet:** Ensure it’s set to receive form submissions.  \n- **Configure the Trigger Node:** Provide the correct document ID and sheet name in the Google Sheets Trigger node.\n\n### 2. OpenAI Configuration\n- **API Credentials:** Set up the OpenAI Chat Model node with valid OpenAI API credentials.  \n- **Prompt Definition:** Create a prompt that formats the form submission data into a structured output (e.g., title, description, suggested fix).\n\n### 3. GitHub Configuration\n- **OAuth Credentials:** Configure the GitHub node with your GitHub OAuth credentials.  \n- **Target Repository:** Specify the repository where new issues should be created.\n\n### 4. Discord Webhook\n- **Webhook URL:** Obtain a webhook URL from your Discord server.  \n- **Notification Setup:** Use the HTTP Request node to send notifications to your chosen Discord channel.\n\n### 5. Google Sheets Update\n- **Document & Sheet Name:** Provide the same Google Sheet details used in the first step.  \n- **Add GitHub Link:** Update the corresponding row with the newly created GitHub issue link.\n\n---\n\n## Recommended Google Sheet Columns\n- **Timestamp**: Automatically recorded when the form is submitted.  \n- **Issue Title**: Generated by the OpenAI Chat Model.  \n- **Issue Description**: Detailed breakdown of the issue.  \n- **GitHub Link**: Automatically populated once the issue is created.  \n- **Discord Notification Status** (optional): Indicates whether the notification was sent successfully.\n\n---\n\n## Additional Notes\n- **Duplicate Prevention**: The conditional logic ensures existing issues aren’t recreated on GitHub.  \n- **AI-Powered Formatting**: OpenAI helps structure the issue details, providing clarity for developers.  \n- **Real-Time Alerts**: Discord notifications keep your entire team updated on new issues as they arise.\n",
  "featuredImage": "/data/workflows/2938/2938.webp",
  "author": {
    "id": 101,
    "slug": "chrisv",
    "name": "xerang",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 540,
  "downloads": 54,
  "createdAt": "2025-02-18T17:32:20.487Z",
  "updatedAt": "2026-01-16T08:27:17.680Z",
  "publishedAt": "2025-02-18T17:32:20.487Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2938"
}