{
  "id": 5622,
  "slug": "5622",
  "title": "Generate SWOT analysis reports with OpenAI, Google Sheets & APITemplate PDF Export",
  "description": "### SWOT Analysis Generator That Produces PDF Reports In n8n\n\nWant to skip the manual work and instantly generate SWOT analyses for your business plans, investor decks, or strategy docs? 🚀 This workflow lets you automate the entire SWOT (Strengths, Weaknesses, Opportunities, Threats) process—using AI and no-code tools! Whether you're using this for yourself or creating documents for clients, this workflow will save you hours of time and help identify the key components of growing any business.\n\n#### Tools We’ll Be Using:\n- **OpenAI API**: Powers AI-driven extraction and generation of SWOT sections, introductions, conclusions, and more.\n- **n8n**: The no-code automation platform that orchestrates this workflow.\n- **Google Sheets**: Stores your company data and report outputs (download the provided \"SWOT Analysis\" template and fill it out).\n- **APITemplate.io**: Converts HTML reports into downloadable, multi-page PDFs.\n- **DeepSeek API** *(optional)*: An alternative to OpenAI for specific reasoning tasks.\n- **Gmail OAuth2**: Sends the final report via email.\n\nIf you’re building a business, doing client work, or just want faster strategic planning—this will save you HOURS.\n\n---\n\n### How It Works\n\nThis n8n workflow transforms structured company data from a Google Sheet into a fully formatted, investor-grade SWOT report in both HTML and PDF formats. Here’s the process in a few high-level steps:\n\n1. **Load Data**: Pulls company information from the \"Company Info Input\" tab in the \"SWOT Analysis\" Google Sheet.\n2. **AI Analysis**: Uses AI (via OpenAI or DeepSeek) to categorize data into Strengths, Weaknesses, Opportunities, and Threats, and generates detailed narrative sections for each.\n3. **Create Report Sections**: Produces a strategic introduction, conclusion, table of contents, and title page using AI.\n4. **Format and Combine**: Converts all sections into styled HTML and merges them into a single document.\n5. **Generate PDF**: Converts the HTML into a polished, multi-page PDF using APITemplate.io.\n6. **Save and Share**: Saves the report back to Google Sheets and emails the PDF to a specified recipient.\n\nThe result is a professional, investor-ready SWOT report with minimal manual effort, ready for sharing or review.\n\n---\n\n### Setup Steps\n\nSetting up this workflow typically takes **15-30 minutes**, depending on your familiarity with the tools. Here’s what you’ll need to do:\n\n- **Configure Credentials**: Set up API keys and OAuth2 credentials for Google Sheets, OpenAI, APITemplate.io, Gmail, and optionally DeepSeek.\n- **Prepare Your Google Sheet**: Download the provided \"SWOT Analysis\" template, fill out the \"Company Info Input\" tab with your company data, and ensure it’s accessible.\n- **Import the Workflow**: Copy the workflow JSON into your n8n instance and connect your credentials.\n\n**Detailed instructions** for each step, including credential setup and customization options, are available in the sticky notes within the workflow. Refer to these for step-by-step guidance.\n\n---\n\n### Benefits\n\n- **Efficiency**: Automates the entire SWOT report generation process, saving hours of manual work.\n- **Professional Output**: Delivers fully styled HTML and PDF reports with headings, paragraphs, and custom layouts.\n- **AI-Driven Insights**: Ensures clarity and relevance in every section through targeted AI analysis.\n- **Seamless Sharing**: Automatically saves reports to Google Sheets and emails them to stakeholders.\n\nThis workflow is perfect for entrepreneurs, consultants, or strategists looking to streamline their SWOT analysis process and deliver high-quality, professional reports effortlessly.",
  "featuredImage": "/data/workflows/5622/5622.webp",
  "author": {
    "id": 101,
    "slug": "lewxiangang",
    "name": "Sebastian/OptiLever",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1851,
  "downloads": 185,
  "createdAt": "2025-07-03T06:15:48.765Z",
  "updatedAt": "2026-01-16T08:40:36.371Z",
  "publishedAt": "2025-07-03T06:15:48.765Z",
  "nodes": 40,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5622"
}