{
  "id": 7835,
  "slug": "7835",
  "title": "Automated recipe finder with an API - n8n API tutorial material",
  "description": "## Video Introduction\n[![Video Walkthrough](https://vasarmilan-public.s3.us-east-1.amazonaws.com/blog_thumbnails/thumbnail_recux4gNImLpzqvyd.jpg)](https://youtu.be/mMEX4Zsz4XY)\n\n#### Want to automate your inbox or need a custom workflow? [📞 Book a Call](https://smoothwork.ai/book-a-call/) | [💬 DM me on Linkedin](https://www.linkedin.com/in/mil%C3%A1n-v%C3%A1s%C3%A1rhelyi-3a9985123/)\n\n---\n\n## Workflow Overview\n\nThis workflow creates a recipe finder web application that connects to the API Ninjas Recipe API using n8n's HTTP Request node. Users submit search queries through a public web form, which triggers an API call to fetch matching recipes. The results—including recipe title, ingredients, and cooking instructions—are displayed in a formatted completion page.\n\n## Why This Workflow Is Valuable\n\nThis template demonstrates API-to-API integration, a crucial skill for connecting services that don't have pre-built n8n nodes. By using direct API calls, you gain access to the full functionality of external services. This pattern can be adapted to integrate virtually any tool with an API into your n8n workflows.\n\n## Common Use Cases\n\n- Create public-facing forms that query external databases\n- Build custom search tools for specialized APIs\n- Integrate niche services without dedicated n8n nodes\n- Learn header authentication for secure API connections\n\n## Setup & Configuration\n\n1. **Register for API Ninjas**: Sign up at API Ninjas to access their Recipe API\n2. **Get your API Key**: Locate your API key in the API Ninjas dashboard\n3. **Configure Credentials**: In n8n, create a new **Header Auth** credential\n   - Set the header name to match the API requirement (e.g., 'X-Api-Key')\n   - Paste your API key as the value\n   - Apply this credential to the HTTP Request node\n\nThe Form Trigger generates a public URL for users to submit queries. Customize the form title, field labels, and completion message HTML to match your needs.",
  "featuredImage": "/data/workflows/7835/7835.webp",
  "author": {
    "id": 101,
    "slug": "vasarmilan",
    "name": "Milan Vasarhelyi - SmoothWork",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 180,
  "downloads": 18,
  "createdAt": "2025-08-25T12:29:05.450Z",
  "updatedAt": "2026-01-16T08:52:33.478Z",
  "publishedAt": "2025-08-25T12:29:05.450Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7835"
}