{
  "id": 4358,
  "slug": "4358",
  "title": "Auto-Delete SPAM, Social, and Promotions Emails in Gmail",
  "description": "## Who is this for?\nThis workflow is perfect for Gmail users who want a tidy inbox without manual effort. It’s especially great for those overwhelmed by SPAM, social media updates, or promotional emails and want them automatically removed regularly.\n\n## What problem is this workflow solving?\nUnwanted emails like SPAM, social notifications, and promotions can clutter your Gmail inbox, making it hard to focus on what matters. Manually deleting them is repetitive and time-consuming. This workflow automates the cleanup, keeping your inbox streamlined.\n\n## What this workflow does\nEvery 3 days, this workflow deletes emails from Gmail’s SPAM, Social, and Promotions categories. It uses n8n’s Gmail node to fetch these emails, merges them into a single list, splits out individual email IDs, and deletes each one. The scheduled process ensures consistent inbox maintenance.\n\n## Setup\n1. Set up valid Gmail OAuth2 credentials in n8n.\n2. Import the \"Clean My Mail\" workflow into your [n8n instance](https://n8n.partnerlinks.io/khaisastudio).\n3. Confirm the Gmail nodes target SPAM, CATEGORY_SOCIAL, and CATEGORY_PROMOTIONS labels.\n4. Adjust the \"Run Every 3 Days (Trigger)\" node’s schedule if needed.\n5. Activate the workflow to begin automated cleaning.\n\n## How to customize this workflow to your needs\n- Change the Gmail node labels to target other categories or custom labels.\n- Adjust the schedule frequency in the trigger node.\n- Add filters to spare specific emails from deletion.\n- Extend functionality with nodes for archiving or notifications.\n\n***made by:** [khmuhtadin](https://khmuhtadin.com)*\n**Need a custom?** contact me on **[LinkedIn](https://www.linkedin.com/in/khmuhtadin/)** or **[Web](khmuhtadin.com)**",
  "featuredImage": "/data/workflows/4358/4358.webp",
  "author": {
    "id": 101,
    "slug": "khmuhtadin",
    "name": "Khairul Muhtadin",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3025,
  "downloads": 302,
  "createdAt": "2025-05-24T11:22:05.573Z",
  "updatedAt": "2026-01-16T08:33:57.503Z",
  "publishedAt": "2025-05-24T11:22:05.573Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4358"
}