{
  "id": 8400,
  "slug": "8400",
  "title": "Generate sprint review summaries from transcripts with OpenAI and Google Sheets",
  "description": "## What this workflow does\n\nThis template automates the entire process of documenting **Sprint Reviews in Scrum**:  \n1. **Input Collection** – Through a friendly form, users upload the **transcript file** (meeting notes, sprint review transcript, or VTT captions) and specify the sprint name and domain.  \n2. **Transcript Parsing** – A Code node formats the transcript into clean [HH:MM:SS] Speaker: text lines, supporting VTT, Zoom, or custom timestamp formats used in Scrum events.  \n3. **AI-Driven Summary** – The AI Agent (LangChain + OpenAI) produces a well-structured **AI summarization** in Markdown, including:  \n   - A 3–5 bullet Executive Summary of sprint review highlights  \n   - A Presentation Recap table (Timestamp | Presenter | Topics)  \n   - A list of Action Items with owners (if recognizable from the transcript)  \n4. **Preview** – The summary renders as a styled card with custom CSS for easy readability in n8n.  \n5. **Archive** – Automatically appends a record to Google Sheets, saving the date, domain, sprint, transcript file name, and the **AI-generated sprint review summary**.  \n\n## Why it’s useful\n- **Zero manual summarizing** – AI extracts key insights from transcript files into Markdown you can instantly share with your Scrum team and stakeholders.  \n- **Easy setup** – drag-and-drop import, plus form-based input for non-technical users during sprint reviews.  \n- **Centralized tracking** – all past sprint summaries live in one spreadsheet for retrospectives, audits, and continuous improvement.  \n- **Flexible and extendable** – you can switch to Airtable, Slack, or Notion, or refine the summary template to match your Scrum workflow.  \n\n## Ideal for\n- **Scrum Masters** wanting quick sprint review summaries for stakeholders  \n- **Agile Coaches** analyzing sprint review transcripts, presentation patterns, and follow-up tasks  \n- **Product Owners** keeping a searchable log of sprint outcomes and action items  \n\n## Prerequisites / Credentials\n- **OpenAI API Key** — required for the AI Agent node (or any other Agent for summarization)  \n- **Google Sheets OAuth2 credentials** — required for saving sprint review data to Sheets  \n- (Optional) Ensure LangChain / AI Agent nodes are installed in your n8n instance  \n\n## How to Use This Template\n1. Import the workflow JSON into your n8n instance.  \n2. Set up credentials:  \n   - For the **OpenAI LLM** node, provide your OpenAI API key  \n   - In **Google Sheets**, configure OAuth2 and specify your spreadsheet ID (replace YOUR_SHEET_ID)  \n3. **Create a new sheet** with the following columns:  \n   - Date  \n   - Domain  \n   - Sprint name  \n   - Content  \n   - VTT file  \n   - Transcript  \n4. Enable and run the workflow.  \n5. Fill out the form: upload transcript file, enter sprint & domain, click **Create Summary**.  \n6. View the AI-generated Markdown sprint review summary in the preview card.  \n7. Verify the new entry appears in your Google Sheet with all sprint details.  ",
  "featuredImage": "/data/workflows/8400/8400.webp",
  "author": {
    "id": 101,
    "slug": "akadiusz",
    "name": "Arkadiusz",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 78,
  "downloads": 7,
  "createdAt": "2025-09-09T07:40:49.207Z",
  "updatedAt": "2026-01-16T08:55:36.226Z",
  "publishedAt": "2025-09-09T07:40:49.207Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8400"
}