{
  "id": 10140,
  "slug": "10140",
  "title": "Send WooCommerce discount coupons to customers via WhatsApp using Rapiwa API",
  "description": "## Who is this for?\nThis workflow is ideal for WooCommerce store owners who want to automatically send promotional WhatsApp messages to their customers when new coupons are created. It’s designed for marketers and eCommerce managers looking to boost engagement, streamline coupon sharing, and track campaign performance effortlessly through Google Sheets.\n\n## Overview\nThis workflow listens for WooCommerce coupon creation events (coupon.created) and uses customer billing data to send promotional WhatsApp messages via the Rapiwa API. The flow formats the coupon data, cleans phone numbers, verifies WhatsApp registration with Rapiwa, sends the promotional message when verified, and logs each attempt to Google Sheets (separate sheets for verified/sent and unverified/not sent).\n\n## What this Workflow Does\n- Listens for new coupon creation events in WooCommerce via the WooCommerce Trigger node\n- Retrieves all customer data from the WooCommerce store\n- Processes customers in batches to control throughput\n- Cleans and formats customer phone numbers for WhatsApp\n- Verifies if phone numbers are valid WhatsApp accounts using Rapiwa API\n- Sends personalized WhatsApp messages with coupon details to verified numbers\n- Logs all activities to Google Sheets for tracking and analysis\n- Handles both verified and unverified numbers appropriately\n\n## Key Features\n- Automated coupon distribution: Triggers when new coupons are created in WooCommerce\n- Customer data retrieval: Fetches all customer information from WooCommerce\n- Phone number validation: Verifies WhatsApp numbers before sending messages\n- Personalized messaging: Includes customer name and coupon details in messages\n- Dual logging system: Tracks both successful and failed message attempts\n- Rate limiting: Uses batching and wait nodes to prevent API overload\n- Data formatting: Structures coupon information for consistent messaging\n\n\n## Google Sheet Column Structure\n**A Google Sheet formatted like this** ➤ [sample](https://docs.google.com/spreadsheets/d/14UclmcZ7TGU4Qaag89yaZLVFee1IQNA6t-uhgN8_TAE/edit?usp=drivesdk)\nThe workflow uses a Google Sheet with the following columns to track coupon distribution:\n\n| name        | number        | email                                               | address1  | couponCode | couponTitle    | couponType | couponAmount | createDate          | expireDate          | validity   | status   |\n| ----------- | ------------- | --------------------------------------------------- | --------- | ---------- | -------------- | ---------- | ------------ | ------------------- | ------------------- | ---------- | -------- |\n| Abdul Mannan | 8801322827799 | [contact@spagreen.net](mailto:contact@spagreen.net)     | mirpur-DOHS | 62dhryst   | eid offer 2025 | percent    | 20.00        | 2025-09-11 06:08:02 | 2025-09-15 00:00:00 | unverified | not sent |\n| Abdul Mannan  | 8801322827799 | [contact@spagreen.net](mailto:contact@spagreen.net) | mirpur-DOHS | 62dhryst   | eid offer 2025 | percent    | 20.00        | 2025-09-11 06:08:02 | 2025-09-15 00:00:00 | verified   | sent     |\n\n\n## Requirements\n- n8n instance with the following nodes: WooCommerce Trigger, Code, SplitInBatches, HTTP Request, IF, Google Sheets, Wait\n- WooCommerce store with API access\n- Rapiwa account with API access for WhatsApp verification and messaging\n- Google account with Sheets access\n- Customer phone numbers in WooCommerce (stored in billing.phone field)\n\n\n## Important Notes\n- **Phone Number Format**: The workflow cleans phone numbers by removing all non-digit characters. Ensure your WooCommerce phone numbers are in a compatible format.\n- **API Rate Limits**: Rapiwa and WooCommerce APIs have rate limits. Adjust batch sizes and wait times accordingly.\n- **Data Privacy**: Ensure compliance with data protection regulations when sending marketing messages.\n- **Error Handling**: The workflow logs unverified numbers but doesn't have extensive error handling. Consider adding error notifications for failed API calls.\n- **Message Content**: The current message template references the first coupon only (`coupons[0]`). Adjust if you need to handle multiple coupons.\n\n## Useful Links\n- **Dashboard:** [https://app.rapiwa.com](https://app.rapiwa.com/login)\n- **Official Website:** [https://rapiwa.com](https://rapiwa.com/)\n- **Documentation:** [https://docs.rapiwa.com](https://docs.rapiwa.com/)\n\n## Support & Help\n- **WhatsApp**: [Chat on WhatsApp](https://wa.me/8801322827799)\n- **Discord**: [SpaGreen Community](https://discord.gg/SsCChWEP)\n- **Facebook Group**: [SpaGreen Support](https://www.facebook.com/groups/spagreenbd)\n- **Website**: [https://spagreen.net](https://spagreen.net)\n- **Developer Portfolio**: [Codecanyon SpaGreen](https://codecanyon.net/user/spagreen/portfolio)\n",
  "featuredImage": "/data/workflows/10140/10140.webp",
  "author": {
    "id": 101,
    "slug": "rapiwa",
    "name": "Rapiwa",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 107,
  "downloads": 10,
  "createdAt": "2025-10-25T03:47:51.211Z",
  "updatedAt": "2026-01-16T09:03:37.960Z",
  "publishedAt": "2025-10-25T03:47:51.211Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10140"
}