{
  "id": 8544,
  "slug": "8544",
  "title": "Create & post viral news AI avatar videos to 9 platforms with Perplexity & HeyGen",
  "description": "## Description\nThis fully automated AI Twin Viral News system researches the latest trending news in any niche or industry, then generates talking-head AI clone videos WITHOUT having to film or edit yourself. This can easily be tailored to any particular niche, simply by updating the Perplexity research prompty.\n\nIt combines ChatGPT, Perplexity, HeyGen, and Blotato to research, create, and auto-post talking-head AI avatar videos to every social media platform, every single day.\n\n## Who Is This For?\n\nThis is perfect for digital marketing agencies, small business owners, entrepreneurs, content creators, influencers, and social media agencies.\n\n## How It Works\n\n**1. Trigger**\n- Schedule: configured to run once daily at 10am\n\n**2. AI Researcher**\n\n- Call Perplexity to research the top 10 latest news in your industry  \n- Select news story most likely to go viral  \n- Compile detailed factual report on selected news story\n\n**3. AI Writer**\n- AI writes monologue script, video caption, and short title\n\n**4. Create Avatar Video**\n- Call HeyGen API (requires paid API plan), specifying your avatar ID and voice ID  \n- Create avatar video; optionally pass an image/video background if you have a green screen avatar\n\n**5. Get Video**\n- Wait awhile, then fetch completed avatar video  \n- Upload video to Blotato\n\n**6. Publish to Social Media via Blotato**\n- Connect your Blotato account  \n- Choose your social accounts  \n- Either post immediately or schedule for later\n\n## Setup & Required Accounts\n- Sign up for Perplexity.ai and set up your API Billing  \n- Generate your Perplexity API Key: https://www.perplexity.ai/account/api/keys\n- Sign up for Blotato.com  \n - Generate Blotato API Key via Settings &gt; API &gt; Generate API Key (paid feature only)  \n - Ensure \"Verified Community Nodes\" enabled in n8n Admin Panel  \n- Install \"Blotato\" verified community node  \n- Create Blotato credential\n- Sign up for HeyGen web plan and API plan  \n- Paste your HeyGen API key, HeyGen avatar ID, and HeyGen voice ID\n- Complete the 2 setup steps in BROWN sticky notes in this template\n\n## Optional: Background Image/Video Behind Avatar\n- Ensure you have an avatar with background removed (requires higher tier Heygen plan)  \n- Open SETUP HEYGEN node and set parameter 'has_background_video' to `true`  \n- Open SETUP HEYGEN node and replace video URL in parameter 'background_video_url'  \n- Recommendation: Only enable after the basic workflow is operational, i.e. you can make avatar videos without a background\n\n## Tips & Tricks\n- Perplexity API account must have billing funded  \n- HeyGen API requires paid plan  \n- Make sure you copied your avatar ID correctly (not the group avatar ID)  \n- If your script is long, it takes more time for your video to finish  \n- While testing:\n  - Enable only 1 social platform and deactivate the rest  \n  - Update AI writer prompt to return a 5-second script instead of 30 seconds to reduce processing time\n- Go to HeyGen and check that your avatar video is being processed  \n- After the workflow finishes, check your social media account for the final post  \n- If successful, enable another social media node and continue testing\n\n## 📄 Documentation\n[Full Tutorial](https://help.blotato.com/api/templates/4-viral-news-to-ai-avatar-videos)\n\n## Troubleshooting\nCheck your [Blotato API Dashboard](https://my.blotato.com/api-dashboard) to see every request, response, and error. Click on a request to see the details.\n\n## Need Help?\nIn the Blotato web app, click the orange button on the bottom right corner. This opens the Support messenger where I help answer technical questions.\n\n**Connect with me: [Linkedin](https://www.linkedin.com/in/sabrinaramonov) | [Youtube](https://www.youtube.com/@sabrina_ramonov)**",
  "featuredImage": "/data/workflows/8544/8544.webp",
  "author": {
    "id": 101,
    "slug": "sabrina-ramonov",
    "name": "Sabrina Ramonov 🍄",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1082,
  "downloads": 108,
  "createdAt": "2025-09-12T21:19:21.153Z",
  "updatedAt": "2026-01-16T08:56:23.670Z",
  "publishedAt": "2025-09-12T21:19:21.153Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8544"
}