{
  "id": 3366,
  "slug": "3366",
  "title": "Webpage change detection & alerts with Google Suite and hash tracking",
  "description": "### This n8n template can monitor and detect changes to a webpage's contents and notify you only when a change occurs.\n\nGreat to keep an eye on and track publicly available documents such as  company TOS, government policy or competitor pages.\n\n### How it works\n* A scheduled trigger is used so we can run everyday to automate this process.\n* A website page is then fetched with the HTTP request node and the contents we want to track are extracted using the HTML node.\n* To detect changes, we generate a hash on the contents with the cryptography node and compare it with previously seen hashes using the \"remove duplicates\" node. If the hash was seen before, the workflow stops here.\n* Finally, when new changes are detected a copy of the contents are uploaded to Google Drive and a logged into a Google sheet. A notification email can also be sent if action is required.\n\n### How to use\n* Update the URL you want to track in the node named \"variables\" and ensure the HTML node has updated selectors to get the content you want.\n* Ensure the timezone is set correctly when using the Scheduled Trigger node.\n\n### Requirements\n* Google Sheets, Drive and Gmail for storing and notifying about changes.\n* Webpages should ideally be publicly accessible. If not, you may need to switch the HTTP request node with a webscraping service.\n\n### Customising this workflow\n* Not using Google? Easier swap to other Service providers such as Miscrosoft365.\n* Need more URLs? Try modifing the variables node to accept multiple URLs though the HTML node will need to be customised.",
  "featuredImage": "/data/workflows/3366/3366.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 4317,
  "downloads": 431,
  "createdAt": "2025-03-30T11:27:55.561Z",
  "updatedAt": "2026-01-16T08:29:25.855Z",
  "publishedAt": "2025-03-30T11:27:55.561Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3366"
}