{
  "id": 10387,
  "slug": "10387",
  "title": "Generate, encrypt, and send invoices with PDF Generator API & Google Suite",
  "description": "## Why\nCreating and sending invoices manually is a major administrative bottleneck. It's not only slow but also prone to human error, such as creating duplicate invoice numbers or sending sensitive financial data in an unsecured format. This workflow solves these problems by creating a robust, end-to-end automation. It ensures every invoice has a unique ID, is professionally generated, is password-protected, and is delivered to your customer automatically.\n\n## What\nThis workflow provides a complete, secure solution for automated invoicing. It is designed to be triggered by a **Webhook** (e.g., from your e-commerce store, CRM, or billing platform) that provides customer and order details.\n\nThe workflow then executes the following steps:\n\n1.  **Generate & Verify ID:** It first generates a new invoice ID. It then performs a critical check by reading your master **Google Sheet** to ensure this ID is unique, preventing duplicate invoices.\n2.  **Generate PDF:** Once the ID is verified, it passes the data to the **PDF Generator API**. This service dynamically populates your custom invoice template. ([PDF Generator API](https://pdfgeneratorapi.com/) makes it incredibly easy to build and manage your document templates via their web-based editor).\n3.  **Encrypt Document:** For enhanced security, the workflow uses a **PDF Generator API** operation to encrypt the newly generated invoice with a password, protecting your client's sensitive data.\n4.  **Store & Deliver:** Finally, it uploads the secure PDF to a specified **Google Drive** folder for your records and then automatically sends it to the customer as an attachment using **Gmail**.\n\n## How\n1.  **Prerequisites:** You will need active accounts for:\n    * [PDF Generator API](https://pdfgeneratorapi.com/) (for both generation and encryption)\n    * Google Suite (for Sheets, Drive, and Gmail)\n2.  **PDF Generator API Setup:**\n    * Log in to your PDF Generator API account and use their template builder to create your invoice design.\n    * Note your **Template ID**, **API Key**, and **API Secret**.\n    * In the n8n `PDFGeneratorAPI` node (`Generate a PDF document`), create new credentials using your Key and Secret. In the node's parameters, select your **Template ID** from the list.\n3.  **Google Sheets Setup:**\n    * Create a Google Sheet to act as your master list of invoices.\n    * In the `Check If ID Already Exists` node, authenticate your Google Sheets account. Set the **Spreadsheet ID** and **Sheet Name**. In the \"Columns to Return\" field, enter the name of the column where you store your invoice IDs.\n4.  **Security & Delivery Setup:**\n    * **Encrypt Node:** In the `Encrypt PDF document` node, authenticate your **PDF Generator API** credentials (the same ones from Step 2). You can set a static password, or for better security, use an expression to set a dynamic password from the webhook data (e.g., the customer's postal code or order ID).\n    * **Google Drive Node:** Authenticate the `Upload file` node and specify the Drive and Folder ID where invoices should be stored.\n    * **Gmail Node:** Authenticate the `Send a message + file` node. Use an expression to map the customer's email from the trigger data into the \"To\" field.\n5.  **Test & Activate:**\n    * The `Webhook` node has pinned test data. You can click \"Test workflow\" to run the entire process with this sample data.\n    * Once you confirm the file is generated, encrypted, and sent, connect your live app (e.g., Shopify, Stripe, etc.) to the production Webhook URL.\n    * Activate the workflow.",
  "featuredImage": "/data/workflows/10387/10387.webp",
  "author": {
    "id": 101,
    "slug": "marian",
    "name": "Marián Današ",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 205,
  "downloads": 20,
  "createdAt": "2025-10-31T12:00:01.667Z",
  "updatedAt": "2026-01-16T09:04:50.983Z",
  "publishedAt": "2025-10-31T12:00:01.667Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10387"
}