{
  "id": 8290,
  "slug": "8290",
  "title": "Automate faceless shorts with OpenAI, RunwayML & ElevenLabs: script to social media",
  "description": "### ⚙️ Faceless YouTube Generator - Automate Faceless YouTube Shorts with AI: Generate Scripts, Videos, Audio, and Captions in Minutes!\n\nTired of grinding out YouTube content? This n8n workflow turns AI into your personal video factory—creating engaging, faceless shorts on autopilot. Perfect for creators, marketers, or side-hustlers looking to monetize without showing your face. From script writing to final upload, it's all handled: AI-generated scripts (optimized for 20-second hooks), stunning image-to-video animations via RunwayML, immersive audio with ElevenLabs, and pro captions. Scale your channel effortlessly and watch the views (and revenue) roll in!\n\n### 🧑‍💻 Author: LeeWei\n\n---\n\n### 🚀 How It Works\n\n• **Trigger & Script Magic**: Starts via Google Sheets webhook—AI crafts a punchy 213-223 character script (via Anthropic) for ~20-second shorts, ensuring viral potential.\n• **Visuals on Autopilot**: Splits scenes, generates high-quality images with OpenAI, then animates them into videos using RunwayML's Gen3a Turbo.\n• **Audio Layering**: Adds soothing background sounds and professional voice-overs (Adam voice) via ElevenLabs for that polished, immersive feel.\n• **Final Polish & Upload**: Merges everything in Creatomate, slaps on captions with Replicate, uploads to Google Drive/YouTube, and updates your sheet—ready to post!\n\nSetup takes 15-20 minutes with API keys. Plug-and-play: Import the JSON into n8n, and you're set—edit only API tokens and credentials as noted.\n\n### 🚀 Steps to Connect:\n\n1. **Google Sheets & Drive Setup**\n    - Use your existing Google OAuth2 credentials in the \"Google Sheets\" and \"Google Drive\" nodes.\n    - Clone the demo sheet (ID: 1Co9tTJelYyefLLxzkoOhUBU3XuQIspBpDudtZLynW2M) and update the ID in \"Update Video Status\" if needed. Tweak folder IDs in \"Upload to Drive\" nodes for custom storage.\n\n2. **Anthropic API Key**\n    - Head to [Anthropic](https://www.anthropic.com/) and grab your API key.\n    - Paste it into the \"Anthropic Chat Model\" node credentials.\n\n3. **OpenAI API Key**\n    - Visit [OpenAI](https://platform.openai.com/) for your API key.\n    - Add it to the \"OpenAI Chat Model\" node credentials.\n\n4. **RunwayML API Key**\n    - Sign up at [RunwayML](https://runwayml.com/) and get your token.\n    - Replace \"YOUR_API_TOKEN\" in the \"Authorization\" headers of \"Generate Videos\" and \"Get Generated Videos\" HTTP nodes.\n\n5. **ElevenLabs API Key**\n    - Go to [ElevenLabs](https://try.elevenlabs.io/mjxkz7027sqp) and generate your key.\n    - Swap \"YOUR_API_TOKEN\" in the \"xi-api-key\" headers of \"Generate Audio (Background sound)\" and \"Text to Speech (Adam Voice)\" nodes.\n\n6. **Creatomate API Key**\n    - Register at [Creatomate](https://creatomate.com/) for your token.\n    - Update \"YOUR_API_TOKEN\" in the \"Authorization\" header of the \"Render Video with Creatomate\" HTTP node.\n\n7. **Replicate API Key**\n    - Get your token from [Replicate](https://replicate.com/).\n    - Insert \"YOUR_API_TOKEN\" in the \"Authorization\" header of the \"Add Captions - replicate\" HTTP node.\n\n8. **(Optional) YouTube Upload**\n    - For direct uploads, add your Google YouTube OAuth credentials to the \"Upload Video\" node.\n\n",
  "featuredImage": "/data/workflows/8290/8290.webp",
  "author": {
    "id": 101,
    "slug": "leeweihernandez07",
    "name": "LeeWei",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 154,
  "downloads": 15,
  "createdAt": "2025-09-05T09:50:38.393Z",
  "updatedAt": "2026-01-16T08:55:08.243Z",
  "publishedAt": "2025-09-05T09:50:38.393Z",
  "nodes": 56,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8290"
}