{
  "id": 4325,
  "slug": "4325",
  "title": "Find, scrape & analyze Twitter posts by name with Bright Data & Gemini",
  "description": "This n8n workflow template automates the process of collecting and analyzing Twitter (X) posts for any public profile, then generates a clean, AI-powered summary including key metrics, interests, and activity trends.\n\n🚀 **What It Does**\n- Accepts a user's full name and date range through a public form.\n- Automatically finds the person’s X (formerly Twitter) profile using a Google search.\n- Uses Bright Data to retrieve full post data from the X.com profile.\n- Extracts key post metrics like views, likes, reposts, hashtags, and mentions.\n- Uses Google Gemini (PaLM) to generate a personalized summary: tone, themes, popularity, and sentiments.\n- Stores both raw data and the AI summary into a connected Google Sheet for further review or team collaboration.\n\n🛠️ **Step-by-Step Setup**\n1. Deploy the public form to collect full name and date range.\n2. Build a Google search query using the name to find their X profile.\n3. Scrape the search results via Bright Data (Web Unlocker zone).\n4. Parse the page content using the HTML node.\n5. Use Gemini AI to extract the correct X profile URL.\n6. Pull full post data via Bright Data dataset snapshot API.\n7. Transform post data into clean structured fields:\ndate_posted, description, hashtags, likes, views,\nquoted_post.date_posted, quoted_post.description,\nreplies, reposts, quotes, and tagged_users.profile_name.\n8. Analyze all posts using Google Gemini for interest detection and persona generation.\n9. Save results to a Google Sheet: structured post data + AI-written summary.\n10. Show success or fallback messages depending on profile detection or scraping status.\n\n🧠 **How It Works: Workflow Overview**\n- Trigger: When user submits form\n- Search & Match: Google search → HTML parse → Gemini filters matching X profile\n- Data Gathering: Bright Data → Poll for snapshot completion → Fetch post data\n- Transformation: Extract and restructure key fields via Code node\n- AI Summary: Use Gemini to analyze tone, interests, and trends\n- Export: Save results to Google Sheet\n- Fallback: Display custom error message if no X profile found\n\n📨 **Final Output**\n- A record in your Google Sheet with:\n  - Clean post-level data\n  - Profile-level engagement summary\n  - An AI-written overview including tone, common topics, and post popularity\n\n🔐 **Credentials Used**\n- **Bright Data account** (for search & post scraping)\n- **Google Gemini (PaLM)** or Gemini Flash via - \nOpenAI/Google Vertex API\n- **Google Sheets (OAuth2) account** (for result storage)\n\n**⚠️Community Node Dependency**\nThis workflow uses a custom community node:\n**n8n-nodes-brightdata**\nInstall it via UI (Settings → Community Nodes → Install).",
  "featuredImage": "/data/workflows/4325/4325.webp",
  "author": {
    "id": 101,
    "slug": "glebd",
    "name": "Gleb D",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1720,
  "downloads": 172,
  "createdAt": "2025-05-22T16:00:13.479Z",
  "updatedAt": "2026-01-16T08:33:48.259Z",
  "publishedAt": "2025-05-22T16:00:13.479Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4325"
}