{
  "id": 9562,
  "slug": "9562",
  "title": "AI-powered X (Twitter) content generator and scheduler with LangChain and Blotato",
  "description": "This n8n template demonstrates how to use AI to fully automate the generation and scheduling of X (formerly Twitter) content based on a specific, predefined persona.\n\nUse cases are many: It's perfect for social media marketers looking to streamline content creation, individual experts building a consistent brand voice, or businesses aiming to drive traffic to specific services with a steady stream of relevant content.\n\n#### Good to know\n\n*   The AI model used in this workflow (via OpenRouter) requires an API key and will incur costs based on usage (typically a few cents per generation).\n*   The Blotato node used for posting is a third-party community node and requires a separate Blotato account.\n\n#### How it works\n\nThis workflow is divided into two main processes: **Content Generation** and **Content Posting**.\n\n1.  **Content Generation Process:**\n    *   A Schedule Trigger kicks off the workflow every 4 hours.\n    *   An AI Agent (LangChain) generates a post based on a detailed prompt defining a persona, purpose, and rules.\n    *   A Code node refines the AI's output, ensuring the text ends naturally.\n    *   The generated post is then saved to a Google Sheet with a \"Not Posted\" status, creating a content queue.\n\n2.  **Content Posting Process:**\n    *   The workflow retrieves one \"Not Posted\" item from the Google Sheet.\n    *   An IF node checks the post's category to determine if an image is required.\n    *   If an image is needed, it searches for and retrieves a matching image file from a specified Google Drive folder.\n    *   The Blotato node posts the text (and image, if applicable) to the designated X (Twitter) account.\n    *   A confirmation email is sent via Gmail to notify stakeholders of the successful post.\n    *   Finally, the Google Sheet status is updated to \"Completed\" to prevent duplicate posts.\n\n#### How to use\n\n*   You can test the workflow anytime using the manual trigger. For production, adjust the posting frequency in the \"Trigger: Every 4 Hours\" node.\n*   The quality of the generated content is determined by the prompt. Edit the system message within the \"AI: Generate X Post Content\" node to customize the persona, purpose, tone of voice, etc.\n*   To generate posts with images, you must upload image files to the specified Google Drive folder. The filename must exactly match the post's category name (e.g., `Evidence-based_Graph.png`).\n\n#### Requirements\n\n*   An OpenRouter account (or another AI service account) for the LLM.\n*   A Blotato account for social media posting.\n*   A Google account for content management, image storage, and notifications (Sheets, Drive, Gmail).\n\n#### Customising this workflow\n\n*   Expand the workflow to post to other social media platforms supported by Blotato, such as Facebook or LinkedIn.\n*   Instead of posting immediately, add a human-in-the-loop approval step by sending the AI-generated draft to Slack or email for review before publishing.\n*   Replace the Schedule Trigger with a Webhook Trigger to generate and post relevant content based on external events, such as \"when a new blog post is published.\"",
  "featuredImage": "/data/workflows/9562/9562.webp",
  "author": {
    "id": 101,
    "slug": "yusuke-yamamoto",
    "name": "Yusuke Yamamoto",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 174,
  "downloads": 17,
  "createdAt": "2025-10-13T08:14:27.804Z",
  "updatedAt": "2026-01-16T09:01:01.740Z",
  "publishedAt": "2025-10-13T08:14:27.804Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9562"
}