{
  "id": 5324,
  "slug": "5324",
  "title": "Viral ASMR video factory: Automatically generate viral videos on autopilot.",
  "description": "## 🚀 Overview\n\nThis automation is a complete content creation engine for your social media. It endlessly designs, generates, and organizes unique and oddly satisfying ASMR videos, ensuring you always have fresh, viral-style content ready to post on platforms like TikTok, YouTube Shorts, and Instagram Reels.\n\n[Video Examples](https://drive.google.com/drive/folders/1S082VB9UhMRKW5p4AH31AYPPQ3CmfJD7?usp=sharing)\n\n![The Prospects of AI in 1600 x 1200 px 1.png](fileId:1585)\n\n## 😩 The Problem\n\nConsistently creating viral content is exhausting. You're constantly battling creative burnout, trying to come up with new ideas that are fresh and engaging. For every video, you have to brainstorm an idea, write a detailed prompt for an AI generator, wait for the video, and then manually track what you've already posted. This manual process is slow, repetitive, and a major roadblock to scaling your content output.\n\n## ✨ The Solution\n\nThis workflow acts as your personal, automated content creation employee. When you trigger it, the automation first checks a Google Sheet to see what videos it has already made. Then, a built-in \"Idea Agent\" cleverly brainstorms a brand new, unused concept (like a \"glass banana\" or \"glass pomegranate\").\n\nNext, it passes this idea to a \"Prompt Agent,\" which writes a perfectly detailed, sensory-rich script designed to produce a stunning, hyper-realistic video. The script is sent to an AI video generator, and the workflow waits patiently for it to finish. Once the video is ready, the automation saves the final video link neatly into your Google Sheet and cleans up the oldest entry, creating a self-sustaining content machine.\n\n## ⚙️ Simple Setup\n\nThis workflow is a pre-built blueprint, designed to be up and running in minutes!\n\n* **1. Upload:** Simply upload the provided JSON file into your n8n instance.\n* **2. Connect:** Connect your app credentials (e.g., your Google, OpenAI, and Fal accounts). The workflow will show you exactly where.\n* **3. Activate:** Turn the workflow on, and it's ready to go! Let your new automated employee get to work.\n\n---\n🌐 Explore more workflows\n❤️ Buy more workflows at: [adamcrafts](https://adamcrafts.cloudysoftwares.com)\n🦾 Custom workflows at: [adamcrafts@cloudysoftwares.com](mailto:adamcrafts@cloudysoftwares.com)\n[adamaicrafts@gmail.com](mailto:adamaicrafts@gmail.com)\n\n\n&gt; Build once, customize endlessly, and scale your video content like never before.",
  "featuredImage": "/data/workflows/5324/5324.webp",
  "author": {
    "id": 101,
    "slug": "adamcrafts",
    "name": "Abdellah Homrani",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 3212,
  "downloads": 321,
  "createdAt": "2025-06-25T21:18:03.073Z",
  "updatedAt": "2026-01-16T08:38:59.743Z",
  "publishedAt": "2025-06-25T21:18:03.073Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5324"
}