{
  "id": 6543,
  "slug": "6543",
  "title": "Vectorize Medical Procedures for Semantic Search with TUSS, Gemini & pgVector",
  "description": "## Description\n\nThis workflow vectorizes the TUSS (Terminologia Unificada da Saúde Suplementar) table by transforming medical procedures into vector embeddings ready for semantic search.\n\nIt automates the import of TUSS data, performs text preprocessing, and uses Google Gemini to generate vector embeddings. The resulting vectors can be stored in a vector database, such as PostgreSQL with pgvector, enabling efficient semantic queries across healthcare data.\n\n## What Problem Does This Solve?\nSearching for medical procedures using traditional keyword matching is often imprecise. This workflow enhances the search experience by enabling semantic similarity search, which can retrieve more relevant results based on the meaning of the query instead of exact word matches.\n\n## How It Works\n\n1. Import TUSS data: Load medical procedure entries from the TUSS table.\n2. Preprocess text: Clean and prepare the text for embedding.\n3. Generate embeddings: Use Google Gemini to convert each procedure into a semantic vector.\n4. Store vectors: Save the output in a PostgreSQL database with the pgvector extension.\n\n## Prerequisites\n\n1. An n8n instance (self-hosted).\n2. A PostgreSQL database with the pgvector extension enabled.\n3. Access to the Google Gemini API.\n4. TUSS data in a structured format (CSV, database, or API source).\n\n## Customization Tips\nYou can adapt the preprocessing logic to your own language or domain-specific terms.\n\nSwap Google Gemini with another embedding model, such as OpenAI or Cohere.\n\nAdjust the chunking logic to control the granularity of semantic representation.\n\n\n## Setup Instructions\nPrepare a source (database or CSV) with TUSS data. You need at least two fields:\n\n - CD_ITEM (Medical procedure code)\n\n - DS_ITEM (Medical procedure description)\n\nConfigure your Oracle or PostgreSQL database credentials in the Credentials section of n8n.\n\nMake sure your PostgreSQL database has pgVector installed.\n\nReplace the placeholder table and column names with your actual TUSS table.\n\nConnect your Google Gemini credentials (via OpenAI proxy or official connector).\n\nRun the workflow to vectorize all medical procedure descriptions.\n\n![image.png](fileId:1894)",
  "featuredImage": "/data/workflows/6543/6543.webp",
  "author": {
    "id": 101,
    "slug": "thiagovazzoler",
    "name": "Thiago Vazzoler Loureiro",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI RAG"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 454,
  "downloads": 45,
  "createdAt": "2025-07-27T23:18:57.203Z",
  "updatedAt": "2026-01-16T08:45:35.019Z",
  "publishedAt": "2025-07-27T23:18:57.203Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6543"
}