{
  "id": 7003,
  "slug": "7003",
  "title": "AI model GPT-4.1-mini and hosting on AWS S3",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n## Overview\nThis workflow is designed for inspiring teams or individuals who need to quickly and efficiently serve files, content, or documents via the web. It offers a straightforward approach while still being flexible and adaptable for different branding needs. \n\nThe HTML branding can be easily updated through an external LLM, making it possible to fully customize the look and feel without complex coding. You simply prompt the AI (using the JSON as a guide) to output your desired design.\n\n*This template makes use of a powerful community node, which brings in the benefits of shared knowledge and collective improvement.*\n\n## Setup Instructions\nCopy the JSON Preset into your AI model or use your own, along with your custom branding requirements. Ask the model for an HTML response, then paste the output into the HTML Preset. \n\nNext, connect the JSON inputs into the relevant locations from the structured output parser.\nOnce complete, the static HTML can be served via AWS or another web server using HTTPS, ensuring secure and reliable delivery.\n\n## Workflow Explanation\nThis AI Agent takes a simple user input and transforms it into dynamic HTML. The structured JSON output forces consistent formatting, while giving you the creative flexibility to adjust visuals on demand.\n\nSince the output is relatively consistent the workflow can produce repitive business documents with consistency and accuracy.\n\n## Requirements\n- LLM account access\n- AWS Account (S3) or HTTPs equivalent\n- Basic HTML/JSON knowledge\n- PDF.co Account",
  "featuredImage": "/data/workflows/7003/7003.webp",
  "author": {
    "id": 101,
    "slug": "chopgod",
    "name": "Thomas Heal",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 166,
  "downloads": 16,
  "createdAt": "2025-08-05T10:01:51.263Z",
  "updatedAt": "2026-01-16T08:48:07.473Z",
  "publishedAt": "2025-08-05T10:01:51.263Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7003"
}