{
  "id": 9855,
  "slug": "9855",
  "title": "Extract LinkedIn profile data & generate follow-ups with Vision AI and Google Forms",
  "description": "**The problem**\nEver attend a networking event and find yourself taking screenshots of people's LinkedIn? \nSounds counter-intuitive because you *are* connecting on LinkedIn. But you find it hard to keep track of everyone you've met. \nYou also don't want to miss diligently updating your CRM with details and insights. \n\n**The solution **\nThere's no need for yet another app. Continue taking screenshots. Just share them on a 2-field only Google Form: screenshot + your quick notes about the person. \n\nCreate a shortcut to the Google Form link on your phone homescreen. Voila! You have app-like access without the need for an app. \n\nOnce you submit with just these 2 pieces of info, AI parses the image AND crafts a follow-up message. Within minutes!\n\nJust open your spreadsheet to have all that information consolidated - automatically - for your review. \n\nPromote yourself from do-er to manager. \n\n**Who should use it?**\n\nAnyone really. If you find yourself meeting people but want to be more meticulous or efficient staying on top, use this. \n\n**How to set it up**\n\n- Time: ~10 minutes end-to-end.\n- Import the provided workflow JSON in n8n.\n- Connect credentials: Google Drive (read), Google Sheets (write), OpenAI.\n- Configure key information: Google Sheets and relevant columns\n- Configure Open AI models based on your cost/ efficiency requirements\n- Confirm column headers in your Sheet match the variables (or update the variables).\n- Test with one screenshot. \n\n**Pro-tip: Add that Google Form link as a shortcut on your phone's home screen. Get app-like convenience without downloading yet another app.**",
  "featuredImage": "/data/workflows/9855/9855.webp",
  "author": {
    "id": 101,
    "slug": "swathi",
    "name": "swathi",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 64,
  "downloads": 6,
  "createdAt": "2025-10-17T21:08:30.550Z",
  "updatedAt": "2026-01-16T09:02:19.207Z",
  "publishedAt": "2025-10-17T21:08:30.550Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9855"
}