{
  "id": 7735,
  "slug": "7735",
  "title": "Extract invoice data from Gmail with GPT-4o and send Slack notifications",
  "description": "## Who is this for?\n\nThis workflow is ideal for freelancers, accountants, and finance teams who receive invoices in Gmail and want to automate their tracking process with AI.\n\nIf your inbox fills up with invoice-related messages and you want to automate how they’re handled, this AI-powered solution is for you.\n\n## What does it solve?\n\n- Automatically detects and processes invoices from your Gmail inbox.\n- Uses OpenAI GPT-4o to extract payment amount, due date, subject line, and sender details.\n- Sends real-time Slack notifications so you never miss a payment.\n- Eliminates manual sorting of invoice-related emails.\n- Great for improving productivity and ensuring timely payment tracking.\n\n## How it works\n\n- Every hour, the workflow checks for unread emails in your Gmail inbox.\n- It sends the email content to OpenAI to determine if it's invoice-related email. \n- If it is:\n  - It extracts key fields like due date, amount due, subject, and sender.\n  - Then sends a Slack message with these details.\n- If it's not invoice-related, it simply ignores the email.\n\n## How to setup?\n\n1. **Connect these accounts:**\n   - Gmail using OAuth2\n   - Slack using OAuth2\n   - OpenAI (API Key under credentials)\n\n2. **Customize the Slack message (optional):**\n   - In the Slack node, you can modify the text to show more fields or personalize the formatting.\n\n3. **Adjust the schedule:**\n   - By default, the workflow runs hourly. You can change the frequency in the **Schedule Trigger** node.\n\n4. **Modify the AI logic (optional):**\n   - Update the AI Agent prompt to detect additional types like receipts or payment confirmations.\n\n\n### How to customize this workflow to your needs\n\n- **Notify a Slack channel instead of a user:** Just switch the recipient in the Slack node.\n- **Add labels in Gmail:** Add nodes to label or archive invoice emails once detected.\n- **Expand detection:** Modify the AI prompt to detect other financial or transactional emails.\n",
  "featuredImage": "/data/workflows/7735/7735.webp",
  "author": {
    "id": 101,
    "slug": "mattxchong",
    "name": "Matt Chong | n8n Creator",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 214,
  "downloads": 21,
  "createdAt": "2025-08-22T11:09:11.345Z",
  "updatedAt": "2026-01-16T08:52:05.754Z",
  "publishedAt": "2025-08-22T11:09:11.345Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7735"
}