{
  "id": 8922,
  "slug": "8922",
  "title": "Daily business ideas from IdeaBrowser to Telegram",
  "description": "Transform your daily business inspiration routine by automatically receiving curated business ideas from IdeaBrowser directly in Telegram. This workflow scrapes the \"Idea of the Day\" content and delivers it to your Telegram chat with beautiful formatting and smart content handling.\n\n## Description\nThis n8n workflow template automates the process of fetching and delivering daily business ideas from IdeaBrowser's \"Idea of the Day\" page to your Telegram chat. Perfect for entrepreneurs, business analysts, and innovation teams who want to stay updated with fresh business concepts without manual checking.\n\n## Key Features:\n\nAutomated Daily Delivery: Runs every day at 9:00 AM to fetch the latest business idea\n\nSmart Content Extraction: Uses advanced HTML parsing to extract title, description, pricing model, target market, and key features\n\nIntelligent Message Formatting: Creates beautifully formatted Telegram messages with emojis and structured content\n\nMessage Length Handling: Automatically truncates long content to fit Telegram's character limits\n\nManual Testing: Includes a manual trigger for testing before scheduling\n\nError Resilience: Built-in error handling to ensure reliable operation\n\nWhat Gets Delivered:\n\n🚀 Daily business idea title with date\n\n💡 Business description and concept\n\n💰 Revenue model and pricing strategy\n\n🎯 Target market analysis\n\n⚡ Key features and benefits\n\n## 🔗 Direct link to full details\n\n## Prerequisites\nBefore using this template, ensure you have:\n\nTelegram Bot: Create a bot using @BotFather on Telegram\n\nChat ID: Obtain your Telegram chat ID (use @userinfobot)\n\nn8n Instance: Running n8n installation (cloud or self-hosted)\n\n## Setup Instructions\nImport the Workflow: Copy the JSON below and import it into your n8n instance\n\nConfigure Telegram Credentials:\n\nAdd your Telegram bot token in n8n credentials\n\nUpdate the chat ID in both Telegram nodes\n\nTest the Workflow: Use the \"Manual Test Trigger\" to verify everything works\n\nActivate: Enable the workflow to start receiving daily ideas at 9:00 AM",
  "featuredImage": "/data/workflows/8922/8922.webp",
  "author": {
    "id": 101,
    "slug": "hgray",
    "name": "Femi Ad",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 640,
  "downloads": 64,
  "createdAt": "2025-09-25T11:04:41.432Z",
  "updatedAt": "2026-01-16T08:58:20.944Z",
  "publishedAt": "2025-09-25T11:04:41.432Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8922"
}