{
  "id": 4485,
  "slug": "4485",
  "title": "Telegram AI chatbot agent with InfraNodus GraphRAG knowledge base",
  "description": "## Using the knowledge graphs instead of RAG vector stores\n\nThis workflow creates a Telegram chatbot agent that has access to several knowledge bases at the same time (used as \"experts\"). \n\nThese knowledge bases are provided using the [InfraNodus GraphRAG](https://infranodus.com/use-case/ai-knowledge-graphs) using the knowledge graphs and providing high-quality responses without the need to set up complex RAG vector store workflows.\n\nThe advantages of using GraphRAG instead of the standard vector stores for knowledge are:\n\n- Easy and quick to set up and update (no complex data import workflows or vector stores needed)\n- A knowledge graph has a holistic view of your knowledge base and knows what it's about\n- Better retrieval of relations between the document chunks = higher quality responses\n\n![InfraNodus knowledge graph](https://support.noduslabs.com/hc/article_attachments/20266752795292)\n\n\n## How it works\nThis template uses the n8n AI agent node as an orchestrating agent that decides which tool (knowledge graph) to use based on the user's prompt. \n\nHere's a description step by step:\n\n- The user submits a question using the Telegram bot, which is then received in the n8n workflow via the Telegram trigger node.\n- The AI agent node checks a list of tools it has access to. Each tool has a description of the knowledge it has auto-generated by InfraNodus. \n- The AI agent decides which tool should be used to generate a response. It may reformulate user's query to be more suitable for the expert. \n- The query is then sent to the official InfraNodus Graph RAG Node or directly to the InfraNodus API via the HTTP node endpoint, which will query the graph that corresponds to that expert. \n- Each InfraNodus GraphRAG expert provides a rich response that takes the whole context into account and provides a response from each expert (graph) along with a list of relevant statements retrieved using a combination or RAG and GraphRAG. \n- The n8n AI Agent node integrates the responses received from the experts to produce the final answer.\n- The final answer is sent back to the Telegram bot who delivers it back to the private chat or a Telegram group.\n\n## How to use\n\nYou need an [InfraNodus GraphRAG API account and key](https://infranodus.com/use-case/ai-knowledge-graphs) to use this workflow. \n\n- Create an InfraNodus account\n- Get the API key at [https://infranodus.com/api-access](https://infranodus.com/api-access) and create a Bearer authorization key for the InfraNodus HTTP nodes.\n- Create a separate knowledge graph for each expert (using PDF / content import options) in InfraNodus\n- For each graph, go to the workflow, paste the name of the graph into the `body` `name` field.\n- Keep other settings intact or learn more about them at the [InfraNodus access points](https://support.noduslabs.com/hc/en-us/articles/13605983537692-InfraNodus-API-Access-Points) page. \n- Once you add one or more graphs as experts to your flow, add the LLM key to the OpenAI node\n- Create a Telegram bot (the instructions are in the workflow Post note) — it takes 30 seconds. Get its API key and create the Telegram credentials to use in the Telegram nodes in this workflow.\n\n## Requirements\n\n- An [InfraNodus](https://infranodus.com/use-case/ai-knowledge-graphs) account and API key\n- An OpenAI (or any other LLM) API key\n- A Telegram account\n\n\n## Customizing this workflow\n\nYou can use this same workflow with a standard AI chatbot via a URL that can also be embedded to any website. You can also use it with [ElevenLabs AI voice agent](https://support.noduslabs.com/hc/en-us/articles/20318967066396-How-to-Build-a-Text-Voice-AI-Agent-Chatbot-with-n8n-Elevenlabs-and-InfraNodus). There are many more customizations available. \n\nCheck out the **complete guide** at [https://support.noduslabs.com/hc/en-us/articles/20174217658396-Using-InfraNodus-Knowledge-Graphs-as-Experts-for-AI-Chatbot-Agents-in-n8n](https://support.noduslabs.com/hc/en-us/articles/20174217658396-Using-InfraNodus-Knowledge-Graphs-as-Experts-for-AI-Chatbot-Agents-in-n8n)\n\nAlso check out the **video tutorial** with a demo:\n\n[![Video tutorial](https://img.youtube.com/vi/kS0QTUvcH6E/sddefault.jpg)](https://www.youtube.com/watch?v=kS0QTUvcH6E)\n\n## Support\n\nIf you have any questions, contact us via the support portal at [https://support.noduslabs.com](https://support.noduslabs.com) or via our [Discord channel](https://discord.gg/v4BWAvTfB9).\n\nMore n8n workflows are available on our support portal: [n8n x InfraNodus AI automation workflows](https://support.noduslabs.com/hc/en-us/sections/18343587412252-AI-RAG-GraphRAG-and-LLM-Workflows).\n\n\n\n",
  "featuredImage": "/data/workflows/4485/4485.webp",
  "author": {
    "id": 101,
    "slug": "infranodus",
    "name": "InfraNodus",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 20786,
  "downloads": 2078,
  "createdAt": "2025-05-29T11:44:34.562Z",
  "updatedAt": "2026-01-16T08:34:36.921Z",
  "publishedAt": "2025-05-29T11:44:34.562Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4485"
}