{
  "id": 9398,
  "slug": "9398",
  "title": "Document-based RAG chat assistant with Google Drive, Supabase & OpenAI",
  "description": "### What is this?\nThis RAG workflow allows you to build a smart chat assistant that can answer user questions based on any collection of documents you provide. It automatically imports and processes files from Google Drive, stores their content in a searchable vector database, and retrieves the most relevant information to generate accurate, context-driven responses. The workflow manages chat sessions and keeps the document database current, making it adaptable for use cases like customer support, internal knowledge bases, or HR assistant etc.\n\n## How it works\n### 1. Chat RAG Agent\n- Uses OpenAI for responses, referencing only specific data from the vector store (data that is uploaded on google drive folder).\n- Maintains chat history in Postgres using a session key from the chat input.\n\n### 2. Data Pipeline (File Ingestion)\n- Monitors Google Drive for new/updated files and automatically updates them in vector store\n- Downloads, extracts, and processes file content (PDFs, Google Docs).\n- Generates embeddings and stores them in the Supabase vector store for retrieval.\n\n### 3. Vector Store Cleanup\n- Scheduled and manual routines to remove duplicate or outdated entries from the Supabase vector store.\n- Ensures only the latest and unique documents are available for retrieval.\n\n### 4. File Management\n- Handles folder and file creation, upload, and metadata assignment in Google Drive.\n- Ensures files are organized and linked with their corresponding vector store entries.\n\n## Getting Started\n- Create and connect all relevant credentials\n  - Google Drive\n  - Postgres\n  - Supabase\n  - OpenAI\n- Run the table creation nodes first to set up your database tables in Postgres\n- Upload your documents through Google Drive (or swap out for a different file storage solution)\n- The agent will process them automatically (chunking text, storing tabular data in Postgres)\n- Start asking questions that leverage the agent's multiple reasoning approaches\n\n## Customization (optional)\nThis template provides a solid foundation that you can extend by:\n- Tuning the system prompt for your specific use case\n- Adding document metadata like summaries\n- Implementing more advanced RAG techniques\n- Optimizing for larger knowledge bases\n- Note, if you're using a different nodes eg. file storage, vector store etc the integration may vary a little\n\n\n## Prerequisites\n- Google account (google drive)\n- Supabase account\n- OpenAI APIs\n- Postgres account\n",
  "featuredImage": "/data/workflows/9398/9398.webp",
  "author": {
    "id": 101,
    "slug": "jainik",
    "name": "Jainik Sheth",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 367,
  "downloads": 36,
  "createdAt": "2025-10-09T06:56:08.915Z",
  "updatedAt": "2026-01-16T09:00:21.157Z",
  "publishedAt": "2025-10-09T06:56:08.915Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9398"
}