{
  "id": 2658,
  "slug": "2658",
  "title": "Api schema extractor",
  "description": "This workflow automates the process of discovering and extracting APIs from various services, followed by generating custom schemas. It works in three distinct stages: research, extraction, and schema generation, with each stage tracking progress in a Google Sheet.\n\n🙏 [Jim Le](https://n8n.io/creators/jimleuk/) deserves major kudos for helping to build this sophisticated three-stage workflow that cleverly automates API documentation processing using a smart combination of web scraping, vector search, and LLM technologies.\n\n## How it works\n### Stage 1 - Research:\n- Fetches pending services from a Google Sheet\n- Uses Google search to find API documentation\n- Employs Apify for web scraping to filter relevant pages\n- Stores webpage contents and metadata in Qdrant (vector database)\n- Updates progress status in Google Sheet (pending, ok, or error)\n\n### Stage 2 - Extraction:\n- Processes services that completed research successfully\n- Queries vector store to identify products and offerings\n- Further queries for relevant API documentation\n- Uses Gemini (LLM) to extract API operations\n- Records extracted operations in Google Sheet\n- Updates progress status (pending, ok, or error)\n\n### Stage 3 - Generation:\n- Takes services with successful extraction\n- Retrieves all API operations from the database\n- Combines and groups operations into a custom schema\n- Uploads final schema to Google Drive\n- Updates final status in sheet with file location\n\n## Ideal for:\n- Development teams needing to catalog multiple APIs\n- API documentation initiatives\n- Creating standardized API schema collections\n- Automating API discovery and documentation\n\n## Accounts required:\n- Google account (for Sheets and Drive access)\n- Apify account (for web scraping)\n- Qdrant database\n- Gemini API access\n\n## Set up instructions:\n- Prepare your Google Sheets document with the services information. [Here's an example of a Google Sheet](https://docs.google.com/spreadsheets/d/1UJtksHQV0NRNhsDdVdkdIoNssuvoTWso/edit?usp=sharing&ouid=108234606433343029350&rtpof=true&sd=true) – you can copy it and change or remove the values under the columns. Also, make sure to update Google Sheets nodes with the correct Google Sheet ID. \n- Configure Google Sheets OAuth2 credentials, required third-party services (Apify, Qdrant) and Gemini.\n- Ensure proper permissions for Google Drive access.\n",
  "featuredImage": "/data/workflows/2658/2658.webp",
  "author": {
    "id": 101,
    "slug": "polina-n8n",
    "name": "Polina Medvedieva",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 28472,
  "downloads": 2847,
  "createdAt": "2024-12-19T12:39:56.130Z",
  "updatedAt": "2026-01-16T08:25:53.247Z",
  "publishedAt": "2024-12-19T12:39:56.130Z",
  "nodes": 88,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2658"
}