{
  "id": 8848,
  "slug": "8848",
  "title": "Auto-generate SEO product titles & descriptions with GPT-4o-mini for Printify",
  "description": "### **N8N Workflow: Printify Automation - Update Title and Description - AlexK1919**\n\nThis workflow automates the process of getting products from Printify, generating new titles and descriptions using OpenAI, and updating those products.\n\n#### **How it Works**\n\nThis workflow automatically retrieves a list of products from a Printify store, processes them to generate new titles and descriptions based on brand guidelines and custom instructions, and then updates the products on Printify with the new information. It also interacts with Google Sheets to track the status of the products being processed. The workflow can be triggered both manually or by an update in a Google Sheet.\n\n#### **Use Cases**\n\n- **E-commerce Automation**: Automating content updates for a Printify store.\n\n- **Marketing & SEO**: Generating SEO-friendly or seasonal content for products using AI.\n\n- **Product Management**: Batch-updating product titles and descriptions without manual effort.\n\n#### **Setup Instructions**\n\n1. **Printify API Credentials**: Set up httpHeaderAuth credentials for Printify to allow the workflow to get and update products.\n\n2. **OpenAI API Credentials**: Provide an API key for OpenAI in the openAiApi credentials.\n\n3. **Google Sheets Credentials**: The workflow requires two separate Google Sheets credentials: one for the trigger (googleSheetsTriggerOAuth2Api) and another for appending/updating data (googleSheetsOAuth2Api).\n\n4. **Google Sheets Setup**: You need a Google Sheet to store product information and track the status of the updates. The workflow is linked to a specific spreadsheet.\n\n5. **Brand Guidelines**: The **Brand Guidelines + Custom Instructions** node must be updated with your specific brand details and any custom instructions for the AI.\n\n#### **Workflow Logic**\n\n1. **Trigger**: The workflow can be triggered manually or by an update in a Google Sheet when the upload column is changed to \"yes\".\n\n2. **Get Product Info**: It fetches the shop ID and then a list of all products from Printify.\n\n3. **Process Products**: The product data is split, and the workflow loops through each product.\n\n4. **AI Content Generation**: For each product, the **Generate Title and Desc** node uses OpenAI to create a new title and description based on the original content, brand guidelines, and custom instructions.\n\n5. **Google Sheets Update**: The workflow appends the product information and a \"Product Processing\" status to a Google Sheet. It then updates the row with the newly generated title and description, and changes the status to \"Option added\".\n\n6. **Printify Update**: The **Printify - Update Product** node sends a PUT request to the Printify API to apply the new title and description to the product.\n\n#### **Node Descriptions**\n\n| Node Name | Description |\n|-----------|-------------|\n| **When clicking 'Test workflow'** | A manual trigger for testing the workflow. |\n| **Google Sheets Trigger** | An automated trigger that starts the workflow when the upload column in the Google Sheet is updated. |\n| **Printify - Get Shops** | Fetches the list of shops associated with the Printify account. |\n| **Printify - Get Products** | Retrieves all products from the specified Printify shop. |\n| **Brand Guidelines + Custom Instructions** | A Set node to store brand guidelines and custom instructions for the AI. |\n| **Generate Title and Desc** | An OpenAI node that generates a new title and description based on the provided inputs. |\n| **GS - Add Product Option** | Appends a new row to a Google Sheet to track the processing status of a product. |\n| **Update Product Option** | Updates an existing row in the Google Sheet with the new product information and status. |\n| **Printify - Update Product** | A PUT request to the Printify API to update a product with new information. |\n\n#### **Customization Tips**\n\n- You can swap out the Printify API calls with similar services like Printful or Vistaprint.\n\n- Modify the Brand Guidelines + Custom Instructions node to change the brand name, tone, or specific instructions for the AI.\n\n- Change the number of options the workflow should generate by modifying the Number of Options node.\n\n- You can change the OpenAI model used in the **Generate Title and Desc** node, for example, from gpt-4o-mini to another model.\n\n#### **Suggested Sticky Notes for Workflow**\n\n- \"Update your Brand Guidelines before running this workflow. You can also add custom instructions for the AI node.\"\n\n- \"You can swap out the API calls to similar services like Printful, Vistaprint, etc.\"\n\n- \"Set the Number of Options you'd like for the Title and Description\"\n\n#### **Required Files**\n\n- 1V1gcK6vyczRqdZC_Printify_Automation_-_Update_Title_and_Description_-_AlexK1919.json: The main n8n workflow export for this automation.\n\n- The Google Sheets template for this workflow.\n\n#### **Testing Tips**\n\n- Run the workflow with the manual trigger to see the flow from start to finish.\n\n- Change the upload column in the Google Sheet to \"yes\" to test the automated trigger.\n\n- Verify that the new titles and descriptions are correctly updated on Printify.\n\n#### **Suggested Tags & Categories**\n\n- Printify\n\n- OpenAI",
  "featuredImage": "/data/workflows/8848/8848.webp",
  "author": {
    "id": 101,
    "slug": "amitswba",
    "name": "Amit Mehta",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 481,
  "downloads": 48,
  "createdAt": "2025-09-23T06:04:44.536Z",
  "updatedAt": "2026-01-16T08:57:56.935Z",
  "publishedAt": "2025-09-23T06:04:44.536Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8848"
}