{
  "id": 10065,
  "slug": "10065",
  "title": "Auto-reply & create Linear tickets from Gmail with GPT-5, gotoHuman & human review",
  "description": "![wflowscreenshot.jpg](fileId:3046)\nThis workflow automatically classifies every new email from your linked mailbox, drafts a personalized reply, and creates Linear tickets for bugs or feature requests. It uses a human-in-the-loop with gotoHuman and continuously improves itself by learning from approved examples.\n\n## How it works\n1. The workflow triggers on every new email from your linked mailbox.\n2. Self-learning Email Classifier: an AI model categorizes the email into defined categories (e.g., Bug Report, Feature Request, Sales Opportunity, etc.). It fetches previously approved classification examples from gotoHuman to refine decisions.\n3. Self-learning Email Writer: the AI drafts a reply to the email. It learns over time by using previously approved replies from gotoHuman, with per-classification context to tailor tone and style (e.g., different style for sales vs. bug reports).\n4. Human Review in gotoHuman: review the classification and the drafted reply. Drafts can be edited or retried. Approved values are used to train the self-learning agents.\n5. Send approved Reply: the approved response is sent as a reply to the email thread.\n6. Create ticket: if the classification is Bug or Feature Request, a ticket is created by another AI agent in Linear.\n\n###### Human Review in gotoHuman:\n![gthreviewscreen.jpg](fileId:3047)\n\n## How to set up\n\n1. **Most importantly, install the gotoHuman node before importing this template!** (Just add the node to a blank canvas before importing)\n2. Set up credentials for gotoHuman, OpenAI, your email provider (e.g. Gmail), and Linear.\n3. In gotoHuman, select and create the pre-built review template \"Support email agent\" or import the ID: `6fzuCJlFYJtlu9mGYcVT`.\n4. Select this template in the gotoHuman node.\n5. In the \"gotoHuman: Fetch approved examples\" http nodes you need to add your `formId`. It is the ID of the review template that you just created/imported in gotoHuman.\n\n## Requirements\n\n- gotoHuman (human supervision, memory for self-learning)\n- OpenAI (classification, drafting)\n- Gmail or your preferred email provider (for email trigger+replies)\n- Linear (ticketing)\n\n## How to customize\n\n- Expand or refine the categories used by the classifier. Update the prompt to reflect your own taxonomy.\n- Filter fetched training data from gotoHuman by reviewer so the writer adapts to their personalized tone and preferences.\n- Add more context to the AI email writer (calendar events, FAQs, product docs) to improve reply quality.",
  "featuredImage": "/data/workflows/10065/10065.webp",
  "author": {
    "id": 101,
    "slug": "gotohuman",
    "name": "gotoHuman",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 343,
  "downloads": 34,
  "createdAt": "2025-10-22T21:30:44.795Z",
  "updatedAt": "2026-01-16T09:03:11.872Z",
  "publishedAt": "2025-10-22T21:30:44.795Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10065"
}