{
  "id": 4709,
  "slug": "4709",
  "title": "Daily news digest: summarize RSS feeds with OpenAI and deliver to WhatsApp",
  "description": "This n8n workflow collects and summarizes news from multiple RSS feeds, using OpenAI to generate a concise summary that can be sent to WhatsApp or other destinations. Perfect for automating your daily news digest.\n\n🔁 Workflow Breakdown:\nSchedule Trigger\nStart the workflow on your desired schedule (daily, hourly, etc.).\n\n🟨 Note: Set the trigger however you wish.\n\nRSS Feeds (My RSS 01–04)\nFetches articles from four different RSS sources.\n\n🟨 Note: You can add as many RSS feeds as you want.\n\nEdit Fields (Edit Fields1–3)\nNormalizes RSS fields (title, link, etc.) to ensure consistency across different sources.\n\nMerge (append mode)\nCombines the RSS items into a single unified list.\n\nFilter\nOptionally filter articles by keywords, date, or categories.\n\nLimit\nLimits the analysis to the 10 most recent articles.\n\n🟨 Note: This keeps the result concise and avoids overloading the summary.\n\nAggregate\nPrepares the selected news for summarization by combining them into a single content block.\n\nOpenAI (Message Assistant)\nSummarizes the aggregated news items in a clean and readable format using AI.\n\nSend Summary to WhatsApp\nSends the AI-generated summary to a WhatsApp endpoint via webhook (yoururlapi.com). You can replace this with an email service, Google Drive, or any other destination.\n\n🟨 Note: You can send it to your WhatsApp API, email, drive, etc.\n\nNo Operation (End)\nFinal placeholder to safely close the workflow. You may expand from here if needed.",
  "featuredImage": "/data/workflows/4709/4709.webp",
  "author": {
    "id": 101,
    "slug": "daniellegomes",
    "name": "Danielle Gomes",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 22284,
  "downloads": 2228,
  "createdAt": "2025-06-05T22:10:34.527Z",
  "updatedAt": "2026-01-16T08:35:47.258Z",
  "publishedAt": "2025-06-05T22:10:34.527Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4709"
}