{
  "id": 8571,
  "slug": "8571",
  "title": "Transform your selfies into 3D figurines with Nano Banana AI",
  "description": "# Transform Your Selfies into 3D Figurines with Nano Banana AI\n\n## Overview\nThis workflow utilizes the Defapi API with Google's **Nano Banana AI** model to transform your selfies into stunning **3D figurines**, **action figures**, and collectible merchandise designs. Simply upload a selfie photo, provide a creative prompt describing your desired **3D figurine** or **action figure** design, and watch as AI generates professional-quality product visualizations.\n\n**Input:** Your selfie photo + creative prompt + API key  \n**Output:** AI-generated **3D figurine** and **action figure** designs perfect for collectibles, merchandise, and product visualization\n\nUsers can interact through a simple form, providing a text prompt describing the desired creative scene, a product image URL, and their API key. The system automatically submits the request to the Defapi API, monitors the generation status in real time, and retrieves the final creative image output. This solution is ideal for marketers, product designers, e-commerce businesses, and content creators who want to quickly generate compelling product advertisements and creative visuals with minimal setup. Perfect for creating **3D figurines** and collectible merchandise designs.\n\n\n## Prerequisites\n- A Defapi account and API key: Sign up at [Defapi.org](https://defapi.org/model/google/nano-banana) to obtain your API key.\n- An active n8n instance (cloud or self-hosted) with HTTP Request and form submission capabilities.\n- Basic knowledge of AI prompts for product creative generation to achieve optimal results, especially for **3D figurines** and collectible designs.\n  - Example prompt: Create a 1/7 scale commercialized **3D figurine** of the characters in the picture, in a realistic style, in a real environment. The **figurine** is placed on a computer desk. The **figurine** has a round transparent acrylic base, with no text on the base. The content on the computer screen is the Zbrush modeling process of this **figurine**. Next to the computer screen is a packaging box with rounded corner design and a transparent front window, the figure inside is clearly visible.\n\n- A product image for creative generation.\n- **Important Note**: Avoid using dark photos as input, as the generated **3D figurine** will also appear dark.\n\n## Setup Instructions\n1.  **Obtain API Key**: Register at Defapi.org and generate your API key. Store it securely—do not share it publicly.\n2.  **Configure the Form**: In the \"Upload Image\" form trigger node, ensure the following fields are set up: Image (file upload), API Key (text field), and Prompt (text field).\n3.  **Test the Workflow**:\n    - Click \"Execute Workflow\" in n8n.\n    - Access the generated form URL, upload your product image, enter your prompt, and provide your API key.\n    - The workflow will process the image through the \"Convert to JSON\" node, then send the request to the Defapi API.\n    - The system will wait 10 seconds and then poll the API status until the image generation is complete.\n4.  **Handle Outputs**: The final \"Format and Display Image Results\" node formats and displays the generated creative image URL for download or embedding.\n\n## Workflow Structure\nThe workflow consists of the following nodes:\n1. **Upload Image** (Form Trigger) - Collects user input: image file, API key, and prompt\n2. **Convert to JSON** (Code Node) - Converts uploaded image to base64 and formats data\n3. **Send Image Generation Request to Defapi.org API** (HTTP Request) - Submits generation request\n4. **Wait for Image Processing Completion** (Wait Node) - Waits 10 seconds before checking status\n5. **Obtain the generated status** (HTTP Request) - Polls API for completion status\n6. **Check if Image Generation is Complete** (IF Node) - Checks if status equals 'success'\n7. **Format and Display Image Results** (Set Node) - Formats final image URL output\n\n## Technical Details\n- **API Endpoint**: `https://api.defapi.org/api/image/gen` (POST request)\n- **Model Used**: `google/nano-banana` (**Nano Banana AI**)\n- **Status Check Endpoint**: `https://api.defapi.org/api/task/query` (GET request)\n- **Wait Time**: 10 seconds between status checks\n- **Image Processing**: Uploaded images are converted to base64 format for API submission\n- **Authentication**: Bearer token authentication using the provided API key\n- **Specialized For**: **3D figurines**, collectible merchandise, and product visualization\n\n## Customization Tips\n- **Enhance Prompts**: Include specifics like scene setting, lighting, style (e.g., realistic, artistic, cinematic), product placement, and visual elements to improve AI creative image quality. For **3D figurines**, specify scale, materials, and display context.\n- **Form Fields**: The form accepts image files (image/*), API key (text), and prompt (text) as required fields.\n- **Error Handling**: The workflow includes conditional logic to check for successful completion before displaying results.\n- **Best Practices for **Nano Banana AI****: Use detailed descriptions for **figurine** designs, specify lighting conditions, and include environmental context for realistic **3D figurine** generation.\n- **Photo Quality Tips**: Use well-lit photos for best results. Avoid dark images as they will make the generated **3D figurine** appear dark too.\n",
  "featuredImage": "/data/workflows/8571/8571.webp",
  "author": {
    "id": 101,
    "slug": "panyanyany",
    "name": "panyanyany",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 713,
  "downloads": 71,
  "createdAt": "2025-09-14T07:24:15.430Z",
  "updatedAt": "2026-01-16T08:56:34.212Z",
  "publishedAt": "2025-09-14T07:24:15.430Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8571"
}