{
  "id": 7845,
  "slug": "7845",
  "title": "🍎 Update grocery lists in Asana via Telegram voice & text using GPT-4o mini",
  "description": "This n8n workflow demonstrates how to use AI to update your grocery list in Asana via Telegram chat or voice. \n\n## Use cases\n- Update grocery list details in Asana eg. check or uncheck the items, update expiry dates, update quantities etc.\n\n## How it works\n- Instruct telegram bot (via chat or voice) to update a grocery item using natural language. For example, \"we just bought 10 cartons of milk that expires in 6 months\".\n- If via text, just the text message will be sent to the Grocery Agent.\n- If via voice, voice file will be downloaded then transcribed into text using OpenAI.\n- Once Grocery agent receives the text, it will search the item in your grocery list in Asana. It will then check the item since it's bought, and update the quantity and expiry date accordingly.\n- Once task is done, it will respond with the changes it made and insert a hyperlink to Asana if you want to see it.\n\n## How to set up\n- Set up Telegram bot via Botfather. See setup instructions [here](https://core.telegram.org/bots/tutorial) \n- Setup OpenAI API for transcription services (Credits required) [here](https://openai.com/index/openai-api/)\n- Set up Openrouter account. See details [here](https://openrouter.ai/docs/api-reference/authentication)\n- Set up Asana API using the account where you have your grocery list set in. See details [here](https://developers.asana.com/docs/api-explorer)\n\n## Customization Options\n- You can have other custom fields you use to track other than expiry dates or quantity. For example, food type, date purchased etc. \n\n## Requirements\n- Asana account where you manage your grocery list\n- Telegram bot\n- Open AI account\n- Open Router account",
  "featuredImage": "/data/workflows/7845/7845.webp",
  "author": {
    "id": 101,
    "slug": "zawanah",
    "name": "Zawanah",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 293,
  "downloads": 29,
  "createdAt": "2025-08-25T14:45:33.723Z",
  "updatedAt": "2026-01-16T08:52:37.542Z",
  "publishedAt": "2025-08-25T14:45:33.723Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7845"
}