{
  "id": 10825,
  "slug": "10825",
  "title": "Automate task deadline reminders with Google Sheets and Gmail (Today/3-Day/7-Day)",
  "description": "## Task Deadline Reminder Workflow (Today / 3-Day / 7-Day)\nTask deadline management manually is inefficient and leads to missed deadlines—especially when teams rely on spreadsheets and individual reminders.  \nThis workflow automates the entire follow-up process by reading a centralized task sheet in Google Sheets every morning, checking the deadline for each task, and sending automatic email notifications to the responsible person based on urgency.  \nTasks due **today**, **within three days**, or **within one week** are identified and routed to customized Gmail notifications, ensuring that every team member is aware of upcoming deadlines without manual checking.\n\n## Who’s it for\nThis workflow is ideal for teams and organizations that manage multiple tasks across departments and need a reliable way to stay on top of deadlines. It is especially useful for:\n\n- Project managers coordinating many deadlines  \n- Back-office teams monitoring routine operational tasks  \n- Organizations with distributed members  \n- Anyone who relies on spreadsheets but needs automated follow-up  \n\nBy integrating Google Sheets, n8n, and Gmail, you gain a proactive notification system that keeps everyone aligned and reduces the risk of forgotten tasks.\n\n## How it works\n### 1. Daily trigger  \nThe workflow runs every morning at 9:00 using a Schedule Trigger.\n\n### 2. Load task list from Google Sheets  \nThe workflow retrieves all rows from the designated spreadsheet, including task name, deadline, responsible person, and email address.\n\n### 3. Process tasks individually  \nA loop node evaluates each task one by one.\n\n### 4. Evaluate deadline conditions  \n- **Due today:** Deadline matches today’s date  \n- **Due within 3 days:** Deadline falls between today and three days ahead  \n- **Due within 7 days:** Deadline falls between today and one week ahead  \n\n### 5. Send notifications  \nDepending on urgency:  \n- “本日が締め切りです” for tasks due today  \n- “タスク期限が三日前となりました” for tasks due within 3 days  \n- “タスクの期限が一週間以内です” for tasks due within 7 days  \n\nEach email is automatically sent to the responsible person based on the “メールアドレス” field in the sheet.\n\n### 6. Complete processing  \nThe loop continues until all task rows have been checked.\n\n## How to set up\n- Import the workflow into your n8n instance  \n- Authenticate Google Sheets and select the task spreadsheet  \n- Authenticate Gmail as the sender account  \n- Confirm required columns: タスク, 期限, 担当, メールアドレス  \n- Adjust time, message text, or conditions based on your internal rules  \n\n## Requirements\n- Active n8n instance  \n- Google Sheets access with permission to read the task list  \n- Gmail OAuth connection for email sending  \n- Spreadsheet with at least: task name, deadline, responsible person, email address  \n\n## How to customize\nYou can expand and refine this workflow to match your company’s processes:\n\n- Add Slack, Chatwork, or LINE notifications  \n- Add overdue task detection  \n- Add task priority sorting (High / Medium / Low)  \n- Log notifications back into the spreadsheet  \n- Send daily summary reports to managers  \n\nThis workflow provides a flexible foundation for building a complete automated task governance system.\n",
  "featuredImage": "/data/workflows/10825/10825.webp",
  "author": {
    "id": 101,
    "slug": "yukihirota",
    "name": "Yuki Hirota",
    "avatar": ""
  },
  "categories": [
    "Project Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 178,
  "downloads": 17,
  "createdAt": "2025-11-14T12:13:54.395Z",
  "updatedAt": "2026-01-16T09:06:25.951Z",
  "publishedAt": "2025-11-14T12:13:54.395Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10825"
}