{
  "id": 3612,
  "slug": "3612",
  "title": "Automate testing and collect responses via Telegram in Postgres (module \"Quiz\")",
  "description": "### Who is this for?  \nThis template is ideal for educators, HR professionals, and anyone looking to automate testing and collect responses through Telegram, while storing results in a Postgres database.\n\n### What problem is this workflow solving?  \nManually organizing and managing tests can be time-consuming and prone to error. This workflow automates the test distribution, response collection, and scoring process, ensuring a seamless and efficient testing experience.\n\n### What this workflow does  \n- Adds test content, including questions and answers, to a Postgres database  \n- Sends a Telegram bot link to test participants  \n- Automatically delivers the test via the Telegram bot  \n- Collects and stores responses  \n- Displays the participant's ranking at the end of the test  \n\n### Setup  \n1. **Create tables in Postgres**  \n   - Replace `\"n8n\"` in the provided SQL script with the name of your actual schema  \n   - Run the script in your database to create the required tables  \n\n2. **Add credentials**  \n   - Set up and connect your **Telegram** credentials  \n   - Set up and connect your **Postgres** credentials  \n\n### How to customize this workflow to your needs  \n- Modify the test content directly in the Postgres database  \n- Customize the Telegram bot messages to match your tone and branding.\n- Adjust scoring logic if needed to reflect different evaluation methods.",
  "featuredImage": "/data/workflows/3612/3612.webp",
  "author": {
    "id": 101,
    "slug": "boanse",
    "name": "Andrew",
    "avatar": ""
  },
  "categories": [
    "HR"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 524,
  "downloads": 52,
  "createdAt": "2025-04-19T16:48:32.300Z",
  "updatedAt": "2026-01-16T08:30:37.490Z",
  "publishedAt": "2025-04-19T16:48:32.300Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3612"
}