{
  "id": 6257,
  "slug": "6257",
  "title": "Automate LinkedIn lead generation and connection requests with Browserflow",
  "description": "# **Auto find & invite LinkedIn Leads**\nThis n8n template automates LinkedIn lead generation by scraping profiles, filtering out existing connections, and sending connection requests — all in a controlled, looped workflow. Ideal for outreach campaigns, recruitment, or lead gen efforts.\n![Screenshot 20250724 at 18.09.50.png](fileId:1859)\n\n## ⚠️ **Disclaimer – Community Node Notice**\nThis template uses a verified community node available inside the n8n cloud environment.\nTo use it, go to \"Nodes\" → search for:\n\n*Browserflow for Linkedin*\n\n…and click Install.\nIt’s officially verified and accessible directly from n8n cloud.\n\nIn case you wish to run this template locally, you need to go to the settings, click community nodes and search for *n8n-nodes-browserflow*. Then after installing you can start using the actions in this node.\n\n## **🛠️ How to Use**\n\n###### Trigger: Manual Start\nInitiates the workflow manually via the “Test workflow” button, giving you full control.\n\n###### Scrape LinkedIn Profiles\nUses the Browserflow automation to extract profile links from a LinkedIn search or keyword query.\n\n###### Split Out Results\nConverts the list of profiles into individual items for single-profile processing.\n\n###### Loop Through Each Profile\nEnsures each LinkedIn profile is handled one at a time, avoiding simultaneous actions.\n\n###### Check Existing Connection\nVerifies if you’re already connected with the lead on LinkedIn.\n\n###### Conditional Logic\n\n✅ Already Connected → Skip to next profile\n\n❌ Not Connected → Continue to next step\n\n###### Send Connection Invite\nSends a LinkedIn connection request, optionally with a personalized message.\n\n## 📦 Requirements\n- n8n (cloud or self-hosted)\n\n- Installed community node: Browserflow for Linkedin\n\n- LinkedIn account\n\n- Valid Browserflow acount (you can set up a free 7-day trial at [https://browserflow.io](https://browserflow.io/n8n))\n\n## **⚙️ Setup Instructions**\n###### Install the Browserflow Community Node\nSearch “Browserflow for Linkedin” &gt; Install.\n\n###### **Get your API key**\nGet your API key at [https://browserflow.io](https://browserflow.io/n8n)\n\n###### **Setup your Browserflow account**\nAfter registering, setup your Browserflow and connect with Linkedin using the wizard at [https://browserflow.io](https://browserflow.io/n8n)\n\n###### **Connect with Browserflow by making a credential**\nClick on the Browserflow actions to setup a connection with Browserflow by adding your API key to a credential.\n\n## **🧩 Customization Tips**\nTargeting: Adjust the Browserflow actions to scrape specific roles, industries, or locations.\n\nMessaging: You can add a message to the connection invite but remind that LinkedIn limits the amount of messages that can be send each month. Use variables in the message for personalization (e.g., {firstName}).\n\nTrigger: Replace manual trigger with a cron node for scheduled outreach.\n\nIntegration: Combine with CRM tools (e.g., HubSpot, Notion, Airtable) for syncing leads or integrate with AI Agents. \n\n",
  "featuredImage": "/data/workflows/6257/6257.webp",
  "author": {
    "id": 101,
    "slug": "browserflow",
    "name": "Kees Bosch - Browserflow",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1228,
  "downloads": 122,
  "createdAt": "2025-07-22T06:55:54.825Z",
  "updatedAt": "2026-01-16T08:44:05.360Z",
  "publishedAt": "2025-07-22T06:55:54.825Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6257"
}