{
  "id": 7913,
  "slug": "7913",
  "title": "Manage tasks and deadlines via WhatsApp using GPT-4 and Google Sheets",
  "description": "![Screenshot 20250826 184939.png](fileId:2203)\n## Who’s it for  \nThis template is for anyone who wants to manage tasks, deadlines, and updates directly from WhatsApp. It’s especially useful for teams, freelancers, and small businesses that track their work in Google Sheets and want quick AI-powered assistance without opening spreadsheets.  \n\n## How it works / What it does  \nThis workflow turns WhatsApp into your personal task manager. When a user sends a message, the AI agent (powered by OpenAI) interprets the request, retrieves or updates task information from Google Sheets, and sends a concise response back via WhatsApp. The workflow can highlight overdue tasks, upcoming deadlines, and provide actionable suggestions.  \n\n## How to set up  \n1. Connect your **WhatsApp API account** in n8n.  \n2. Add your **OpenAI credentials**.  \n3. Link your **Google Sheets document** where tasks are stored.  \n4. Deploy the workflow and test by sending a message to your WhatsApp number.  \n\n## Requirements  \n- WhatsApp Business API account connected to n8n  \n- OpenAI account for AI responses  \n- Google Sheets with task data  \n\n## How to customize the workflow  \n- Adjust the AI prompt to change tone or instructions.  \n- Modify the Google Sheets fields (Task, Status, Due Date, Notes) to match your structure.  \n- Add conditions or filters to customize which tasks get highlighted. ",
  "featuredImage": "/data/workflows/7913/7913.webp",
  "author": {
    "id": 101,
    "slug": "yar",
    "name": "Yar Malik (Asfandyar)",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 543,
  "downloads": 54,
  "createdAt": "2025-08-26T15:50:07.195Z",
  "updatedAt": "2026-01-16T08:52:59.963Z",
  "publishedAt": "2025-08-26T15:50:07.195Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7913"
}