{
  "id": 12184,
  "slug": "12184",
  "title": "Multi-agent LinkedIn content creation with GPT-4o, Google Sheets, and human review",
  "description": "**Description:**\nThis is a Production-Grade Multi-Agent Content Engine designed for creators who prioritize technical authority over generic AI output.\n\nUnlike standard \"one-shot\" prompts, this system uses a Chain-of-Thought (CoT) architecture to separate logical blueprinting from creative writing. It features a Persistent Memory loop via Google Sheets to ensure topic variety and a dedicated Compliance Editor to enforce strict branding rules (e.g., \"Sentence Case\" and spaced hyphens).\n\nBuilt with enterprise resiliency in mind, it includes Global Error Handling and a Human-in-the-Loop Gmail approval gate with a 48-hour auto-timeout.\n\nI built this to solve the 'Technical Content' bottleneck. It ensures that my social presence reflects the same high-quality engineering standards I apply to my client's n8n workflows.\n\n**Key features:**\n- Persistent Topic Memory: Automatically scans your Google Sheets history to prevent repeating technical topics.\n\n- Multi-Agent Pipeline: Specialized agents for Topic Selection, Structural Architecture, Copywriting, and Brand Compliance.\n\n- Style Enforcement: A final \"Editor\" agent that strips AI fluff and ensures a professional, human-sounding tone.\n\n- Resilient Design: Features a global Error Trigger for instant failure notifications and an Approval Timeout to maintain system resources.\n\n- Human-in-the-Loop: Sends a clean draft to Gmail for manual image pairing and final review before posting.\n\n**How to setup**\n- Google Sheets: Prepare a sheet with columns for Topic, Status, and Difficulty.\n\n- Credentials: Connect your OpenAI (or Gemini) and Gmail accounts.\n\n- IDs: Replace the placeholder Sheet ID and Recipient Email address in the nodes.\n\n- Error Handling: Point the Error Trigger notification to your preferred email or Slack channel.",
  "featuredImage": "/data/workflows/12184/12184.webp",
  "author": {
    "id": 101,
    "slug": "ailinwerner",
    "name": "Ailin Werner",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 404,
  "downloads": 40,
  "createdAt": "2025-12-26T15:15:36.136Z",
  "updatedAt": "2026-01-16T09:11:39.764Z",
  "publishedAt": "2025-12-26T15:15:36.136Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12184"
}