{
  "id": 6070,
  "slug": "6070",
  "title": "Instagram content & DM automation with Gemini, Telegram, and Apify",
  "description": "\n# 🤖 Instagram Automation Suite: AI Chatbot & Content Powerhouse\n\n## Workflow Overview\n\nThis cutting-edge n8n workflow is a comprehensive automation solution designed to streamline various Instagram operations. It combines an intelligent AI chatbot for direct message management, automated user following, and an advanced content generation system, all integrated to enhance your Instagram presence and efficiency.\n\nThis workflow automatically:\n\n  * **Manages Instagram Direct Messages via Telegram Chatbot**:\n      * Listens for new messages on **Telegram**.\n      * Routes messages from a specific Instagram user (`Wolf23000`) for processing.\n      * Utilizes an **AI agent (powered by OpenRouter's cutting-edge models)** to determine the intent of the message (e.g., chat back, run an Instagram-related action like getting profile info, posting, or following).\n      * Sends AI-generated responses back to the user via **Telegram**.\n  * **Automates Instagram User Following**:\n      * Scheduled to run at regular intervals (hourly).\n      * Processes a list of usernames (likely from a Google Sheet, though not explicitly shown in the provided JSON, it's a common pattern for \"Auto Follow users from sheet\" sticky note).\n      * Initiates following actions on Instagram for the specified users.\n  * **Generates & Schedules Instagram Posts**:\n      * Scheduled to run monthly.\n      * Leverages an **AI agent (powered by OpenRouter)** to generate **30 or 31 Instagram post ideas** for the current month, based on a predefined \"Instagram personality profile.\"\n      * Each post idea includes an `imagePrompt` (for AI image generation), a `caption` with emojis and hashtags, and a `scheduledDate`.\n      * Refines these post ideas by enhancing the `imagePrompt` to be more vivid and detailed for AI image generation, and polishing the `caption` for optimal engagement.\n      * Updates a Google Sheet (\"posts generation plan\") with the generated content, including the enhanced image prompts and the resulting image URLs (presumably from a separate image generation step not fully detailed in the provided JSON, but implied by `image_url` updates).\n\n-----\n\n## Key Benefits\n\n  * **Intelligent DM Management**: Automate responses and actions for Instagram direct messages, ensuring timely and relevant interactions without manual effort.\n  * **Effortless Audience Growth**: Automatically follow target users, expanding your reach and potential engagement on Instagram.\n  * **AI-Powered Content Creation**: Generate a full month's worth of diverse, engaging Instagram post ideas tailored to a specific personality, complete with image prompts and captions.\n  * **Content Optimization**: Automatically enhance image prompts for better AI image generation and refine captions for maximum impact.\n  * **Time-Saving**: Significantly reduce the manual workload associated with Instagram management, from direct messages to content planning and execution.\n  * **Consistent Brand Voice**: Maintain a consistent and engaging presence on Instagram with AI-generated content aligned with your defined personality.\n\n-----\n\n## Setup Requirements\n\nTo set up and run this workflow, you'll need the following:\n\n  * **n8n Installation**:\n      * Install n8n (cloud or self-hosted). The latest stable version, as of July 2025, is **v1.101.1**.\n      * Import the workflow configuration.\n      * Configure API credentials for all integrated services.\n      * Set up scheduling preferences for continuous operation.\n      * **System Requirements for Self-Hosting**: A modern multi-core processor (2 cores minimum, 4 recommended), 2 GB RAM (4 GB or more recommended), and 20 GB of free SSD storage. Node.js version 16 or later (18.x LTS recommended) is required. PostgreSQL is the recommended database for production.\n  * **Telegram API Access**:\n      * Create a Telegram bot via BotFather and obtain your API token.\n      * Configure the **Telegram Trigger** node with your bot's API credentials to receive messages.\n      * **Pricing**: Telegram's API is free to use.\n  * **OpenRouter API Access**:\n      * Create an OpenRouter account and generate an API key.\n      * This key (`{{your open router api key }}` as seen in the code) is used to access their chat models (e.g., `google/gemini-2.5-flash-preview`) for AI agent operations.\n      * **Pricing**: OpenRouter offers a variety of models with different pricing structures, including some free models like DeepSeek R1. Most models operate on a pay-per-usage basis, with costs clearly displayed for each model and prompt.\n  * **Instagram Session ID**:\n      * You'll need a valid Instagram session ID (`{{ your instagram session ID }}` as seen in the code) for the workflow to interact with Instagram. This usually involves extracting it from your browser's cookies after logging into Instagram.\n      * **Caution**: Instagram's terms of service generally prohibit automated interactions, and using session IDs for scraping or automation can lead to account suspension. Use with extreme caution and at your own risk.\n  * **Apify token setup**:\n        *You'll need to replace `{{ your apify token }}` with you apify token in https requests\n  * **Google Sheets Credentials**:\n      * A Google Cloud API key with access to Google Sheets.\n      * Set up OAuth2 authentication in n8n for read/write access to your \"posts generation plan\" spreadsheet (Document ID: `1XHNwAXR4USThaAzX1Y6M5PF2P8WqCBU8mi34FBLkV6M`). This sheet is used to store and manage generated post ideas.\n      * **Pricing**: The Google Sheets API is generally free for most common use cases, with generous per-minute quotas (300 read and 300 write requests per minute per project, 60 per user per project). No additional charges are incurred for exceeding these limits.\n        [https://docs.google.com/spreadsheets/d/1Ze5SC1g6Q5VzMAKYx0zmqlT00Db1HOchUth1jrPyM2Y/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1Ze5SC1g6Q5VzMAKYx0zmqlT00Db1HOchUth1jrPyM2Y/edit?usp=sharing)\n        [https://docs.google.com/spreadsheets/d/1XHNwAXR4USThaAzX1Y6M5PF2P8WqCBU8mi34FBLkV6M/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1XHNwAXR4USThaAzX1Y6M5PF2P8WqCBU8mi34FBLkV6M/edit?usp=sharing)\n  * **Predefined Instagram Personality JSON**:\n      * The workflow relies on a detailed JSON object defining an \"Instagram personality\" (e.g., `user_id`, `username`, `full_name`, `bio`, `content_preferences`, `personality_traits`, `unfulancer_attributes`). This JSON needs to be correctly set within the **Code** nodes (`Variables`, `Variables1`, `Variables2`) to guide the AI content generation.\n\n-----\n\n## Workflow Architecture\n\n```\n[Telegram New Message Trigger]\n    ⬇️\n[Variables (Set OpenRouter API Key, Instagram Personality, Session ID)]\n    ⬇️\n[Switch (Filter messages from 'Wolf23000' and ensure message text exists)]\n    ⬇️\n[Edit Fields (Extract message text)]\n    ⬇️\n[AI Agent (Determine action based on message intent)]\n    ⬇️\n[Structured Output Parser (Parse AI agent's JSON output)]\n    ⬇️\n[Switch1 (Route based on AI agent's determined action: chat_back, run_agent, get_instagram_profile)]\n    ⬇️\n    ┌─────────────┬─────────────┬─────────────┐\n    │             │             │             │\n    ▼             ▼             ▼             ▼\n[Send a text message1 (Chat back)] [Send a text message (Run agent confirmation)] [Send a text message2 (Get profile confirmation)]\n    ▲\n    │\n[Schedule Trigger (Hourly for Instagram follow)]\n    ⬇️\n[Variables (Set OpenRouter API Key, Instagram Personality, Session ID)]\n    ⬇️\n[Code (Prepare usernames for following)]\n    ⬇️\n[Code1 (Process followed usernames)]\n    ⬇️\n[Schedule Trigger2 (Monthly for Instagram post generation)]\n    ⬇️\n[AI Agent1 (Generate monthly Instagram post ideas)]\n    ⬇️\n[OpenRouter Chat Model (AI Model for content generation)]\n    ⬇️\n[Code2 (Parse AI agent's JSON output)]\n    ⬇️\n[Schedule Trigger3 (Daily for post generation refinement and auto-posting)]\n    ⬇️\n[AI Agent2 (Enhance image prompts and captions)]\n    ⬇️\n[OpenRouter Chat Model2 (AI Model for prompt refinement)]\n    ⬇️\n[Update row in sheet1 (Update Google Sheet with enhanced content)]\n    ⬇️\n[Get row(s) in sheet2 (Retrieve data from Google Sheet)]\n```\n\n\n-----\n\n## Connect With Me\n\nExploring AI-Powered Social Media Automation?\n📧 **Email**: mohamedgb00714@gmail.com\n💼 **LinkedIn**: [Mohamed el Hadi Msaid](https://www.linkedin.com/in/mohamed-el-hadi-m-said-1a9a5095/)\n\n**Supercharge your Instagram presence with intelligent automation and AI-driven content\\!** 🚀",
  "featuredImage": "/data/workflows/6070/6070.webp",
  "author": {
    "id": 101,
    "slug": "mohamedgb00714",
    "name": "Msaid Mohamed el hadi",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 3411,
  "downloads": 341,
  "createdAt": "2025-07-16T20:13:20.550Z",
  "updatedAt": "2026-01-16T08:42:58.724Z",
  "publishedAt": "2025-07-16T20:13:20.550Z",
  "nodes": 47,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6070"
}