{
  "id": 2988,
  "slug": "2988",
  "title": "Get daily exercise plan with Flex Message via LINE",
  "description": "The YogiAI workflow automates sending daily yoga pose reminders and related information via Line Push Messages . This automation leverages data from a Google Sheets database containing yoga pose details such as names, image URLs, and links to ensure users receive personalized and engaging content every day.\n\n**Purpose**\n- Provide users with daily yoga pose suggestions tailored to their practice.\n- Deliver visually appealing and informative content through Line's Flex Messages, including images and clickable links.\n- Log user interactions and preferences back into Google Sheets to refine future recommendations.\n\n**Key Features**\n1. Automated Daily Reminders : Sends a curated list of yoga poses at a scheduled time (21:30 Bangkok time).\n2. Dynamic Content Generation : Uses AI to rewrite and format messages in a user-friendly manner, complete with emojis and clear instructions.\n3. Integration with Google Sheets : Pulls data from a predefined Google Sheet and logs interactions for continuous improvement.\n4. Customizable Messaging : Ensures JSON outputs are properly formatted for Line’s Flex Message API, allowing for interactive and visually rich content.\n\n\n**Data Source**\nGoogle Sheets Structure\nThe workflow relies on a Google Sheet structured as follows:\n\nPoseName : The name of the yoga pose.\nuri : The image URL representing the pose.\nurl : A clickable link directing users to more information about the pose.\n\nSample Data Layout\nSupine Angle\nhttps://example.com/SupineAngle-tn146.png\nhttps://example.com/pose/SupineAngle\nWarrior II\nhttps://example.com/WarriorII-tn146.png\nhttps://example.com/pose/WarriorII\n\n*Note : Ensure that you update the Google Sheet with your own data. Refer to this sample sheet for reference. *\n\n**Scheduled Trigger**\nThe workflow is triggered daily at 21:30 (9:30 PM) Bangkok Time (Asia/Bangkok) . This ensures timely delivery of reminders to users, keeping them engaged with their yoga practice.\n\n**Workflow Process**\n1. **Data Retrieval**\nNode: Get PoseName\nFetches yoga pose details from the specified range in the Google Sheet.\n2. **Content Generation**\nNode: WritePosesToday\nUtilizes Azure OpenAI to craft user-friendly text, complete with emojis and clear instructions.\nNode: RewritePosesToday\nFormats the AI-generated text specifically for Line messaging, ensuring compatibility and visual appeal.\n3. **JSON Formatting**\nNode: WriteJSONflex\nGenerates JSON structures required for Line’s Flex Messages, enabling carousel displays of yoga pose images and links.\nNode: Fix JSON\nEnsures all JSON outputs are correctly formatted before being sent via Line.\n4. **Message Delivery**\nNode: Line Push with Flex Bubble\nSends the final message, including both text and Flex Message carousels, directly to users via Line Push Messages.\n5. **Logging Interactions**\nNodes: YogaLog & YogaLog2\nLogs each interaction back into Google Sheets to track which poses were sent and how often they appear, refining future recommendations.\n\n**Setup Prerequisites**\n*Google Sheets Account* : Set up a Google Sheet with the required structure and populate it with your yoga pose data.\n*Line Developer Account* : Create a Line channel to obtain necessary credentials for sending push messages.\n*Azure OpenAI Account* : Configure access to Azure OpenAI services for generating and formatting content.\n\n**Intended Audience**\nThis workflow is ideal for:\n- Yoga Instructors : Seeking to engage students with daily pose suggestions.\n- Fitness Enthusiasts : Looking to maintain consistency in their yoga practice.\n- Content Creators : Interested in automating personalized and visually appealing content distribution.\n \n",
  "featuredImage": "/data/workflows/2988/2988.webp",
  "author": {
    "id": 101,
    "slug": "linlinmhee",
    "name": "lin@davoy.tech",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2430,
  "downloads": 243,
  "createdAt": "2025-02-23T10:17:56.432Z",
  "updatedAt": "2026-01-16T08:27:32.060Z",
  "publishedAt": "2025-02-23T10:17:56.432Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2988"
}