{
  "id": 6887,
  "slug": "6887",
  "title": "Enhance AI chatbot responses with InfraNodus knowledge graph reasoning",
  "description": "## Augment AI chatbot prompts with a knowledge graph reasoning ontology and improve the quality of responses with Graph RAG.\n\nIn this workflow, we augment the original prompt using the [InfraNodus GraphRAG system](https://infranodus.com/docs/graph-rag-knowledge-graph) that will extract a reasoning ontology from a graph that you create (or that you can copy from our [repository of public graphs](https://infranodus.com/knowledge-graphs)). \n\nThis additional reasoning logic will improve the user's prompt and make it more descriptive and closely related to the logic you want to use. \n\nAs the next step, you can send it back to the same graph to generate a high-quality response using Graph RAG or to another graph (or AI model) to apply one type of knowledge in a completely different field.\n\n![InfraNodus Graph](https://infranodus.com/images/front/blog/reasoning-knowledge-graph-infranodus.png)\n\n## How it works\n\n1. Receives a request from a user (via n8n or a publicly available URL chat bot, you can also connect it to [Telegram](https://n8n.io/workflows/4485-telegram-ai-chatbot-agent-with-infranodus-graphrag-knowledge-base/)\n2. Sends the request to the knowledge graph in your InfraNodus account that contains a reasoning ontology represented as a knowledge graph. Reformulates the original prompt to include the reasoning logic provided. \n3. Sends the request to the knowledge graph in your InfraNodus account (same as the previous one or a new one for cross-disciplinary research) to retrieve a high-quality response using GraphRAG\n\n**Special sauce:** [InfraNodus](https://infranodus.com) will build a graph from your augmented prompt, then overlap it on the knowledge graph you want to inquire, traverse this graph based on the overlapped parts and extended relations, then retrieve the necessary part of the graph and include it in the context to improve the quality of your response. This helps InfraNodus grasp the relations and nuances that are not usually available through standard RAG.\n\n## How to use\n\n• Just get an [InfraNodus API key](https://infranodus.com/api-access) and add it into your Prompt Augmentation and Knowledge Base InfraNodus HTTP nodes for authentication\n\n• Then provide the name of the graphs you want to be using for prompt augmentation and retrieval. Note, these can be two different graphs if you want to apply a reasoning logic from one domain in another (e.g. machine learning in biology or philosophy in electrical engineering).\n\n## Support\n\nIf you wan to create your own reasoning ontology graphs, please, refer to this [article on generating your own knowledge graph ontologies](https://support.noduslabs.com/hc/en-us/articles/18301655686172-Generate-Knowledge-Graphs-and-Ontologies-in-Plain-Text).\n\nYou may also be interested to watch this video that explains the logic of this approach in detail:\n\n[![Video tutorial](https://img.youtube.com/vi/jhqBb3nuyAY/sddefault.jpg)](https://www.youtube.com/watch?v=jhqBb3nuyAY)\n\nHelp article on the same topic: [Using knowledge graphs as reasoning experts](https://support.noduslabs.com/hc/en-us/articles/21429518472988-Using-Knowledge-Graphs-as-Reasoning-Experts). \n\n",
  "featuredImage": "/data/workflows/6887/6887.webp",
  "author": {
    "id": 101,
    "slug": "infranodus",
    "name": "InfraNodus",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 473,
  "downloads": 47,
  "createdAt": "2025-08-02T13:49:53.846Z",
  "updatedAt": "2026-01-16T08:47:23.573Z",
  "publishedAt": "2025-08-02T13:49:53.846Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6887"
}