{
  "id": 2730,
  "slug": "2730",
  "title": "Get daily weather and save it in Airtable",
  "description": "This smart automation workflow created by the [AI development team](https://www.weblineindia.com/hire-ai-developers.html) at WeblineIndia, helps with the daily collection and storage of weather data. Using the OpenWeatherMap API and Airtable, this solution gathers vital weather details such as temperature, humidity, and wind speed. The automation ensures daily updates, creating a dependable historical record of weather patterns for future reference and analysis.\n\n## Steps:\n\n### Set Schedule Trigger\nConfigure a Cron node to trigger the workflow daily, for example, at 7 AM.\n\n### Fetch Weather Data (HTTP Request)\n\n- Use the HTTP Request node to retrieve weather data from the OpenWeatherMap API.\n- Include your API key and query parameters (e.g., q=London, unit=metric) to specify the city and desired units.\n\n### Parse Weather Data\n\nUtilize a JSON Parse node to extract key weather details, such as temperature, humidity, and wind speed, from the API response.\n\n### Store Data in Airtable\n\nUse the Airtable node to insert the parsed data into the designated Airtable table. Ensure proper mapping of fields like temperature, humidity, and wind speed.\n\n### Save and Execute\n\nSave the workflow and activate it to ensure weather data is fetched and stored automatically every day.\n\n## Outcome\nThis robust solution, developed by WeblineIndia, reliably collects and archives daily weather data, providing businesses and individuals with an accessible record of weather trends for analysis and decision-making.\n\n## About WeblineIndia\nWe specialize in creating [custom automation solutions](https://www.weblineindia.com/process-automation-solutions.html) and innovative software workflows to help businesses streamline operations and achieve efficiency. This weather data fetcher is just one example of our expertise in delivering value through technology.",
  "featuredImage": "/data/workflows/2730/2730.webp",
  "author": {
    "id": 101,
    "slug": "weblineindia",
    "name": "WeblineIndia",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1243,
  "downloads": 124,
  "createdAt": "2025-01-15T08:26:21.852Z",
  "updatedAt": "2026-01-16T08:26:12.062Z",
  "publishedAt": "2025-01-15T08:26:21.852Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2730"
}