{
  "id": 11625,
  "slug": "11625",
  "title": "Automated employee attendance & salary deduction with Google Sheets and GPT-4",
  "description": "## Overview\n\nThis workflow is designed for HR teams and payroll department to automate the monthly process of calculating employee attendance, salary deductionsm and personalized email notification. It seamlessly integrates Google Sheets, internal attendance data and GPT-4 (via AI Agent) to generate complete monthly payroll reports with professional summaries for each employees.\n\n## Prerequisites\n\nBefore using this workflow, ensure you have:\n\n- A Google Sheet with the monthly attendance logs\n- A secong Google Sheet containing salary, employee names and email addresses.\n- Gmail or SMTP credentials for sending email\n- OpenAI API key (for summarization)\n- Crendentials for Google Sheet and Gmail Integration\n\n## Google Sheet Structure\n\n#### 1. Attendance Sheet (Daily Log)\n\n```\nEmpId\tName\tDate\tInTime\tOutTime\tHoursWorked\tStatus\n```\n\n#### 2. Ouput Sheet (Generated by Workflow)\n\n```\nEmpId\tName\tOriginalSalary\tTotalMissingHours\tTotalAbsentDays\tDeduction\tFinalSalary\tEmpEmail\n```\n\n## How It Works\n\n#### 1. Retrieve Attendance & Employee Master Data\n\nThe workflow fetches all employee attendace logs and thier corresponding salary, name and email details from Google Sheets.\n\n#### 2. Calculate Work Hours & Absences\n\nThe workflow computes total worked hours per day, missing hours and identifies absent days, It then calculates the total missing hours and absences for the entire month.\n\n#### 3. Salary Deduction Calculation\n\nEach employee's hourly and daily rate is determined from thier salary, and deductions are calculated based on missing hours and absences.\n\n#### 4. Prepare Final Dataset\n\nA structured JSON dataset is generated combining attendace summary, deductions and final salary amounts.\n\n#### 5. Generate AI Summary Report (GPT-4)\n\nUsing AI Agent GPT-4 creates a professional, HR-friendly summary paragraph for each employee's email report.\n\n#### 6. Send Salary Deduction Report Email\n\nEach employee receives a personalized email with thier final salary summary and monthly attendance report.\n\n#### 7. Log Email Status\n\nEmail delivery details and summary text are stored in new Google Sheet for audit and HR tracking.\n\n## User Cases\n\n- Monthly attendance and payroll automation\n- Automated HR communication\n- Salary deduction reporting\n- Attendace compliance monitoring\n- Reducing manual calculation errors",
  "featuredImage": "/data/workflows/11625/11625.webp",
  "author": {
    "id": 101,
    "slug": "mohamed-abubakkar",
    "name": "Mohamed Abubakkar",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 210,
  "downloads": 21,
  "createdAt": "2025-12-09T05:47:05.407Z",
  "updatedAt": "2026-01-16T09:09:24.765Z",
  "publishedAt": "2025-12-09T05:47:05.407Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11625"
}