{
  "id": 11708,
  "slug": "11708",
  "title": "Generate strategic business recommendations with GPT-4 Mini and multi-channel distribution",
  "description": "## How It Works\nAutomates sales data analysis and strategic insight generation for sales managers and strategists needing actionable intelligence. Fetches multi-source data from sales, marketing, and financial systems, validates data quality to prevent errors, applies advanced AI analysis via OpenAI to identify market trends and patterns, calculates comprehensive KPIs for performance measurement, generates prioritized recommendations, and automatically distributes detailed insights via Gmail alerts and Google Sheets dashboards—eliminating time-consuming manual analysis overhead.\n\n## Setup Instructions\n1. **OpenAI API**: Add key via credentials\n2. **Gmail**: Authorize account for email delivery\n3. **Google Sheets**: Connect for dashboard logging\n4. **Schedule**: Set monthly trigger timing\n5. **Modify data sources**: Replace fetch nodes with your APIs\n\n## Prerequisites\nOpenAI API key, Gmail account with send permissions, Google Sheets access, n8n instance, source data APIs (sales, marketing, financial systems).\n\n## Use Cases\nE-commerce platforms analyzing sales trends; SaaS companies generating strategy reports; multi-channel retailers routing recommendations; \n\n\n## Customization\nAdd data sources via fetch nodes; swap OpenAI for Claude or Gemini; modify routing logic for different priority thresholds; \n\n## Benefits\nReduces analysis time from hours to minutes. Eliminates manual report crea",
  "featuredImage": "/data/workflows/11708/11708.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 91,
  "downloads": 9,
  "createdAt": "2025-12-11T15:01:12.569Z",
  "updatedAt": "2026-01-16T09:09:48.422Z",
  "publishedAt": "2025-12-11T15:01:12.569Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11708"
}