{
  "id": 6060,
  "slug": "6060",
  "title": "Automate Chinese to English translation in Google Slides with Openrouter AI",
  "description": "\n---\n\n## Overview of the n8n Workflow\n\nThis n8n workflow automates the translation of text in Google Slides presentations from one language to another using AI. It retrieves a specified presentation from Google Drive, extracts text from the slides, translates it in batches, and updates the presentation with the translated text. The workflow includes sticky notes with setup instructions and guidance on editable fields, formatted in Markdown for clarity.\n\n---\n\n## Step-by-Step Execution of the Workflow\n\nHere’s how the workflow operates, node by node, based on the JSON and image descriptions:\n\n1. **Manual Trigger**  \n   - **Node**: \"When clicking ‘Execute workflow’\"  \n   - **Function**: Initiates the workflow when the user manually clicks \"Execute workflow\" in n8n.  \n\n\n2. **Search for Google Slides Presentation**  \n   - **Node**: \"Google Drive\"  \n   - **Function**: Searches Google Drive for a presentation file.  \n\n\n3. **Retrieve Presentation Data**  \n   - **Node**: \"Google Slides2\"  \n   - **Function**: Fetches the full presentation data from Google Slides.  \n \n\n4. **Extract Text from Slides**  \n   - **Node**: \"Code\"  \n   - **Function**: Extracts text from the presentation using JavaScript.  \n  \n\n5. **Split Text Array**  \n   - **Node**: \"Split Out\"  \n   - **Function**: Breaks the `extracted` array into individual items.  \n   \n\n6. **Process Text in Batches**  \n   - **Node**: \"Loop Over Items\"  \n   - **Function**: Loops over the text items in batches for efficient processing.  \n   \n7. **Translate Text with AI**  \n   - **Node**: \"AI Agent\"  \n   - **Function**: Translates text from Chinese to English using an AI model.  \n  \n8. **Provide AI Model**  \n   - **Node**: \"OpenRouter Chat Model\"  \n   - **Function**: Supplies the AI language model for the \"AI Agent\".  \n  \n\n9. **Replace Text in Slides**  \n   - **Node**: \"Replace text\"  \n   - **Function**: Updates the Google Slides presentation with translated text.  \n  \n10. **Delay Between Batches**  \n    - **Node**: \"Wait\"  \n    - **Function**: Adds a delay to prevent overwhelming the system.  \n    \n\n---\n\n## Sticky Notes: Setup and Customization Guidance\n\nThe workflow includes three sticky notes with Markdown formatting, providing essential instructions:\n\n\n---\n\n## How to Set Up the Workflow\n\nTo use this workflow in n8n:\n\n1. **Import the JSON**: Copy the provided JSON into n8n to load the workflow.  \n2. **Configure Credentials**:  \n   - **Google Drive**: Set up OAuth2 credentials (\"Google Drive Auth\") with access to the folder containing your presentation.  \n   - **Google Slides**: Set up OAuth2 credentials (\"Google Slides Auth\") with edit permissions for the presentation.  \n   - **OpenRouter**: Create an account at [openrouter.ai](https://openrouter.ai/) and add the API credentials to the \"OpenRouter Chat Model\" node.  \n3. **Customize the Google Drive Query**: Update the \"Google Drive\" node’s `queryString` to match your presentation’s name or ID (default is \"slides\").  \n4. **Test the Workflow**: Click \"Execute workflow\" to run it manually and verify each step.\n\n---\n\n## Potential Customizations\n\nYou can adapt the workflow for different needs:\n\n- **Change Language Pair**:  \n  Modify the \"AI Agent\" node’s system message, e.g., replace \"convert all of them into English\" with \"convert all of them into French\" to translate Chinese to French.  \n- **Use a Different AI Model**:  \n  Replace the \"OpenRouter Chat Model\" node with another AI provider (e.g., OpenAI) by updating the node type and credentials.  \n- **Expand Text Extraction**:  \n  Edit the \"Code\" node’s JavaScript to extract text from tables or other elements, not just shapes.  \n- **Adjust Batch Processing**:  \n  Change the \"Loop Over Items\" node’s `batchSize` (e.g., to 10) or the \"Wait\" node’s `amount` (e.g., to 1 second) for performance tuning.  \n- **Process Multiple Presentations**:  \n  Remove the `limit: 1` in the \"Google Drive\" node and add a loop to handle multiple files.\n\n---\n\n## Considerations and Improvements\n\n- **Error Handling**: The workflow lacks explicit error handling. Add \"If\" nodes or error outputs to manage failures (e.g., if no presentation is found).  \n- **Text Coverage**: The \"Code\" node may miss text in non-shape elements (e.g., tables). Test with your presentation to confirm coverage.  \n- **Performance**: For large presentations, the 2-second wait per batch of 5 may slow things down. Adjust based on your needs and API limits.  \n- **Permissions**: Ensure your Google credentials have edit access to the presentation, or replacements will fail.\n\n---\n\n## Conclusion\n\nThis n8n workflow efficiently automates the translation in Google Slides, leveraging Google Drive, Google Slides, and AI via OpenRouter. It’s well-documented with sticky notes and easy to set up with proper credentials. While robust for its purpose, it could benefit from error handling and broader text extraction. You can customize it for different languages, models, or file types by tweaking the relevant nodes as outlined.\n\nIf you have a specific question or need help with a modification, let me know! [OptiLever](www.linkedin.com/in/sebastian-lew-9ab9b9242)",
  "featuredImage": "/data/workflows/6060/6060.webp",
  "author": {
    "id": 101,
    "slug": "lewxiangang",
    "name": "Sebastian/OptiLever",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 158,
  "downloads": 15,
  "createdAt": "2025-07-16T14:22:15.147Z",
  "updatedAt": "2026-01-16T08:42:55.190Z",
  "publishedAt": "2025-07-16T14:22:15.147Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6060"
}