{
  "id": 11655,
  "slug": "11655",
  "title": "Monitor website uptime with Google Sheets, Slack, Email & Phone Call alerts",
  "description": "## Who’s it for\nThis template is ideal for developers, agencies, hosting providers, and website owners who need real-time alerts when a website goes down. It helps teams react quickly to downtime by sending multi-channel notifications and keeping a historical uptime log for tracking performance over time.\n\n## What it does / How it works\nThis workflow runs on a schedule and checks a list of websites stored in Google Sheets.  \nFor every website URL, it performs an HTTP status check and determines whether the site is **up** or **down**.  \nIf the website is up, the workflow logs the status and timestamp into a separate uptime log sheet.  \nIf the website is down, it sends immediate alerts through Slack and Gmail, and also triggers an automated phone call using a voice-call API service.  \nAll uptime and downtime events are logged automatically, enabling long-term monitoring and reporting.\n\n## Requirements\n- Google Sheets OAuth2 credentials  \n- Slack credentials  \n- Gmail OAuth2 credentials  \n- Voice-call API credentials (e.g., Vapi.ai)  \n- A Google Sheet containing the list of website URLs  \n- A second Google Sheet for logging uptime history  \n\n## How to set up\n1. Connect your Google Sheets, Slack, Gmail, and call-API credentials.  \n2. Replace both Google Sheet IDs with your own.  \n3. Update the HTTP Request node to reference your sheet’s URL column.  \n4. Configure your Slack user or channel for downtime alerts.  \n5. Add your API Key, assistant ID, and phone number variables to the call alert node.  \n6. Adjust the schedule interval in the Schedule Trigger node.  \n\n## How to customize the workflow\n- Add SMS alerts (Twilio, Vonage)  \n- Log uptime to a database instead of Sheets  \n- Add retry logic for false positives  \n- Monitor response time in addition to status codes  \n- Connect alerts to your incident-management tools (PagerDuty, Jira, Discord)",
  "featuredImage": "/data/workflows/11655/11655.webp",
  "author": {
    "id": 101,
    "slug": "pixcelsthemes",
    "name": "Pixcels Themes",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 77,
  "downloads": 7,
  "createdAt": "2025-12-10T12:28:36.602Z",
  "updatedAt": "2026-01-16T09:09:32.683Z",
  "publishedAt": "2025-12-10T12:28:36.602Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11655"
}