{
  "id": 9387,
  "slug": "9387",
  "title": "Automate LinkedIn posts to email newsletter with Apify and GPT-4",
  "description": "## Who's it for\n\nThis workflow is ideal for content creators, marketers, and business professionals who want to automatically repurpose their LinkedIn content into email newsletters. If you're actively posting on LinkedIn and want to maximize your content's reach by delivering it directly to your email subscribers, this automation saves you hours of manual work each week.\n\n## What it does\nThis workflow automatically transforms your latest LinkedIn posts into professionally formatted email newsletters. It monitors your LinkedIn profile, extracts your most recent post, and intelligently converts it into engaging newsletter content with proper HTML formatting. The final newsletter is then delivered directly to your target email inbox, ready to be reviewed and sent to your subscribers.\n\n## How it works\nThe workflow operates through four key stages:\n\n1. Content Extraction: Uses an Apify actor node to scrape all posts from your specified LinkedIn account\n\n2. Latest Post Filter: Automatically identifies and isolates your most recent LinkedIn post from the scraped data\n\n3. AI Transformation: Leverages OpenAI to convert the LinkedIn post into newsletter-style content with improved formatting and structure\n\n4. Email Delivery: Applies email-friendly HTML formatting and sends the polished newsletter to your designated email inbox\n\n## Requirements\nTo use this workflow, you'll need:\n\n- Apify account - For LinkedIn data scraping (free tier available)\n- OpenAI API key - For content transformation and formatting\n- Gmail API credentials - For email delivery\n\n## Setup instructions\n\n1. Configure Apify: Add your Apify API credentials and specify the LinkedIn profile URL you want to monitor\n\n2. Connect OpenAI: Insert your OpenAI API key in the AI transformation node\n\n3. Set up Gmail: Authenticate your Gmail account and specify the recipient email address\n\n4. Customize prompts: Adjust the OpenAI prompts to match your newsletter's tone and style\n\n5. Test the workflow: Run manually first to ensure all connections work properly\n\n## How to customize\n\n- Modify the OpenAI prompts to adjust newsletter tone, length, and formatting style\n- Change the filtering logic to select posts based on engagement metrics instead of recency\n- Add additional nodes to schedule automatic runs or post to multiple platforms\n- Integrate with email marketing platforms like Mailchimp or SendGrid for direct subscriber delivery",
  "featuredImage": "/data/workflows/9387/9387.webp",
  "author": {
    "id": 101,
    "slug": "rj-nelson",
    "name": "RJ Nelson",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 101,
  "downloads": 10,
  "createdAt": "2025-10-08T20:10:20.749Z",
  "updatedAt": "2026-01-16T09:00:18.140Z",
  "publishedAt": "2025-10-08T20:10:20.749Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9387"
}