{
  "id": 4075,
  "slug": "4075",
  "title": "Automated tweet generator & publisher with GPT-4, Discord, and Google Sheets",
  "description": "# AI Twitter Content Machine – Write, Refine & Publish Tweets on Autopilot\n\nThis workflow is perfect for creators, solopreneurs, and personal brands who want to consistently publish bold, high-performing content on X (Twitter) — without writing a single line themselves. After a one-time setup, it automatically generates tweet ideas, writes in your voice, evaluates post quality, avoids duplicates, and publishes directly to Twitter. All approvals and rewrites are handled in a conversational loop powered by OpenAI, Discord, and Google Sheets.\n\nWhether you’re building a personal brand or growing your startup audience, this tool will help you stay active, edgy, and relevant — with zero friction.\n\n## How it works\n- Distill what your flow does in a few high-level steps.\n- Loads your brand brief from a sub-workflow.\n- Generates a tweet idea aligned with your tone.\n- Checks Google Sheets to ensure the idea hasn’t been used.\n- Writes the post.\n- Evaluates it using a feedback sub-workflow — if the quality score is below 0.7, it rewrites the post.\n- Refines tone and voice using a Rewriter Agent that mimics your past content (from a Google Sheet).\n- Sends the final post to a Discord channel for manual approval.\n- On approval, posts directly to Twitter (X) and logs it to Google Sheets (History and Examples tabs).\n\n## Set up steps\n- Give users an idea of how long setup will take. Don’t describe every detail.\n- Keep detailed descriptions in sticky notes inside your workflow.\n\n## Key benefits\n- No burnout, no block – Stop spending energy thinking what to tweet. AI handles everything.\n- Style-matching – Posts sound like you, not a generic robot. Based on your real writing.\n- Fast & scalable – Publish once or five times a day — it’s up to you.\n- Avoid duplicates – Each idea is checked against your post history.\n- Human-in-the-loop – You approve final posts via Discord. No rogue tweets.\n\n## Integrations required\n- n8n\n- OpenAI API\n- Google Sheets\n- Twitter (OAuth2)\n- Discord (for approval)\n- Notion (optional for brand brief storage)\n",
  "featuredImage": "/data/workflows/4075/4075.webp",
  "author": {
    "id": 101,
    "slug": "lukaszb",
    "name": "LukaszB",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 3194,
  "downloads": 319,
  "createdAt": "2025-05-15T17:47:41.088Z",
  "updatedAt": "2026-01-16T08:32:55.324Z",
  "publishedAt": "2025-05-15T17:47:41.088Z",
  "nodes": 44,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4075"
}