{
  "id": 6770,
  "slug": "6770",
  "title": "Automate QuickBooks customers & sales receipts generation from a Google Sheet",
  "description": "# This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution to streamline your sales and accounting process.\n\nSimply add new transaction details to a designated Google Sheet, and this workflow takes over. Using specific status keywords in a column to trigger the process, it automatically creates new customer profiles and generates sales receipts in QuickBooks. This creates a complete, end-to-end system from a simple spreadsheet entry to a formal accounting record, eliminating manual data entry.\n\n## How it works\n\nThis workflow streamlines the process of recording sales from a Google Sheet into QuickBooks Online, intelligently handling both new and existing customers.\n\n**1. Trigger on New Row:** The workflow starts automatically whenever a new row is added to your specified Google Sheet.\n\n**2. Check for Existing Customer:** It takes the customer's name from the new row and searches your QuickBooks account to see if a customer with that DisplayName already exists.\n\n**3. Conditional Logic (IF Node):** Based on the search result, the workflow splits into two paths:\n\n- If Customer Exists (True Path): The workflow proceeds directly to create a Sales Receipt, linking it to the existing customer's ID found in the search.\n- If Customer Does Not Exist (False Path): The workflow first creates a new customer in QuickBooks using the name and email from the sheet. It then uses the ID of this newly created customer to generate the corresponding Sales Receipt.\n\n\n### How to Use: Quick Start Guide\n\n1. Prepare your Google Sheet: Make sure you have a Google Sheet with clear headers for your sales data. The template is configured for the following columns: CustomerName, Email, Amount, and Quantity.\n\n2. Import the Template: Click the \"Use Template\" button to import the workflow into your n8n instance.\n\n3. Configure Google Sheet Node: \n- Enter the Spreadsheet ID from your Google Sheet's URL.\n- Enter the Sheet Name where your sales data is located (e.g., Sheet1).\n\n4. Configure the QuickBooks Nodes: \n- Select your QuickBooks Online credential or create a new one for the \"Search for Customer\", \"Create Receipt for EXISTING Customer\", \"Create New Customer\", and \"Create Receipt for NEW Customer\" nodes.\n- Important: In both \"Create Receipt\" nodes, you must provide a valid Product/Service ID from your QuickBooks account. Find this in the node parameters under Line &gt; Sales Item Line Detail &gt; Item Ref &gt; Value.\n\n5. Activate the Workflow: Save your changes and activate the workflow. Now, every new row you add to the Google Sheet will automatically create the necessary records in QuickBooks.\n \n\n#### Key Requirements to Use Template\n- An active n8n instance.\n- A Google account with a prepared Google Sheet.\n- A QuickBooks Online account.\n- A QuickBooks Developer account to obtain the API credentials needed to connect to n8n.\n- At least one Product or Service item set up in your QuickBooks account to be referenced in the sales receipts.\n \n## Connect with us\n\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n\n## For Custom Workflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n",
  "featuredImage": "/data/workflows/6770/6770.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 271,
  "downloads": 27,
  "createdAt": "2025-08-01T08:59:09.867Z",
  "updatedAt": "2026-01-16T08:47:01.640Z",
  "publishedAt": "2025-08-01T08:59:09.867Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6770"
}