{
  "id": 2006,
  "slug": "2006",
  "title": "AI agent that can scrape webpages",
  "description": "![n8nReAct.webp](fileId:720)\n\n⚙️🛠️🚀🤖🦾\n\nThis template is a PoC of a ReAct AI Agent capable of fetching random pages (not only Wikipedia or Google search results).\n\nOn the top part there's a manual chat node connected to a LangChain ReAct Agent. The agent has access to a workflow tool for getting page content.\n\nThe page content extraction starts with converting query parameters into a JSON object. There are 3 pre-defined parameters:\n- **url** – an address of the page to fetch\n- **method** = full / simplified\n- **maxlimit** - maximum length for the final page. For longer pages an error message is returned back to the agent\n\nPage content fetching is a multistep process:\n1. An HTTP Request mode tries to get the page content.\n\nIf the page content was successfuly retrieved, a series of post-processing begin:\n\n2. Extract HTML BODY; content\n3. Remove all unnecessary tags to recuce the page size\n4. Further eliminate external URLs and IMG scr values (based on the method query parameter)\n5. Remaining HTML is converted to Markdown, thus recuding the page lengh even more while preserving the basic page structure\n6. The remaining content is sent back to an Agent if it's not too long (maxlimit = 70000 by default, see CONFIG node).\n\n*NB:*\n- You can isolate the HTTP Request part into a separate workflow.\n- Check the Workflow Tool description, it guides the agent to provide a query string with several parameters instead of a JSON object.\n\nPlease reach out to [Eduard](https://www.linkedin.com/in/parsadanyan/) is you need further assistance with you n8n workflows and automations!\n\nNote that to use this template, you need to be on n8n version 1.19.4 or later.\n",
  "featuredImage": "/data/workflows/2006/2006.webp",
  "author": {
    "id": 101,
    "slug": "eduard",
    "name": "Eduard",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 268473,
  "downloads": 26847,
  "createdAt": "2023-12-06T14:45:11.358Z",
  "updatedAt": "2026-01-16T08:22:36.223Z",
  "publishedAt": "2023-12-06T14:45:11.358Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2006"
}