{
  "id": 12271,
  "slug": "12271",
  "title": "Schedule and track interviews using Calendly, Zoom, Asana, and Gmail",
  "description": "## 📊 Description\nThis workflow automates interview scheduling by orchestrating Calendly, Zoom, Asana, and Gmail into a single, reliable hiring pipeline. When a candidate books an interview, the automation ensures the interview is properly scheduled, tracked, assigned, and communicated — without any manual follow-ups.\nThe workflow listens for new Calendly bookings, normalizes scheduling data, creates a Zoom meeting, assigns a structured interview task in Asana, and notifies the appropriate interviewer via email. Conditional routing ensures the right stakeholders are involved while keeping candidate communications separate.\nDesigned for real-world hiring operations, this automation provides consistency, accountability, and scalability as interview volume grows.\n\n## 🔁 What this template does\n- Receives interview booking events from Calendly via webhook.\n- Normalizes and structures scheduling details such as time, timezone, and invitee information.\n- Creates a Zoom meeting automatically for the scheduled interview.\n- Routes the interview based on type (for example, HR or Technical).\n- Creates a structured Asana task assigned to the appropriate interviewer.\n- Stores interview context and Zoom meeting links directly in the Asana task.\n- Sends automated email notifications to interviewers with complete interview details.\n- Ensures interviewer-side visibility without exposing candidate-facing communications.\n- Executes fully automatically with no manual intervention.\n\n## ⭐ Key benefits\n- Eliminates manual interview coordination and follow-ups\n- Ensures every interview has a correctly configured Zoom meeting\n- Keeps interviewers aligned through structured Asana task tracking\n- Provides reliable, role-based notifications\n- Reduces scheduling errors and missed interviews\n- Production-ready automation for growing hiring teams\n\n## 🧩 Features\n- Calendly webhook-based trigger\n- Normalized interview data handling\n- Automated Zoom meeting creation\n- Interview-type routing and interviewer assignment\n- Interview-focused Asana task management\n- Automated Gmail notifications\n- Clean, interviewer-only communication flow\n- Scalable interview orchestration design\n\n## 🔐 Requirements\n- Calendly account with webhook access enabled\n- Zoom API credentials\n- Asana OAuth2 credentials\n- Gmail OAuth2 credentials\n- n8n (cloud or self-hosted)\n\n## 🎯 Target audience\n- Hiring managers\n- Technical interviewers\n- HR and recruitment teams\n- Startups and SaaS companies\n- Automation engineers building internal hiring pipelines",
  "featuredImage": "/data/workflows/12271/12271.webp",
  "author": {
    "id": 101,
    "slug": "rahul08",
    "name": "Rahul Joshi",
    "avatar": ""
  },
  "categories": [
    "HR"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2025-12-29T13:03:33.291Z",
  "updatedAt": "2026-01-16T09:11:56.516Z",
  "publishedAt": "2025-12-29T13:03:33.291Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12271"
}