{
  "id": 9710,
  "slug": "9710",
  "title": "Podcast to X (Twitter) pipeline with OpenAI Whisper, GPT-4o & Slack approval",
  "description": "Turn your favorite podcast episodes into engaging social media content automatically. This workflow fetches new episodes from an RSS feed, transcribes the audio using OpenAI Whisper, generates a concise summary using GPT-4o, and drafts a tweet. It then sends the draft to Slack for your review before posting it to X (Twitter).\n\n## Who is this for\nContent creators, social media managers, and podcast enthusiasts who want to share insights without manually listening to and typing out every episode.\n\n## Key Features\n- **Large File Support:** Includes a custom logic to download audio in chunks, ensuring stability even with long episodes (preventing timeouts).\n- **Human-in-the-Loop:** Nothing gets posted without your approval. You can review the AI-generated draft in Slack before it goes live.\n- **High-Quality AI:** Uses OpenAI's Whisper for accurate transcription and GPT-4o for intelligent summarization.\n\n## How it works\n1. **Monitor:** Checks the Podcast RSS feed daily for new episodes.\n2. **Process:** Downloads the audio (handling large files via chunking) and transcribes it.\n3. **Draft:** AI summarizes the transcript into bullet points and formats it for X (Twitter).\n4. **Approve:** Sends the draft to a Slack channel.\n5. **Publish:** Once approved by you, it posts the tweet to your X account.\n\n## Requirements\n- OpenAI API Key\n- Slack Account & App (Bot Token)\n- X (Twitter) Developer Account (OAuth2)\n\n## Setup instructions\n1. **RSS Feed:** The template defaults to \"TED Talks Daily\" for demonstration. Open the `[Step 1] RSS` node and replace the URL with your target podcast.\n2. **Connect Credentials:** Set up your credentials for OpenAI, Slack, and X (Twitter) in the respective nodes.\n3. **Slack Channel:** In the `[Step 12] Slack` node, select the Channel ID where you want to receive the approval request.",
  "featuredImage": "/data/workflows/9710/9710.webp",
  "author": {
    "id": 101,
    "slug": "nakayama",
    "name": "Shun Nakayama",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 134,
  "downloads": 13,
  "createdAt": "2025-10-15T12:58:52.048Z",
  "updatedAt": "2026-01-16T09:01:35.222Z",
  "publishedAt": "2025-10-15T12:58:52.048Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9710"
}