{
  "id": 6286,
  "slug": "6286",
  "title": "Extract organizations & summarize documents with Foxit and Diffbot",
  "description": "## How It Works\n\nThis N8N template demonstrates using Foxit's Extraction API to get information from an incoming document and then using Diffbot's APIs to turn the text into a list of organizations mentioned in the document and create a summary.\n\n## How it works\n\n* Listen for a new file added to a Google Drive folder. When executed, the bits are downloaded.\n* Upload the bits to Foxit.\n* Call the [Extract API](https://docs.developer-api.foxit.com/#f7aaf21d-f519-4c20-90b9-17d0c1763476) to get the text contents of the document.\n* Poll the API to see if it's done, and when it is, grab the text.\n* Send the text to [Diffbot API](https://docs.diffbot.com/reference/introduction-to-natural-language-api) to get a list of entities mentioned in the doc as well as the summary.\n* Use a code step to filter the entities returned from Diffbot to ones that are organizations, as well as filtering to a high confidence score.\n* Use another code step to make an HTML string from the previous data.\n* Email it using the GMail node.\n\n## Requirements\n\n* A Google account for Google Drive and GMail\n* Foxit developer account (https://developer-api.foxit.com)\n* Diffbot developer account (https://app.diffbot.com/get-started)\n\n## Next Steps\n\nThis workflow assumes PDF input, but Foxit has APIs to convert Office docs to PDF and that flow could be added before the Extract API is called. \n\nDiffbot returns an incredible set of information and more could be used in the email.\n\nInstead of emailing, you could sort documents by organizations into new folders.",
  "featuredImage": "/data/workflows/6286/6286.webp",
  "author": {
    "id": 101,
    "slug": "raymondcamden",
    "name": "Raymond Camden",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 225,
  "downloads": 22,
  "createdAt": "2025-07-22T19:21:53.956Z",
  "updatedAt": "2026-01-16T08:44:13.460Z",
  "publishedAt": "2025-07-22T19:21:53.956Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6286"
}