{
  "id": 7693,
  "slug": "7693",
  "title": "Bulk lead email validation with Google Sheets & Anymail Finder",
  "description": "This workflow automates the **process of validating email addresses** stored in a **Google Sheets file** by using the Anymail Finder API.\n\n---\n\n###  Key Advantages\n\n* ✅ **Automated Lead Validation**\n  No need for manual copy-paste or bulk uploads emails are verified directly inside your existing Google Sheets.\n\n* 🔎 **Improved Data Quality**\n  Ensures your CRM or outreach campaigns only target **valid and deliverable email addresses**, reducing bounce rates.\n\n* 🔄 **Real-Time Updates**\n  Results are automatically updated in the spreadsheet, making it easy for your team to see which leads are safe to contact.\n\n* 📈 **Improves lead quality** for outreach, reduces bounce rates\n---\n\nOf course. Here is a description of the provided n8n workflow.\n\n### **Workflow Description: Verify Leads Email Address with Anymail Finder**\n\nThis workflow automates the process of checking the validity of email addresses from a Google Sheets list using the Anymail Finder API and writing the results back to the sheet.\n\n---\n\n### **How It Works**\n\nThe workflow operates in a loop to process a list of leads from a Google Sheet one by one.\n\n1.  **Manual Trigger:** The workflow is started manually by a user within n8n.\n2.  **Get Leads:** The \"Get Leads\" node reads data from a specified Google Sheet. It is configured with a filter to only fetch rows where the \"VERIFY\" column is empty, ensuring it only processes new leads that haven't been checked yet.\n3.  **Loop Over Items:** The \"Split In Batches\" node is used to iterate over each row (lead) retrieved from the Google Sheet. This sends each lead individually to the next node for processing.\n4.  **Check Email Status:** For each lead, the \"HTTP Request\" node sends a `POST` request to the Anymail Finder API (`/v5.1/verify-email`). The email address from the current sheet row (`$json[\"EMAIL \"]`) is sent in the request body.\n5.  **Update Email Status:** The response from Anymail Finder (which contains the verification status) is received. The \"Update email status\" node then takes this result and writes it back to the \"VERIFY\" column of the original Google Sheet. It uses the `row_number` to identify the correct row to update, ensuring data is placed accurately.\n\n---\n\n### **Set Up Steps**\n\nTo use this workflow, you need to configure the following credentials and nodes:\n\n1.  **Google Sheets Credentials:**\n    *   Create a credential named \"Google Sheets account\" of type `OAuth2`.\n    *   Follow n8n's guide to authenticate with Google Sheets. This will give the workflow permission to read from and write to your spreadsheet.\n\n2.  **Anymail Finder Credentials:**\n    *   Create a credential named \"Anymail Finder\" of type `HTTP Header Auth`.\n    *   In the \"Name\" field, enter `Authorization` (or the header name required by Anymail Finder's API documentation).\n    *   In the \"Value\" field, enter your Anymail Finder API key (in the format `YOUR_API_KEY`).\n\n3.  **Configure Google Sheet:**\n    *   Ensure your Google Sheet has at least the following columns: `COMPANY NAME`, `EMAIL ` (note the space), and `VERIFY`.\n    *   The \"VERIFY\" column must be empty for rows you want to verify. The \"Get Leads\" node is filtered to only process rows where this column is blank.\n\n4.  **Activate and Execute:**\n    *   Once the credentials are set and the sheet ID is configured, activate the workflow.\n    *   Click on the \"Manual Trigger\" node and execute the workflow. It will begin processing all leads with an empty \"VERIFY\" field.\n\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/). ",
  "featuredImage": "/data/workflows/7693/7693.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 462,
  "downloads": 46,
  "createdAt": "2025-08-21T08:36:21.288Z",
  "updatedAt": "2026-01-16T08:51:51.821Z",
  "publishedAt": "2025-08-21T08:36:21.288Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7693"
}