{
  "id": 8194,
  "slug": "8194",
  "title": "Generate product mockups with Nano Banana (Gemini 2.5 Flash Image)",
  "description": "## This n8n template uses AI to generate product mockups by composing a product image onto a model or template image.\n\nThis workflow provides a powerful solution for creating dynamic marketing assets and e-commerce visuals. Use cases are many: Instantly create virtual try-on images for apparel, place your product into different scenes for advertisements, or generate custom marketing material without needing a physical photoshoot.\n\n### Good to know\n* This workflow uses the **OpenRouter API** to access Google's Gemini model. You will need an OpenRouter account.\n* The model used is `google/gemini-2.5-flash-image-preview:free`. While this specific model may be free, costs can vary depending on the model you choose and your usage on OpenRouter. Always check their latest pricing.\n* The workflow is triggered by a form. To use it, you must activate the workflow and use its Production URL.\n\n### How it works\n* A user submits a **product image**, a **template/model image**, and a **text prompt** via the n8n form trigger.\n* The images are then converted to **Base64 strings** so they can be used in an API request.\n* A multimodal payload is sent to the OpenRouter API. Gemini's image generation model is used, which takes all 3 inputs (the two images and the prompt) to understand how to compose the final image.\n* Gemini generates a new image based on the instructions and returns it as a Base64 string.\n* The workflow extracts this output string and uses a \"Convert to file\" node to convert the data back into a binary image file, ready for use.\n\n### How to use\n* First, set up your **OpenRouter API credential** in n8n.\n* Activate the workflow.\n* Open the **Production URL** for the form trigger.\n* Upload your product image, your template image, and write a descriptive prompt.\n* Submit the form to execute the workflow and generate your image.\n\n### Requirements\n* An active n8n instance.\n* An OpenRouter account and API key.\n\n### Customising this workflow\n* You can easily change the AI model by editing the JSON body in the **HTTP Request** node. OpenRouter provides access to a wide variety of models from different providers.\n* Add a final step to automatically save the generated image. You can connect nodes for services like **Google Drive, AWS S3, or Dropbox** after the \"Convert to File\" node.\n* Replace the **Form Trigger** with a **Webhook Trigger** to run this workflow programmatically from another application or service.",
  "featuredImage": "/data/workflows/8194/8194.webp",
  "author": {
    "id": 101,
    "slug": "thegrowthbolt-shivam",
    "name": "The Growth Bolt ",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 6448,
  "downloads": 644,
  "createdAt": "2025-09-02T20:55:51.976Z",
  "updatedAt": "2026-01-16T08:54:36.227Z",
  "publishedAt": "2025-09-02T20:55:51.976Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8194"
}