{
  "id": 8584,
  "slug": "8584",
  "title": "Automate funding insights with Crunchbase, Google Sheets & Airtable",
  "description": "## How it works\nThis workflow runs daily to collect the latest funding round data from Crunchbase. It retrieves up to 100 recent funding events, including company, investors, funding amount, and industry details. The data is cleaned and filtered to only include rounds announced in the last 30 days. Finally, the results are saved into both Google Sheets for reporting and Airtable for structured database management.\n\n## Step-by-step\n1. **Trigger & Data Fetching**  \n   - **Schedule Trigger node** – Runs the workflow once a day.  \n   - **HTTP Request node** – Calls the Crunchbase API to fetch the latest 100 funding rounds with relevant details.  \n\n2. **Data Processing**  \n   - **Code node** – Parses the raw API response into clean fields such as company name, funding type, funding amount, investors, industry, and Crunchbase URL.  \n   - **Filter node** – Keeps only funding rounds from the last 30 days to ensure the dataset remains fresh and relevant.  \n\n3. **Storage & Outputs**  \n   - **Google Sheets node** – Appends or updates the filtered funding records in a Google Sheet for easy sharing and reporting.  \n   - **Airtable node** – Stores the same records in Airtable for more structured, database-style organization and management.  \n\n## Why use this?\n- Automates daily collection of startup funding data from Crunchbase.  \n- Keeps only the most recent and relevant records for faster insights.  \n- Ensures data is consistently stored in both Google Sheets and Airtable.  \n- Supports reporting, collaboration, and database management in one flow.  \n",
  "featuredImage": "/data/workflows/8584/8584.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 158,
  "downloads": 15,
  "createdAt": "2025-09-15T05:02:53.280Z",
  "updatedAt": "2026-01-16T08:56:39.294Z",
  "publishedAt": "2025-09-15T05:02:53.280Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8584"
}