{
  "id": 11632,
  "slug": "11632",
  "title": "Automated product review monitoring with sentiment analysis via Decodo, Gemini & Telegram",
  "description": "\n\n## Decodo-powered review aggregation to Google Sheets with Gemini analysis and Telegram alerts\n\n### Who’s it for\n\nThis template is designed for e-commerce owners, marketplace sellers, product teams, and CX/reputation managers who need an automated way to monitor product reviews. It’s ideal for anyone tracking Amazon listings or other URLs and wants AI-powered sentiment, summaries, and alerts without manual scraping.\n\n### What it does\n\nThis workflow automatically retrieves product URLs from Google Sheets, scrapes reviews using Decodo (community node), formats the extracted data, and analyzes it using Gemini AI. It produces both sentiment classification and a concise review summary. Results are saved to a Google Sheets log, and the workflow sends a Telegram alert whenever new reviews are processed. The entire pipeline runs on a schedule, ensuring continuous and fully automated monitoring.\n\n### How it works\n- A scheduled trigger starts the workflow.\n- Google Sheets provides the list of product URLs.\n- Each URL is processed through Decodo to extract user reviews.\n- A Code node formats the raw review data.\n- Gemini performs sentiment analysis and summarization.\n- Results are appended to a Google Sheets review log.\n- A Telegram message delivers a real-time summary and sentiment snapshot.\n\n[Sign up for Decodo — get better pricing here](https://visit.decodo.com/MA90zY)\n\n### Requirements\n- Decodo API credentials (self-hosted community node)\n- Google Sheets API Key\n- Gemini AI credentials\n- Telegram Bot + Chat ID\n- n8n self-hosted (required for Decodo community node)\n\n### How to set up\n- Add your Decodo credentials to the Decodo node.\n- Update both Google Sheets nodes with your document ID and sheet names.\n- Insert your Gemini API key.\n- Provide your Telegram Bot token and Chat ID.\n- Adjust the schedule interval to your preference.\n- Run the workflow once to validate mappings and output fields.\n\n## How to customize\n\n- Modify the Code node to change how reviews are formatted.\n- Extend Gemini prompts for deeper analysis (keywords, categories, toxicity).\n- Add filters to trigger alerts only on negative sentiment.\n- Append additional metadata (timestamps, product IDs) to the Sheets log.\n- Add email, Slack, or other communication channels.\n\n### Disclaimer (Community Node)\n\nThis workflow uses a community node (Decodo) and therefore works only on self-hosted n8n instances. Be sure to install and trust the package before using it.",
  "featuredImage": "/data/workflows/11632/11632.webp",
  "author": {
    "id": 101,
    "slug": "rullysaputra15",
    "name": "Rully Saputra",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 863,
  "downloads": 86,
  "createdAt": "2025-12-09T14:59:20.848Z",
  "updatedAt": "2026-01-16T09:09:26.374Z",
  "publishedAt": "2025-12-09T14:59:20.848Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11632"
}