{
  "id": 11136,
  "slug": "11136",
  "title": "Auto-generate WordPress blog tags with GPT-4.1-mini and smart tag mapping",
  "description": "## **Overview**\n\nThis n8n template demonstrates how to use AI to automatically analyze WordPress blog content and generate relevant, SEO-optimized tags for WordPress posts.\n\n## **Use cases** \nAutomate content tagging for WordPress blogs, maintain consistent taxonomy across large content libraries, save hours of manual tagging work, or improve SEO by ensuring every post has relevant, searchable tags!\n\n## **Good to know**\n* The workflow creates new tags automatically if they don't exist in WordPress.\n* Tag generation is intelligent - it avoids duplicates by mapping to existing tag IDs.\n\n## **How it works**\n* We fetch a WordPress blog post using the WordPress node with sticky data enabled for testing.\n* The post content is sent to GPT-4.1-mini which analyzes it and generates 5-10 relevant tags using a structured output parser.\n* All existing WordPress tags are fetched via HTTP Request to check for matches.\n* A smart loop processes each AI-generated tag:\n  * If the tag already exists, it maps to the existing tag ID\n  * If it's new, it creates the tag via WordPress API\n* All tag IDs are aggregated and the WordPress post is updated with the complete tag list.\n\n## **How to use**\n* The manual trigger node is used as an example but feel free to replace this with other triggers such as webhook, schedule, or WordPress webhook for new posts.\n* Modify the \"Fetch One WordPress Blog\" node to fetch multiple posts or integrate with your publishing workflow.\n\n## **Requirements**\n* WordPress site with REST API enabled\n* OpenAI API\n\n## **Customising this workflow**\n* Adjust the AI prompt to generate tags specific to your industry or SEO strategy\n* Change the tag count (currently 5-10) based on your needs\n* Add filtering logic to only tag posts in specific categories",
  "featuredImage": "/data/workflows/11136/11136.webp",
  "author": {
    "id": 101,
    "slug": "bhavyshekhaliya",
    "name": "Bhavy Shekhaliya",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 180,
  "downloads": 18,
  "createdAt": "2025-11-22T15:03:25.071Z",
  "updatedAt": "2026-01-16T09:07:43.134Z",
  "publishedAt": "2025-11-22T15:03:25.071Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11136"
}