{
  "id": 2321,
  "slug": "2321",
  "title": "Automate Your RFP Process with OpenAI Assistants",
  "description": "This n8n workflow demonstrates how to automate oftern time-consuming form filling tasks in the early stages of the tendering process; the Request for Proposal document or \"RFP\".\n\nIt does this by utilising a company's knowledgebase to generating question-and-answer pairs using Large Language Models.\n\n## How it works\n* A buyer's RFP is submitted to the workflow as a digital document that can be parsed.\n* Our first AI agent scans and extracts all questions from the document into list form.\n* The supplier sets up an [OpenAI assistant](https://platform.openai.com/docs/assistants/overview) prior loaded with company brand, marketing and technical documents.\n* The workflow loops through each of the buyer's questions and poses these to the OpenAI assistant.\n* The assistant's answers are captured until all questions are satisified and are then exported into a new document for review.\n* A sales team member is then able to use this document to respond quickly to the RFP before their competitors.\n\n## Example Webhook Request\n\n```\ncurl --location 'https://&lt;n8n_webhook_url&gt;' \\\n--form 'id=\"RFP001\"' \\\n--form 'title=\"BlueChip Travel and StarBus Web Services\"' \\\n--form 'reply_to=\"jim@example.com\"' \\\n--form 'data=@\"k9pnbALxX/RFP Questionnaire.pdf\"'\n```\n\n## Requirements\n* An OpenAI account to use AI services.\n\n## Customising the workflow\n\nOpenAI assistants is only one approach to hosting a company knowledgebase for AI to use. Exploring different solutions such as building your own RAG-powered database can sometimes yield better results in terms of control of how the data is managed and cost.",
  "featuredImage": "/data/workflows/2321/2321.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 10812,
  "downloads": 1081,
  "createdAt": "2024-07-09T10:40:35.836Z",
  "updatedAt": "2026-01-16T08:24:00.343Z",
  "publishedAt": "2024-07-09T10:40:35.836Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2321"
}