{
  "id": 2465,
  "slug": "2465",
  "title": "Building your first WhatsApp chatbot",
  "description": "This n8n template builds a simple WhatsApp chabot acting as a Sales Agent. The Agent is backed by a product catalog vector store to better answer user's questions.\n\nThis template is intended to help introduce n8n users interested in building with WhatsApp.\n\n## How it works\n* This template is in 2 parts: creating the product catalog vector store and building the WhatsApp AI chatbot.\n* A product brochure is imported via HTTP request node and its text contents extracted.\n* The text contents are then uploaded to the in-memory vector store to build a knowledgebase for the chatbot.\n* A WhatsApp trigger is used to capture messages from customers where non-text messages are filtered out.\n* The customer's message is sent to the AI Agent which queries the product catalogue using the vector store tool.\n* The Agent's response is sent back to the user via the WhatsApp node.\n\n## How to use\n\nOnce you've setup and configured your WhatsApp account and credentials\n* First, populate the vector store by clicking the \"Test Workflow\" button.\n* Next, activate the workflow to enable the WhatsApp chatbot.\n* Message your designated WhatsApp number and you should receive a message from the AI sales agent.\n* Tweak datasource and behaviour as required.\n\n## Requirements\n* WhatsApp Business Account\n* OpenAI for LLM\n\n## Customising this workflow\n\n* Upgrade the vector store to [Qdrant](https://qdrant.tech) for persistance and production use-cases.\n* Handle different WhatsApp message types for a more rich and engaging experience for customers.",
  "featuredImage": "/data/workflows/2465/2465.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 443048,
  "downloads": 44304,
  "createdAt": "2024-10-17T10:20:43.714Z",
  "updatedAt": "2026-01-16T08:24:55.976Z",
  "publishedAt": "2024-10-17T10:20:43.714Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2465"
}