{
  "id": 7936,
  "slug": "7936",
  "title": "Automate birthday discount emails for e-commerce using Google Sheets and Gmail",
  "description": "# ⚙ **How It Works & Setup Steps: Automated Birthday Discount**\n\n---\n\n## **How It Works**\n\nThis workflow is a powerful yet simple automation to delight your customers on their birthdays. It runs every day on a schedule you define and automatically pulls data from your customer list on Google Sheets. The workflow then checks to see if any customer has a birthday on the current day. If a match is found, it generates a unique discount code and sends a personalized, celebratory email with the code directly to the customer. This ensures no birthday is ever missed, fostering customer loyalty and driving sales with zero manual effort.\n\n---\n\n## **Setup Steps**\n\nFollow these steps to get the workflow running in your n8n instance and start sending automated birthday discounts.\n\n## **1. Prerequisites**\nYou will need a working n8n instance and a few key accounts:\n* **Google Sheets:** To store your customer data, including their email address and birthday. The birthday column should be formatted as **`MM-dd`** (e.g., `08-27`).\n* **Gmail:** To send the personalized birthday emails to your customers.\n\n## **2. Workflow Import**\nImport the provided workflow JSON into your n8n canvas. All the necessary nodes will appear on your canvas, ready for configuration.\n\n## **3. Configure Credentials**\nConnect the following credentials to their respective nodes:\n* **Google Sheets:** Connect your Google account to the **`Get Customer Data`** node.\n* **Gmail:** Connect your Gmail account to the **`Send Birthday Email`** node.\n\n## **4. Customize the Workflow**\n1.  **`Get Customer Data`:**\n    * Enter the **`Spreadsheet ID`** and **`Sheet Name`** of your Google Sheet containing the customer data.\n2.  **`Is It Their Birthday?`:**\n    * This node compares the customer's birthday column with the current date. Ensure `{{ $json.birthday }}` matches the exact name of your birthday column in Google Sheets.\n3.  **`Generate Discount Code`:**\n    * This node is pre-configured to create a simple unique code. For an e-commerce platform (like Shopify or WooCommerce), you will need to replace this node with the specific API call to generate a valid coupon code in your system.\n4.  **`Send Birthday Email`:**\n    * Enter your sender email in the **`From Email`** field.\n    * Customize the **`Subject`** and **`Message`** with your own text and branding to make it personal. The `{{ $json.name }}` and `{{ $json.discountCode }}` expressions will automatically pull the correct customer name and generated code.\n\n## **5. Activate the Workflow**\nOnce all configurations are complete, click **\"Save\"** and then **\"Active\"**. The workflow is now live and will automatically run every morning to send out birthday wishes!",
  "featuredImage": "/data/workflows/7936/7936.webp",
  "author": {
    "id": 101,
    "slug": "marth",
    "name": "Marth",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 294,
  "downloads": 29,
  "createdAt": "2025-08-27T07:16:29.555Z",
  "updatedAt": "2026-01-16T08:53:07.533Z",
  "publishedAt": "2025-08-27T07:16:29.555Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7936"
}