{
  "id": 11780,
  "slug": "11780",
  "title": "Aggregate & update documentation from Slack, Teams & GitHub with Claude Sonnet 4.5",
  "description": "## How It Works\nAggregates communication data from Slack, Microsoft Teams, Gmail, GitHub, and Confluence into a single, unified AI-powered analysis workflow designed for quality review and automated documentation updates. This solution is specifically aimed at teams managing distributed content and knowledge workflows across multiple platforms. It addresses the challenges of fragmented communication and isolated information silos that often prevent rapid content review and timely decision-making. The workflow begins with a scheduled trigger, followed by multi-source data collection, merging and normalizing inputs, Claude AI-powered analysis, validation and quality checks, formatting, and finally publishing updates to Notion and Confluence, accompanied by Slack notifications to ensure stakeholders are promptly informed.\n\n## Setup Steps\n-Connect credentials: Slack API, Teams, Gmail OAuth, GitHub PAT. \n-Confluence API, Anthropic API key, Notion Integration. \n-Configure monitored channels/repositories. \n-Set schedule frequency. \n-Map output destinations (Notion/Confluence). \n-Test merged output before enabling automation.\n\n## Prerequisites\nSlack workspace, Teams account, Gmail access, GitHub repository, Confluence space, Anthropic API key, Notion workspace, n8n instance.\n\n## Use Cases\nContent review teams processing feedback, documentation teams aggregating updates, QA teams reviewing communications \n\n## Customization\nAdd/remove source nodes, adjust Claude prompts for analysis type, modify output destinations \n\n## Benefits\nSaves 6+ hours weekly, eliminates missed content, AI-driven quality assurance \n\n\n",
  "featuredImage": "/data/workflows/11780/11780.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 58,
  "downloads": 5,
  "createdAt": "2025-12-14T09:20:13.289Z",
  "updatedAt": "2026-01-16T09:10:03.946Z",
  "publishedAt": "2025-12-14T09:20:13.289Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11780"
}