{
  "id": 9782,
  "slug": "9782",
  "title": "AI-powered customer feedback analysis & routing for Gmail, Zendesk, Slack & Pipedrive",
  "description": "## Who's it for\nThis workflow is for Customer Success, Product, and Support teams who need to centralize and analyze unstructured customer feedback. It automates the process of identifying key themes from various communication channels, allowing you to proactively address issues, track feature requests, and understand the voice of the customer without manual effort.\n\n## What it does\nThis workflow uses a powerful chain of AI agents to process customer feedback from end to end. It begins by using a Data Agent to gather all recent customer interactions from multiple sources, including Gmail, Pipedrive, Zendesk, and Slack.\n\nOnce the raw data is collected, a second AI Chain reads all the text and compresses it into concise, actionable \"signals.\" A third AI Chain then takes these signals and intelligently clusters them into shared topics, assigning each a human-readable label like \"Billing,\" \"Performance,\" or \"Feature Request.\"\n\nFinally, a fourth AI Agent acts as a dispatcher. It analyzes the clustered topics and follows a set of routing rules defined in its prompt to take the appropriate action. It uses its tools to automatically create a Zendesk ticket for product feedback, send a Slack message for billing issues, create a Notion page for training opportunities, or send a direct email alert for high-risk accounts.\n\n## How to set up\nTo get this workflow running, you will need to configure the credentials and parameters for the following nodes:\n1.  **Configure Credentials:** Add your credentials for the `Config: Set LLM for Agents` node and all of the Tool nodes (`Gmail`, `Pipedrive`, `Zendesk`, `Slack`, and `Notion`).\n2.  **Set Initial Parameters:** In the `Set: Initial Parameters` node, update the placeholder email address and the Slack channel name for billing alerts.\n3.  **Update Slack Search Channel:** In the `Tool: Search Slack Messages` node, set the channel you want the agent to search for feedback in.\n4.  **Activate Workflow:** Once configured, you can run the workflow manually to start the analysis.\n\n## Requirements\n- An account with an LLM provider, such as OpenAI.\n- Accounts for the services you wish to connect (Gmail, Pipedrive, Zendesk, Slack, Notion).\n- This workflow requires n8n's Langchain community nodes to be installed on your instance.\n\n## How to customize the workflow\nThis workflow's logic is primarily driven by AI prompts, making it highly customizable:\n- **AI Prompts:** Adjust the prompts in any of the `AI Agent` or `AI Chain` nodes to change the data gathering, analysis, clustering, or routing rules to fit your business needs.\n- **Data Sources:** Add, remove, or swap out the \"Tool\" nodes in the `AI Agent: Gather Customer Feedback` section to connect to different data sources like Intercom, Salesforce, or a database.\n- **Triggers:** Replace the `Manual Trigger` with a `Schedule Trigger` to run the analysis automatically on a daily or weekly basis.",
  "featuredImage": "/data/workflows/9782/9782.webp",
  "author": {
    "id": 101,
    "slug": "Pollup",
    "name": "PollupAI",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 54,
  "downloads": 5,
  "createdAt": "2025-10-16T13:51:11.955Z",
  "updatedAt": "2026-01-16T09:01:53.965Z",
  "publishedAt": "2025-10-16T13:51:11.955Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9782"
}