{
  "id": 4382,
  "slug": "4382",
  "title": "Automated website change monitoring with Bright Data, GPT-4.1 & Google Workspace",
  "description": "![Wispr_Flow_mxokqGw8g8.png](fileId:1379)\n**Note: This template is for self-hosted n8n instances only**\n\nYou can use this workflow to fully automate website content monitoring and change detection on a weekly basis—even when there’s no native node for scraping or structured comparison. It uses an AI-powered scraper, structured data extraction, and integrates Google Sheets, Drive, Docs, and email for seamless tracking and reporting.\n\n## Main Use Cases\n\n- Monitor and report changes to websites (e.g., pricing, content, headings, FAQs) over time\n- Automate web audits, compliance checks, or competitive benchmarking\n- Generate detailed change logs and share them automatically with stakeholders\n\n## How it works\n\nThe workflow operates as a scheduled process, organized into these stages:\n\n### 1. Initialization & Configuration\n\n- Triggers weekly (or manually) and initializes key variables: Google Drive folder, spreadsheet IDs, notification emails, and test mode.\n\n### 2. Input Retrieval\n\n- Reads the list of URLs to be monitored from a Google Sheet.\n\n### 3. Web Scraping & Structuring\n\n- For each URL, an AI agent uses [Bright Data's](https://brightdata.com/) `scrape_as_markdown` tool to extract the full web page content.\n- The workflow then parses this content into a well-structured JSON, capturing elements like metadata, headings, pricing, navigation, calls to action, contacts, banners, and FAQs.\n\n### 4. Saving Current Week’s Results\n\n- The structured JSON is saved to Google Drive as the current week’s snapshot for each monitored URL.\n- The Google Sheet is updated with file references for traceability.\n\n### 5. Comparison with Previous Snapshot\n\n- If a prior week’s file exists, it is downloaded and parsed.\n- The workflow compares the current and previous JSON snapshots, detecting and categorizing all substantive content changes (e.g., new/updated plans, FAQ edits, contact info modifications).\n- Optionally, in test mode, mock changes are introduced for demo and validation purposes.\n\n### 6. Change Report Generation & Delivery\n\n- A rich Markdown-formatted changelog is generated, summarizing the detected changes, and then converted to HTML.\n- The changelog is uploaded to Google Docs and linked back to the tracking sheet.\n- An HTML email with the full report and relevant links is sent to recipients.\n\n---\n\n**Summary Flow:**\n\n1. Schedule/workflow trigger → initialize variables\n2. Read URL list from spreadsheet\n3. For each URL:\n    - Scrape & structure as JSON\n    - Save to Drive, update tracking sheet\n    - If previous week exists:\n        - Download & parse previous\n        - Compare, generate changelog\n        - Convert to HTML, save to Docs, update Sheet\n        - Email results\n\n---\n\n**Benefits:**\n\n- Fully automated website change tracking with end-to-end reporting\n- Adaptable and extensible for any set of monitored pages and content types\n- Easy integration with Google Workspace tools for collaboration and storage\n- Minimal manual intervention required after initial setup\n\n",
  "featuredImage": "/data/workflows/4382/4382.webp",
  "author": {
    "id": 101,
    "slug": "tomax",
    "name": "Daniel Shashko",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 866,
  "downloads": 86,
  "createdAt": "2025-05-25T11:58:15.627Z",
  "updatedAt": "2026-01-16T08:34:06.191Z",
  "publishedAt": "2025-05-25T11:58:15.627Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4382"
}