{
  "id": 4404,
  "slug": "4404",
  "title": "One-way sync between Telegram, Notion, Google Drive, and Google Sheets",
  "description": "# One-way sync between Telegram, Notion, Google Drive, and Google Sheets\n\n## Who is this for?\n\nThis workflow is perfect for productivity-focused teams, remote workers, virtual assistants, and digital knowledge managers who receive documents, images, or notes through Telegram and want to automatically organize and store them in Notion, Google Drive, and Google Sheets—without any manual work.\n\n## What problem is this workflow solving?\n\nManaging Telegram messages and media manually across different tools like Notion, Drive, and Sheets can be tedious. This workflow automates the classification and storage of incoming Telegram content, whether it’s a text note, an image, or a document. It saves time, reduces human error, and ensures that media is stored in the right place with metadata tracking.\n\n## What this workflow does\n\n- **Triggers on a new Telegram message** using the Telegram Trigger node.\n- **Classifies the message type** using a Switch node:\n  - Text messages are appended to a Notion block.\n  - Images are converted to base64, uploaded to imgbb, and then added to Notion as toggle-image blocks.\n  - Documents are downloaded, uploaded to Google Drive, and the metadata is logged in Google Sheets.\n- **Sends a completion confirmation** back to the original Telegram chat.\n\n## Setup\n\n1. **Telegram Bot**: Set up a bot and get the API token.\n2. **Notion Integration**:\n   - Share access to your target Notion page/block.\n   - Use the Notion API credentials and block ID where content should be appended.\n3. **Google Drive & Sheets**:\n   - Connect the relevant accounts.\n   - Select the destination folder and spreadsheet.\n4. **imgbb API**: Obtain a free API key from [imgbb](https://api.imgbb.com/).\n\nReplace placeholder credential IDs and asset URLs as needed in the imported workflow.\n\n## How to customize this workflow to your needs\n\n- **Change Storage Locations**:\n  - Update the Notion block ID or Google Drive folder ID.\n  - Switch Google Sheet to log in a different file or sheet.\n- **Add More Filters**:\n  - Use additional Switch rules to handle other Telegram message types (like videos or voice messages).\n- **Modify Response Message**:\n  - Personalize the Telegram confirmation text based on the file type or sender.\n- **Use a different image hosting service** if you don’t want to use imgbb.\n",
  "featuredImage": "/data/workflows/4404/4404.webp",
  "author": {
    "id": 101,
    "slug": "lakshit1996",
    "name": "Lakshit Ukani",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 9553,
  "downloads": 955,
  "createdAt": "2025-05-26T13:36:26.445Z",
  "updatedAt": "2026-01-16T08:34:13.867Z",
  "publishedAt": "2025-05-26T13:36:26.445Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4404"
}