{
  "id": 11264,
  "slug": "11264",
  "title": "Create and manage ERC-20 tokens with a Telegram bot and 1Shot API wallets",
  "description": "![image.png](fileId:3483)\n\n## Launch ERC-20 Tokens with Telegram Bot and 1Shot API Custodial Wallets\n\nFind the full walk-through tutorial video for this workflow on [YouTube](https://youtu.be/bKRvt2DuVKA?si=u_Myb07cxyDvlFtx). \n\nThis Telegram bot template demonstrates some useful patterns for creating crypto-powered multi-user bot applications like: \n\n- How to create custodial wallets tied to specific telegram users. \n- How submit onchain transactions from a specific user's wallet when they interact with your bot.\n- Storing transaction logs in n8n data tables\n- Settings up inline keyboards for use triggering specific onchain actions.\n\nStarting with this workflow, you can extend it for many different crypto/onchain applications as well as introduce fees to generate revenue in return for performing onchain actions for your users. \n\nNOTE: This is somewhat advanced setup as it requires the use of datatables, you will need to self-host this workflow.\n\n![image.png](fileId:3463)\n\n## Setup\n\nYou'll need to perform the following steps to get this Telegram bot workflow up and running:\n\n1. Create a free [1Shot API](https://1shotapi.com) account & generate an API Key & Secret. Use the API credentials to authenticate the 1Shot API nodes.\n2. Create a new Telegram bot using the [@BotFather](https://t.me/BotFather) bot to get an api key. Use the bot API key to authenticate the Telegram nodes.\n3. Create a two Data Tables in your n8n account: `User Table` & `Token Table`. The `User Table` should have `chatid`, `wallet` and `walletid` as columns. The `Token Table` should have `wallet`, `token`, `name` and `chatid` as columns. These tables are used to the mappings between your bot users and their wallets and tokens. \n4. Import the 1Shot API Token Factory contract into your 1Shot API account. This smart contract is needed to deploy ERC-20 tokens on behalf of your bot users. \n\nYou can also watch the associated [YouTube](https://youtu.be/bKRvt2DuVKA?si=u_Myb07cxyDvlFtx) tutorial for a step-by-step walkthrough of these points.\n\n\n",
  "featuredImage": "/data/workflows/11264/11264.webp",
  "author": {
    "id": 101,
    "slug": "oneshotapi",
    "name": "1Shot API",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2025-11-26T21:53:25.235Z",
  "updatedAt": "2026-01-16T09:08:10.685Z",
  "publishedAt": "2025-11-26T21:53:25.235Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11264"
}