{
  "id": 4646,
  "slug": "4646",
  "title": "Rank Math bulk title & description optimizer for WordPress",
  "description": "# Bulk WordPress SEO Meta Optimizer with Rank Math & AI\n\nThis n8n workflow, along with its companion WordPress plugin (`rank_math_tools.zip`), automates the bulk optimization of your WordPress posts' Rank Math SEO titles and descriptions using AI. \n\nStop manually crafting metas and let AI supercharge your SEO efforts efficiently!\n\n[free version here.](https://n8n.io/workflows/2836-automate-rank-math-seo-field-updates-for-posts-and-products/)\n\n**How it works:**\n\nThis workflow streamlines your SEO process through several automated steps:\n\n* **Fetches Post IDs:** Retrieves all published post IDs from your WordPress site using a secure, custom API endpoint provided by the companion plugin.\n* **Gathers Post Content:** For each identified post, it accesses the existing title, slug, and main rendered content to provide context for the AI.\n* **AI-Powered Meta Generation:** Leverages an AI model of your choice via OpenRouter (defaulting to Claude 3.7 Sonnet) to generate an optimized SEO title and meta description. This generation is guided by a detailed, customizable prompt within the \"Create Meta Infos\" node, allowing you to define the style, tone, and SEO strategy.\n* **Updates WordPress Metas:** Sends the newly generated SEO title and description back to your WordPress site via another custom API endpoint. The companion plugin then updates the specific Rank Math fields for each post.\n* **Refreshes Modified Date:** The companion plugin automatically updates the post's 'last modified' date in WordPress whenever meta information is changed, which can be a positive signal for search engines.\n* **Selective Processing:** An \"IF\" node (\"Should I Rewrite\") intelligently determines whether a post's metas need updating based on predefined conditions (e.g., empty metas or placeholder content), optimizing resource usage.\n\n**Setup Steps:**\n\nGet up and running in approximately 15-25 minutes by following these high-level steps. Detailed instructions are available in the comprehensive documentation provided with your purchase and within the sticky notes inside the n8n workflow itself.\n\n1.  **Install the Companion WordPress Plugin:**\n    * Download the `rank_math_tools.zip` file.\n    * Upload and activate it on your WordPress site.\n    * *(Estimated time: 2-5 minutes)*\n2.  **Configure WordPress API Authentication:**\n    * In your WordPress admin area, go to your user profile and create a new Application Password.\n    * Ensure the user has at least an \"Editor\" role.\n    * Copy the generated password.\n    * *(Estimated time: 2-5 minutes)*\n3.  **Set Up n8n Credentials:**\n    * In n8n, create a new \"WordPress API\" credential using your WordPress username, the Application Password you just copied, and your site's Base URL.\n    * Create a new \"OpenRouter Api\" credential using your OpenRouter API key.\n    * *(Estimated time: 5-10 minutes, assuming you have your OpenRouter key ready)*\n4.  **Import and Configure the n8n Workflow:**\n    * Download the `Bulk_Wordpress_Meta_Data_Optimizer_Gumroad.json` workflow file.\n    * Import it into your n8n instance.\n    * Link your newly created WordPress and OpenRouter credentials to the respective nodes in the workflow.\n    * Verify and update your WordPress site URL in the \"settings\" node (ensure it has a trailing slash `/`).\n    * Review the \"Limit\" node – it's pre-set to process only 5 items for safe initial testing.\n    * *(Estimated time: 5-10 minutes)*\n\n**Benefits:**\n\n* **Full SEO Meta Automation:** Drastically reduce manual effort by automatically generating and updating SEO titles and descriptions for all your posts.\n* **Bulk Processing Power:** Efficiently handle meta optimization for hundreds or thousands of WordPress posts.\n* **Highly Customizable AI Output:** Fine-tune the AI's generation style, keyword focus, and direct response techniques by editing the detailed prompt within the \"Create Meta Infos\" node.\n* **Improved SEO Consistency & Quality:** Ensure all your articles have relevant, compelling, and optimized meta tags, adhering to best practices.\n* **Signal Freshness to Search Engines:** The automatic update of the post 'last modified' date upon meta change can help improve crawl frequency and SEO.\n* **Resource-Efficient Updates:** The \"Should I Rewrite\" node prevents unnecessary processing and API calls for posts that already have satisfactory meta information.\n* **Save Time & Focus on Content:** Free up valuable time to concentrate on creating great content, rather than on repetitive SEO tasks.\n\n---\n\nTo understand exactly how to use and customize this workflow in detail, please refer to the comprehensive step-by-step documentation provided with your purchase.\n\nFor professional n8n automation services for your business, contact:\n[Phil | Inforeole](https://inforeole.fr)",
  "featuredImage": "/data/workflows/4646/4646.webp",
  "author": {
    "id": 101,
    "slug": "phil",
    "name": "phil",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 660,
  "downloads": 66,
  "createdAt": "2025-06-04T10:29:55.157Z",
  "updatedAt": "2026-01-16T08:35:31.224Z",
  "publishedAt": "2025-06-04T10:29:55.157Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4646"
}