{
  "id": 8257,
  "slug": "8257",
  "title": "Automate Instagram reel downloads with Google Drive storage & Telegram alerts",
  "description": "## Instagram Reel Downloader & Logger\nAutomate Instagram Reel Downloads, Storage, and Activity Logging\n\n### What does this workflow do?\n\n- Handles incoming webhook requests (ideal for Instagram/Facebook API triggers).\n- Validates the webhook via challenge-response and custom verify token.\n- Checks for messages from yourself (filtering automated/self-triggered runs).\n- Downloads Instagram Reels from URLs posted to the webhook.\n- Uploads the reel to Google Drive and retrieves the download URL.\n- Logs reel details (status, URL, and timestamp) to a Google Sheet for record-keeping.\n- Notifies you on Telegram with the download details and Google Drive link.\n\n### How does it work?\n\n- Webhook: Listens for new messages/events (custom webhook endpoint for Meta).\n- Validation: Confirms webhook subscribe/challenge and verify token from Meta API.\n- Sender Check: Ignores messages unless they match your configured sender/recipient.\n- Download Reel: Fetches the reel/attachment from Instagram using received URLs.\n- Timestamp Gen: Adds a precise timestamp and ISO-based unique ID to the activity log.\n- Upload to Drive: Saves the downloaded reel in a preset Google Drive folder.\n- Log to Sheet: Updates a Google Sheet with the reel’s status, URL, and timestamp.\n- Telegram Alert: Instantly notifies you when a new reel is downloaded and logged.\n\n### What do I need to make this work?\n\n- A registered webhook endpoint (from your Meta/Instagram app configuration). \n- A Google Drive and Google Sheets account (OAuth2 connected to n8n).\n- A Telegram Bot and Chat ID setup to receive download completion messages.\n- The correct verify_token in your webhook event source matches your template (‘youtube-automation-n8n-token’ by default).\n- Update your Drive/Sheet/Bot credentials as per your n8n instance’s environment.\n\n### Why use this?\n\n- Fully automates the collection and archival of Instagram Reels.\n- Centralizes content download, backup, and activity records for your automation flows.\n- Provides instant monitoring and archival of each event.\n\n### Setup Tips:\n\n- Make sure your webhook path and Meta app configuration match (/n8n-template-insta-webhook).\n- Double-check the Google credentials and the sheet’s tab IDs/names.\n- Replace the Telegram and Google connection credentials with your own securely.\n\nUse this as a foundation for any Instagram/Facebook-based automations in n8n,\nand customize as your automation stack evolves!\n\nPublish confidently, and let users know this template:\n\nSaves time, automates digital content management, and notifies users in real-time.",
  "featuredImage": "/data/workflows/8257/8257.webp",
  "author": {
    "id": 101,
    "slug": "shindearyan",
    "name": "Aryan Shinde",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 915,
  "downloads": 91,
  "createdAt": "2025-09-04T14:33:02.924Z",
  "updatedAt": "2026-01-16T08:54:58.232Z",
  "publishedAt": "2025-09-04T14:33:02.924Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8257"
}