{
  "id": 7930,
  "slug": "7930",
  "title": "Automated crypto news digest to Telegram with RSS feeds and GPT-4",
  "description": "What this template does\n\nCollects the latest crypto news from multiple RSS feeds, filters and deduplicates them, uses OpenAI GPT-4 to analyze and select the top stories, translates and formats them into Russian, and posts a digest to a Telegram channel or group. The workflow runs automatically on a schedule and ensures all messages fit Telegram’s 4096-character limit.\n\nHow it works (high level)\n\nRSS Sources: Reads fresh items from CoinDesk, Cointelegraph, Decrypt, Cryptobriefing, and Nulltx.\n\nFilter & Deduplicate: Keeps only unique items from the last 24 hours.\n\nAI Analysis (Crypto Analyst): An OpenAI agent identifies the most important events and selects the best article for each.\n\nAI Formatting (SMM Editor): Another OpenAI agent writes a styled digest in Russian with Telegram-compatible HTML formatting.\n\nMessage Preparation: Long texts are split into safe chunks ≤ 4096 characters.\n\nTelegram Post: The digest is posted automatically to your configured Telegram channel or group.\n\nPrerequisites\n\nn8n Cloud or n8n &gt;= 1.107.4\n\nCredentials:\n\nOpenAI (gpt-4o-mini or gpt-4.1-mini)\n\nTelegram Bot with rights to post in your target chat\n\nSetup (5 minutes)\n\nImport this workflow into n8n.\n\nOpen the Telegram node “Post to Group” and set your chatId (e.g., @your_channel or numeric ID).\n\nConnect your OpenAI and Telegram credentials.\n\n(Optional) Adjust the Scheduler interval (default: every 3 hours).\n\nRun once manually to test, then activate.\n\nCustomization\n\nAdd or replace RSS sources.\n\nModify the prompts in Crypto Analyst and SMM Editor to adapt tone, style, or language.\n\nSwap out the Telegram node to publish on other platforms (Slack, Discord, etc.).![Telegram News Templates.png](fileId:2209)",
  "featuredImage": "/data/workflows/7930/7930.webp",
  "author": {
    "id": 101,
    "slug": "zodiac",
    "name": "Ivan Maksiuta",
    "avatar": ""
  },
  "categories": [
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1348,
  "downloads": 134,
  "createdAt": "2025-08-27T05:54:04.522Z",
  "updatedAt": "2026-01-16T08:53:04.842Z",
  "publishedAt": "2025-08-27T05:54:04.522Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7930"
}