{
  "id": 5712,
  "slug": "5712",
  "title": "Automated stock news alerts with Google RSS, Gemini & Telegram notifications",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n## 🎯 Purpose\nThis workflow helps you automatically monitor stock related news, extract the main content, summarize it using a LLM (via OpenRouter), and send real time alerts to Telegram and store them in Google Sheets.\n\n## ⚙️ How It Works\n### Trigger\n- A Cron node triggers the workflow every 15 minutes (adjustable).\n- RSS Feed node checks latest articles from Google Alerts RSS.\n- The workflow filters duplicates using Google Sheets as a log.\n- The article URL is sent to Jina AI Readability API to extract the main body text.\n- The content is summarized using a model from OpenRouter (e.g., Gemini, Claude, GPT-4).\n- You can customize the prompt to suit your tone and analysis needs.\n- The result is appended to a Google Sheets file.\n- Sends the title, summary, and reccomendation to Telegram chat.\n\n**🧾 Google Sheets Template**\nCreate a Google Sheet using this template: [Stock Alert](https://docs.google.com/spreadsheets/d/109kj97ABR37XviIpxARCFviZwq8opOoe--rayOeFDSo/edit?usp=sharing)\n\n## 🧰 Requirements\n- Telegram Bot + your Chat ID\n- OpenRouter account and API key\n- Jina AI account for content extraction\n- Google Account with access to Google Sheets\n- Google Alerts RSS feed\n\n## 🛠 Setup Instructions\n- Install required credentials:\n  - Add OpenRouter API key to n8n credentials.\n  - Add Telegram Bot Token and Chat ID.\n  - Add Google Sheets credentials.\n  - Add Jina AI credentials.\n- Create or copy the Google Sheet using the link above.\n- Go to Google Alerts, create alerts, and copy the RSS feed URL.\n- Replace placeholder API keys and URLs.\n- Adjust Telegram Chat ID.\n\n## 🔐 Security Note\nAll sensitive credentials (e.g., API keys, personal chat IDs) have been removed from this template. Please replace them using the n8n credentials manager before activating the workflow.",
  "featuredImage": "/data/workflows/5712/5712.webp",
  "author": {
    "id": 101,
    "slug": "budisj",
    "name": "Budi SJ",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1661,
  "downloads": 166,
  "createdAt": "2025-07-06T09:35:51.280Z",
  "updatedAt": "2026-01-16T08:41:03.648Z",
  "publishedAt": "2025-07-06T09:35:51.280Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5712"
}