{
  "id": 9089,
  "slug": "9089",
  "title": "Predict housing prices with a simple neural network",
  "description": "# Predict Housing Prices with a Neural Network\n\nThis n8n template demonstrates how a simple Multi-Layer Perceptron (MLP) neural network can predict housing prices. The prediction is based on four key features, processed through a three-layer model.\n\n### Input Layer\nReceives the initial data via a webhook that accepts four query parameters.\n\n### Hidden Layer\nComposed of two neurons. Each neuron calculates a weighted sum of the inputs, adds a bias, and applies the ReLU activation function.\n\n### Output Layer\nContains one neuron that calculates the weighted sum of the hidden layer's outputs, adds its bias, and returns the final price prediction.\n\n## Setup\nThis template works out-of-the-box and requires no special configuration or prerequisites. Just import the workflow to get started.\n\n## How to Use\nTrigger this workflow by sending a GET request to the webhook endpoint. Include the house features as query parameters in the URL.\n\nEndpoint: `/webhook/regression/house/price`\n\n### Query Parameters\n- `square_feet`: The total square footage of the house.\n- `number_rooms`: The total number of rooms.\n- `age_in_years`: The age of the house in years.\n- `distance_to_city_in_km`: The distance to the nearest city center in kilometers.\n\n### Example\nHere’s an example curl request for a 1,500 sq ft, 3-room house that is 10 years old and 5 km from the city.\n\n#### Request\n\n```\ncurl \"https://your-n8n-instance.com/webhook/regression/house/price?square_feet=1500&number_rooms=3&age_in_years=10&distance_to_city_in_km=5\"\n```\n\n### Response\n\n```\nJSON\n\n{\n    \"price\": 53095.832123960805\n}\n```",
  "featuredImage": "/data/workflows/9089/9089.webp",
  "author": {
    "id": 101,
    "slug": "sspaniel",
    "name": "Sean Spaniel",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 327,
  "downloads": 32,
  "createdAt": "2025-09-30T01:50:00.625Z",
  "updatedAt": "2026-01-16T08:58:58.164Z",
  "publishedAt": "2025-09-30T01:50:00.625Z",
  "nodes": 43,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9089"
}