{
  "id": 11594,
  "slug": "11594",
  "title": "Creating consistent character videos with Veo 3.1, GPT-4o, and Google NanoBanana",
  "description": "**This n8n template demonstrates how to create consistent character videos using AI image and video generation. The workflow generates photorealistic videos featuring the same character across different poses, locations, and outfits, maintaining perfect character consistency throughout cinematic transitions.**\n\n**Use cases are many:** Create consistent character content for social media, generate cinematic videos for brand campaigns, produce lifestyle content with the same character, automate video content creation for TikTok/Instagram, create character-based storytelling videos, or scale video production with consistent visual identity!\n\n### **Good to know**\n\n- The workflow maintains perfect character consistency across frames using reference images\n- Uses multiple AI services: GPT-4o for prompt generation, Google Nano Banana Edit for image generation, and Veo 3.1 for video creation\n- Features 100 unique locations (beaches, cities, cafes, rooftops, etc.) and 15 different poses\n- KIE.AI pricing: Check current rates for Veo 3.1 and Nano Banana Edit models\n- Processing time: ~5-10 minutes per complete video (depends on AI service queue)\n- Output format: 9:16 aspect ratio videos optimized for TikTok/Instagram\n- Automatically generates social media content (titles, descriptions, hashtags) using GPT-4o\n- Includes AI disclosure labels for TikTok compliance\n\n### **How it works**\n\n1. **Location & Pose Selection:** Randomly selects one location from 100 options and 3 unique poses from 15 options\n2. **AI Story Creation:** GPT-4o generates cinematic prompts for first frame, last frame, and video motion while maintaining character identity from reference images\n3. **Start Frame Generation:** Google Nano Banana Edit creates the first frame image with character in initial pose, location, and outfit\n4. **End Frame Generation:** Nano Banana Edit generates the final frame using start frame as reference, changing only pose/expression while maintaining consistency\n5. **Video Generation:** Veo 3.1 creates smooth cinematic video transition between frames with natural character movement\n6. **Content Creation:** GPT-4o generates engaging title, description, and hashtags for social media\n7. **Auto-Publishing:** Automatically posts to TikTok (with AI disclosure) and Instagram, plus sends previews via Telegram\n\nThe workflow ensures the same character appears in both frames with identical facial features, hair, skin tone, and overall appearance, while only pose and expression change. The video features dynamic camera movements (arc shots, dolly pushes, crane rises, etc.) for cinematic quality.\n\n### **How to use**\n\n1. **Setup Credentials:** Configure OpenAI API, KIE.AI API, Blotato API, and Telegram Bot credentials\n2. **Add Reference Images:** Update the 5 reference image URLs in the \"Create Start Frame\" node with your character images\n3. **Configure Social Media:** Set up Blotato accounts for TikTok and Instagram posting\n4. **Set Telegram Chat ID:** Replace `YOUR_TELEGRAM_CHAT_ID` with your Telegram chat ID for previews\n5. **Deploy Workflow:** Import the template and activate the workflow\n6. **Trigger Generation:** Use the schedule trigger (default: every 6 hours) or replace with manual/webhook trigger\n7. **Receive Content:** Get previews via Telegram and published posts on TikTok & Instagram\n\n**Pro tip:** The workflow uses 5 reference images to maintain character consistency. For best results, use clear, high-quality photos of your character from different angles. The workflow automatically handles character identity preservation across all generated content.\n\n### **Requirements**\n\n- **OpenAI API** account for GPT-4o prompt generation and social media content creation\n- **KIE.AI API** account for Veo 3.1 video generation and Google Nano Banana Edit image generation\n- **Blotato API** account for TikTok and Instagram posting automation\n- **Telegram Bot** setup for preview delivery (optional but recommended)\n- **n8n** instance (cloud or self-hosted)\n- **Reference Images:** 5 high-quality images of your character (URLs or hosted images)\n\n### **Customizing this workflow**\n\n**Character Variations:** Modify the reference images to create videos with different characters while maintaining the same workflow structure.\n\n**Location Customization:** Edit the location pool in the \"Code in JavaScript\" node to add or modify locations (currently 100 options).\n\n**Pose Library:** Expand or customize the pose library in the JavaScript code node (currently 15 poses with detailed guidance).\n\n**Social Media Platforms:** Add more platforms by duplicating the Blotato nodes and configuring additional accounts (YouTube, Facebook, etc.).\n\n**Content Style:** Adjust GPT-4o prompts in \"Story Creator Agent\" and \"Title Description\" nodes to change content tone, style, or language.\n\n**Scheduling:** Replace the schedule trigger with webhook, form, or manual trigger based on your needs.\n\n**Video Settings:** Modify Veo 3.1 parameters (aspect ratio, watermark, seeds) in the \"Veo 3.1\" node for different output formats.\n\n**Batch Processing:** Add loops to generate multiple videos with different location/pose combinations automatically.",
  "featuredImage": "/data/workflows/11594/11594.webp",
  "author": {
    "id": 101,
    "slug": "mfarooqone",
    "name": "Muhammad Farooq Iqbal",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1680,
  "downloads": 168,
  "createdAt": "2025-12-08T08:49:13.860Z",
  "updatedAt": "2026-01-16T09:09:17.779Z",
  "publishedAt": "2025-12-08T08:49:13.860Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11594"
}