{
  "id": 9379,
  "slug": "9379",
  "title": "Filter for positive Google reviews using Telegram, web form & Google Sheets",
  "description": "This workflow is a powerful reputation management tool designed to proactively filter customer reviews. It helps you encourage positive reviews on Google while capturing negative feedback privately before it impacts your public rating. By using an incentive, it maximizes the number of customers who enter this review funnel, giving you control over your online reputation.\n\n\n## Who’s it for?\nThis template is essential for any business where Google Reviews are critical: restaurants, clinics, retail stores, local services, and more. If you want to improve your Google star rating by systematically encouraging happy customers to post public reviews and addressing unhappy customers privately, this is the perfect solution.\n\n## How it works / What it does\nThe main job of this workflow is to send customers to a special review landing page. On this page, only reviews of 4 stars or more are directed to your Google Review page, while lower-rated feedback is captured in a private form.\n\nTrigger: A customer scans a QR code (e.g., in your store) and sends a message to your Telegram bot.\n\nIncentivize: The bot checks if the user is new. If so, it sends them a small discount or offer as a thank-you for their business and to encourage them to provide feedback.\n\nSend to Filter Page: After a short delay, the workflow sends a message with a link to your review filtering webpage.\n\nTrack & Follow Up: The workflow tracks whether the link has been clicked (updating the status in a Google Sheet). If a user doesn't click the link after 23 hours, an automated reminder is sent to maximize engagement.\n\n## How to set up\nCrucial Prerequisite: This workflow sends users to a review-filtering webpage. You must have this webpage already built. The page should have logic to send 4+ star reviewers to Google and capture other feedback internally. [code](https://github.com/anirudhaeran/Google-Review-Feedback-Form)\n\nCreate a Telegram Bot: Use the BotFather on Telegram to create a bot and get your API token.\n\nGoogle Sheet: Create a Google Sheet with columns like: ID, First Name, Status, Feedback Message, Timestamp.\n\nCredentials: Add your Google Sheets API and Telegram Bot API credentials to n8n.\n\nConfigure Nodes:\n\nIn all Google Sheets nodes, select your credential and paste your Sheet ID.\n\nIn all Telegram nodes, select your Telegram credential.\n\nIn the \"Send Review Page Link\" and \"Send Review Link Reminder\" nodes, update the URL to point to your review filtering page.\n\nCreate a QR Code: Generate a QR code for your bot's link (e.g., https://t.me/YOUR_BOT_USERNAME) and display it for your customers.\n\nActivate Workflow: Save and activate the workflow.\n\n## Requirements\nA pre-built review filtering webpage. [code](https://github.com/anirudhaeran/Google-Review-Feedback-Form)\n\nAn active n8n instance.\n\nGoogle Sheets API credentials.\n\nA Telegram Bot and its API token.",
  "featuredImage": "/data/workflows/9379/9379.webp",
  "author": {
    "id": 101,
    "slug": "anirudhaeran",
    "name": "Anirudh Aeran",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 218,
  "downloads": 21,
  "createdAt": "2025-10-08T16:33:17.881Z",
  "updatedAt": "2026-01-16T09:00:15.216Z",
  "publishedAt": "2025-10-08T16:33:17.881Z",
  "nodes": 33,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9379"
}