{
  "id": 8223,
  "slug": "8223",
  "title": "Auto-post platform-optimized content to X and Threads with late API and Google Sheets",
  "description": "X (Twitter) and Threads (by Meta) both have different maximum character lengths.\n\n## Different X and Threads Content Auto Poster  \n### This n8n template demonstrates how to post different content optimized for X (Twitter) and Meta Threads using the Late API.  \n\nYou can use it for any niche. For example: posting AI news to X and Threads.  \n\n**Possible use cases:**  \n- Schedule your posts to X and Threads.  \n- Use this workflow as a content calendar and automated posting system.  \n- Apply it across different content niches.  \n\n### How it works  \n- The automation runs according to the time defined in the Schedule Trigger node.  \n- Content is pulled from Google Sheets.  \n- Any URL is shortened using your preferred short URL API.  \n- Images are uploaded to Late’s server first.  \n- Content for X is posted in Step 2. The workflow checks that the content length is under 280 characters.  \n- Content for Threads is posted in Step 3. The workflow checks that the content length is under 500 characters.  \n- Posts on X are published as threaded posts, while on Threads they are single posts.  \n- Once posted, the Google Sheets content database is updated.  \n\n### Requirements  \n- Google OAuth credentials with the Google Sheets API enabled  \n- Bitly account and access token (or OAuth)  \n- GetLate API connected to your X and Threads accounts  \n\n---\n\n## HOW TO USE  \n\n**STEP 1**  \n1. Adjust the settings in the Schedule Trigger node to define when the workflow runs.  \n2. Open this [Google Sheets template](https://docs.google.com/spreadsheets/d/1CtpVHtzu_y9KoELS7Cee3BDivtRN2zVg-Uuy7uZD4ko/edit?usp=sharing), then go to **File → Make a copy**, and update the settings in the Get Topic node.  \n3. Get your Bitly OAuth or Access Token [here](https://app.bitly.com/settings/api) and add the credentials in the Short Link node.  \n4. Get your API key from [getlate.dev](https://getlate.dev/) and add the credentials in the Upload IMG node.  \n\n**STEP 2**  \n1. Add your Late credentials to the Post Twitter node.  \n2. Get your Twitter account ID from Late, and update it in the JSON Body section of the Post Twitter node.  \n\n**STEP 3**  \n1. Add your Late credentials to the Post Threads node.  \n2. Get your Threads account ID from Late, and update it in the JSON Body section of the Post Threads node.  \n",
  "featuredImage": "/data/workflows/8223/8223.webp",
  "author": {
    "id": 101,
    "slug": "kelaswfa",
    "name": "Fariez",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2770,
  "downloads": 277,
  "createdAt": "2025-09-03T14:59:57.790Z",
  "updatedAt": "2026-01-16T08:54:46.030Z",
  "publishedAt": "2025-09-03T14:59:57.790Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8223"
}