{
  "id": 11529,
  "slug": "11529",
  "title": "Organize school emails with AI, Google Calendar and Drive auto-triage system",
  "description": "**Overview**\n\nThis workflow automatically reads school-related emails from Gmail, uses AI to understand what each email is about, and then organizes everything into Google Drive and Google Calendar. It classifies messages into schedules, “what to bring” lists, general notices, and contact information, creates calendar events when needed, saves text files in Drive, and sends you a daily reminder email about tomorrow’s important events. \n\nEmail Auto-Triage and Organizat…\n\nEmail Auto-Triage and Organization Hub\n\n**Who this is for**\n\nParents or caregivers who get lots of school emails and want everything organized automatically\n\nBusy families who often forget dates, deadlines, or 持ち物 (things to bring)\n\nAnyone who wants school communication stored in a structured, searchable way in Drive and Calendar\n\n**How it works**\n\nTrigger: Gmail watch for new emails\nA Gmail Trigger node watches your inbox and starts the workflow whenever a new email arrives. It then loads the full message content (subject, body, metadata). \n\nEmail Auto-Triage and Organizat…\n\nAI classification and extraction\nThe email text is sent to an AI model, which returns a structured JSON object with:\n\ncategory: “Schedule”, “What to Bring”, “Notice”, or “Contacts”\n\neventTitle, eventDescription, eventDate (ISO format)\n\nitemsToBring, contacts, subject, id, and hasAttachments\nThis turns messy school emails into clean structured data. \n\nEmail Auto-Triage and Organizat…\n\nRouting by category\nA Switch node routes each email based on its category and whether it has attachments:\n\nSchedule / What to Bring → create a calendar event and also save a notice file\n\nNotice → save a notice file only\n\nAny email with attachments → send to the attachment branch for optional photo storage \n\nEmail Auto-Triage and Organizat…\n\nSave notices to Google Drive\nFor all categorized emails, the workflow creates a text file in Google Drive containing:\n\nTitle, date, category, items to bring, and a short description of the event or notice. \n\nEmail Auto-Triage and Organizat…\n\nCreate calendar events\nFor “Schedule” and “What to Bring” emails, the workflow builds a summary and description (including 持ち物) and creates a Google Calendar event. If no end time is given, it defaults to one hour after the start. \n\nEmail Auto-Triage and Organizat…\n\nSave photo attachments (optional)\nIf the email has image attachments, the workflow:\n\nDownloads the attachments from Gmail\n\nFilters to only image files\n\nSaves the photos in a specified Google Drive folder, using the original file name \n\nEmail Auto-Triage and Organizat…\n\nExtract and archive contact information\nThe workflow also pulls out the sender’s contact info (From), links it to the email subject and timestamp, and saves it as a separate contact text file in Google Drive for easy reference. \n\nEmail Auto-Triage and Organizat…\n\nDaily reminder for tomorrow’s events\nEvery morning at a set time, a Schedule Trigger runs:\n\nIt fetches all events from Google Calendar for “tomorrow”\n\nFilters down to events whose description includes “持ち物”\n\nSends you an email summarizing tomorrow’s events and what you need to bring, so you can prepare in advance. \n\nEmail Auto-Triage and Organizat…\n\n**How to set up**\n\nConnect your Gmail, Google Calendar, and Google Drive credentials in the respective nodes.\n\nIn the Workflow Configuration node, set:\n\nphotosFolderId – Drive folder for saved photos\n\nnoticesFolderId – Drive folder for notice text files\n\ncontactsFolderId – Drive folder for contact text files\n\nreminderEmail – email address that will receive the daily reminder\n\nMake sure the Gmail Trigger is pointing to the correct mailbox and is set to poll as often as you like.\n\nConfirm that the Google Calendar node uses the calendar where you want school events to appear.\n\nTurn the workflow on and test it with a few real school emails (schedules, what to bring, general notices). \n\nEmail Auto-Triage and Organizat…\n\n**Customization ideas**\n\nAdjust the AI prompt in Extract Email Info to better match your school’s typical email style or to add more categories.\n\nChange the logic for calendar events (all-day events, different default times, or additional fields like location).\n\nModify file naming patterns or folder structure in Google Drive (e.g., separate folders per child, per school year, or per class).\n\nAdd logging to Google Sheets for a timeline view of all school communication.\n\nForward or mirror important events/notices to other tools such as Slack, Notion, or a family LINE group.",
  "featuredImage": "/data/workflows/11529/11529.webp",
  "author": {
    "id": 101,
    "slug": "anna0726",
    "name": "SOLOVIEVA ANNA",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 80,
  "downloads": 8,
  "createdAt": "2025-12-05T11:21:02.805Z",
  "updatedAt": "2026-01-16T09:09:03.818Z",
  "publishedAt": "2025-12-05T11:21:02.805Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11529"
}