{
  "id": 6012,
  "slug": "6012",
  "title": "Create a privacy-focused AI assistant with Telegram, Ollama, and Whisper",
  "description": "Title: Create a Privacy-Focused AI Assistant with Telegram, Ollama, and Whisper\n\nPersonalAssistant is a fully-local, intelligent AI agent that assists you with daily tasks through voice or text interaction via Telegram. It is designed for users who want the convenience of a smart assistant without sacrificing privacy or relying on paid APIs or cloud infrastructure.\n\n## Prerequisites\nBefore you begin, ensure you have the following set up:\n\nn8n Instance: A running instance of n8n.\n\nTelegram Bot: A Telegram bot created with a valid API token. You can create one by talking to the BotFather.\n\nOllama: Ollama running locally with a downloaded language model (e.g., llama3.2:1b).\n\nWhisper ASR API: A local API endpoint for audio transcription using a Whisper model. This workflow is pre-configured for an endpoint at http://localhost:9000/asr.\n\n## What It Can Do\nRespond to general questions: Get answers about weather, facts, reminders, and more.\n\nHandle tasks: Create and manage to-do lists.\n\nProvide inspiration: Get motivational quotes or affirmations.\n\nJournaling assistant: Use prompts to support mental clarity.\n\nSpeech-to-Text: Convert Telegram voice messages into text for the AI to process.\n\n## How It Works\nInput Handling (Text or Voice): The workflow triggers when you send a voice note or text message to your Telegram bot.\n\nAuthorization: It first checks if the message is from an authorized Telegram User ID.\n\nRouting: A switch directs the workflow based on the message type. Text messages go directly to the AI, while voice messages are first sent for transcription.\n\nTranscription: Voice messages are sent to your local Whisper ASR API to be converted into text.\n\nLLM Reasoning: The text is processed by a local language model (like LLaMA 3.2) via Ollama, which generates a smart response.\n\nTelegram Response: The final answer is sent back to you as a text message in Telegram.\n\n## Setup Instructions\nConfigure Telegram Credentials: In the Telegram Trigger node, select your Telegram API credentials from the dropdown menu. Do the same for all other Telegram nodes in the workflow.\n\nSet Your User ID: In the Authorization Check If node, you must set your personal Telegram User ID to allow access.\n\nClick on the node.\n\nIn the \"Value 2\" field, enter your numeric Telegram User ID.\n\nTip: You can find your ID by sending a message to a bot like @userinfobot.\n\nConfigure Whisper API URL: If your Whisper ASR service is running on a different URL, update the Whisper ASR HTTP Request node.\n\nClick on the node.\n\nChange the URL from http://localhost:9000/asr to your endpoint.\n\nConfigure the Ollama Model: In the Ollama Chat Model node, select your Ollama credentials and specify the model you wish to use (e.g., llama3.2:1b).\n\nActivate Workflow: Save and activate the workflow. You can now send messages to your bot!\n\n## Customization\nChange the AI Persona: Modify the prompt in the AI Agent node to change the assistant's personality, tone, or instructions.\n\nUse a Different AI Model: Simply change the model name in the Ollama Chat Model node to experiment with different local LLMs.\n\nAdjust Memory: In the Simple Memory node, you can change the Context Window Length to control how many past conversations the AI remembers.\n\nAdd More Tools: Expand the workflow by connecting the AI Agent to other nodes like a calendar, a to-do list app, or a web search tool.\n\n## Privacy-First by Design\nAll data processing—including speech recognition, reasoning, and generation—happens entirely offline on your local machine.\n\nNo voice recordings are sent to cloud servers.\n\nNo chat data leaves your device.\n\nOperates even without an internet connection (once set up).",
  "featuredImage": "/data/workflows/6012/6012.webp",
  "author": {
    "id": 101,
    "slug": "albertob12",
    "name": "Alberto",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1320,
  "downloads": 132,
  "createdAt": "2025-07-14T22:26:43.213Z",
  "updatedAt": "2026-01-16T08:42:40.303Z",
  "publishedAt": "2025-07-14T22:26:43.213Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6012"
}