{
  "id": 11182,
  "slug": "11182",
  "title": "Reddit monitoring with AI sentiment analysis and growth insights dashboard",
  "description": "# This template gives you a complete, automated system for monitoring Reddit and extracting growth insights.\n\nIt tracks discussions across target subreddits, surfaces what users love, dislike, want changed, and highlights how they compare you to competitors.\n\nPaired with the free [WeWeb UI template](https://marketplace.weweb.io/projects/9a2048a6-8702-4606-8320-948db5962e88/), it prioritizes engagement and organizes everything into a clean, easy-to-use dashboard. So every team gets the insights they need:\n\n- **Leadership** gains clarity on industry trends and emerging shifts  \n- **Product** can adjust roadmaps and prioritize features or integrations  \n- **Marketing** gets content angles, competitive messaging, and SEO topics  \n- **Sales** receives objection insights straight from real conversations  \n- **Support** spots early patterns in user challenges  \n\n---\n\n## 🙌 Who this is for\n\nPerfect for product teams, founders, and growth marketers who want to build and scale Reddit as a channel without spending hours manually scanning threads.\n\n---\n\n## 💫 What Makes This Different\n\n- **Eliminates manual scanning:** Automatically pull product and competitor mentions using F5Bot for free, without the high cost of traditional monitoring tools.  \n- **Captures full conversations:** Track not just posts, but the entire comment chain where real insights, objections, and frustrations actually surface.  \n- **AI-powered prioritization:** Every mention is classified by sentiment and topic so you know what to prioritize and why.  \n- **Cross-team intelligence:** Highlights product insights, competitor signals, sales objections, user frustrations, and industry trends, helping product, marketing, sales, support, and leadership make more customer-centric decisions.\n\n---\n\n## ⚙️ How the Workflow Works\n\n- A cron job runs every hour and scans your Gmail inbox for new F5Bot alert emails.  \n- When an alert is found, the workflow extracts all mention data from the email.  \n- An AI node processes each mention to:  \n  - categorize it by topic  \n  - tag sentiment  \n- All data is stored in Supabase.  \n- The data is displayed in a WeWeb dashboard where users can browse mentions.  \n- If a user wants deeper context, they click **“AI Summary.”**  \n- This triggers a webhook in n8n, which pulls the main Reddit post and its entire comment chain.  \n- The AI node summarizes the full thread and highlights:  \n  - the core discussion  \n  - competitor comparisons  \n  - what users like or dislike  \n  - industry-level signals  \n- The workflow returns a clean, actionable summary back to the WeWeb UI.\n\n---\n\n## 🧪 Requirements\n\nYou don’t need any heavy infrastructure. To get started, you’ll need:\n\n- **F5Bot account (free)** - to track Reddit mentions by keywords and trigger email alerts  \n- **Gmail integration** - so the workflow can parse emails from F5Bot  \n- **OpenAI API key** - for AI-powered categorization and summarization  \n- **Supabase project (free)** - to store all mention data  \n- **WeWeb account (free)** - connects your n8n workflow to a clean, user-friendly dashboard for viewing insights \n\n[Here's](https://www.weweb.io/blog/reddit-seo-automation) a detailed setup guide.\n \n\n---\n\n## 🔧 Want to Go Further?\n\nThis setup is beginner-friendly, but you can extend it with:\n\n- Blog topic generation  \n- Full blog post generation  \n- Social media posts  \n- Competitor benchmarking reports  \n- Weekly or monthly email digests  \n- Slack alerts for high-signal mentions  \n",
  "featuredImage": "/data/workflows/11182/11182.webp",
  "author": {
    "id": 101,
    "slug": "weweb",
    "name": "WeWeb",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 802,
  "downloads": 80,
  "createdAt": "2025-11-24T11:16:40.061Z",
  "updatedAt": "2026-01-16T09:07:49.510Z",
  "publishedAt": "2025-11-24T11:16:40.061Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11182"
}