{
  "id": 11606,
  "slug": "11606",
  "title": "Clone and change your voice 🤖🎙️with Elevenlabs and Telegram",
  "description": "This workflow creates a voice AI assistant accessible via Telegram that leverages [ElevenLabs](https://try.elevenlabs.io/ahkbf00hocnu)* powerful voice synthesis technology. Users can either **clone their own voice** or **transform their voice** using pre-existing voice models, all through simple voice messages sent to a Telegram bot.\n\n*ONLY FOR STARTER, CREATOR, PRO PLAN\n\nThis workflow allows users to:\n1. **Clone their voice** by sending a voice message to a Telegram bot (creates a new voice profile on ElevenLabs)\n2. **Change their voice** to a cloned voice and save the output to Google Drive\n\n---\n\n### For Best Results\n\n**Important Considerations for Best Results:**\nFor optimal voice cloning via Telegram voice messages:\n\n\n**1. Recording Quality & Environment**\n- Record in a quiet room with minimal echo and background noise\n- Use a consistent microphone position (10-15cm from mouth)\n- Ensure clear audio without distortion or clipping\n\n**2. Content Selection & Variety**\n- Send 1 voice messages totaling 5-10 minutes of speech\n- Include diverse vocal sounds, tones, and natural speaking cadence\n- Use complete sentences rather than isolated words\n\n**3. Audio Consistency**\n- Maintain consistent volume, tone, and distance from microphone\n- Avoid interruptions, laughter, coughs, or background voices\n- Speak naturally without artificial effects or filters\n\n**4. Technical Preparation**\n- Ensure Telegram isn't overly compressing audio (use HQ recording)\n- Record all messages in the same session with same conditions\n- Include both neutral speech and varied emotional expressions\n\n---\n\n### **How it works**\n\n1. **Trigger**  \n   The workflow starts with a Telegram trigger that listens for incoming messages (text, voice notes, or photos).\n\n2. **Authorization check**  \n   A Code node checks whether the sender’s Telegram user ID matches your predefined ID. If not, the process stops.\n\n3. **Message routing**  \n   A Switch node routes the message based on its type:\n   - **Text** → Not processed further in this flow.\n   - **Voice message** → Sent to the “Get audio” node to retrieve the audio file from Telegram.\n   - **Photo** → Not processed further in this flow.\n\n4. **Two main options**  \n   From the “Get audio” node, the workflow splits into two possible paths:\n   - **Option 1 – Clone voice**  \n     The audio file is sent to ElevenLabs via an HTTP request to create a new cloned voice. The voice ID is returned and can be saved for later use.\n   - **Option 2 – Voice changer**  \n     The audio is sent to ElevenLabs for speech-to-speech conversion using a pre-existing cloned voice (voice ID must be set in the node parameters). The resulting audio is saved to Google Drive.\n\n5. **Output**  \n   - Cloned voice ID (for Option 1).  \n   - Converted audio file uploaded to Google Drive (for Option 2).\n\n---\n\n### **Set up steps**\n\n1. **Telegram bot setup**  \n   - Create a bot via BotFather and obtain the API token.  \n   - Set up the Telegram Trigger node with your bot credentials.\n\n2. **Authorization configuration**  \n   - In the “Sanitaze” Code node, replace `XXX` with your Telegram user ID to restrict access.\n\n3. **ElevenLabs API setup**  \n   - Get an API key from ElevenLabs.  \n   - Configure the HTTP Request nodes (“Create Cloned Voice” and “Generate cloned audio”) with:\n     - API key in the `Xi-Api-Key` header.  \n     - Appropriate endpoint URLs (including voice ID for speech-to-speech).\n\n4. **Google Drive setup** (for Option 2)  \n   - Set up Google Drive OAuth2 credentials in n8n.  \n   - Specify the target folder ID in the “Upload file” node.\n\n5. **Voice ID configuration**  \n   - For voice cloning: The voice name can be customized in the “Create Cloned Voice” node.  \n   - For voice changing: Replace `XXX` in the “Generate cloned audio” node URL with your ElevenLabs voice ID.\n\n6. **Test the workflow**  \n   - Activate the workflow.  \n   - Send a voice note from your authorized Telegram account to trigger cloning or voice conversion.\n\n---\n\n👉 [Subscribe to my new **YouTube channel**](https://youtube.com/@n3witalia). Here I’ll share videos and Shorts with practical tutorials and **FREE templates for n8n**.\n\n[![image](https://n3wstorage.b-cdn.net/n3witalia/youtube-n8n-cover.jpg)](https://youtube.com/@n3witalia)\n\n\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/). ",
  "featuredImage": "/data/workflows/11606/11606.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 319,
  "downloads": 31,
  "createdAt": "2025-12-08T13:42:12.200Z",
  "updatedAt": "2026-01-16T09:09:17.912Z",
  "publishedAt": "2025-12-08T13:42:12.200Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11606"
}