{
  "id": 4735,
  "slug": "4735",
  "title": "AI blog generator for Shopify product listings:  Using GPT-4o and Google Sheets",
  "description": "## 🧠 AI Blog Generator for Shopify Products using GPT-4o\n\nThe **AI Blog Generator** is an advanced automation workflow powered by **n8n**, integrating **GPT-4o** and **Google Sheets** to generate SEO-rich blog articles for Shopify products. It automates the entire process — from pulling product data, analyzing images for nutritional information, to producing structured HTML content ready for publishing — with zero manual writing.\n\n---\n\n### 💡 Key Advantages\n\n- **🔗 Shopify Product Sync**  \n  Automatically pulls product data (title, description, images, etc.) via Shopify API.\n\n- **🤖 AI-Powered Nutrition Extraction**  \n  Uses **GPT-4o** to intelligently analyze product images and extract nutritional information.\n\n- **✍️ SEO Blog Generation**  \n  GPT-4o generates blog titles, meta descriptions, and complete articles using both product metadata and extracted nutritional info.\n\n- **🗂️ Structured Content Output**  \n  Produces well-formatted HTML with headers, bullet points, and nutrition tables for seamless Shopify blog integration.\n\n- **📄 Google Sheets Integration**  \n  Tracks blog creation, manages retries, and prevents duplicate publishing using a centralized Google Sheet.\n\n- **📤 Shopify Blog API Integration**  \n  Publishes the generated blog to Shopify using a two-step blog + article API call.\n\n---\n\n### ⚙️ How It Works\n\n1. **Manual Trigger**  \n   Initiate the process using a test trigger or a scheduler.\n\n2. **Fetch Products from Shopify**  \n   Retrieves all product details including descriptions and images.\n\n3. **Extract Product Images**  \n   Splits and processes each image individually.\n\n4. **OCR + Nutrition AI**  \n   GPT-4o reads nutrition facts from product images. Skips items without valid info.\n\n5. **Check Existing Logs**  \n   References a Google Sheet to avoid duplicates and determine retry status.\n\n6. **AI Blog Generation**  \n   Creates a blog with headings, bullet points, intro, and a nutrition table.\n\n7. **Shopify Blog + Article Posting**  \n   Uses the Shopify API to publish the blog and its content.\n\n8. **Update Google Sheet**  \n   Logs the blog URL, HTML content, errors, and status for future reference.\n\n---\n\n### 🛠️ Setup Steps\n\n- **Shopify Node**: Connects to your Shopify store and fetches product data.  \n- **Split Out Node**: Divides product images for individual OCR processing.  \n- **OpenAI Node**: Uses GPT-4o to extract nutrition data from images.  \n- **If Node**: Filters for entries with valid nutrition information.  \n- **Edit Fields Node**: Formats the product data for AI processing.  \n- **AI Agent Node**: Generates SEO blog content.  \n- **Google Sheets Nodes**: Reads and updates blog creation status.  \n- **HTTP Request Nodes**: Posts the blog and article via Shopify’s API.\n\n---\n\n### 🔐 Credentials Required\n\n- **Shopify Access Token** – For retrieving product data and posting blogs  \n- **OpenAI API Key** – For GPT-4o-based AI generation and image processing  \n- **Google Sheets OAuth** – For accessing the log sheet\n\n---\n\n### 👤 Ideal For\n\n- Ecommerce teams looking to automate content for hundreds of products  \n- Shopify store owners aiming to boost organic traffic through blogging  \n- Marketing teams building scalable, AI-driven content workflows\n\n---\n\n### 💬 Bonus Tip\n\nThe workflow is modular. You can easily extend it with internal linking, language translation, or even social media sharing — all within the same **n8n** flow.\n",
  "featuredImage": "/data/workflows/4735/4735.webp",
  "author": {
    "id": 101,
    "slug": "shivam840708",
    "name": "Kumar Shivam",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 8935,
  "downloads": 893,
  "createdAt": "2025-06-06T15:00:32.038Z",
  "updatedAt": "2026-01-16T08:35:54.626Z",
  "publishedAt": "2025-06-06T15:00:32.038Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4735"
}