{
  "id": 3846,
  "slug": "3846",
  "title": "Extract & analyze brand content with Bright Data and Google Gemini",
  "description": "### Who this is for?\n\nThe Brand Content Extract, Summarization & Sentiment Analysis workflow is designed for professionals and teams who need to monitor, understand, and act on public brand perception at scale. \n\nIt is ideal for:\n\n1. **Brand Managers** - Looking to track how their brand is portrayed online.\n\n2. **Marketing Analysts** - Seeking insights from competitor and industry content.\n\n3. **PR & Communications Teams** - Evaluating media tone and potential reputation risks.\n\n4. **Data Scientists & AI Developers** - Automating content intelligence pipelines.\n\n5. **Growth Hackers** - Performing large-scale web listening for campaign optimization.\n\n### What problem is this workflow solving?\n\nManually tracking and interpreting how your brand is mentioned across blogs, news sites, or product reviews is labor-intensive and unscalable. Traditional scraping tools return raw data but lack insights like summarization, sentiment analysis etc.\n\nThis workflow addresses:\n\n- Scalable extraction of brand-related content using Bright Data's infrastructure.\n\n- Textual data extract for easy decision-making or alerting.\n\n- Automated summarization of verbose or multi-paragraph articles using Gemini.\n\n- Sentiment analysis of how a brand is being portrayed.\n\n### What this workflow does\n\n- Receives input: A brand URL for the data extraction and analysis.\n\n- Uses Bright Data's Web Unlocker to extract content from relevant sites.\n\n- Cleans and preprocesses the scraped content for readability.\n\n- Sends the content to Google Gemini for:\n\n\t- Enriched results including:\n\n\t\t- Cleaned content\n\n\t\t- Summary\n\n\t\t- Sentiment Analysis\n\n\t\t- Sends the response to a target system via Webhook notification\n\t\t- Perists the response to disk\n\n### Setup\n\n- Sign up at [Bright Data](https://brightdata.com/).\n- Navigate to Proxies & Scraping and create a new Web Unlocker zone by selecting Web Unlocker API under Scraping Solutions.\n- In n8n, configure the Header Auth account under Credentials (Generic Auth Type: Header Authentication).\n![Header Authentication.png](fileId:1229)\nThe Value field should be set with the \n**Bearer XXXXXXXXXXXXXX**. The XXXXXXXXXXXXXX should be replaced by the Web Unlocker Token.\n- A Google Gemini API key (or access through Vertex AI or proxy).\n- Update the **Set URL and Bright Data Zone** for setting the brand content URL and the Bright Data Zone name.\n- Update the Webhook HTTP Request node with the Webhook endpoint of your choice.\n\n### How to customize this workflow to your needs\n\n- **Update Source** : Update the workflow input to read from Google Sheet or Airbase for dynamically tracking multiple brands or topics.\n- **AI Prompt Customization** : Tailor Gemini prompts for: \n\t- Summary length (brief vs. detailed)\n\n\t- Detailed Sentiment with the custom structured data format.\n\n\t- Brand-specific tone detection (e.g., trust, excitement, dissatisfaction)\n\n- **Output Destinations**: Configure the output node to send the responses to various platforms, such as Slack, CRM systems, or databases.",
  "featuredImage": "/data/workflows/3846/3846.webp",
  "author": {
    "id": 101,
    "slug": "ranjancse",
    "name": "Ranjan Dailata",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 629,
  "downloads": 62,
  "createdAt": "2025-05-03T13:17:38.073Z",
  "updatedAt": "2026-01-16T08:31:44.629Z",
  "publishedAt": "2025-05-03T13:17:38.073Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3846"
}