{
  "id": 8190,
  "slug": "8190",
  "title": "Create blog posts from YouTube videos with Mistral AI & Gemini image generation",
  "description": "**Description**\n\nThis template automates the process of creating blog posts from YouTube videos using Mistral AI for text generation and Gemini for image generation. It provides a seamless workflow that transforms YouTube content into ready-to-publish articles complete with engaging visuals.\n\n**⚠️ Disclaimer:** This template can only be used on self-hosted n8n instances. It also relies on community nodes, which must be installed before running the workflow.\n\n**Workflow Overview**\n\nYouTube Data Extraction – Retrieves video details (title, description, and transcript).\n\nContent Summarization – Mistral AI rewrites and structures the transcript into a blog-ready format.\n\nImage Generation – Gemini creates relevant, high-quality images to complement the article.\n\nPost Assembly – The workflow automatically combines the generated text and visuals into a structured blog post.\n\n**Features**\n\nExtract video details and transcripts directly from YouTube.\n\nSummarize and rewrite content into blog posts using Mistral AI.\n\nGenerate relevant images with Gemini for engaging visuals.\n\nAutomatically structure blog posts for publishing.\n\n**Requirements**\n\nBefore using this template, ensure you have:\n\nAn active self-hosted n8n instance.\n\nAPI keys for OpenRouter (Mistral AI) and Gemini.\n\nThe required community nodes installed.\n\nAccess to public or unlisted YouTube videos.\n\n**Setup Instructions**\n\nImport the template into your self-hosted n8n instance.\n\nConfigure the API credentials:\n\nAdd your OpenRouter API key.\n\nAdd your Gemini API key.\n\nReplace placeholder domains or webhook URLs with your own.\n\nRun the workflow with a sample YouTube video URL.\n\nReview the generated blog post and images.\n\n**Customization**\n\nContent length: Adjust prompt settings in the Mistral AI node.\n\nTone of voice: Modify prompts for formal, casual, or technical style.\n\nImage style: Update Gemini requests to change the look and feel.\n\nPublishing: Connect to your CMS (e.g., WordPress, Ghost) for direct publishing.\n\n**How YouTube is Involved**\n\nThe workflow starts with a YouTube video URL, extracts metadata and transcripts, and then transforms this raw content into a complete blog post enriched with AI-generated images.\n\n**WorkFlow:**\n![image.png](fileId:2328)",
  "featuredImage": "/data/workflows/8190/8190.webp",
  "author": {
    "id": 101,
    "slug": "zakwanzahid",
    "name": "Zakwan",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 201,
  "downloads": 20,
  "createdAt": "2025-09-02T20:34:36.561Z",
  "updatedAt": "2026-01-16T08:54:33.742Z",
  "publishedAt": "2025-09-02T20:34:36.561Z",
  "nodes": 56,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8190"
}