{
  "id": 10876,
  "slug": "10876",
  "title": "text-to-video generation using Google Veo3 API and Google Drive",
  "description": "## Automate Text To Video Generation with Google Veo3 API and Google Drive Integration\n\n\nCreate CGI ads effortlessly by integrating the [Google Veo3 API](https://rapidapi.com/skdeveloper/api/google-veo-3) for video generation and uploading to Google Drive with seamless email notifications.\n\n---\n\n## Node-by-Node Explanation:\n\n1. **On form submission**: Triggers the workflow when a form is submitted with a prompt for the video.\n2. **Wait for API Response**: Waits for 35 seconds for the API to respond.\n3. **API Request: Check Task Status**: Sends an HTTP request to check the task status for success or failure.\n4. **Condition: Task Output Status**: Checks the task's output status and triggers the appropriate action (success, processing, or failure).\n5. **Wait for Task to Complete**: Waits for another 30 seconds to recheck the task's completion status.\n6. **Send Email: API Error - Task ID Missing**: Sends an email if the task ID is missing from the API response.\n7. **Upload File to Google Drive**: Uploads the generated video to Google Drive.\n8. **Set Google Drive Permissions**: Configures the permissions for the uploaded video on Google Drive.\n9. **Send an email: Video Link**: Sends a final email with the link to the completed video on Google Drive.\n10. **Download Video**: Downloads the video from the generated URL.\n\n\n---\n\n## How to Obtain RapidAPI Key:\n\n1. Visit [Google Veo3 API](https://rapidapi.com/skdeveloper/api/google-veo-3) on RapidAPI.\n2. Sign up or log in to your account.\n3. Subscribe to the Google Veo3 API plan.\n4. Copy the API key provided in your RapidAPI dashboard.\n\n---\n\n## How to Configure Google Drive:\n\n1. Go to [Google Cloud Console](https://console.developers.google.com/).\n2. Enable the **Google Drive API**.\n3. Create credentials for OAuth 2.0 and download the credentials file.\n4. In your workflow, authenticate using these credentials to upload and manage files on Google Drive.\n\n---\n\n## Use Case:\n\nThis workflow is ideal for businesses looking to automate CGI video creation for advertisements using the Google Veo3 API, with seamless file management and sharing via Google Drive.\n\n---\n\n## Benefits:\n\n* **Automation**: Completely automates the CGI video creation and sharing process.\n* **Error Handling**: Sends error notifications for task failures or missing task IDs.\n* **File Management**: Automatically uploads and manages videos on Google Drive.\n* **Easy Sharing**: Generates shareable links to videos via email.\n\n---\n\n## Who Is This For?\n\n* Digital marketers looking to create ads at scale.\n* Creative agencies producing CGI content.\n* Developers integrating API workflows for video generation.\n\n---\n\n## Link to Google Veo3 API:\n\n[Google Veo3 API on RapidAPI](https://rapidapi.com/skdeveloper/api/google-veo-3)\n",
  "featuredImage": "/data/workflows/10876/10876.webp",
  "author": {
    "id": 101,
    "slug": "skdeveloper",
    "name": "Sk developer ",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 414,
  "downloads": 41,
  "createdAt": "2025-11-16T07:21:27.835Z",
  "updatedAt": "2026-01-16T09:06:38.603Z",
  "publishedAt": "2025-11-16T07:21:27.835Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10876"
}