{
  "id": 9409,
  "slug": "9409",
  "title": "Automate random chore assignments with Google Sheets and Gmail notifications",
  "description": "This workflow automates the assignment of household chores. It reads tasks and a list of people from Google Sheets, pairs each task with someone, updates the spreadsheet with the assignments and emails each person their chores. \n\nEach run makes a random assignment so you don’t have to decide who does what. By running on a schedule, it keeps your chore rotation automated.\n\n## Who is it for?\nDesigned for families, roommates, flat‑shares or property managers who want to keep track of recurring chores without endless group chats or arguments. It’s also helpful for anyone coordinating a team of cleaners or volunteers and wishing to automate a fair distribution of tasks.\n\n## How it works\n1.\tA Schedule Trigger starts the workflow at a regular interval (default every seven days).\n2.\tGoogle Sheets node reads the “Tasks” sheet from your spreadsheet. Each row contains a chore with a task.\n3.\tAnother Google Sheets node reads the “Persons” sheet to obtain the list of people available to do chores.\n4.\tNext a Code node filters out any people without an email address and any tasks without a task name, then selects a random person for each task.\n5.\tA Gmail node sends each person an email summarising the chore they’ve been assigned.\n6.\tThe last Google Sheets node updates the “Tasks” sheet, writing the assigned person’s name into the assigned_to column.\n\n## Setup steps\n1.\tSpreadsheet – Create a Google Sheets document with two sheets. The first sheet “Tasks” should have columns for task, description, assigned_to and a “hidden row_number”. The second sheet “Persons” should have columns for name and email and “hidden row_number”. Fill them with your current chores and household members.\n2.\tConnect your Google account – In the Get Tasks and Get People nodes, select the credential for your Google account and search for your sheets.\n3.\tConfigure the Schedule Trigger – Set the trigger interval (for example, every seven days on a Sunday evening).\n4.\tEdit the assignment logic (optional) – The Code node is preconfigured to filter data and assign tasks randomly. You can modify this script if you prefer a round‑robin approach, weighting by difficulty, or any other logic.\n5.\tConfigure Gmail – In the Send a message node, select your Gmail credential. If you want you can customise the subject and body of the email.\n6.\tUpdate sheet mapping – In the Update assign_to node, ensure the assigned_to column mapping writes the assigned person’s name back to the correct row. The workflow uses the row_number to match the row being updated.\n7.\tTest and activate – Run the workflow manually to verify it reads your sheets, assigns tasks and sends emails. Once satisfied, activate the schedule so it runs automatically.\n\n## Requirements\n·\tA Google account with access to Google Sheets and Gmail.\n·\tA spreadsheet containing two sheets as described above (see images), with headers matching the field names used in the workflow.\n\n## How to customise it\n\nChange the schedule interval to suit your rotation, edit the email template to include due dates or motivational messages, or modify the assignment script to weight tasks by difficulty. You could also send notifications via Slack or Telegram. ",
  "featuredImage": "/data/workflows/9409/9409.webp",
  "author": {
    "id": 101,
    "slug": "nafri",
    "name": "Adrian",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 42,
  "downloads": 4,
  "createdAt": "2025-10-09T11:15:07.848Z",
  "updatedAt": "2026-01-16T09:00:25.242Z",
  "publishedAt": "2025-10-09T11:15:07.848Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9409"
}