{
  "id": 5866,
  "slug": "5866",
  "title": "Summarize YouTube transcripts in any language with Google Gemini & Google Docs",
  "description": "### **YouTube Transcript Summarization in Any Language for Social Media**\n\nThis n8n workflow automates the process of:\n\n1. **Retrieving YouTube Video Transcripts:**  \n   It fetches the transcript for any YouTube video URL provided using the **[YouTube Transcript API](https://rapidapi.com/skdeveloper/api/youtube-transcriptor-pro)** from **RapidAPI**.\n\n2. **Generating a Concise Summary in Any Language:**  \n   The workflow uses **Google Gemini (PaLM)** to create a concise summary of the transcript in the language specified by the user (e.g., English, Spanish, etc.).\n\n3. **Storing the Summary in Google Docs:**  \n   The generated summary is inserted into a predefined **Google Document**, making it easy for users to share or edit.\n\n### **Features:**\n- **Language Flexibility:** Summaries are created in the desired language.\n- **Fully Automated:** From fetching the transcript to updating Google Docs, the process is fully automated.\n- **Social Media Ready:** The summary is formatted and stored in a Google Doc, ready for use in social media posts.\n\nThis workflow integrates with **[YouTube Transcript API](https://rapidapi.com/skdeveloper/api/youtube-transcriptor-pro)** via **RapidAPI**, allowing you to easily fetch video transcripts and summarize them with AI. The entire process is automated and seamless.\n\n### **Powered by RapidAPI:**\n- **API Used:** [YouTube Transcript API](https://rapidapi.com/skdeveloper/api/youtube-transcriptor-pro) via **RapidAPI** to get the transcript data.\n\n---\n\n### **Benefits:**\n- **Saves Time:** Automates the transcript summarization process, eliminating the need for manual content extraction and summarization.\n- **Customizable Language Support:** Provides summaries in any language, enabling accessibility and engagement for a global audience.\n- **Streamlined Content Creation:** Automatically generates concise, engaging summaries that are ready for social media use.\n- **Google Docs Integration:** Saves summaries directly into a Google Doc for easy sharing, editing, and content management.\n\n---\n\n### **Challenges Addressed:**\n- **Manual Transcript Extraction:**  \n  **Problem:** Manually transcribing and summarizing YouTube videos for social media can be time-consuming and error-prone.  \n  **Solution:** This workflow fully automates the process, saving hours of manual work using the **[YouTube Transcript API](https://rapidapi.com/skdeveloper/api/youtube-transcriptor-pro)**.\n\n- **Lack of Language Support in Summaries:**  \n  **Problem:** Many automated tools only summarize content in a single language, limiting their accessibility.  \n  **Solution:** With language flexibility, the workflow creates summaries in the language of your choice, helping you cater to diverse audiences.\n\n- **Inconsistent Video Quality & Transcript Accuracy:**  \n  **Problem:** Not all YouTube videos have well-structured or accurate transcripts, leading to incomplete or inaccurate summaries.  \n  **Solution:** The workflow can process and format even imperfect transcripts, ensuring that the generated summaries are still accurate and useful.\n\n- **Managing Content Across Platforms:**  \n  **Problem:** Transcripts and summaries often need to be stored in multiple locations for social media posts, which can be cumbersome.  \n  **Solution:** The workflow integrates with Google Docs to automatically store and manage summaries in one place, making it easier to share and reuse content.\n\n---\n",
  "featuredImage": "/data/workflows/5866/5866.webp",
  "author": {
    "id": 101,
    "slug": "skdeveloper",
    "name": "Sk developer ",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1908,
  "downloads": 190,
  "createdAt": "2025-07-11T04:43:42.519Z",
  "updatedAt": "2026-01-16T08:41:50.589Z",
  "publishedAt": "2025-07-11T04:43:42.519Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5866"
}