{
  "id": 12474,
  "slug": "12474",
  "title": "Score HubSpot deal conversion risk with OpenAI and Slack alerts",
  "description": "## How it works  \nThis workflow runs daily to review all active deals and evaluate their likelihood of closing successfully. It enriches deal data with recent engagement activity and applies AI-based behavioral scoring to predict conversion probability. High-risk or stalled deals are flagged automatically. Actionable alerts are sent to the sales team, and all analysis is logged for forecasting and tracking.\n\n## Step-by-step  \n\n- **Trigger and fetch deals**  \n  - **Schedule Trigger** – Runs the workflow automatically at a fixed time each day.  \n  - **Get Active Deals from HubSpot** – Retrieves all open, non-closed deals with key properties.  \n  - **Formatting Data** – Normalizes deal fields such as value, stage, age, contacts, and activity dates.  \n\n- **Enrich deals with engagement data**  \n  - **If** – Filters only active deals for further processing.  \n  - **Loop Over Items** – Processes each deal individually.  \n  - **HTTP Request** – Fetches engagement associations for the current deal.  \n  - **Get an engagement** – Retrieves detailed engagement records from HubSpot.  \n  - **Extracts Data** – Structures engagement content, timestamps, and metadata for analysis.  \n\n- **Analyze risk, alert, and store results**  \n  - **OpenAI Chat Model** – Provides the language model used for analysis.  \n    - **AI Agent** – Evaluates behavioral signals, predicts conversion probability, and recommends actions.  \n  - **Format Data** – Parses AI output into structured, machine-readable fields.  \n  - **Filter Alerts Needed** – Identifies deals that need immediate attention.  \n  - **Send Slack Alert** – Sends detailed alerts for high-risk or stalled deals.  \n  - **Append or update row in sheet** – Logs analysis results into Google Sheets for reporting.  \n\n## Why use this?  \n\n- Automatically identify high-risk deals before they stall or fail  \n- Give sales teams clear, data-driven next actions instead of raw CRM data  \n- Improve forecasting accuracy with AI-powered probability scoring  \n- Maintain a historical deal health log for audits and performance reviews  \n- Reduce manual pipeline reviews while increasing response speed  \n\n",
  "featuredImage": "/data/workflows/12474/12474.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2,
  "downloads": 0,
  "createdAt": "2026-01-05T12:56:41.785Z",
  "updatedAt": "2026-01-16T09:12:29.867Z",
  "publishedAt": "2026-01-05T12:56:41.785Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12474"
}