{
  "id": 6005,
  "slug": "6005",
  "title": "Automated bulk cold email sender using Gmail, SMTP and Google Sheets",
  "description": "## Overview\nThis workflow automates the process of sending personalized cold email sequences to your prospects. It fetches un-emailed leads from your Google Sheet, validates their email addresses, and then dispatches tailored emails according to a predefined schedule. It updates your CRM (Google Sheet) with the status of each sent email, ensuring your outreach efforts are tracked and efficient.\n\n## Use Case\nThis workflow is perfect for:\n* **Sales Teams**: Automate the delivery of multi-stage cold email campaigns to a large volume of leads.\n* **Business Development**: Nurture prospects over time with a structured email sequence.\n* **Recruiters**: Send out introductory emails to potential candidates for open positions.\n* **Marketers**: Distribute personalized outreach for events, content, or product launches.\n* **Anyone doing cold outreach**: Ensure consistent follow-up and track email performance without manual effort.\n\n---\n\n## How It Works\n\n1.  **Scheduled Trigger**: The workflow is set to run automatically at a defined interval (e.g., every 6 hours, as currently configured by the \"Set Timer\" node). This ensures regular outreach without manual intervention.\n2.  **Fetch Unsent Emails**: The \"Get Emails\" node queries your Google Sheet to identify prospects who haven't yet received the current email in the sequence (i.e., \"Email Sent \" is \"No\").\n3.  **Control Volume**: A \"Limit\" node can be used to control the number of emails sent in each batch, preventing you from sending too many emails at once and potentially hitting sending limits.\n4.  **Loop Through Prospects**: The \"Loop Over Items\" node processes each selected prospect individually.\n5.  **Email Validation (Conditional Send)**: An \"If\" node checks if the prospect's \"Email Address\" is valid and exists. This prevents sending emails to invalid addresses, improving deliverability.\n6.  **Send Email**:\n    * **\"Send Email\" Node**: For valid email addresses, this node dispatches the personalized email to the prospect. It retrieves the recipient's email, subject, and body from your Google Sheet.\n    * **\"connect\" Node**: (Note: The provided JSON uses a generic `emailSend` node named \"connect\" that links to an SMTP credential. This represents the actual email sending mechanism, whether it's Gmail or a custom SMTP server.)\n7.  **Update CRM**: After successfully sending an email, the \"Update Records\" node updates your Google Sheet. It marks the \"Email Sent \" column as \"Yes\" and records the \"Sent on\" timestamp and a \"Message Id\" for tracking.\n8.  **Delay Between Sends**: A \"Wait\" node introduces a delay between sending emails to individual prospects. This helps mimic human sending behavior and can improve deliverability.\n\n---\n\n## How to Set It Up\n\nTo set up your Automated Cold Email Sender, follow these steps:\n\n1.  **Google Sheet Setup**:\n    * **Duplicate the Provided Template**: Make a copy of the Google Sheet Template (`1TjXelyGPg5G8lbPDI9_XOReTzmU1o52z2R3v8dYaoQM`) into your own Google Drive. This sheet should contain columns for \"Name\", \"Email Address \", \"Sender Email\", \"Email Subject\", \"Email Body\", \"Email Sent \", \"Sent on\", and \"Message Id\".\n    * **Connect Google Sheets**: Ensure your Google Sheets OAuth2 API credentials are set up in n8n and linked to the \"Get Emails\" and \"Update Records\" nodes.\n    * **Update Sheet IDs**: In both \"Get Emails\" and \"Update Records\" nodes, update the `documentId` with the ID of *your copied template*.\n2.  **Email Sending Service Credentials**:\n    * **Gmail**: If using Gmail, ensure your Gmail OAuth2 credentials are configured and connected to the \"Send Email\" node (or the \"connect\" node, if that's your chosen sender).\n    * **Other Email Services (SMTP)**: If you use a different email service, you'll need to set up an SMTP credential in n8n and connect it to the \"connect\" node. Refer to the \"Sticky Note4\" for guidance on non-Google email services.\n3.  **Configure Timer**:\n    * In the \"Set Timer\" node, adjust the `hoursInterval` or other time settings to define how frequently you want the email sending process to run (e.g., every 6 hours, once a day, etc.).\n4.  **Control Volume (Optional)**:\n    * In the \"Limit\" node, you can set the `maxItems` to control how many emails are processed and sent in each batch. This is useful for managing email sending limits or gradual outreach.\n5.  **Import the Workflow**: Import the provided workflow JSON into your n8n instance.\n6.  **Populate Your Sheet**: Fill your copied Google Sheet with prospect data, including the email subject and body for each email you wish to send. Ensure the \"Email Sent \" column is initially \"No\".\n7.  **Activate and Monitor**: Activate the workflow. It will begin fetching and sending emails based on your configured schedule. Monitor your Google Sheet to track the \"Email Sent \" status.\n\nThis workflow provides a robust and automated solution for managing your cold email campaigns, saving you time and increasing your outreach efficiency.\n",
  "featuredImage": "/data/workflows/6005/6005.webp",
  "author": {
    "id": 101,
    "slug": "gain-flow",
    "name": "Gain FLow AI",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 5390,
  "downloads": 539,
  "createdAt": "2025-07-14T17:29:51.021Z",
  "updatedAt": "2026-01-16T08:42:37.332Z",
  "publishedAt": "2025-07-14T17:29:51.021Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6005"
}