{
  "id": 8117,
  "slug": "8117",
  "title": "Convert Telegram voice messages to Google Docs with Whisper & GPT-4o tagging",
  "description": "This n8n template demonstrates how to automatically convert voice messages from Telegram into structured, searchable notes in Google Docs using AI transcription and intelligent tagging.\n\nUse cases are many: Try capturing ideas on-the-go while walking, recording meeting insights hands-free, creating voice journals, or building a personal knowledge base from spoken thoughts!\n\n## Good to know\n\n- OpenAI Whisper transcription costs approximately $0.006 per minute of audio\n- ChatGPT tagging adds roughly $0.001-0.003 per message depending on length\n- The workflow supports both German and English voice recognition\n- Text messages are also supported - they bypass transcription and go directly to AI tagging\n- **Perfect companion**: Combine with the \"**Weekly AI Review**\" workflow for automated weekly summaries of all your notes!\n\n## How it works\n\n\n- Telegram receives your voice message or text and triggers the workflow\n- An IF node intelligently detects whether you sent audio or text content\n- For voice messages: Telegram downloads the audio file and OpenAI Whisper transcribes it to text\n- For text messages: Content is passed directly to the next step\n- ChatGPT analyzes the content and generates up to 3 relevant keywords (Work, Ideas, Private, Health, etc.)\n- A function node formats everything with Swiss timestamps, message type indicators, and clean structure\n- The formatted entry gets automatically inserted into your Google Doc with date, keywords, and full content\n- Telegram sends you a confirmation with the transcribed/original text so you can verify accuracy\n\n## How to use\n\n- Simply send a voice message or text to your Telegram bot - the workflow handles everything automatically\n- The manual execution can be used for testing, but in production this runs on every message\n- Voice messages work best with clear speech in quiet environments for optimal transcription\n\n## Requirements\n\n- Telegram Bot Token and configured webhook\n- OpenAI API account for Whisper transcription and ChatGPT tagging\n- Google Docs API access for document writing\n- A dedicated Google Doc where all notes will be collected\n\n## Customising this workflow\n\n- Adjust the AI prompt to use different tagging categories relevant to your workflow (e.g., project names, priorities, emotions)\n- Add multiple Google Docs for different contexts (work vs. private notes)\n- Include additional processing like sentiment analysis or automatic task extraction\n- Connect to other apps like Notion, Obsidian, or your preferred note-taking system\n\n\nAnd don't forget to also implement the complimentary workflow **Weekly AI Review!**\n",
  "featuredImage": "/data/workflows/8117/8117.webp",
  "author": {
    "id": 101,
    "slug": "julianreich",
    "name": "Julian Reich ",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 285,
  "downloads": 28,
  "createdAt": "2025-09-01T12:24:19.582Z",
  "updatedAt": "2026-01-16T08:54:15.179Z",
  "publishedAt": "2025-09-01T12:24:19.582Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8117"
}