{
  "id": 4594,
  "slug": "4594",
  "title": "Generate website screenshots on-demand with ScreenshotMachine API via webhooks",
  "description": "This n8n template enables you to instantly generate high-quality screenshots of any specified public URL by simply sending a webhook request. It’s an indispensable tool for developers, content creators, marketers, or anyone needing on-demand visual captures of web pages without manual intervention, all while including crucial security measures.\n\n---\n\n## 🔧 How it works\n- Receive URL Webhook: This node acts as the entry point for the workflow. It listens for incoming POST requests and expects a JSON body containing a url property with the website you want to screenshot. You can trigger it from any application or service capable of sending an HTTP POST request.\n- Validate URL for SSRF: This is a crucial security step. This Function node validates the incoming url to prevent Server-Side Request Forgery (SSRF) vulnerabilities. It checks for valid http:// or https:// protocols and, more importantly, ensures the URL does not attempt to access internal/private IP addresses or localhost. If the URL is deemed unsafe or invalid, it flags it for an error response.\n- IF URL Valid: This IF node checks the isValidUrl flag set by the previous validation step.\n  - If the URL is valid (true), the workflow proceeds to take the screenshot.\n  - If the URL is invalid or flagged for security (false), the workflow branches to Respond with Validation Error.\n- Take Screenshot: This node sends an HTTP GET request to the ScreenshotMachine API to capture an image of the validated URL. Remember to replace YOUR_API_KEY in the URL field of this node with your actual API key from ScreenshotMachine.\n- Respond with Screenshot Data: This node sends the data received directly from the Take Screenshot node back to the original caller of the webhook. This response typically includes information about the generated screenshot, such as the URL to the image file, success status, and other metadata from the ScreenshotMachine API.\n- Respond with Validation Error: If the IF URL Valid node determines the URL is unsafe or invalid, this node sends a descriptive error message back to the webhook caller, explaining why the request was denied due to security concerns or an invalid format.\n\n---\n\n## 🔒 Security Considerations\nThis template includes a dedicated **Validate URL for SSRF** node to mitigate **Server-Side Request Forgery (SSRF)** vulnerabilities. SSRF attacks occur when an attacker can trick a server-side application into making requests to an unintended location. Without validation, an attacker could potentially use your n8n workflow to scan internal networks, access sensitive internal resources, or attack other services from your n8n server.\n\nThe validation checks for:\n\n- Only http:// or https:// protocols.\n- Prevention of localhost or common private IP ranges (e.g., 10.x.x.x, 172.16.x.x - 172.31.x.x, 192.168.x.x).\n\nWhile this validation adds a significant layer of security, always ensure your n8n instance is properly secured and updated.\n\n---\n\n## 👤 Who is it for?\n### This workflow is ideal for:\n\n- Developers: Automate screenshot generation for testing, monitoring, or integrating visual content into applications.\n- Content Creators: Quickly grab visuals for articles, presentations, or social media posts.\n- Marketing Teams: Create dynamic visual assets for campaigns, ads, or competitive analysis.\n- Automation Enthusiasts: Integrate powerful screenshot capabilities into existing automated workflows.\n- Website Owners: Monitor how your website appears across different tools or over time.\n\n---\n\n## 📑 Prerequisites\nTo use this template, you will need:\n\n- An n8n instance (cloud or self-hosted).\n- An **API Key from ScreenshotMachine**. You can obtain one by signing up on their website: https://www.screenshotmachine.com/\n\n---\n\n## 📑 Data Structure\nWhen you trigger the webhook, send a POST request with a JSON body structured as follows:\n\n```\n{\n  \"url\": \"https://www.example.com\"\n}\n```\n\nIf the URL is valid, the workflow will return the JSON response directly from the ScreenshotMachine API. This response typically includes information about the generated screenshot, such as the URL to the image file, success status, and other metadata:\n\n```\n{\n  \"status\": \"success\",\n  \"hash\": \"...\",\n  \"url\": \"https://www.screenshotmachine.com/...\",\n  \"size\": 12345,\n  \"mimetype\": \"image/jpeg\"\n}\n```\n\nIf the URL is invalid or blocked by the security validation, the workflow will return an error response similar to this:\n\n```\n{\n  \"status\": \"error\",\n  \"message\": \"Access to private IP addresses is not allowed for security reasons.\"\n}\n```\n\n---\n\n## ⚙️ Setup Instructions\n- Import Workflow: In your n8n editor, click \"File\" &gt; \"Import from JSON\" and paste the provided workflow JSON.\n\n- Configure Webhook Path:\n\n  - Double-click the Receive URL Webhook node.\n  - In the 'Path' field, set a unique and descriptive path (e.g., /website-screenshot).\n- Add ScreenshotMachine API Key:\n\n  - Double-click the Take Screenshot node.\n  - In the 'URL' parameter, locate YOUR_API_KEY and replace it with your actual API key obtained from ScreenshotMachine.\n\n\t*Example URL structure: http://api.screenshotmachine.com/?key=YOUR_API_KEY&url={{ $json.validatedUrl }}*\n\n- Activate Workflow: Save and activate the workflow.\n---\n\n## 📝 Tips\n- Processing Screenshots: You're not limited to just responding with the screenshot data! You can insert additional nodes after the Take Screenshot node (and before the Respond with Screenshot Data node) to further process or utilize the generated image. Common extensions include:\n  - Saving to Cloud Storage: Use nodes for Amazon S3, Google Drive, or Dropbox to store the screenshots automatically, creating an archive.\n  - Sending via Email: Attach the screenshot to an email notification using an Email or Gmail node for automated alerts or reports.\n  - Posting to Chat Platforms: Share the screenshot directly in a Slack, Discord, or Microsoft Teams channel for team collaboration or visual notifications.\n  - Image Optimization: Use an image processing node (if available via an API or a custom function) to resize, crop, or compress the screenshot before saving or sending.\n- Custom Screenshot Parameters: The ScreenshotMachine API supports various optional parameters (e.g., width, height, quality, delay, fullpage).\n  - Upgrade: Extend the Receive URL Webhook to accept these parameters in the incoming JSON body (e.g., {\"url\": \"...\", \"width\": 1024, \"fullpage\": true}).\n  - Leverage: Dynamically pass these parameters to the Take Screenshot HTTP Request node's URL to customize your screenshots for different use cases.\n- Scheduled Monitoring:\n  - Upgrade: Combine this workflow with a Cron or Schedule node. Set it to run periodically (e.g., daily, hourly).\n  - Leverage: Automatically monitor your website or competitors' sites for visual changes. You could then save screenshots to cloud storage and even trigger a comparison tool if a change is detected.\n- Automated Visual Regression Testing:\n  - Upgrade: After taking a screenshot, store it with a unique identifier. In subsequent runs, take a new screenshot, then use an external image comparison API or a custom function to compare the new screenshot with a baseline.\n  - Leverage: Get automated alerts if visual elements on your website change unexpectedly, which is critical for quality assurance.\n- Dynamic Image Generation for Social Media/Marketing:\n  - Upgrade: Feed URLs (e.g., for new blog posts, product pages) into this workflow. After generating the screenshot, use it to create dynamic social media images or marketing assets.\n  - Leverage: Streamline the creation of engaging visual content, saving design time.",
  "featuredImage": "/data/workflows/4594/4594.webp",
  "author": {
    "id": 101,
    "slug": "ist00dent",
    "name": "ist00dent",
    "avatar": ""
  },
  "categories": [
    "Content Creation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1459,
  "downloads": 145,
  "createdAt": "2025-06-02T13:58:55.180Z",
  "updatedAt": "2026-01-16T08:35:12.491Z",
  "publishedAt": "2025-06-02T13:58:55.180Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4594"
}