{
  "id": 11695,
  "slug": "11695",
  "title": "Generate product descriptions from images and publish to Shopify using AI",
  "description": "## Who’s it for\nThis template is ideal for ecommerce founders, dropshippers, Shopify store owners, product managers, and agencies who want to automate product listing creation. It removes manual work by generating titles, descriptions, tags, bullet points, alt text, and SEO metadata directly from a product image and basic input fields.\n\n## What it does / How it works\nThis workflow starts with a webhook that receives product information along with an uploaded image.  \nThe image is uploaded to an online image host so it can be used inside Shopify.  \nAt the same time, the image is analyzed by Google Gemini using your provided product name, material type, and details.  \nGemini returns structured JSON containing:\n\n- Title  \n- Description  \n- Tags  \n- Bullet points  \n- Alt text  \n- SEO title  \n- SEO description  \n\nThe workflow cleans and parses the AI output, merges it with the uploaded image URL, and constructs a complete Shopify product payload.  \nFinally, it creates a new product in Shopify automatically using the generated content and the provided product variants, vendor, options, and product type.\n\n## Requirements\n- Google Gemini (PaLM) API credentials  \n- Shopify private access token  \n- Webhook endpoint for receiving data and files  \n- An imgbb (or any image hosting) API key  \n\n## How to set up\n1. Connect your Gemini and Shopify credentials.  \n2. Replace the imgbb API key and configure the hosting node.  \n3. Provide vendor, product type, variants, and options in the webhook payload.  \n4. Ensure your source system sends `file`, `product_name`, `material_type`, and extra fields.  \n5. Run the webhook URL and test with a sample product.\n\n## How to customize the workflow\n- Change the AI prompt for different product categories  \n- Add translation steps for multi-language stores  \n- Add price calculation logic  \n- Push listings to multiple Shopify stores  \n- Save generated metadata into Google Sheets or Notion  ",
  "featuredImage": "/data/workflows/11695/11695.webp",
  "author": {
    "id": 101,
    "slug": "pixcelsthemes",
    "name": "Pixcels Themes",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 141,
  "downloads": 14,
  "createdAt": "2025-12-11T10:47:51.704Z",
  "updatedAt": "2026-01-16T09:09:43.975Z",
  "publishedAt": "2025-12-11T10:47:51.704Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11695"
}