{
  "id": 8011,
  "slug": "8011",
  "title": "Conversational sales agent for WooCommerce with GPT-4, Stripe and CRM integration",
  "description": "## 📄 What this workflow does\nThis workflow transforms your n8n instance into a fully automated AI sales assistant for WooCommerce stores. It detects customer intent from chat, searches products, answers FAQs, generates Stripe payment links, captures leads into your CRM, and even escalates to human support when needed. It provides smooth conversational memory and syncs with your knowledge base to ensure accurate, human-like responses.\n\n## 👤 Who is this for\n- WooCommerce store owners who want to automate customer support and sales.\n- Sales and marketing teams looking to scale personalized product recommendations.\n- E-commerce managers who want to reduce manual chat handling.\n- Anyone aiming to integrate AI assistants with payments, CRM, and FAQs.\n\n\n## ✅ Requirements\n- WooCommerce account with API access.\n- Qdrant vector store (for FAQ and RAG retrieval).\n- OpenAI/Gemini API credentials (for intent detection + message generation).\n- Google Drive account (to sync and update knowledge base docs).\n- Stripe account (to generate instant payment links).\n- CRM account (HubSpot, Pipedrive, etc.) if lead capture is required.\n- Telegram account for optional human escalation.\n\n## ⚙️ How to set up\n- Connect WooCommerce API credentials in n8n.\n- Configure Gemini/OpenAI API for intent extraction and chat generation.\n- Set up Qdrant for document retrieval, and link to your Google Drive Sales Docs folder.\n- Configure Stripe API to enable instant payment link generation.\n- Connect your CRM to capture new leads automatically.\n- Add Telegram bot credentials for human escalation (optional).\n- Enable conversational memory and test chat flows end-to-end.\n\n\n## 🔁 How it works\n1. Intent Extraction → AI analyzes chat messages to detect Product Search, FAQ, Payment, or Lead Capture.\n2. Product Search → Queries WooCommerce catalog by keyword, SKU, or price range.\n3. FAQ Answering → Retrieves company policies/docs from Qdrant + Google Drive, answered via RAG.\n4. Payment Links → Stripe generates instant checkout links for customers ready to buy.\n5. Lead Capture → Name + email are auto-stored into CRM.\n6. Human Escalation → If intent is unclear, conversation is forwarded to Telegram.\n7. Conversational Memory → Maintains last 12 exchanges for natural dialogue.\n8. Knowledge Sync → Google Drive docs auto-update into Qdrant for live FAQ support.\n\n\n## 💡 About Margin AI\n[Margin AI](https://marginai.co/) is an AI-services agency that acts as your AI Service Companion. We design intelligent, human-centric automation solutions—turning your team’s best practices into scalable workflows and tools. Industries like marketing, sales, and operations benefit from our tailored AI consulting, automation tools, and chatbot development.\n",
  "featuredImage": "/data/workflows/8011/8011.webp",
  "author": {
    "id": 101,
    "slug": "cong-nguyen",
    "name": "Cong Nguyen",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 591,
  "downloads": 59,
  "createdAt": "2025-08-29T04:38:46.775Z",
  "updatedAt": "2026-01-16T08:53:32.535Z",
  "publishedAt": "2025-08-29T04:38:46.775Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8011"
}