{
  "id": 3501,
  "slug": "3501",
  "title": "Generate & auto-post social videos to multiple platforms with GPT-4 and Kling AI",
  "description": "![Workflow Screenshot](https://www.dr-firas.com/Workflow-AI_Social_Video_Generator.png)\n\n# AI-Powered Social Video Generator with Auto-Posting to Instagram, TikTok, YouTube, Facebook, LinkedIn, Threads, Pinterest, Twitter (X), and Bluesky\n\n## Who is this workflow for?\n\nThis workflow is ideal for content creators, marketers, social media managers, and automation enthusiasts who want to generate, customize, and publish short-form videos across multiple platforms without manual editing or posting. If you use tools like ChatGPT, Kling, or Blotato and want to streamline your content creation process, this workflow is made for you.\n\n## What problem does this workflow solve?\n\nPublishing regular video content on multiple platforms is time-consuming—especially when adding voice-overs, captions, and managing distribution. This workflow solves that by:\n\n- Automating video generation using AI (Kling + GPT-4)\n- Adding realistic voice narration\n- Styling subtitles for social media\n- Creating titles and social captions\n- Auto-posting to Instagram, TikTok, YouTube, Facebook, Threads, Twitter (X), LinkedIn, Pinterest, and Bluesky\n\nAll of this is triggered by a simple message sent via Telegram.\n\n## How the workflow works\n\nThis end-to-end automation transforms a short Telegram message into a fully produced and published social video:\n\n1. Receives a text prompt from Telegram  \n2. Transforms it into a detailed video scene using GPT-4  \n3. Generates a cinematic video with Kling  \n4. Creates a voice-over script and converts it to audio  \n5. Merges the video and the audio  \n6. Adds styled captions  \n7. Writes a social caption and an SEO-optimized title  \n8. Saves metadata to Google Sheets  \n9. Sends a preview via Telegram  \n10. Publishes the video to 9 social platforms using Blotato\n\n## Setup\n\n1. Connect your Telegram bot to the \"Telegram Trigger\" node  \n2. Add your OpenAI API key to all GPT-related nodes  \n3. Configure Kling API access in the \"Generate Video\" node  \n4. Link your Cloudinary account for audio upload  \n5. Connect JSON2Video to handle video merging and captioning  \n6. Set up Google Sheets with your preferred spreadsheet ID  \n7. Connect your Blotato API key and fill in the platform IDs (Instagram, TikTok, etc.)  \n8. Test by sending a Telegram message like:  \n   `generate video A robot exploring Mars, Why AI will reshape humanity`\n&gt; **Disclaimer:** This workflow uses Community Nodes, which are only available on self-hosted instances of n8n.\n\n## How to customize this workflow to your needs\n\n- **Change the visual style**: Adjust the GPT-4 prompt formatting to reflect your brand tone  \n- **Edit voice style**: Replace the TTS provider or tweak OpenAI's voice settings  \n- **Revise captions or titles**: Fine-tune the system prompts in the \"Create Description\" or \"Create Title\" nodes  \n- **Target fewer platforms**: Disable or remove nodes for platforms you don’t use  \n- **Add approval steps**: Insert a Telegram confirmation step before auto-publishing\n\n📄 **Documentation**: [Notion Guide](https://automatisation.notion.site/AI-powered-social-video-creation-and-auto-posting-to-Instagram-TikTok-LinkedIn-more-1cf3d6550fd98038a91edbdd3022d37f?pvs=4)\n\n## Demo Video\n\n🎥 Watch the full tutorial here: [YouTube Demo](https://youtu.be/lpfe0joyNL4)\n",
  "featuredImage": "/data/workflows/3501/3501.webp",
  "author": {
    "id": 101,
    "slug": "drfiras",
    "name": "Dr. Firas",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 17470,
  "downloads": 1747,
  "createdAt": "2025-04-09T17:44:59.665Z",
  "updatedAt": "2026-01-16T08:30:04.193Z",
  "publishedAt": "2025-04-09T17:44:59.665Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3501"
}