{
  "id": 12382,
  "slug": "12382",
  "title": "Translate Chinese text to multilingual audio with GPT-4o and ElevenLabs",
  "description": "\n## How It Works\nThis workflow provides automated Chinese text translation with high-quality audio synthesis for language learning platforms, content creators, and international communication teams. It addresses the challenge of converting Chinese text into accurate multilingual translations with natural-sounding voiceovers. The system receives Chinese text via webhook, validates input formatting, and processes it through an AI translation agent that generates multiple language versions. Each translation is converted to speech using ElevenLabs' neural voice models, then formatted into professional audio responses. A quality review agent evaluates translation accuracy, cultural appropriateness, and audio clarity against predefined criteria. High-scoring outputs are returned via webhook for immediate use, while low-quality results trigger review processes, ensuring consistent delivery of publication-ready multilingual audio content.\n\n## Setup Steps\n1. Obtain OpenAI API key and configure in \"Translation Agent\"\n2. Set up ElevenLabs account, generate API key\n3. Configure webhook URL and update in source applications to trigger workflow\n4. Customize target languages and voice settings in translation and ElevenLabs nodes\n5. Adjust quality thresholds in \"Check Quality Score\" \n6. Update output webhook endpoint in \"Return Audio Files\" node\n\n## Prerequisites\nActive accounts: OpenAI API access, ElevenLabs subscription.\n\n## Use Cases\nChinese language learning apps, international marketing content localization\n\n## Customization\nAdd additional target languages, modify voice characteristics and speaking rates\n\n## Benefits\nAutomates 95% of translation workflow, delivers publication-ready audio in minutes\n\n\n\n \n\n\n\n\n",
  "featuredImage": "/data/workflows/12382/12382.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5,
  "downloads": 0,
  "createdAt": "2026-01-02T05:00:01.191Z",
  "updatedAt": "2026-01-16T09:12:21.083Z",
  "publishedAt": "2026-01-02T05:00:01.191Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12382"
}