{
  "id": 7424,
  "slug": "7424",
  "title": "Website lead management: Send contact form submissions to WhatsApp & Google Sheets",
  "description": "## Who's it for\nBusiness owners, marketers, and web developers who want to instantly respond to website contact form submissions and maintain organized lead records without manual monitoring.\n\n## What it does\nThis workflow automatically processes contact form submissions from your website, sending immediate WhatsApp notifications with formatted lead details while simultaneously logging all data to Google Sheets for organized lead management and follow-up tracking.\n\n## How it works\nWhen someone submits your website contact form, the webhook instantly receives the data, formats it into a professional WhatsApp message with emojis and structure, sends the notification to your phone, and logs all details (name, email, phone, service, message, timestamp) to a Google Sheets database for permanent storage and analysis.\n\n## Requirements\n- WhatsApp Business API credentials\n- Google Sheets API access with a spreadsheet containing these columns:\n  - **date** (for timestamp)\n  - **name** (contact's full name)\n  - **email** (contact's email address)\n  - **phone** (contact's phone number)\n  - **service** (requested service/interest)\n  - **message** (contact's message/inquiry)\n- Website contact form that can POST to webhook URL with fields: name, email, phone, service, message\n- n8n instance (self-hosted or cloud)\n\n## Google Sheets Setup\nCreate a new Google Sheet with the following column headers in row 1:\n- Column A: `date`\n- Column B: `name` \n- Column C: `email`\n- Column D: `phone`\n- Column E: `service`\n- Column F: `message`\n\nThe workflow will automatically populate these columns with each form submission and use the date column for duplicate checking.\n\n## How to set up\n1. **Credentials Setup:**\n   - Configure WhatsApp Business API credentials in the WhatsApp node\n   - Set up Google Sheets API connection and grant necessary permissions\n   \n2. **Configuration:**\n   - Update the recipient phone number in the WhatsApp node (format: +1234567890)\n   - Replace the Google Sheets document ID with your spreadsheet ID\n   - Ensure your Google Sheet has the required column structure mentioned above\n   \n3. **Integration:**\n   - Copy the webhook URL from the Contact Form Trigger node\n   - Configure your website form to POST data to this endpoint with field names: name, email, phone, service, message\n   \n4. **Testing:**\n   - Test the workflow by submitting a sample form entry\n   - Verify WhatsApp notification is received and data appears in Google Sheets\n\n## How to customize the workflow\n- **Message Format:** Modify the WhatsApp message template in the Format Lead Data node\n- **Additional Fields:** Add more form fields by updating both the Code node and Google Sheets mapping\n- **Email Notifications:** Include email alerts by adding an Email node after the Format Lead Data node\n- **Conditional Logic:** Set up different notifications for high-priority services or VIP customers\n- **Data Validation:** Add filtering rules in the Code node to handle spam or invalid submissions\n- **Multiple Recipients:** Configure the WhatsApp node to send alerts to multiple team members",
  "featuredImage": "/data/workflows/7424/7424.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1224,
  "downloads": 122,
  "createdAt": "2025-08-15T10:54:47.612Z",
  "updatedAt": "2026-01-16T08:50:17.894Z",
  "publishedAt": "2025-08-15T10:54:47.612Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7424"
}