{
  "id": 6626,
  "slug": "6626",
  "title": "Analyze property maintenance costs with ScrapeGraphAI and budget planning",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# How it works\n\nThis workflow automatically analyzes property maintenance costs by scraping contractor websites and provides comprehensive budget planning and recommendations.\n\n## Key Steps\n\n1. **Scheduled Trigger** - Runs weekly to update maintenance cost data from multiple sources.\n2. **Multi-Source Scraping** - Uses ScrapeGraphAI to extract service data from plumbing, electrical, and HVAC contractor websites.\n3. **Cost Analysis** - JavaScript nodes process and categorize services by price level and urgency.\n4. **Service Comparison** - Compares providers within each category to find best-rated and most cost-effective options.\n5. **Budget Planning** - Creates annual budget with quarterly breakdown and service scheduling recommendations.\n6. **Property Manager Alerts** - Formats comprehensive reports with budget summaries and actionable recommendations.\n\n## Set up steps\n\n**Setup time: 10-15 minutes**\n\n1. **Configure ScrapeGraphAI credentials** - Add your ScrapeGraphAI API key for web scraping.\n2. **Customize contractor websites** - Update the URLs in the scraping nodes to target specific local contractor directories.\n3. **Adjust schedule frequency** - Modify the trigger timing based on how often you want cost updates.\n4. **Review budget parameters** - Customize the budget planning logic in the JavaScript nodes if needed.\n5. **Test the workflow** - Run manually first to ensure all scraping and analysis nodes work correctly.\n\n## Technologies Used\n\n- **ScrapeGraphAI** - For extracting structured data from contractor websites\n- **JavaScript Code Nodes** - For data processing, cost analysis, and budget planning\n- **Schedule Trigger** - For automated weekly execution\n- **JSON Data Processing** - For structured data handling and analysis\n",
  "featuredImage": "/data/workflows/6626/6626.webp",
  "author": {
    "id": 101,
    "slug": "vinci-king-01",
    "name": "vinci-king-01",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 361,
  "downloads": 36,
  "createdAt": "2025-07-29T10:59:04.271Z",
  "updatedAt": "2026-01-16T08:46:02.806Z",
  "publishedAt": "2025-07-29T10:59:04.271Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6626"
}