{
  "id": 9081,
  "slug": "9081",
  "title": "Create a weekly LLM traffic report using Google Analytics, GPT-5, and Gmail",
  "description": "## Overview\n\nGet a weekly report on website traffic driven by large language models (LLMs) such as ChatGPT, Perplexity, and Gemini. This workflow helps you track how these tools bring visitors to your site. A weekly snapshot can guide better content and marketing decisions.\n\n## How it works\n\n- The trigger runs every Monday.  \n- Pull the number of sessions on your website by source/medium from Google Analytics.  \n- The code node uses the following regex to filter referral traffic from AI providers like ChatGPT, Perplexity, and Gemini:\n\n```\n/^.openai.*|.*copilot.*|.*chatgpt.*|.*gemini.*|.*gpt.*|.*neeva.*|.*writesonic.*|.*nimble.*|.*outrider.*|.*perplexity.*|.*google.*bard.*|.*bard.*google.*|.*bard.*|.*edgeservices.*|.*astastic.*|.*copy.ai.*|.*bnngpt.*|.*gemini.*google.*$/i;\n```\n\n- Combine the filtered sessions into one list so they can be processed by an LLM.  \n- Generate a short report using the filtered data.  \n- Email the report to yourself.  \n\n## Setup\n\n1. Get or connect your [OpenAI API key](https://platform.openai.com/api-keys) and set up your OpenAI credentials in n8n.  \n2. Enable Google Analytics and Gmail API access in the Google Cloud Console. ([Read more here](https://cloud.google.com/apis/docs/getting-started)).\n3. Set up your Google Analytics and Gmail credentials in n8n. If you're using the cloud version of n8n, you can log in with your Google account to connect them easily.  \n4. In the Google Analytics node, add your credentials and select the property for the website you’re working with. Alternatively, you can use your property ID, which can be found in the Google Analytics admin panel under `Property &gt; Property Details`. The property ID is shown in the top-right corner. Add this to the property field.  \n5. Under **Metrics**, select the metric you want to measure. This workflow is configured to use *sessions*, but you can choose others. Leave the dimension as-is, since we need the source/medium dimension to filter LLMs.  \n6. *(Optional)* To expand the list of LLMs being filtered, adjust the regex in the code node. You can do this by copying and pasting one of the existing patterns and modifying it. Example: `|.*example.*|`  \n7. The LLM node creates a basic report. If you’d like a more detailed version, adjust the system prompt to specify the details or formatting you want.  \n8. Add your email address to the Gmail node so the report is delivered to your inbox.  \n\n## Requirements\n\n- OpenAI API key for report generation  \n- Google Analytics API enabled in Google Cloud Console\n- Gmail API enabled in Google Cloud Console  \n\n## Customizing this workflow\n\n- The regex used to filter LLM referral traffic can be expanded to include specific websites.  \n- The system prompt in the AI node can be customized to create a more detailed or styled report.  ",
  "featuredImage": "/data/workflows/9081/9081.webp",
  "author": {
    "id": 101,
    "slug": "robingeuens",
    "name": "Robin Geuens",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 430,
  "downloads": 43,
  "createdAt": "2025-09-29T21:22:07.334Z",
  "updatedAt": "2026-01-16T08:58:55.990Z",
  "publishedAt": "2025-09-29T21:22:07.334Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9081"
}