{
  "id": 7273,
  "slug": "7273",
  "title": "Automate QuickBooks customer & estimate creation from Google Sheets",
  "description": "# This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution to accelerate your sales and quoting process into Quickbooks.\n\nThis workflow creates a seamless data pipeline from a Google Sheet directly into QuickBooks, automating the creation of new customers and their initial sales estimates. It’s designed to save time, reduce human error, and ensure your financial records are always up-to-date.\n\n\n## How it works\n\n**1. Trigger on New Sheet Row:** The workflow starts automatically when you add a new row containing customer and estimate details to your designated Google Sheet.\n\n**2. Check for Duplicates:** Before doing anything else, it takes the customer's name from the sheet and searches your QuickBooks account to see if a customer with that exact name already exists.\n\n**3. Route Based on Existence (If/Else Logic):**\n- If the Customer is NEW: The workflow proceeds down the \"true\" path, first creating a new customer record in QuickBooks with the details from the sheet (Name, Email, Phone, Company). Immediately after, it creates a new sales estimate linked to that newly created customer.\n- If the Customer ALREADY EXISTS: The workflow follows the \"false\" path and stops. This is a built-in safety measure to prevent creating duplicate customer records.\n\n**4. End of Process:** The workflow concludes, having either created a new customer and estimate or having intelligently stopped to avoid duplication.\n\n## Step by Step Instructions\nFollow these steps carefully to get the workflow running.\n\n**1. Connect Your Credentials**\n- Google: Connect your Google account using OAuth2. Ensure you have enabled permissions for both Google Sheets and Google Drive.\n- QuickBooks: Connect your QuickBooks Online account using OAuth2 credentials.\n\n**2. Prepare Your Google Sheet**\nThis is the most critical step. Create a Google Sheet and ensure the first row contains these exact column headers:\n- CustomerName\n- Email\n- Phone\n- Company Name\n- Amount\n\n**3. Configure the n8n Nodes**\n\nGoogle Sheets Trigger:\n- Select your Google Sheet from the Document ID dropdown.\n- Select the specific sheet from the Sheet Name dropdown.\n\nCreate an estimate (QuickBooks Node):\n- This node has a default product/service (itemId) and tax code (TaxCodeRef) set. You must update these to match the items and tax codes in your QuickBooks account. See the Customization section for more details.\n\n**4. Activate the Workflow**\nSave the workflow and toggle the Active switch to \"on\". Now, every time you add a new row to your sheet, the automation will run.\n\n\n## Connect with us\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n\n## For Custom Worflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n",
  "featuredImage": "/data/workflows/7273/7273.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 495,
  "downloads": 49,
  "createdAt": "2025-08-12T07:39:12.878Z",
  "updatedAt": "2026-01-16T08:49:26.713Z",
  "publishedAt": "2025-08-12T07:39:12.878Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7273"
}