{
  "id": 8108,
  "slug": "8108",
  "title": "Quick HubSpot contact lookup in Slack for sales & support teams",
  "description": "## How it works\nThis workflow starts when a user triggers a custom slash command in Slack. The workflow checks if a valid message (email address or HubSpot contact ID) was provided. Based on the input, it searches HubSpot for the contact either by email or by ID. Once the contact is found, the workflow formats the details into a clean, Slack-friendly message card and posts it back into the Slack channel.\n\n## Step-by-step\n\n**Start with Slack Slash Command**\n- The workflow is triggered whenever someone uses a custom slash command in Slack.\n\n- It checks if the user actually entered something (email or ID). If nothing is entered, the workflow stops with an error.\n\n**Parse Search Input**\n- The workflow cleans up the user’s input and determines whether it’s an email address or a HubSpot contact ID.\n\n- This ensures the correct HubSpot search method is used.\n\n**Search in HubSpot**\n\n- If the input is an email → the workflow searches HubSpot by email.\n\n- If the input is an ID → the workflow retrieves the contact directly using the HubSpot contact ID.\n\n**Format Contact Info**\n- The retrieved HubSpot contact details (name, email, phone, company, deal stage, etc.) are formatted into a Slack-friendly message card.\n\n**Send Contact Info to Slack**\n- Finally, the formatted contact information is posted back into the Slack channel, making it instantly visible to the user and team.\n\n## Why use this?\n\n- Quickly look up HubSpot contacts directly from Slack without switching tools.\n\n- Works with both email addresses and HubSpot IDs.\n\n- Provides a clean, structured contact card in Slack with key details.\n\n- Saves time for sales and support teams by keeping workflows inside Slack.\n\n- Runs automatically once set up — no extra clicks or manual searches.",
  "featuredImage": "/data/workflows/8108/8108.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 81,
  "downloads": 8,
  "createdAt": "2025-09-01T06:09:48.099Z",
  "updatedAt": "2026-01-16T08:54:10.642Z",
  "publishedAt": "2025-09-01T06:09:48.099Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8108"
}