{
  "id": 7914,
  "slug": "7914",
  "title": "Manage Google Sheets data with GPT-4 natural language processing & calculator",
  "description": "![Screenshot 20250826 205424.png](fileId:2204)\n\n## Who’s it for  \nThis template is for users who want to combine the power of AI with Google Sheets for managing and calculating data quickly. It’s ideal for small businesses, data entry teams, and anyone who tracks lists, orders, or tasks in Google Sheets and needs AI-driven insights or calculations.  \n\n## How it works \nThe workflow connects an AI agent with Google Sheets and a calculator tool. When a user sends a chat message, the AI interprets the request, retrieves or updates rows in the connected sheet, and performs calculations when needed. For example, it can read a list of orders from a sheet and calculate totals or averages instantly. It also supports creating, updating, and deleting rows from the sheet through natural language instructions.  \n\n## How to set up  \n1. Copy the provided **Google Sheet** into your Google Drive.  \n2. Connect your **Google Sheets credentials** in n8n.  \n3. Add your **OpenAI credentials** for the AI agent.  \n4. Deploy the workflow and start interacting with it by sending chat prompts.  \n\n## Requirements  \n- OpenAI account (for AI responses)  \n- Google Sheets account with a spreadsheet  \n- n8n instance with LangChain nodes enabled  \n\n## How to customize the workflow  \n- Change the spreadsheet fields (ID, Name, etc.) to match your own data structure.  \n- Modify the AI prompt to guide the agent’s tone or behavior.  \n- Extend the workflow by adding more Google Sheets operations or AI tools for advanced tasks.  ",
  "featuredImage": "/data/workflows/7914/7914.webp",
  "author": {
    "id": 101,
    "slug": "yar",
    "name": "Yar Malik (Asfandyar)",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 223,
  "downloads": 22,
  "createdAt": "2025-08-26T16:06:01.790Z",
  "updatedAt": "2026-01-16T08:52:59.310Z",
  "publishedAt": "2025-08-26T16:06:01.790Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7914"
}