{
  "id": 12540,
  "slug": "12540",
  "title": "Assess document fraud risk and compliance with GPT-4, Claude and Slack alerts",
  "description": "# n8n Template Submission: AI-Powered Multi-Document Analysis & Recommendation Engine\n\n## 1. Title\n**AI Multi-Document Analyzer with Smart Recommendations & Reporting**\n\n\n## How It Works\nThis workflow automates intelligent document analysis by processing multiple uploaded files through parallel AI pipelines to extract insights, generate comparative analysis, and produce actionable recommendations delivered via email. Designed for business analysts, consultants, and researchers, it enables efficient synthesis of insights from diverse document types into strategic, data-driven conclusions. The workflow eliminates the manual effort of reviewing documents, identifying patterns, cross-referencing information, and formulating recommendations by orchestrating structured data extraction, routing content through specialized AI models (OpenAI and Claude), aggregating and validating results, and formatting professional-grade reports. End-to-end processing includes batch document ingestion, structured extraction, parallel AI analysis, comparative evaluation, recommendation generation, report formatting, and tracked delivery via Gmail.\n\n## Setup Steps\n1. Configure NVIDIA NIM API credentials for creative content analysis\n2. Add OpenAI API key with GPT-4 access for strategic evaluation\n3. Connect Anthropic Claude API for technical assessment capabilities\n4. Set up Google Sheets integration with read/write permissions\n5. Configure Gmail OAuth2 credentials for automated report delivery\n6. Customize analysis prompts and recommendation thresholds \n\n## Prerequisites\nNVIDIA NIM API access, OpenAI API key (GPT-4), Anthropic Claude API key\n## Use Cases\nMulti-vendor proposal evaluation, regulatory compliance document review\n## Customization\nAdjust AI model parameters per analysis depth, modify recommendation scoring algorithms\n## Benefits\nProcesses multiple documents 90% faster than manual review, eliminates bias through multi-model  ",
  "featuredImage": "/data/workflows/12540/12540.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 77,
  "downloads": 7,
  "createdAt": "2026-01-07T10:28:48.394Z",
  "updatedAt": "2026-01-16T09:12:37.860Z",
  "publishedAt": "2026-01-07T10:28:48.394Z",
  "nodes": 48,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12540"
}