{
  "id": 9762,
  "slug": "9762",
  "title": "Create an intelligent FAQ Telegram bot with Google Gemini and Supabase",
  "description": "Overview This template creates a smart FAQ bot on Telegram, powered by Google Gemini for intelligent answers and Supabase to store user data. The workflow can distinguish between new and existing users.\n\nHow It Works\n\nTrigger: The workflow starts when a user sends any message to the Telegram Bot.\n\nCheck User: It looks up the user's chat_id in a Supabase telegram_users table.\n\nRoute (New vs. Existing):\n\nNew User (True Path): If the user is not found, the workflow saves their chat_id to Supabase and sends a one-time welcome message.\n\nExisting User (False Path): If the user exists, the workflow proceeds to the AI step.\n\nGenerate Answer: It loads a predefined FAQ context and combines it with the user's question. This is sent to Google Gemini via the AI Agent node.\n\nSend Response: The AI-generated answer is sent back to the user on Telegram.\n\nSetup Instructions\n\nTelegram:\n\nConnect your Telegram credentials to the Telegram Trigger and both Send a text message nodes.\n\nSupabase:\n\nConnect your Supabase credentials to the Find user in DB and Create a row nodes.\n\nYou MUST have a table named telegram_users.\n\nThis table MUST have a column named chat_id (type: text or varchar).\n\nGoogle Gemini:\n\nConnect your Google Gemini (Palm API) credentials to the Google Gemini Chat Model node.\n\n(REQUIRED) Customization:\n\nOpen the Set FAQ Context node and change its contents with Questions (Q) and Answers (A) that are appropriate for your bot.\n\nChange the text in the Send a text message (Welcome Message) node as you want.",
  "featuredImage": "/data/workflows/9762/9762.webp",
  "author": {
    "id": 101,
    "slug": "muimsa",
    "name": "Mohammad Jibril",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 273,
  "downloads": 27,
  "createdAt": "2025-10-16T07:12:15.568Z",
  "updatedAt": "2026-01-16T09:01:48.230Z",
  "publishedAt": "2025-10-16T07:12:15.568Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9762"
}