{
  "id": 11046,
  "slug": "11046",
  "title": "Automate marketing leads import from Google Sheets to Airtable CRM",
  "description": "# 🎯General Principles\nThis workflow automates the import of leads into the **Company** table of a CRM built with Airtable. \n\nIts originality lies in leveraging the new \"**Data Table**\" node (an internal table within n8n) to generate an execution report.\n\n**📚 Why Data Tables:** This approach eliminates the need for reading/writing operations on a Google Sheet file or an external database.\n\n________________________________________\n\n## 🧩 It is structured on 3 main key steps:\n\n1. Reading leads for which email address validity has been verified.\n2. Creating or updating company information.\n3. Generating of execution report.\n\nThis workflow enables precise tracking of marketing actions while facilitating the historical record of interactions with prospects and clients.\n\n________________________________________\n\n## Prerequisites\n### Leads file:\nA prior validation check on email address accuracy is required.\n\n### Airtable:\nMust contain at least a Company table with the following fields:\n* Company: company name\n* Business Leader: name of the executive\n* Activity: business sector (notary, accountant, plumber, electrician, etc.)\n* Address: main company address\n* Zip Code: postal code\n* City: city\n* Phone Number: phone number\n* Email: email address of a manager\n* URL Site: company website URL\n* Opt-in: company’s consent for commercial prospecting\n* Campaign: reserved for future marketing campaigns\n* Valid Email: indicator confirming email verification\n\n________________________________________\n\n## ⚙️ Step-by-Step Description\n### 1️⃣ Initialization and Lead Selection\n**Data Table Initialization:**\nAn internal n8n table is created to build the execution report.\n\n**Lead Selection:**\nThe workflow selects leads from the Google Sheet file (Sheet1 tab) where the condition \"Valid Email\" is equal to OK.\n\n### 2️⃣ Iterative Loop\n**Company Existence Check:**\nThe Search Company node is configured with Always Output Data enabled.\nA JavaScript code node distinguishes three possibilities:\n1. Company does not exist: create a new record and increment the created records counter.\n\n2. Company exists once: update the record and increment the updated records counter.\n\n3. Company appears multiple times: log the issue in the Leads file under the Logs tab, requiring a data quality procedure.\n\n### 3️⃣ Execution Report Generation\nAn execution report is generated and emailed, example format:\n**Leads Import Report:**\n* Number of records read: 2392\n* Number of records created: 2345\n* Number of records updated: 42\n\nIf the sum of records created and updated differs from the total records read, it indicates **the presence of duplicates**. A counter for duplicated companies could be added.\n\n________________________________________\n\n## ✅ Benefits of this template\n* Exception Management and Logging: Identification and traceability of inconsistencies during import with dedicated logs for issues.\n* Data Quality and Structuring: Built-in checks for duplicate detection, validation, and mapping to ensure accurate analysis and compliance.\n* Automated Reporting: Systematic production and delivery of a detailed execution report covering records read, created, and updated.\n\n## 📬 Contact\nNeed help customizing this (e.g., expanding Data Tables, connecting multiple surveys, or automating follow-ups)?\n\n📧 [smarthome.smartelec@gmail.com](smarthome.smartelec@gmail.com)\n🔗 [guy.salvatore](https://www.linkedin.com/in/guy-salvatore-3570911a/)\n🌐 [smarthome-smartelec.fr](https://smarthome-smartelec.fr)",
  "featuredImage": "/data/workflows/11046/11046.webp",
  "author": {
    "id": 101,
    "slug": "guy",
    "name": "Guy",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 327,
  "downloads": 32,
  "createdAt": "2025-11-20T14:03:52.146Z",
  "updatedAt": "2026-01-16T09:07:16.313Z",
  "publishedAt": "2025-11-20T14:03:52.146Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11046"
}