{
  "id": 9774,
  "slug": "9774",
  "title": "Generate AI summaries from Hacker News to Slack with OpenRouter",
  "description": "## Who's it for\n\nThis template is for teams that want to stay updated on industry trends, tech news, or competitor mentions without manually browsing news sites. It's ideal for marketing, development, and research teams who use Slack as their central hub for automated, timely information.\n\n## What it does / How it works\n\nThis workflow runs on a daily schedule (default 9 AM), fetches the top articles from Hacker News for a specific keyword you define (e.g., 'AI'), and uses an AI agent with OpenRouter to generate a concise, 3-bullet point summary in Japanese for each article. The final formatted summary, including the article title, is then posted to a designated Slack channel. The entire process is guided by descriptive sticky notes on the canvas, explaining each configuration step.\n\n## How to set up\n\n1.  In the **Configure Your Settings** node, change the default keyword `AI` to your topic of interest and update the `slack_channel` to your target channel name.\n2.  Click the **OpenRouter Chat Model** node and select your OpenRouter API key from the Credentials dropdown. If you haven't connected it yet, you will need to create a new credential.\n3.  Click the **Send Summary to Slack** node and connect your Slack account using OAuth2 credentials.\n4.  (Optional) Adjust the schedule in the **Trigger Daily at 9 AM** node to change how often the workflow runs.\n5.  Activate the workflow.\n\n## Requirements\n\n* An n8n instance (Cloud or self-hosted).\n* A Slack account and workspace.\n* An OpenRouter API key stored in your n8n credentials.\n* If self-hosting, ensure the LangChain nodes are enabled.\n\n## How to customize the workflow\n\n* **Change the News Source:** Replace the **Hacker News** node with an **RSS Feed Read** node or another news integration to pull articles from different sources.\n* **Modify the AI Prompt:** In the **Summarize Article with AI** node, you can edit the system message to change the summary language, length, or tone.\n* **Use a Different AI Model:** Swap the **OpenRouter** node for an **OpenAI**, **Anthropic**, or any other supported chat model.\n* **Track Multiple Keywords:** Modify the workflow to loop through a list of keywords in the **Configure Your Settings** node to monitor several topics at once.",
  "featuredImage": "/data/workflows/9774/9774.webp",
  "author": {
    "id": 101,
    "slug": "yusei",
    "name": "Yusei Miyakoshi",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 736,
  "downloads": 73,
  "createdAt": "2025-10-16T11:27:42.975Z",
  "updatedAt": "2026-01-16T09:01:50.534Z",
  "publishedAt": "2025-10-16T11:27:42.975Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9774"
}