{
  "id": 7405,
  "slug": "7405",
  "title": "AI-powered WhatsApp support bot with ticket creation for Google Sheets",
  "description": "This n8n workflow automates the entire process, from learning based on your website data, documents to a multi-channel chatbot with automated ticket creation. It's the perfect solution for businesses looking to build a powerful and intelligent chatbot, replace their customer support operations team with a website widget support and a dedicated WhatsApp support agent.\n\n#### How it Works\n\n1.  **Data Ingestion & Vectorization**:\n    * The workflow starts with a simple form where you can input your website's **sitemap**, specific **page URLs**, and relevant documents containing your business information.\n    * n8n crawls and scrapes all the data from these sources.\n    * The scraped data is then processed and vectorized (converted into numerical representations).\n    * These vector embeddings are stored in a **Pinecone Vector DB** to create a powerful and searchable knowledge base.\n\n2.  **Multi-Channel User Interaction**:\n    * **Website Widget Support**: An integrated chatbot can be embedded directly onto your website. Users can ask questions and receive instant, accurate answers based on the vectorized data in Pinecone.\n    * **WhatsApp Support Agent**: A **WhatsApp trigger** allows users to interact with your business via WhatsApp. The bot responds to queries using the same knowledge base, making support accessible on a popular messaging platform.\n\n3.  **Intelligent Ticket Creation**:\n    * If a user describes a specific issue that requires human intervention, the bot will intelligently ask for more specific information (e.g., order number, user ID).\n    * Once the required information is provided, the workflow automatically creates a new support **ticket** in a designated **Google Sheet**.\n\n4.  **Automated Communication**:\n    * After a ticket is created, the workflow automatically sends a confirmation email to the user.\n    * This email contains the ticket details and a confirmation that their issue has been logged, ensuring a smooth and professional customer experience.\n\n#### Requirements\n\n* **n8n**: A self-hosted or cloud instance of n8n.\n* **Pinecone**: An account and API key for Pinecone to store your vector data.\n* **Google Sheets**: A Google account with a designated spreadsheet for storing support tickets.\n* **Email Service**: An email service provider (e.g., Gmail, SendGrid, Mailgun) configured with n8n to send automated emails.\n* **WhatsApp Business API**: Access to the WhatsApp Business API for the WhatsApp trigger.\n\n#### How to Use\n\n1.  **Configure Credentials**: Set up your credentials for Pinecone, Google Sheets, your email service, and the WhatsApp Business API within n8n.\n2.  **Populate the Knowledge Base**: Use the provided form to enter your website's sitemap, specific URLs, and documents. Run the initial part of the workflow to scrape and store this data in Pinecone.\n3.  **Activate the Chatbots**: Deploy the website widget and activate the WhatsApp trigger.\n4.  **Monitor and Manage**: Monitor the incoming tickets in your Google Sheet and manage customer queries efficiently, knowing that the automated system is handling the initial interactions and basic queries.",
  "featuredImage": "/data/workflows/7405/7405.webp",
  "author": {
    "id": 101,
    "slug": "zain",
    "name": "Zain Khan",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 214,
  "downloads": 21,
  "createdAt": "2025-08-14T22:26:58.703Z",
  "updatedAt": "2026-01-16T08:50:11.887Z",
  "publishedAt": "2025-08-14T22:26:58.703Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7405"
}