{
  "id": 11470,
  "slug": "11470",
  "title": "Real-time ISS overhead alert with weather check and multi-channel notifications",
  "description": "Get notified when the International Space Station passes over your location - but only when you can actually see it! This workflow combines real-time ISS tracking with weather condition checks to send you alerts at the perfect moment for observation.\n\n## Who is this for\n\n- Space enthusiasts and astronomy hobbyists who want to spot the ISS\n- Parents looking to share exciting science moments with their kids\n- Remote workers who want a unique break reminder\n- Educators creating engaging science experiences\n\n## What this workflow does\n\n1. Tracks ISS position every 10 minutes using the Open Notify API\n2. Calculates distance and direction from your location using the Haversine formula\n3. Checks weather conditions via OpenWeatherMap to determine if ISS will be visible\n4. Provides observation guidance including compass direction, elevation angle, and viewing tips\n5. Includes crew information showing who is currently aboard the ISS\n6. Sends multi-channel alerts to Discord, Telegram, and Gmail simultaneously\n\n## How to set up\n\n1. Configure your location in the Calculate Distance and Direction node\n2. Add OpenWeatherMap credentials (free tier available)\n3. Set up at least one notification channel (Discord, Telegram, or Gmail)\n4. Activate the workflow\n\n## Requirements\n\n- OpenWeatherMap API key (free)\n- At least one notification channel configured",
  "featuredImage": "/data/workflows/11470/11470.webp",
  "author": {
    "id": 101,
    "slug": "kaori",
    "name": "suzuki",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 22,
  "downloads": 2,
  "createdAt": "2025-12-04T01:25:58.725Z",
  "updatedAt": "2026-01-16T09:08:51.956Z",
  "publishedAt": "2025-12-04T01:25:58.725Z",
  "nodes": 55,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11470"
}