{
  "id": 4659,
  "slug": "4659",
  "title": "Forex News & Sentiment Telegram Alerts",
  "description": "# **Purpose & Audience**\n\nThis n8n workflow template is designed for Forex traders, analysts, and enthusiasts who want to automate the process of staying updated on the latest news and sentiment for any currency pair. By leveraging advanced news aggregation and sentiment analysis, the workflow delivers concise, actionable updates directly to your Telegram—helping you make more informed trading decisions without manual research on news for broader market sentiment.\n\n## **What It Does?**\n- Aggregates the latest news from major Forex platforms for your chosen currency pair.\n- Analyzes the news to extract market sentiment (bullish, bearish, or neutral) using an LLM.\n- Summarizes key headlines, technical levels (support/resistance), and highlights high-impact economic events.\n- Sends a neatly formatted update to your selected Telegram chat or group at your preferred schedule.\n\n### Who Is It For?\n1. Forex traders seeking a competitive edge by staying ahead of market sentiment shifts.\n2. Analysts who want automated, unbiased news curation and sentiment summaries.\n3. Anyone looking for a hands-off, plug-and-play solution to monitor any currency pair.\n\nSetup once, and you can use this workflow for a lifetime. Simply duplicate the workflow for as many currency pairs as you want—customize the inputs, and you’re set! No recurring fees, no coding required, and you control the update frequency and destinations.\n\n## How to Set Up?\n1. Choose your currency pair and set your preferred update schedule.\n2. Connect your LLM and Telegram credentials (simple, guided steps included).\n3. Specify where you want to receive the updates.\n4. That’s it—receive real-time, actionable Forex news and sentiment updates automatically.",
  "featuredImage": "/data/workflows/4659/4659.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1354,
  "downloads": 135,
  "createdAt": "2025-06-04T17:29:02.034Z",
  "updatedAt": "2026-01-16T08:35:34.468Z",
  "publishedAt": "2025-06-04T17:29:02.034Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4659"
}