{
  "id": 6564,
  "slug": "6564",
  "title": "Automate loan agency lead management with Twilio, Google Sheets & Drive",
  "description": "### How to Set Up 🛠️\n\nSetting up this powerful CRM system is a straightforward process that connects your lead sources, your database, and your communication channels. The core steps involve preparing your database, importing the workflow, and then customizing the nodes to match your business rules.\n\n### Setup Steps:\n\n1.  **Prepare Your Database**:\n    * Create a new Google Sheet (or Airtable Base) to serve as your central CRM database.\n    * Title the sheet `Loan Agency CRM` and create the following columns in the first row: `Name`, `Phone Number`, `Loan Type`, `Assigned Agent`, `Status`, `Date Captured`.\n    * This will be the single source of truth for all your leads.\n\n2.  **Import the Workflow**:\n    * Copy the provided workflow JSON and import it into your n8n instance. This will create both the \"Lead Intake\" and \"Status Update\" workflows.\n\n3.  **Configure Integrations**:\n    * **Webhook**: This node is the entry point. Simply copy the generated URL to use in your lead form integrations.\n    * **Google Sheets**: Add your Google Sheets credential. Replace `[YOUR SPREADSHEET ID]` with the ID from your newly created sheet.\n    * **Twilio / WhatsApp**: Add your communication credential. Replace `[YOUR TWILIO NUMBER]` with your number.\n    * **Google Drive (for documents)**: Add your credential and specify a secure folder ID where documents will be stored.\n\n4.  **Customize Business Logic**:\n    * **Node (`Auto-Assign Agent`)**: Open this `Function` node and edit the JavaScript code. Change the agent names, loan types, and locations to match your specific team and business rules.\n    * **Node (`Twilio`)**: If you have a list of agent phone numbers, you can use a lookup expression here to automatically send the notification to the right person.\n\n5.  **Connect Your Lead Sources**:\n    * Go to your Facebook Lead Ads, Google Forms, or website forms.\n    * In the integration settings, paste the `Webhook` URL you copied from n8n.\n    * This will ensure that every new lead is automatically sent to your CRM system.\n\n6.  **Activate & Test**:\n    * Once all settings are configured, save the workflow.\n    * Click the \"Inactive\" toggle to make it live.\n    * Run a test by submitting a dummy lead through one of your forms to ensure the data flows correctly into your Google Sheet and an agent is notified.",
  "featuredImage": "/data/workflows/6564/6564.webp",
  "author": {
    "id": 101,
    "slug": "marth",
    "name": "Marth",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 111,
  "downloads": 11,
  "createdAt": "2025-07-28T10:28:40.699Z",
  "updatedAt": "2026-01-16T08:45:41.672Z",
  "publishedAt": "2025-07-28T10:28:40.699Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6564"
}