{
  "id": 11432,
  "slug": "11432",
  "title": "Smart break recommendation system using Google Calendar, weather data, and GPT-4 to Slack",
  "description": "Who is this for\nThis workflow is perfect for busy professionals, consultants, and anyone who frequently travels between meetings. If you want to make the most of your free time between appointments and discover great nearby spots without manual searching, this template is for you.\nWhat it does\nThis workflow automatically monitors your Google Calendar and identifies gaps between appointments. When it detects sufficient free time (configurable, default 30+ minutes), it calculates travel time to your next destination, checks the weather, and uses AI to recommend the top 3 spots to visit during your break. Recommendations are weather-aware: indoor spots like cafés in malls or stations for rainy days, and outdoor terraces or open-air venues for nice weather.\nHow it works\n\nSchedule Trigger - Runs every 30 minutes to check your calendar\nFetch Data - Gets your next calendar event and user preferences from Notion\nCalculate Gap Time - Determines available free time by subtracting travel time (via Google Maps) from time until your next appointment\nWeather Check - Gets current weather at your destination using OpenWeatherMap\nSmart Routing - Routes to indoor or outdoor spot search based on weather conditions\nAI Recommendations - GPT-4.1-mini analyzes spots and generates personalized top 3 recommendations\nSlack Notification - Sends a friendly message with recommendations to your Slack channel\n\nSet up steps\n\nConfigure API Keys - Add your Google Maps, Google Places, and OpenWeatherMap API keys in the \"Set Configuration\" node\nConnect Google Calendar - Set up OAuth connection and select your calendar\nSet up Notion - Create a database for user preferences and add the database ID\nConnect Slack - Set up OAuth and specify your notification channel\nConnect OpenAI - Add your OpenAI API credentials\nCustomize - Adjust currentLocation and minGapTimeMinutes to your needs\n\nRequirements\n\nGoogle Cloud account with Maps and Places APIs enabled\nOpenWeatherMap API key (free tier available)\nNotion account with a preferences database\nSlack workspace with bot permissions\nOpenAI API key\n\nHow to customize\n\nChange trigger frequency: Modify the Schedule Trigger interval\nAdjust minimum gap time: Change minGapTimeMinutes in the configuration node\nModify search radius: Edit the radius parameter in the Places API calls (default: 1000m)\nCustomize spot types: Modify the type and keyword parameters in the HTTP Request nodes\nChange AI model: Switch to a different OpenAI model in the AI node\nLocalize language: Update the AI prompt to generate responses in your preferred language",
  "featuredImage": "/data/workflows/11432/11432.webp",
  "author": {
    "id": 101,
    "slug": "masa0258",
    "name": "長谷　真宏",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 15,
  "downloads": 1,
  "createdAt": "2025-12-02T12:04:01.477Z",
  "updatedAt": "2026-01-16T09:08:41.105Z",
  "publishedAt": "2025-12-02T12:04:01.477Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11432"
}