{
  "id": 4106,
  "slug": "4106",
  "title": "Resume data extraction and storage in Supabase from email attachments",
  "description": "### Description\n**What Problem Does This Solve? 🛠️**\n\nThis workflow automates the process of extracting key information from resumes received as email attachments and storing that data in a structured format within a Supabase database. It eliminates the manual effort of reviewing each resume, identifying relevant details, and entering them into a database. This streamlines the hiring process, making it faster and more efficient for recruiters and HR professionals.\n\n**Target audience**: Recruiters, HR departments, and talent acquisition teams.\n\n**What Does It Do? 🌟**\n* Monitors a designated email inbox for new messages with resume attachments.\n* Extracts key information such as name, contact details, education, work experience, and skills from the attached resumes.\n* Cleans and formats the extracted data.\n* Stores the processed data securely in a Supabase database.\n\n### Key Features 📋\n\n* Automatic email monitoring for resume attachments.\n* Intelligent data extraction from various resume formats (e.g., PDF, DOC, DOCX).\n* Customizable data fields to capture specific information.\n* Seamless integration with Supabase for data storage.\n* Uses **OpenRouter** to streamline API key management for services such as AI-powered parsing.\n\n### Setup Instructions\n\n**Prerequisites ⚙️**\n\n* **n8n Instance**: Self-hosted or cloud instance of n8n.\n* **Email Account**: Gmail account with Gmail API access for receiving resumes.\n* **Supabase Account**: A Supabase project with a database/table ready to store extracted resume data. You'll need the Supabase URL and API key.\n* **OpenRouter Account**: For managing AI model API keys centrally when using LLM-based resume parsing.\n\n ### **Installation Steps 📦**\n**1. Import the Workflow**:\n\n* Copy the exported workflow JSON.\n* Import it into your n8n instance via **“Import from File”** or **“Import from URL”**.\n\n**2. Configure Credentials**:\n\n* In **n8n &gt; Credentials**, add credentials for:\n  - **Email account (Gmail API)**: Provide Client ID and Client Secret from the Google Cloud Platform.\n  - **Supabase**: Provide the Supabase URL and the anon public API key.\n  - **OpenRouter (Optional)**: Add your OpenRouter API key for use with any AI-powered resume parsing nodes.\n\n* Assign these credentials to their respective nodes:\n\n  - **Gmail Trigger** → Email credentials.\n  - **Supabase Insert** → Supabase credentials.\n   - **AI Parsing Node** → OpenRouter credentials.\n\n**3. Set Up Supabase Table**:\n\nCreate a table in Supabase with columns such as:\n`name`, `email`, `phone`, `education`, `experience`, `skills`, `received_date`, etc.\n\nMake sure the field names align with the structure used in your workflow.\n\n**4. Customize Nodes:**\n\n* **Parsing Node(s):** Modify the workflow to use an **OpenAI model** directly for field extraction, replacing the **Basic LLM Chain** node that utilizes OpenRouter.\n\n**5. Test the Workflow:**\n\n* Send a test email with a resume attachment.\n* Check n8n's execution log to confirm the workflow triggered, parsed the data, and inserted it into Supabase.\n* Verify data integrity in your Supabase table.\n\n ### **How It Works**\n**High-Level Workflow 🔍**\n\n1. **Email Monitoring:** Triggered when a new email with an attachment is received (via Gmail API).\n2.  **Attachment Check:** Verifies the email contains at least one attachment.\n3.  **Prepare Data:** Extracts the attachment and prepares it for analysis.\n4. **Data Extraction:** Uses OpenRouter-powered LLM (if configured) to extract structured information from the resume.\n5. **Data Storage:** The structured information is saved into the Supabase database.\n\n### **Node Names and Actions (Example)**\n\n* **Gmail Trigger:** Triggers when a new email is received.\n* **IF**: Checks whether the received email includes any attachments.\n* **Get Attachments:** Retrieves attachments from the triggering email.\n* **Prepare Data:** Prepares the attachment content for processing.\n* **Basic LLM Chain:** Uses an AI model via OpenRouter to extract relevant resume data and returns it as structured fields.\n* **Supabase-Insert:** Inserts the structured resume data into your Supabase database.\n",
  "featuredImage": "/data/workflows/4106/4106.webp",
  "author": {
    "id": 101,
    "slug": "kacemdh",
    "name": "Belgacem Dhiflaoui",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 3527,
  "downloads": 352,
  "createdAt": "2025-05-16T13:42:57.033Z",
  "updatedAt": "2026-01-16T08:33:05.997Z",
  "publishedAt": "2025-05-16T13:42:57.033Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4106"
}