{
  "id": 7621,
  "slug": "7621",
  "title": "Automate ABM research to outreach with Octave, AI, and Instantly.ai",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# Complete account-based outreach automation with Octave context engine\n\n## Who is this for?\nRevenue teams, account-based marketing professionals, and growth operators who want a complete, automated pipeline from account identification to contextualized outreach. Built for teams ready to move beyond fragmented point solutions to an integrated, context-aware GTM engine.\n\n## What problem does this solve?\nMost GTM teams are flying blind with disconnected tools that can't talk to each other. You qualify accounts in one system, find contacts in another, research context manually, then hope your email sequences land. Each step loses context, and by the time you're writing outreach, you've forgotten why the account was qualified in the first place. Octave centralizes all this typically fragmented context - your ICP definitions, personas, value propositions, and business logic - so every agent operation can act on the same unified understanding of your market. This workflow demonstrates how Octave's agents work together seamlessly because they all share the same context foundation.\n\n## What this workflow does\n\n**Complete Account-to-Outreach Pipeline:**\nThis workflow demonstrates the full power of Octave's context engine by connecting multiple agent operations in a seamless flow. Unlike traditional tools that lose context at each handoff, Octave centralizes your business context - ICP definitions, personas, value propositions, competitive positioning - so every agent operates from the same unified understanding of your market.\n\n**External Context Research:**\n- Gathers real-time external data about target accounts (job postings, news, funding, etc.)\n- Processes this information to create runtime context for later use in outreach\n- Establishes the \"why reach out now\" foundation for the entire workflow\n\n**Company-Level Qualification:**\n- Uses Octave's company qualification to assess account fit against your specific offering\n- Leverages Product and Segment-level fit criteria defined in your Library\n- Filters out accounts that don't meet your qualification thresholds\n- Ensures only high-potential accounts proceed through the workflow\n\n**Intelligent Contact Discovery:**\n- Runs Octave's prospector agent on qualified accounts\n- Finds relevant stakeholders based on responsibilities and business context, not just job titles\n- Discovers multiple contacts per account for comprehensive coverage\n- Maintains qualification context when identifying the right people\n\n**Runtime Context Integration:**\n- Takes the external context gathered at the beginning and injects it into sequence generation\n- Creates truly dynamic, timely outreach that references current company events\n- Generates sequences that feel impossibly relevant and well-researched\n\n**Multi-Contact Sequence Generation:**\n- Splits discovered contacts into individual records for processing\n- Generates contextualized email sequences for each contact\n- Maintains account-level context while creating contact-specific messaging\n- Produces sequences (1-7 emails) that feel unmistakably meant for each person\n\n**Automated Campaign Deployment:**\n- Automatically adds all qualified contacts with their contextualized sequences to email campaigns\n- Maps dynamic content to campaign variables for seamless execution\n- Maintains the context chain from qualification through delivery\n\n## Setup\n\n**Required Credentials:**\n- Octave API key and workspace access\n- External data source API (job boards, news APIs, enrichment services, etc.)\n- Email platform API key (Instantly.ai configured, easily adaptable)\n- Optional: LLM credentials if using the example external research agent\n\n**Step-by-Step Configuration:**\n\n1. **Set up Account Input Source:**\n   - Replace `your-webhook-path-here` with a unique, secure path\n   - Configure your account source (CRM, website visitors, target lists) to send company data\n   - Ensure account data includes company name and domain for processing\n\n2. **Configure External Context Research:**\n   - Replace the example AI agent with your preferred external data source\n   - Set up connections to job boards, news APIs, or enrichment services\n   - Configure context gathering to find timely, relevant information about target accounts\n\n3. **Set up Company Qualification Agent:**\n   - Add your Octave API credentials\n   - Replace `your-octave-company-qualification-agent-id` with your actual agent ID\n   - Configure qualification criteria at Product and Segment levels in your Octave Library\n\n4. **Configure Prospector Agent:**\n   - Replace `your-octave-prospector-agent-id` with your actual prospector agent ID\n   - Define target personas and stakeholder types in your Octave Library\n   - Set contact discovery parameters for optimal coverage\n\n5. **Set up Sequence Agent:**\n   - Replace `your-octave-sequence-agent-id` with your actual sequence agent ID\n   - Configure runtime context integration for dynamic content\n   - Test sequence quality with the external context integration\n\n6. **Configure Email Campaign Platform:**\n   - Add your email platform API credentials\n   - Replace `your-campaign-id-here` with your actual campaign ID\n   - Ensure campaign supports custom variables for dynamic content\n\n**Required Webhook Payload Format:**\n```json\n{\n  \"body\": {\n    \"companyName\": \"InnovateTech Solutions\",\n    \"companyDomain\": \"innovatetech.com\"\n  }\n}\n```\n\n## How to customize\n\n**External Context Sources:** Replace the example research with your data sources:\n- **Job Board APIs:** Reference current hiring and team expansion\n- **News APIs:** Mention funding, product launches, or market expansion\n- **Enrichment Services:** Pull technology adoption, market changes, or competitive moves\n- **Social Monitoring:** Reference recent company posts or industry discussions\n\n**Company Qualification:** Configure qualification in your Octave company qualification agent:\n- **Product Level:** Define \"good fit\" and \"bad fit\" questions for your core offering\n- **Segment Level:** Set criteria for different market segments or use cases\n- **Qualification Thresholds:** Adjust the filter score based on your standards\n\n**Contact Discovery:** Customize prospecting in your Octave prospector agent:\n- **Target Personas:** Define which Library personas to prioritize\n- **Organizational Levels:** Focus on specific seniority levels or decision-making authority\n- **Contact Volume:** Adjust how many contacts to discover per qualified account\n\n**Runtime Context Integration:** Configure dynamic content injection:\n- **Context Definition:** Specify what external data represents in your sequences\n- **Usage Instructions:** Define how to incorporate context into messaging\n- **Email-Level Control:** Apply different context to different emails in sequences\n\n**Sequence Generation:** Customize email creation:\n- **Core Context (Library):** Define personas, use cases, and offering definitions\n- **Strategy (Playbooks):** Configure messaging frameworks and value propositions\n- **Writing Style (Agent):** Adjust tone, voice, and communication approach\n\n**Campaign Integration:** Adapt for different email platforms:\n- Update API endpoints and authentication for your preferred platform\n- Modify variable mapping for platform-specific requirements\n- Adjust sequence formatting and length based on platform capabilities\n\n## Use Cases\n- Complete inbound lead processing from website visitor to qualified outreach\n- Event-triggered account processing for funding announcements or hiring spikes\n- Competitive displacement campaigns with account qualification and contact discovery\n- Market expansion automation for entering new territories or segments\n- Product launch outreach with context-aware targeting and messaging\n- Customer expansion workflows for upselling within existing account bases",
  "featuredImage": "/data/workflows/7621/7621.webp",
  "author": {
    "id": 101,
    "slug": "nalinkrishnan",
    "name": "Nalin",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 215,
  "downloads": 21,
  "createdAt": "2025-08-20T00:53:52.049Z",
  "updatedAt": "2026-01-16T08:51:25.105Z",
  "publishedAt": "2025-08-20T00:53:52.049Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7621"
}