{
  "id": 6159,
  "slug": "6159",
  "title": "Sync Cal.com meeting bookings to Notion with contact management",
  "description": "This workflow is especially suitable for founders and operators offering services to their clients and regularly scheduling sales or project update meetings.\n## How it works\nWhen a booking is created, rescheduled, or canceled in cal.com, this workflow syncs the meeting and contact data into Notion.\n\n**When a new booking is scheduled:**\n\n1. Creates a meeting in the dedicated Notion database. Here we can customize all the information to include on the meeting page (e.g., mapping the answers to custom questions).\n\n2. Finds the Contact(s) in the dedicated Notion database (based on the email). If the Contact(s) exists, it links the contact(s) to the newly created meeting. If the Contact(s) doesn’t exist, it creates the contact(s) and links them to the newly created meeting.\n\n**When a booking is rescheduled:**\n\n1. The automation finds the event in Notion (based on the “cal id” property)\n\n2. It updates the event date and time in Notion\n\n**When a booking is cancelled:**\n\nThe automation deletes the event in Notion (i.e., it archives the page, which remains available in the Trash for 30 days)\n\n## Requirements\nA Cal account and [API key](https://app.cal.com/settings/developer/api-keys).\n\nA Notion account and connection with access to all the databases involved (Meetings, Contacts). Find all your connections, manage their access, or create a new connection on your [Notion Integrations page](https://www.notion.so/profile/integrations).\n\nA Meetings and Contacts database in Notion, both accessible by the Integration (see step 2 above). The database names don't matter. You will input your database IDs in the workflow. Find a Notion database ID in the URL between the slash characters.\n\n## Notion database column specifications\nIn the *Meetings* database, these are required properties:\n1. Event time (date)\n2. cal id (text)\n3. Contacts (relation)\n4. Name\n\nIn the *Contacts* database, these are required properties:\n1. Name\n2. Email\n3. Meetings (relation)\n---\n[Read the essay and watch the video](https://www.simonesmerilli.com/business/cal-notion-automation) for a detailed walkthrough.",
  "featuredImage": "/data/workflows/6159/6159.webp",
  "author": {
    "id": 101,
    "slug": "simo",
    "name": "Simone Smerilli",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 340,
  "downloads": 34,
  "createdAt": "2025-07-19T00:40:22.302Z",
  "updatedAt": "2026-01-16T08:43:29.857Z",
  "publishedAt": "2025-07-19T00:40:22.302Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6159"
}