{
  "id": 7585,
  "slug": "7585",
  "title": "Automatically rename Gmail attachments with GPT-4o and save to Google Drive",
  "description": "## Automatically Rename Gmail Attachments with AI and Save to Google Drive\n\n### Who is this for?\n\nThis workflow is perfect for anyone who regularly receives important email attachments like reports, invoices, or PDFs and wants them:\n\n- Renamed using clean AI generated filenames  \n- Automatically saved to a specific Google Drive folder  \n- Neatly organized without manual work  \n\nIt is ideal for freelancers, business owners, accountants, and productivity enthusiasts.\n\n### What does it solve?\n\nManually naming and organizing email attachments takes time and often leads to messy files.\n\nThis workflow solves that by:\n\n- Automatically downloading unread Gmail attachments  \n- Using AI to understand the content and generate clean, consistent filenames  \n- Saving the renamed files to your chosen Google Drive folder  \n- Marking emails as read after processing  \n\nNo more confusing filenames like \"Attachment 1.pdf\".\n\n### How it works\n\n1. The workflow runs on a scheduled interval (every hour by default)  \n2. It checks Gmail for any unread emails with attachments.  \n3. For each email:\n   - Downloads attachments  \n   - Extracts and reads PDF content  \n   - Uses AI to generate a new filename in the format: `YYYYMMDD-keyword-summary.pdf`  \n4. Saves the file to Google Drive with the new name  \n5. Marks the email as read to avoid duplicates  \n\n### How to set up?\n\n1. Connect these accounts in your n8n credentials:\n   - Gmail (OAuth2)  \n   - Google Drive (OAuth2)  \n   - OpenAI (API key)  \n\n2. Update the folder URL in the Google Drive node to your target folder  \n3. Optional: adjust the trigger interval if you want it to run more or less often  \n\n### How to customize this workflow to your needs\n\n- Change the AI prompt to create different naming rules, such as including sender or topic  \n- Dynamically set Drive folders based on email sender or subject  \n",
  "featuredImage": "/data/workflows/7585/7585.webp",
  "author": {
    "id": 101,
    "slug": "mattxchong",
    "name": "Matt Chong | n8n Creator",
    "avatar": ""
  },
  "categories": [
    "AI Summarization",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1098,
  "downloads": 109,
  "createdAt": "2025-08-19T11:24:45.805Z",
  "updatedAt": "2026-01-16T08:51:14.405Z",
  "publishedAt": "2025-08-19T11:24:45.805Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7585"
}