{
  "id": 9332,
  "slug": "9332",
  "title": "Automate LinkedIn job postings from Recrutei ATS with GPT-4o content generation",
  "description": "## Overview: Automated LinkedIn Job Posting with AI\n\nThis workflow automates the publication of new job vacancies on LinkedIn immediately after they are created in the Recrutei ATS (Applicant Tracking System). It leverages a Code node to pre-process the job data and a powerful AI model (GPT-4o-mini, configured via the OpenAI node) to generate compelling, marketing-ready content.\n\nThis template is designed for Recruitment and Marketing teams aiming to ensure consistent, timely, and high-quality job postings while saving significant operational time.\n\n## Workflow Logic & Steps\n\n1.  **Recrutei Webhook Trigger:** The workflow is instantly triggered when a new job vacancy is published in the Recrutei ATS, sending all relevant job data via a webhook.\n2.  **Data Cleaning (Code Node 1):** The first Code node standardizes boolean fields (like `remote`, `fixed_remuneration`) from `0`/`1` to descriptive text (`'yes'`/`'no'`).\n3.  **Prompt Transformation (Code Node 2):** The second, crucial Code node receives the clean job data and:\n    * Maps the original data keys (e.g., `title`, `description`) to user-friendly labels (e.g., `Job Title`, `Detailed Description`).\n    * Cleans and sanitizes the HTML description into readable Markdown format.\n    * Generates a single, highly structured prompt containing all job details, ready for the AI model.\n4.  **AI Content Generation (OpenAI):** The AI Model receives the structured prompt and acts as a **'Marketing Copywriter'** to create a compelling, engaging post specifically optimized for the LinkedIn platform.\n5.  **LinkedIn Post:** The generated text is automatically posted to the configured LinkedIn profile or Company Page.\n6.  **Internal Logging (Google Sheets):** The workflow concludes by logging the event (Job Title, Confirmation Status) into a Google Sheet for internal tracking and auditing.\n\n## Setup Instructions\n\nTo implement this workflow successfully, you must configure the following:\n\n1.  **Credentials:**\n    * Configure **OpenAI** (for the Content Generator).\n    * Configure **LinkedIn** (for the Post action).\n    * Configure **Google Sheets** (for the logging).\n2.  **Node Configuration:**\n    * Set up the Webhook URL in your Recrutei ATS settings.\n    * Replace `YOUR_SHEET_ID_HERE` in the **Google Sheets Logging** node with your sheet's ID.\n    * Select the correct LinkedIn profile/company page in the **Create a post** node.",
  "featuredImage": "/data/workflows/9332/9332.webp",
  "author": {
    "id": 101,
    "slug": "paulo-lazari",
    "name": "Recrutei  Automações ",
    "avatar": ""
  },
  "categories": [
    "HR",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 460,
  "downloads": 46,
  "createdAt": "2025-10-07T02:02:34.837Z",
  "updatedAt": "2026-01-16T09:00:01.616Z",
  "publishedAt": "2025-10-07T02:02:34.837Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9332"
}