{
  "id": 8909,
  "slug": "8909",
  "title": "Ai lead scoring & enrichment from Mailchimp to HubSpot and Pipedrive with GPT-4o",
  "description": "## How it works\n\nThis workflow captures new subscribers from a Mailchimp list and extracts their key details.  \nIt then enriches the subscriber data using AI, predicting professional attributes and assigning a lead score.  \nBased on the score, high-value leads are identified, and all leads are synced into HubSpot and Pipedrive.  \nFor top-priority leads, the workflow automatically creates new deals in Pipedrive for sales follow-up.  \n\n## Step-by-step\n\n## Step-by-step\n\n**1. Capture subscriber data**  \n- **Mailchimp Subscriber Trigger** – Detects new signups in a Mailchimp list.  \n- **Extract Subscriber Data** – Normalizes payload into clean fields like name, email, and timestamp.  \n\n**2. Enrich with AI**  \n- **Lead Enrichment AI** – Uses AI to infer company, role, industry, intent, LinkedIn, and lead score.  \n- **Parse & Merge Enrichment** – Merges AI output with subscriber info and sets defaults if parsing fails.  \n\n**3. Qualify leads**  \n- **High-Value Lead Check** – Filters leads with a score ≥70 to flag them as priority.  \n- **Create High-Value Deal** – Opens a new deal in Pipedrive for high-value leads.  \n\n**4. Sync to CRMs**  \n- **HubSpot Contact Sync** – Updates enriched lead data in HubSpot CRM.  \n- **Pipedrive Person Create** – Adds lead as a person in Pipedrive.  \n\n\n## Why use this?\n\n- Automatically enrich raw Mailchimp subscribers with valuable professional insights.  \n- Score and qualify leads instantly for prioritization.  \n- Keep HubSpot and Pipedrive updated with enriched lead records.  \n- Automate deal creation for high-value opportunities, saving sales team effort.  \n- Build a seamless pipeline from marketing signups to CRM-ready opportunities.  \n",
  "featuredImage": "/data/workflows/8909/8909.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 238,
  "downloads": 23,
  "createdAt": "2025-09-25T05:06:30.953Z",
  "updatedAt": "2026-01-16T08:58:15.385Z",
  "publishedAt": "2025-09-25T05:06:30.953Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8909"
}