{
  "id": 8187,
  "slug": "8187",
  "title": "Generate email newsletters from Telegram keywords with Dumpling AI and GPT",
  "description": "### Who is this for?  \nThis workflow is perfect for content creators, newsletter publishers, digital marketers, and virtual assistants who need a quick way to generate professional newsletters from trending news without manually curating and formatting articles.  \n\n---  \n\n### What problem is this workflow solving?  \nManually searching for news, summarizing articles, formatting them into a newsletter, and sending them by email is time-consuming and inconsistent. This workflow automates the process end-to-end: from capturing a keyword in Telegram to sending a ready-to-publish HTML newsletter by Gmail.  \n\n---  \n\n### What this workflow does  \nThe workflow begins when a keyword is received from Telegram. The keyword is expanded into trending suggestions using Dumpling AI Autocomplete, then passed to Dumpling AI Google News to fetch recent articles. The results are structured, split, and scraped for clean content. The combined content is sent to OpenAI to generate a professional HTML newsletter and subject line, which is finally delivered to a chosen inbox via Gmail.  \n\n---  \n\n### Nodes Overview  \n\n1. Telegram Trigger – `Start: Receive Keyword`  \n   Listens for a keyword sent from Telegram to initiate the workflow.  \n\n2. HTTP Request – `Google Autocomplete via Dumpling AI`  \n   Expands the keyword into trending search suggestions.  \n\n3. HTTP Request – `Search Google News via Dumpling AI`  \n   Fetches recent news articles related to the autocomplete suggestions.  \n\n4. Parser and Split Nodes – `Process Articles`  \n   Formats results into structured JSON and splits them into individual articles.  \n\n5. HTTP Request – `Scraper via Dumpling AI`  \n   Scrapes and cleans each article to extract high-quality text.  \n\n6. Aggregate – `Combine Article Content`  \n   Merges all cleaned articles into a single dataset for newsletter generation.  \n\n7. OpenAI – `Generate Newsletter`  \n   Produces a ready-to-use HTML newsletter and subject line.  \n\n8. Gmail – `Send Newsletter`  \n   Delivers the completed newsletter to the specified inbox.  \n\n---  \n\n### 📝 Notes  \n\n- You must connect Dumpling AI and OpenAI accounts with valid API keys before running.  \n- The Telegram trigger can be configured for private or group chats depending on your use case.  \n- Ensure Gmail is properly connected with send permissions enabled.  \n",
  "featuredImage": "/data/workflows/8187/8187.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 173,
  "downloads": 17,
  "createdAt": "2025-09-02T19:08:50.223Z",
  "updatedAt": "2026-01-16T08:54:34.521Z",
  "publishedAt": "2025-09-02T19:08:50.223Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8187"
}