{
  "id": 10617,
  "slug": "10617",
  "title": "Brand DNA generator using JotForm, Google Search, Gemini AI & Notion",
  "description": "# Automated Brand DNA Generator Using JotForm, Google Search, AI Extraction & Notion\n\nThe Brand DNA Generator workflow automatically scans and analyzes online content to build a company’s Brand DNA profile.  It starts with input from a form, then crawls the company’s website and Google search results to gather relevant information. Using AI-powered extraction, the system identifies insights such as value propositions, ideal customer profiles (ICP), pain points, proof points, brand tone, and more.  All results are neatly formatted and automatically saved to a Notion database as a structured Brand DNA report, eliminating the need for manual research.\n\n## 🛠️ Key Features\n- Automated data capture, collects company data directly from form submissions and Google search results.  \n- Uses AI-powered insight extraction with LLMs to extract and summarize brand-related information from website content.  \n- Fetches clean text from multiple web pages using HTTP requests and a content extractor.  \n- Merges extracted data from multiple sources into a single Brand DNA JSON structure.  \n- Automatically creates a new page in Notion with formatted sections (headings, paragraphs, and bullet points).  \n- Handles parsing failures and processes multiple pages efficiently in batches.\n\n## 🔧 Requirements\n- JotForm API Key, to capture company data from form submissions.  \n- SerpAPI Key, to perform automated Google searches.  \n- OpenRouter / LLM API, for AI-based language understanding and information extraction.  \n- Notion Integration Token & Database ID, to save the final Brand DNA report to Notion.\n\n## 🧩 Setup Instructions\n1. Connect your JotForm account and select the form containing the fields Company Name and Company Website.  \n2. Add your SerpAPI Key.  \n3. Configure the AI model using OpenRouter or LLM.  \n4. Enter your Notion credentials and specify the databaseId in the Create a Database Page node.  \n5. Customize the prompt in the Information Extractor node to modify the tone or structure of AI analysis (Optional).  \n6. Activate the workflow, then submit data through the JotForm to test automatic generation and Notion integration.\n\n## 💡 Final Output  \nA complete Brand DNA Report containing:\n- Company Description  \n- Ideal Customer Profile  \n- Pain Points  \n- Value Proposition  \n- Proof Points  \n- Brand Tone  \n- Suggested Keywords  \nAll generated automatically from the company’s online presence and stored in Notion with no manual input required.",
  "featuredImage": "/data/workflows/10617/10617.webp",
  "author": {
    "id": 101,
    "slug": "budisj",
    "name": "Budi SJ",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 41,
  "downloads": 4,
  "createdAt": "2025-11-08T04:23:16.534Z",
  "updatedAt": "2026-01-16T09:05:41.454Z",
  "publishedAt": "2025-11-08T04:23:16.534Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10617"
}