{
  "id": 11759,
  "slug": "11759",
  "title": "Email newsletter system with SendGrid, Google Sheets & freemium rate limiting",
  "description": "A complete email campaign automation system featuring dual-mode access control (Demo/Pro), usage tracking, and professional email delivery. Perfect for SaaS products, marketing agencies, or anyone building newsletter tools with freemium models.\n\n**WHAT IT DOES**\nThis workflow manages email newsletter campaigns with built-in rate limiting for free users and unlimited access for premium users. It automatically tracks daily usage, manages user data in Google Sheets, delivers emails via SendGrid, and sends real-time notifications through Telegram.\n\n**KEY FEATURES**\n- Dual-Mode System: Demo mode (5 emails/day) and Pro mode (unlimited)\n- Smart Rate Limiting: Automatic daily counter reset\n- User Management: Automatic new user registration and tracking\n- Google Sheets Integration: Stores user data, send counts, and usage history\n- Professional Email Delivery: SendGrid integration for reliable sending\n- Real-Time Monitoring: Telegram notifications for every send\n- Ready-to-Use Templates: 4 professional email designs included (Modern, Professional, Promotional, Newsletter)\n- Live Preview: See exactly how emails look before sending\n- HTML Export: Copy email HTML for use in any platform\n\n**HOW IT WORKS**\n1. User accesses the Email Newsletter Builder web form\n2. Designs email using one of 4 professional templates\n3. Chooses Demo or Pro mode\n4. Webhook receives the email data and configuration\n5. Workflow checks mode (Demo/Pro)\n6. For Demo mode:\n   - Queries Google Sheets for user email\n   - Checks if user exists and validates daily limit (&lt;5 sends)\n   - If new user: Creates database entry\n   - If existing user + under limit: Increments counter\n   - If limit reached: Returns error message\n7. For Pro mode: Sends immediately without limits\n8. SendGrid delivers the email\n9. Google Sheets updates with new send count and timestamp\n10. Telegram notification sent to admin\n11. Success/error response returned to user\n\n**SETUP REQUIREMENTS**\n1. Google Sheets account (free)\n2. SendGrid account (free tier: 100 emails/day)\n3. Telegram account + bot (free)\n4. n8n instance (self-hosted or cloud)\n\n**SUPPORT & FEEDBACK**\nQuestions or issues? Connect with me on [LinkedIn](https://www.linkedin.com/in/gilbert-onyebuchi/)\nWant to see it in action? Try the live demo: [Click here](https://sites.google.com/view/template-n8n/email-newsletter)\n\n⭐ If you find this workflow helpful, please give it a rating and share your feedback!\n\n",
  "featuredImage": "/data/workflows/11759/11759.webp",
  "author": {
    "id": 101,
    "slug": "gilbert-onyebuchi",
    "name": "Gilbert Onyebuchi",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 25,
  "downloads": 2,
  "createdAt": "2025-12-13T09:33:24.128Z",
  "updatedAt": "2026-01-16T09:10:00.937Z",
  "publishedAt": "2025-12-13T09:33:24.128Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11759"
}