{
  "id": 8577,
  "slug": "8577",
  "title": "Auto-edit images from Google Drive with Nano Banana and send via Gmail",
  "description": "Auto-Edit Images from Google Drive with (Wavespeed) Nano Banana and Send via Gmail\n\nWhen a new image is uploaded to a specific Google Drive folder, this workflow sends it to Wavespeed’s Google Nano Banana image editing API, waits for the edited version, and then emails the result automatically. Perfect for creators, marketers, and ops teams who want hands-off, consistent image edits with instant delivery to a stakeholder inbox.\n\n👉 Watch step-by-step video tutorials of workflows like these on: www.youtube.com/@automatewithmarc\n\nHighlights\n\nGoogle Drive trigger detects new image uploads\n\nWavespeed API (Google Nano Banana) performs automated image editing\n\nPolling loop checks job status until complete\n\nGmail auto-sends the edited image to your chosen recipient\n\nGreat for social media pipelines, product photo retouching, or team approvals\n\n\nApps & Nodes Used\n\nTrigger: Google Drive Trigger (fileCreated in folder)\n\nHTTP Request: POST to Wavespeed (submit edit job)\n\nWait: Delay before first status check (15s)\n\nHTTP Request: GET result (poll prediction status)\n\nIF: Status == completed → proceed, else wait & recheck\n\nGmail: Send edited image output to recipient\n\nPrerequisites\n\nn8n account (Cloud or Self-hosted)\n\nGoogle Drive folder for uploads\n\nWavespeed API key (HTTP Header Auth)\n\nGmail account with OAuth2 connected to n8n\n\nConfiguration (5 Steps)\n\nGoogle Drive Trigger – set to your image upload folder.\n\nPOST Image Edit Request – sends file URL + prompt (default: “Change the lighting to night scene”).\n\nWait 15s – lets the job start.\n\nGET Image Edit Request – checks prediction status/result.\n\nIF → Gmail – once status = completed, send edited image to your chosen email.\n\nCustomization\n\nChange the prompt (e.g., “remove background”, “enhance product lighting”).\n\nSet Gmail recipient dynamically or statically.\n\nAdjust polling wait times based on job length.\n\nSave results to Drive/S3 instead of email if needed.\n\nError Handling\n\nAdd IF nodes to catch API errors.\nSet a retry limit to avoid infinite loops.\nUse Drive “Share File” if API can’t access the uploaded file link.",
  "featuredImage": "/data/workflows/8577/8577.webp",
  "author": {
    "id": 101,
    "slug": "marconi",
    "name": "Automate With Marc",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1171,
  "downloads": 117,
  "createdAt": "2025-09-14T14:34:16.211Z",
  "updatedAt": "2026-01-16T08:56:37.112Z",
  "publishedAt": "2025-09-14T14:34:16.211Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8577"
}