{
  "id": 4089,
  "slug": "4089",
  "title": "Track SEO keyword rankings in Google Search with ScrapingBee API",
  "description": "## Who is this template for?\n\nThis SEO Reporting workflow template is ideal for digital marketers, SEO consultants, content strategists, and founders who need to quickly gather, format, and store Google search result data. If you regularly audit SERPs, track keyword performance, or monitor competitors, this automation lets you generate polished SEO reports in seconds—ready to share or analyze further.\n\n![Google SERP Scraper n8n.jpg](fileId:1315)\n\n## What problem does this workflow solve?\n\nScraping and formatting Google search results for SEO insights is often manual, repetitive, and error-prone or requires expensive software. Professionals frequently face challenges like:\n\n* Collecting live, structured data from Google for multiple keywords\n* Converting raw search results into readable reports for clients or stakeholders\n* Logging changes in rankings or URLs across time for historical tracking\n* Exporting SEO data into spreadsheets for deeper analysis\n* High monthly software fees\n\n## What this workflow does\n\nThis n8n workflow scrapes the top organic Google search results for a given keyword and automatically creates a downloadable report while also logging the results in a table format for long-term storage or further processing.\n\nHere’s what it includes:\n\n* A trigger form that accepts a search keyword from the user\n* An automated API call to fetch Google’s SERP data\n* Two output formats: a formatted **HTML table** for emails and a **Markdown table** for download (e.g., for Excel, Airtable or Google Sheets)\n* Automatic CSV file generation for download\n* Optional email delivery of the report\n\n## Setup\n\nGetting started is simple:\n\n1. **Enter your API key**\n\n   * Add your API key to the “Scrape Google SERPs” HTTP Request node (Step-by-step guide inside the template)\n   * Replace the default query with your own custom Google search parameters if needed\n\n2. **Set up delivery options**\n\n   * Update your email in the “Mail SEO Report” node for report delivery\n   * Use the downloadable file output from the “Convert to File” node\n   * Optional: Add a Google Sheets (or similar) node which imports the file\n\n3. **Test the workflow**\n\n   * Use the built-in form to input a keyword\n   * Confirm that results appear in both your email and downloadable file\n\n4. **Activate the workflow**\n\n   * Turn on the trigger so your team or clients can submit keywords at any time\n\n## How to customize this workflow\n\nThis template is easy to extend for a variety of SEO automation needs:\n\n* Add a loop to handle multiple keywords at once\n* Connect to Airtable, Notion or Google Sheets\n* Integrate with Slack or Discord for notifications\n* Apply additional filtering to track only new or changed search results\n* Schedule it to run daily or weekly with a cron trigger\n\nBy combining live SERP scraping, report formatting, and spreadsheet integration, this workflow gives you a fast and flexible SEO reporting system you can use right away or scale up as needed.\n",
  "featuredImage": "/data/workflows/4089/4089.webp",
  "author": {
    "id": 101,
    "slug": "gegenfeld",
    "name": "Gegenfeld",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 412,
  "downloads": 41,
  "createdAt": "2025-05-15T23:42:27.189Z",
  "updatedAt": "2026-01-16T08:32:59.864Z",
  "publishedAt": "2025-05-15T23:42:27.189Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4089"
}