{
  "id": 3994,
  "slug": "3994",
  "title": "Readable workflow export & deployment pipeline for multi-environment CI/CD",
  "description": "**This n8n workflow template uses community nodes and is only compatible with the self-hosted version of n8n.** \n\n## Export workflows with readable names, tagged for different environments\n\nTo ensure understandable workflow exports, ease of use in delivery pipelines, and a better developer experience, this workflow helps with exporting workflows.\n\n## Inner workings\n- First, the workflow ensures that the directory structure for storing the workflows is correct.\n- Exports all workflows.\n- Next, it processes all workflow files and stores them with readable names.\n- Based on tags, it will *also* export to `dev` and `prod` folders for easy commit and usage in a delivery pipeline.\n\n## Configration\nNo special setup is required for readable exporting.\n\n## Usage\nCreate a workflow and tag it with '*Auto deploy to dev*'\nRun the workflow, this will create the needed folders and workflows with readable names.\nCommit these in your version control.\nHave a CICD pipeline build an n8n container\n—see the attached Dockerfile. \n\nCheck our **Auto Starter workflow** for auto-starting workflows after deployment.\n\n## CI/CD Bonus:\nAttached are two nodes with some example configuration on building your own automated n8n deployment. \n- A Dockerfile, to get the new entrypoint and exported workflows packaged in the container.\n- An updated entrypoint to build your own container, import the workflows, and run the Auto Starter.\n\nSet the following environment variables:\n\n- `STARTUP_WORKFLOWS_LOAD_LOCATION`: to specify the folder to import from and distinguish between environments.\n- `STARTUP_WORKFLOW_ID`: the ID of the workflow to run after starting n8n.  \n  &gt; **Note:** The 'Instance Started' n8n trigger won't work, as all workflows are disabled upon import.\n",
  "featuredImage": "/data/workflows/3994/3994.webp",
  "author": {
    "id": 101,
    "slug": "voortwis",
    "name": "Klaasjan te Voortwis",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 892,
  "downloads": 89,
  "createdAt": "2025-05-12T08:05:06.961Z",
  "updatedAt": "2026-01-16T08:32:30.372Z",
  "publishedAt": "2025-05-12T08:05:06.961Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3994"
}