{
  "id": 9084,
  "slug": "9084",
  "title": "Parse PDF, DOCX & images with Mistral OCR via Google Drive with Slack alerts",
  "description": " ### Use cases \n* Monitor Google Drive folder, parsing PDF, DOCX and image file into a destination folder, ready for further processing (e.g. RAG ingestion, translation, etc.)\n* Keep processing log in Google Sheet and send Slack notifications. \n\n### How it works\n* Trigger: Watch Google Drive folder for new and updated files.\n* Create a uniquely named destination folder, copying the input file.\n* Parse the file using Mistral Document, extracting content and handling non-OCRable images separately.\n* Save the data returned by Mistral Document into the destination Google Drive folder (raw JSON file, Markdown files, and images) for further processing.\n\n\n### How to use\n* Google Drive and Google Sheets nodes:\n  * Create Google credentials with access to Google Drive and Google Sheets. [Read more about Google Credentials](https://docs.n8n.io/integrations/builtin/credentials/google/).\n  * Update **all** Google Drive and Google Sheets nodes (14 nodes total) to use the credentials\n* Mistral node:\n  * Create Mistral Cloud API credentials. [Read more about Mistral Cloud Credentials](https://docs.n8n.io/integrations/builtin/credentials/mistral/).\n  * Update the `OCR Document` node to use the Mistral Cloud credentials.\n* Slack nodes:\n  * Create Slack OAuth2 credentials. [Read more about Slack OAuth2 credentials](https://docs.n8n.io/integrations/builtin/credentials/slack/#using-oauth2)\n   * Update the two Slack nodes: `Send Success  Message` and `Send Error Message`:\n      * Set the credentials\n      * Select the channel where you want to send the notifications (channels can be different for success and errors). \n* Create a Google Sheets spreadsheet following the steps in `Google Sheets Configuration`. Ensure the spreadsheet can be accessed as `Editor` by the account used by the Google Credentials above.\n* Create a directory for input files and a directory for output folders/files. Ensure the directories can be accessed by the account used by the Google Credentials.\n* Update the `File Created`, `File Updated` and `Workflow Configuration` node following the steps in the green Notes.\n\n\n### Requirements\n* Google account with Google API access\n* Mistral Cloud account access to Mistral API key.\n* Slack account with access to Slack client ID and secret ID. \n* Basic n8n knowledge: understanding of triggers, expressions, and credential management\n\n\n### Who’s it for\nAnyone building a data pipeline ingesting files to be OCRed for further processing. \n\n\n### 🔒 Security\nAll credentials are stored as n8n credentials. The only information stored in this workflow that *could* be considered sensitive are the Google Drive Directory and Sheet IDs. These directories and the spreadsheet should be secured according to your needs.\n\n\n### Need Help?\nReach out on [LinkedIn](https://www.linkedin.com/in/ytkaczyk/) or Ask in the [Forum](https://community.n8n.io/)!\n",
  "featuredImage": "/data/workflows/9084/9084.webp",
  "author": {
    "id": 101,
    "slug": "ytkaczyk",
    "name": "Yves Tkaczyk",
    "avatar": ""
  },
  "categories": [
    "Document Extraction"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 983,
  "downloads": 98,
  "createdAt": "2025-09-29T22:47:39.073Z",
  "updatedAt": "2026-01-16T08:58:57.952Z",
  "publishedAt": "2025-09-29T22:47:39.073Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9084"
}