{
  "id": 2323,
  "slug": "2323",
  "title": "Customer Support Channel and Ticketing System with Slack and Linear",
  "description": "This n8n workflow demonstrates how to create a really simple yet effective customer support channel and pipeline by combining Slack, Linear and AI tools.\n\nBuilt on n8n's ability to integrate anything, this workflow is intended for small support teams who want to maximise re-use of the tools they already have with an interface which is doesn't require any onboarding.\n\n**Read the blog post here**: [https://blog.n8n.io/automated-customer-support-tickets-with-n8n-slack-linear-and-ai/](https://blog.n8n.io/automated-customer-support-tickets-with-n8n-slack-linear-and-ai/)\n\n## How it works\n* The workflow is connected to a slack channel setup with the customer to capture support issues.\n* Only messages which are tagged with a \"✅\" reaction are captured by the workflow. Messages are tagged by the support team in the channel.\n* Each captured support issue is sent to the AI model to classify, prioritise and rewrite into a support ticket.\n* The generated support ticket is uploaded to Linear for the support team to investigate and track.\n* Support team is able to report back to the user via the channel when issue is fixed.\n\n## Requirements\n* Slack channel to be monitored\n* Linear account and project\n\n## Customising this workflow\n\nDon't have Linear? This workflow can work just as well with traditional ticketing systems like JIRA.",
  "featuredImage": "/data/workflows/2323/2323.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 7904,
  "downloads": 790,
  "createdAt": "2024-07-09T13:29:02.369Z",
  "updatedAt": "2026-01-16T08:24:01.273Z",
  "publishedAt": "2024-07-09T13:29:02.369Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2323"
}