{
  "id": 4022,
  "slug": "4022",
  "title": "AI-optimized content posting to X, Discord & LinkedIn with OpenRouter",
  "description": "Amplify your social media presence with **BuzzBlast**, an n8n workflow designed to make your content go viral across X, Discord, and LinkedIn. By sending a single chat message, BuzzBlast leverages OpenRouter's AI to optimize your input for each platform’s unique audience—crafting punchy tweets for X, engaging messages for Discord, and professional posts for LinkedIn. With smart language detection, it ensures the output matches your input’s language for authentic engagement.\n\n## Key Features\n\n- 🚀 **Multi-Platform Posting**: Shares optimized content to X, Discord, and LinkedIn simultaneously.\n- 🧠 **AI Optimization**: Uses OpenRouter’s AI to tailor content for virality on each platform.\n- 🌐 **Language Detection**: Matches output to your input language for seamless engagement.\n- 🔄 **Smart Routing**: Automatically directs content to the right platform using a switch node.\n- 📱 **Chat Trigger**: Initiates posts via a simple chat message.\n- ⚡ **Zero Hassle**: No manual reformatting—BuzzBlast handles it all.\n\n## Ideal For\n\n- Social media managers looking to streamline cross-platform posting.\n- Content creators aiming to boost engagement with minimal effort.\n- Businesses seeking to maximize reach across diverse audiences.\n\n## Pre-Requirements\n\n- **[n8n instance](https://n8n.partnerlinks.io/khaisastudio)**: A running n8n instance (cloud or self-hosted).\n- **Credentials**:\n  - X account with OAuth2 API access.\n  - Discord Webhook API setup for your server.\n  - LinkedIn account with OAuth2 API access.\n  - OpenRouter account for AI language model access.\n- **Chat Trigger Setup**: A configured chat platform (e.g., Slack, Telegram) to send input messages to the workflow.\n\n## Setup Instructions\n\n1. **Import the Workflow**:\n   - Copy the provided workflow JSON and import it into your n8n instance via the \"Import Workflow\" option in the n8n editor.\n2. **Configure Credentials**:\n   - In the `Post to X` node, set up OAuth2 credentials for your X account.\n   - In the `Post to Discord` node, configure a Discord Webhook for your server.\n   - In the `Post to LinkedIn` node, add OAuth2 credentials for your LinkedIn account.\n   - In the `OpenRouter AI Model` node, provide API credentials for your OpenRouter account.\n3. **Set Up Chat Trigger**:\n   - In the `Chat Input Trigger` node, configure your preferred chat platform (e.g., Slack, Telegram) to send trigger messages.\n   - Ensure the webhook is active and correctly linked to your chat platform.\n4. **Test the Workflow**:\n   - Send a test message via your chat platform (e.g., \"Announcing our new product launch!\").\n   - Verify that the AI optimizes the content and posts it to X, Discord, and LinkedIn as expected.\n5. **Activate the Workflow**:\n   - Once tested, toggle the workflow to \"Active\" in n8n to enable automatic execution when chat messages are received.\n\n## Customization Guidance\n- **Changes Chat Trigger**: Adjust the chat trigger using your preference platform like telegram, discord, etc.\n- **Modify AI Prompt**: Adjust the prompt in the `AI Content Optimizer` node to change the tone or style (e.g., more professional for LinkedIn or conversational for Discord).\n- **Add New Platforms**: Extend the `Route to Platforms` node by adding conditions for additional platforms (e.g., Instagram or Facebook) and corresponding posting nodes.\n- **Change AI Model**: In the `OpenRouter AI Model` node, select a different OpenRouter model to optimize content quality or manage costs.\n- **Enhance Output Format**: Update the JSON schema in the `Parse AI Output` node to include additional fields like hashtags, emojis, or links for specific platforms.\n- **Add Error Handling**: Include an error-handling node after the `Route to Platforms` node to log failed posts or retry them automatically.\n\n## Why Choose BuzzBlast?\n\nBuzzBlast saves time, maximizes reach, and lets AI craft platform-perfect posts that resonate with your audience. Whether you're an influencer, marketer, or business, this workflow makes cross-platform posting effortless. Ready to make waves online? Grab BuzzBlast and start buzzing!\n\n*made by: [khmuhtadin](khmuhtadin.com)*\n**Need a custom?** contact me on **[LinkedIn](https://www.linkedin.com/in/khmuhtadin/)** or **[Web](khmuhtadin.com)**",
  "featuredImage": "/data/workflows/4022/4022.webp",
  "author": {
    "id": 101,
    "slug": "khmuhtadin",
    "name": "Khairul Muhtadin",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2396,
  "downloads": 239,
  "createdAt": "2025-05-13T14:18:13.939Z",
  "updatedAt": "2026-01-16T08:32:38.320Z",
  "publishedAt": "2025-05-13T14:18:13.939Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4022"
}