{
  "id": 6112,
  "slug": "6112",
  "title": "Shopify review aggregator: Trustpilot, Google, Facebook to Google Sheets",
  "description": "## Multi-Platform Review Collector for n8n: Trustpilot + Google + Facebook Automation\n\n## How it works\nThe schedule triggers daily review collection from configured platforms and connects to multiple review platform APIs to download latest reviews. The workflow normalizes review data into consistent format with rating, text, date, source, and customer name. It removes duplicates and stores centralized database in Google Sheets creating comprehensive review repository for analysis and response management.\nTrigger: Daily schedule (10 AM)\nOutput: Updated review database\nTiming: Daily sync\nFrequency: Once per day\nData Flow:\nTrustpilot → API call → Raw reviews\nGoogle Reviews → API call → Raw reviews\nFacebook → API call → Raw reviews\n↓\nNormalize format → Remove duplicates\n↓\nGoogle Sheets → Centralized database\n\n## Set up instructions\n\nSet up Shopify credentials in n8n: API Key, Password, Shop Subdomain, and Shared Secret\nObtain API credentials for each review platform you want to monitor (Trustpilot, Google Reviews, Facebook)\nConfigure HTTP Request nodes with proper API endpoints and authentication headers for each platform\nSet up Google Sheets credentials and create a spreadsheet with columns: Source, Rating, Review Text, Customer Name, Date, Product ID, Review ID\nThe schedule trigger runs daily at 10 AM but feel free to adjust frequency based on review volume\nUpdate the Code node with proper data mapping for each review platform's API response format\n\nTest API connections individually before running the full workflow to ensure all platforms return data correctly",
  "featuredImage": "/data/workflows/6112/6112.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 186,
  "downloads": 18,
  "createdAt": "2025-07-18T04:05:19.162Z",
  "updatedAt": "2026-01-16T08:43:13.734Z",
  "publishedAt": "2025-07-18T04:05:19.162Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6112"
}