{
  "id": 7544,
  "slug": "7544",
  "title": "Generate AI images from text prompts with Gemini 2.0, Google Sheets & Drive",
  "description": "![Screenshot 20250818 at 1.56.53 PM.png](fileId:2134)\n\n**This n8n template demonstrates how to automate the creation of high-quality visual content using AI. The workflow takes simple titles from a Google Sheets spreadsheet, generates detailed artistic prompts using AI, creates photorealistic images, and manages the entire process from data input to final delivery.**\n\n**Use cases are many**: Perfect for digital marketers, content creators, social media managers, e-commerce businesses, advertising agencies, and anyone needing consistent, high-quality visual content for marketing campaigns, social media posts, or brand materials!\n\n### Good to know\n\n- The Gemini 2.0 Flash Exp image generation model used in this workflow may have geo-restrictions. \n- The workflow processes one image at a time to ensure quality and avoid rate limiting.\n- Each generated image maintains high consistency with the source prompt and shows minimal AI artifacts.\n\n### How it works\n\n1. **Automated Trigger**: A schedule trigger runs every minute to check for new entries in your Google Sheets spreadsheet.\n\n2. **Data Retrieval**: The workflow fetches rows from your Google Sheets document, specifically looking for entries with \"pending\" status.\n\n3. **AI Prompt Generation**: Using Google Gemini, the workflow takes simple titles and transforms them into detailed, artistic prompts for image generation. The AI considers:\n   - Specific visual elements, styles, and compositions\n   - Natural poses, interactions, and environmental context\n   - Lighting conditions and mood settings\n   - Brand consistency and visual appeal\n   - Proper aspect ratios for different platforms\n\n4. **Text Processing**: A code node ensures proper JSON formatting by escaping newlines and maintaining clean text structure.\n\n5. **Image Generation**: Gemini's advanced image generation model creates photorealistic images based on the detailed prompts, ensuring high-quality, consistent results.\n\n6. **File Management**: Generated images are automatically uploaded to a designated folder in Google Drive with organized naming conventions.\n\n7. **Public Sharing**: Images are made publicly accessible with read permissions, enabling easy sharing and embedding.\n\n8. **Database Update**: The workflow completes by updating the Google Sheets with the generated image URL and changing the status from \"pending\" to \"posted\", creating a complete audit trail.\n\n### How to use\n\n1. **Setup**: Ensure you have the required Google Sheets document with columns for ID, prompt, status, and imageUrl.\n\n2. **Configuration**: Update the Google Sheets document ID and folder IDs in the respective nodes to match your setup.\n\n3. **Activation**: The workflow is currently inactive - activate it in n8n to start processing.\n\n4. **Data Input**: Simply add new rows to your Google Sheets with titles and set status to \"pending\" - the workflow will automatically process them.\n\n5. **Monitoring**: Check the Google Sheets for updated status and image URLs to track progress.\n\n### Requirements\n\n- **Google Gemini API** account for LLM and image generation capabilities\n- **Google Drive** for file storage and management\n- **Google Sheets** for data input and tracking\n- **n8n instance** with proper credentials configured\n\n### Customizing this workflow\n\n**Content Variations**: Try different visual styles, seasonal themes, or trending designs by modifying the AI prompt in the LangChain agent.\n\n**Output Formats**: Adjust the aspect ratio or image specifications for different platforms (Instagram, Pinterest, TikTok, Facebook ads, etc.).\n\n**Integration Options**: Replace the schedule trigger with webhooks for real-time processing, or add notification nodes for status updates.\n\n**Batch Processing**: Modify the limit node to process multiple items simultaneously, though be mindful of API rate limits.\n\n**Quality Control**: Add additional validation nodes to ensure generated images meet quality standards before uploading.\n\n**Analytics**: Integrate with analytics platforms to track image performance and engagement metrics.\n\nThis workflow provides a complete solution for automated visual content creation, perfect for businesses and creators looking to scale their visual content production while maintaining high quality and consistency across all marketing materials.",
  "featuredImage": "/data/workflows/7544/7544.webp",
  "author": {
    "id": 101,
    "slug": "mfarooqone",
    "name": "Muhammad Farooq Iqbal",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 4163,
  "downloads": 416,
  "createdAt": "2025-08-18T09:13:07.476Z",
  "updatedAt": "2026-01-16T08:50:59.246Z",
  "publishedAt": "2025-08-18T09:13:07.476Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7544"
}