{
  "id": 7603,
  "slug": "7603",
  "title": "Send daily Mailchimp subscriber reports to Slack",
  "description": "## What this workflow does\nThis workflow sends a **daily Slack report** with the current number of subscribers in your Mailchimp list.  \nIt’s a simple way to keep your marketing or growth team informed without logging into Mailchimp.\n\n## How it works\n1. **Cron Trigger** starts the workflow once per day (default: 09:00).  \n2. **Mailchimp node** retrieves the total number of subscribers for a specific list.  \n3. **Slack node** posts a formatted message with the subscriber count into your chosen Slack channel.\n\n## Pre-conditions / Requirements\n- A Mailchimp account with API access enabled.  \n- At least one Mailchimp audience list created (you’ll need the List ID).  \n- A Slack workspace with permission to post to your chosen channel.  \n- n8n connected to both Mailchimp and Slack via credentials.\n\n## Setup\n1. **Cron Trigger**  \n   - Default is set to 09:00 AM daily. Adjust the time or frequency as needed.  \n\n2. **Mailchimp: Get Subscribers**  \n   - Connect your Mailchimp account in n8n credentials.  \n   - Replace `{{MAILCHIMP_LIST_ID}}` with the List ID of the audience you want to monitor.  \n   - To find the List ID: Log into Mailchimp → Audience → All contacts → Settings → Audience name and defaults.  \n\n3. **Slack: Send Summary**  \n   - Connect your Slack account in n8n credentials.  \n   - Replace `{{SLACK_CHANNEL}}` with the name of the channel where the summary should appear (e.g., `#marketing`).  \n   - The message template can be customized, e.g., include emojis, or additional Mailchimp stats.\n\n## Customization Options\n- **Multiple lists:** Duplicate the Mailchimp node for different audience lists and send combined stats.  \n- **Formatting:** Add more details like new subscribers in the last 24h by comparing with previous runs (using Google Sheets or a database).  \n- **Notifications:** Instead of Slack, send the update to email or Microsoft Teams by swapping the output node.\n\n## Benefits\n- **Automation:** Removes the need for manual Mailchimp checks.  \n- **Visibility:** Keeps the whole team updated on subscriber growth in real time.  \n- **Motivation:** Celebrate growth milestones directly in team channels.  \n\n## Use Cases\n- Daily subscriber growth tracking for newsletters.  \n- Sharing metrics with leadership without giving Mailchimp access.  \n- Monitoring the effectiveness of campaigns in near real time.  \n",
  "featuredImage": "/data/workflows/7603/7603.webp",
  "author": {
    "id": 101,
    "slug": "ziadadel",
    "name": "Ziad Adel",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "beginner",
  "price": 0,
  "visitors": 134,
  "downloads": 13,
  "createdAt": "2025-08-19T18:58:51.493Z",
  "updatedAt": "2026-01-16T08:51:20.036Z",
  "publishedAt": "2025-08-19T18:58:51.493Z",
  "nodes": 4,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7603"
}