{
  "id": 6147,
  "slug": "6147",
  "title": "Automate income and expense tracking in Google Sheets via Telegram",
  "description": "## Who’s it for\nThis template is perfect for freelancers, small business owners, or financial assistants who want to record and approve financial transactions like income and expenses directly from Telegram, without opening a spreadsheet manually.\n\nIt’s also useful for teams that require a supervisor to approve expenses before they’re finalized.\n\n\n## What it does\nThis workflow allows users to:\n\n- Start a conversation via Telegram using the /start command.\n- Choose to record an income or expense.\n- Submit transaction data using a structured format.\n- Store the data into Google Sheets in real time.\n- For expenses, automatically notify a supervisor for approval.\n- The supervisor can Approve ✅, Reject ❌, or View Details 👁.\n- Sends feedback to the user based on supervisor action.\n\n\n## 🔧 How it works\n\n1. Telegram Bot Trigger: Captures user input via message or inline button callback.\n2. Message Detection Logic: Differentiates between text input and button interactions.\n3. Switch Node: Routes the message type:\n   - /start: Displays income/expense buttons.\n   - Input text: Validates formatting and parses data.\n   - Callback: Handles approval/rejection process.\n\n4. Google Sheets Integration: Appends or updates entries in different sheets based on the data type.\n\n5. Notifications:\n\n   - User gets feedback (recorded, pending, approved, rejected).\n   - Supervisor receives inline button options for approval.\n\n\n## Google Sheets Details\nYou will need a Google Sheet with the following two worksheets:\n\nSheet 1: income\nSheet 2: Sheet1 (Default tab for expenses)\n\n\n## 📱 Telegram Setup Instructions\n\n1. Create a bot using @BotFather.\n2. Save the bot token.\n3. Go to n8n Credentials → Telegram API and add:\n   - Access Token = your bot token\n4. In Telegram, send /start to your bot.\n5. Make sure your bot has enabled privacy mode (or disabled, if used in a group).\n\n\n💡 For the approval flow, update the node Send Approval Request with the correct chatId of the supervisor's Telegram account. You can hardcode a static ID (e.g., \"123456789\") or pull from a variable if dynamic.\n\n\n## 🛠 Requirements\n\n| Tool                       | Description                         |\n| -------------------------- | ----------------------------------- |\n| n8n (Cloud or Self-hosted) | Use latest stable version           |\n| Telegram Bot               | For user input and notifications    |\n| Google Sheets              | To store income and expense records |\n| Google OAuth2 Credentials  | Required for Google Sheets node     |\n\n\n\n## ⚙️ How to customize the workflow\n\n- Change the chat ID for supervisors in the node Send Approval Request.\n- Modify the text or add new buttons in the inline keyboard node.\n- Update Google Sheet ID and tab names if you’re using different sheets.\n- Customize the approval logic, for example, route to different teams.\n\n\n## ✅ Setup Steps\n\n1. Import the workflow JSON into your n8n instance.\n2. Configure Telegram API credential with your bot token.\n3. Connect your Google Sheets OAuth2 credential.\n4. Replace Google Sheet document ID and tab names with your own (via UI or “Expression” mode).\n5. Deploy and activate the workflow.",
  "featuredImage": "/data/workflows/6147/6147.webp",
  "author": {
    "id": 101,
    "slug": "fahmi3322",
    "name": "Fahmi Oktafian",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 209,
  "downloads": 20,
  "createdAt": "2025-07-18T17:28:39.101Z",
  "updatedAt": "2026-01-16T08:43:23.790Z",
  "publishedAt": "2025-07-18T17:28:39.101Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6147"
}