{
  "id": 4637,
  "slug": "4637",
  "title": "Automate social media content with AI for Instagram, Facebook, LinkedIn & X",
  "description": "# AI Social Media Content Automation – n8n Workflow\n\nThis workflow is built for creators, solopreneurs, SaaS founders, and agencies looking to automate their social media content process from idea to publication. It combines the power of OpenAI, Google Sheets, and official APIs for Instagram, Facebook, X (Twitter), and LinkedIn to deliver fully automated, brand-consistent social media posts — including text, images, hashtags, CTAs, and scheduling.\n\nNo more switching tools, rewriting content, or forgetting to post. Just set it up once and let your brand grow automatically.\n\n## 🔧 What the Workflow Does\n- Generates platform-specific post ideas based on your brand tone.\n- Selects the best idea (or lets you manually input one).\n- Writes tailored posts for Instagram, Facebook, X, and LinkedIn.\n- Auto-generates platform-specific visuals using OpenAI (DALL·E) and uploads to Cloudinary.\n- Publishes content directly using official platform APIs.\n- Logs all actions to Google Sheets and optionally sends a summary email via Gmail.\n\n## ⚙️ How It Works\n1. Trigger the workflow manually, on a schedule, or from a chatbot.\n2. AI generates multiple post ideas and filters the best one.\n3. Based on the selected idea, it generates full posts for each platform.\n4. Custom visuals are created using OpenAI and uploaded to Cloudinary.\n5. Final post content is merged and sent to Instagram, Facebook, X, and LinkedIn.\n6. Logs and optional reports are created in Google Sheets and Gmail.\n\n## 🛠️ Setup Steps\n- Set up your accounts and credentials: OpenAI, Cloudinary, Gmail, Meta, LinkedIn, X, and Google Sheets.\n- Import the workflow and subworkflow (Get Brand Brief) into n8n.\n- Replace all placeholders (sheet IDs, access tokens, profile/page IDs, brand brief URLs).\n- Optionally personalize prompts and output templates to match your brand voice.\n- Setup time: ~30–45 minutes (including credentials and testing).\n\nDetailed configuration notes are included in sticky nodes throughout the workflow.\n\n## 📦 Included in Your Package\n- JSON workflow file (main flow + brand brief subflow)\n- Google Sheets templates for history logging\n- Setup documentation (Markdown & PDF)\n- Placeholder reference sheet\n",
  "featuredImage": "/data/workflows/4637/4637.webp",
  "author": {
    "id": 101,
    "slug": "lukaszb",
    "name": "LukaszB",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 14193,
  "downloads": 1419,
  "createdAt": "2025-06-04T03:00:43.654Z",
  "updatedAt": "2026-01-16T08:35:28.078Z",
  "publishedAt": "2025-06-04T03:00:43.654Z",
  "nodes": 73,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4637"
}