{
  "id": 9916,
  "slug": "9916",
  "title": "Trello task management with Telegram notifications and Supabase database",
  "description": "# Trello Task-Sync Assistant\n\n## Description\n\nThis n8n workflow automates task management by integrating Trello, Supabase, and Telegram to streamline card creation, user assignment, and due date notifications. It ensures seamless synchronization of Trello card data with a Supabase database and sends timely Telegram notifications to keep team members informed about task assignments and deadlines.\n\n### Key Features\n- **Trello Card Syncing**: Automatically registers new Trello cards in Supabase and keeps card details (e.g., due dates, URLs) updated.\n- **User Management**: Tracks Trello user assignments in Supabase, creating new user entries and linking them to cards as needed.\n- **Real-Time Notifications**: Sends Telegram messages when users are added to or removed from Trello cards, using dynamic, engaging message templates.\n- **Due Date Reminders**: Schedules daily checks to notify users via Telegram about tasks due on the current day.\n\n### Workflow Structure\n\n1. **Trello Trigger Flow**:\n   - **Trigger**: Activates when a new Trello card is created.\n   - **Actions**:\n     - Registers the card in Supabase (`cards` table) with details like ID, name, and board.\n     - Sets up a Trello webhook for real-time updates on the card.\n     - Syncs due date changes to Supabase.\n     - Detects member additions/removals, checks for existing users in Supabase, creates new user entries if needed, and links users to cards in the `card_user` table.\n\n2. **Webhook Event Flow**:\n   - **Trigger**: Processes Trello webhook events (e.g., member changes, due date updates).\n   - **Actions**:\n     - Validates event types (add/remove member).\n     - Maps Trello usernames to Telegram handles.\n     - Sends formatted Telegram notifications with card details and playful, randomized messages for engagement.\n\n3. **Due-Date Notification Flow**:\n   - **Trigger**: Runs twice daily (every 12 hours) via a scheduled trigger.\n   - **Actions**:\n     - Fetches cards due on the current day from Supabase.\n     - Retrieves assigned users for each card.\n     - Sends Telegram reminders with urgent, formatted messages including card name, board, URL, and due date.\n\n### Technical Details\n- **Tools Used**:\n  - **Trello**: Triggers on card creation and updates via webhooks.\n  - **Supabase**: Stores card, user, and card-user relationship data in `cards`, `users`, and `card_user` tables.\n  - **Telegram**: Sends notifications using a bot.\n- **Credentials Required**:\n  - Trello API key and token.\n  - Supabase URL and key.\n  - Telegram bot token and chat ID.\n- **Scheduling**: Due date checks run every 12 hours (adjustable).\n- **Error Handling**: Includes checks for user existence and conditional logic to manage add/remove events.\n\n### Use Case\nIdeal for teams using Trello for project management, this workflow ensures real-time data syncing with Supabase and keeps members informed via Telegram, reducing manual oversight and improving task accountability. It’s particularly useful for remote or distributed teams needing automated task tracking and reminders.\n\n### Setup Requirements\n- Configure Trello webhooks to point to the n8n webhook URL.\n- Set up Supabase with the required tables (`cards`, `users`, `card_user`).\n- Provide Telegram bot token and chat IDs\n- Test the workflow by creating a Trello card, assigning a member, and setting a due date to verify Supabase entries and Telegram notifications.\n\nThis workflow enhances productivity by automating task synchronization and communication, ensuring no deadline is missed.",
  "featuredImage": "/data/workflows/9916/9916.webp",
  "author": {
    "id": 101,
    "slug": "hermong",
    "name": "Hermon",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 235,
  "downloads": 23,
  "createdAt": "2025-10-19T19:39:33.200Z",
  "updatedAt": "2026-01-16T09:02:34.933Z",
  "publishedAt": "2025-10-19T19:39:33.200Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9916"
}