{
  "id": 6148,
  "slug": "6148",
  "title": "Publish LinkedIn & X posts with Telegram Bot, Gemini AI & Vector Memory",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# Overview\n\nThis is a Telegram Bot capable of receiving information from the user in the form of text messages, voice messages, images or documents (e.g., presentations, PDFs, HTML pages), and publishing posts to the user's social platforms.\n\nThe bot always sends the user a draft of the post for verification before publishing it.\n\nThe bot saves relevant information to its long-term memory (vector store), so you don't need to repeat it in every interaction (e.g., who you are, your company, product, etc.).\n\nThis template supports creating posts in LinkedIn and X.\n\n# Setup\n\n## Requirements\nTo use this template your will need:\n1. Google's AI Studio API key. Get one here: https://aistudio.google.com/app/apikey\n2. Telegram Bot API key. You receive one when you register a new Telegram Bot via @BotFather bot in Telegram.\n3. LinkedIn API key. Follow the instructions here to create one: https://docs.n8n.io/integrations/builtin/credentials/linkedin/\n4. X API key. Follow the instructions here to create one: https://docs.n8n.io/integrations/builtin/credentials/twitter/\n\n## Step-by-step instruction\n1. Import this template\n2. Create a new Telegram Bot or get an API key for existing one.\n3. Configre Telegram nodes with Telegram API key.\n4. Obtain a Google's AI Studio API key. Set it in \"Describe document\", \"Describe audio\" and \"Google Gemini Chat Model\".\n5. Create an API key for LinkedIn.\n6. Create an API key for X.\n7. Set our LinkedIn key in \"Create post in LinkedIn\" nodes.\n8. Set your X key in \"Create X (Twitter) post\" node.\n\n## Other\nBright-colored notes in the template highlight information that needs to be set before launching the template.",
  "featuredImage": "/data/workflows/6148/6148.webp",
  "author": {
    "id": 101,
    "slug": "gregory",
    "name": "Gregory",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 834,
  "downloads": 83,
  "createdAt": "2025-07-18T17:34:29.119Z",
  "updatedAt": "2026-01-16T08:43:24.322Z",
  "publishedAt": "2025-07-18T17:34:29.119Z",
  "nodes": 36,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6148"
}