{
  "id": 9376,
  "slug": "9376",
  "title": "AI-powered email support router with Gmail, ChatGPT-4o, and Slack",
  "description": "### This n8n template automates your customer support workflow by connecting Gmail, OpenAI, Supabase, and Slack. It listens for new incoming emails, classifies them using AI, routes them to the appropriate Slack channel based on category (e.g., support or new requests), logs each thread to Supabase for tracking, and marks the email as read once processed.\n\n###### Good to know\n\t•\tThe OpenAI API is used for automatic email classification, which incurs a small per-request cost. See OpenAI Pricing for up-to-date info.\n\t•\tYou can easily expand the categories or connect more Slack channels to fit your workflow.\n\t•\tThe Supabase integration ensures you don’t process the same thread twice.\n\n### How it works\n\t1.\tGmail Trigger checks for unread emails.\n\t2.\tSupabase Get Row verifies if the thread already exists.\n\t3.\tIf it’s a new thread, the OpenAI node classifies the email into categories such as “support” or “new-request.”\n\t4.\tThe Switch node routes messages to the correct Slack channel based on classification.\n\t5.\tSupabase Create Row logs thread details (sender, subject, IDs) to your database.\n\t6.\tFinally, the Gmail node marks the message as read to prevent duplication.\n\n### How to use\n\t•\tThe workflow uses a manual Gmail trigger by default, but you can adjust the polling frequency.\n\t•\tModify category names or Slack channels to match your internal setup.\n\t•\tExtend the workflow to include auto-replies or ticket creation in your CRM.\n\n### Requirements\n\t•\tGmail account (with OAuth2 credentials)\n\t•\tSlack workspace (with channel access)\n\t•\tOpenAI account for classification\n\t•\tSupabase project for storing thread data\n\n### Customizing this workflow\nUse this automation to triage incoming requests, route sales leads to specific teams, or even filter internal communications. You can add nodes for auto-responses, CRM logging, or task creation in Notion or ClickUp.",
  "featuredImage": "/data/workflows/9376/9376.webp",
  "author": {
    "id": 101,
    "slug": "bosar",
    "name": "Bohdan Saranchuk",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 63,
  "downloads": 6,
  "createdAt": "2025-10-08T12:06:02.578Z",
  "updatedAt": "2026-01-16T09:00:13.182Z",
  "publishedAt": "2025-10-08T12:06:02.578Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9376"
}