{
  "id": 6568,
  "slug": "6568",
  "title": "Conference networking intelligence from Eventbrite with ScrapeGraphAI",
  "description": "# How it works\n\nThis workflow automatically discovers industry conferences and provides AI-powered networking intelligence to maximize your event ROI.\n\n## Key Steps\n\n1. **Scheduled Discovery** - Runs weekly to find new industry conferences from Eventbrite and other sources.\n2. **AI-Powered Scraping** - Uses ScrapeGraphAI to extract comprehensive conference information including speakers, agenda, and networking opportunities.\n3. **Speaker Intelligence** - Analyzes speakers to identify high-priority networking targets based on their role, company, and expertise.\n4. **Agenda Analysis** - Extracts and maps the complete conference schedule to optimize your time and networking strategy.\n5. **Networking Strategy** - Generates AI-powered recommendations for maximizing networking ROI with prioritized contact lists and approach strategies.\n\n## Set up steps\n\n**Setup time: 10-15 minutes**\n\n1. **Configure ScrapeGraphAI credentials** - Add your ScrapeGraphAI API key for web scraping capabilities.\n2. **Customize conference sources** - Update the Eventbrite URL to target specific industries or locations.\n3. **Adjust monitoring frequency** - Modify the weekly trigger to match your conference discovery needs.\n4. **Review networking priorities** - The system automatically prioritizes speakers, but you can customize the criteria.\n\n## Key Features\n\n- **Automated Conference Discovery** - Finds relevant industry events from multiple sources\n- **Speaker Intelligence Analysis** - Identifies high-value networking targets with contact priority scoring\n- **Strategic Agenda Mapping** - Optimizes your conference schedule for maximum networking impact\n- **AI-Powered Recommendations** - Provides personalized networking strategies and approach methods\n- **Priority Contact Lists** - Ranks speakers by business value and networking potential\n",
  "featuredImage": "/data/workflows/6568/6568.webp",
  "author": {
    "id": 101,
    "slug": "vinci-king-01",
    "name": "vinci-king-01",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 283,
  "downloads": 28,
  "createdAt": "2025-07-28T10:53:53.351Z",
  "updatedAt": "2026-01-16T08:45:43.476Z",
  "publishedAt": "2025-07-28T10:53:53.351Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6568"
}