{
  "id": 6359,
  "slug": "6359",
  "title": "Process receipts with Google Vision OCR, AI & Telegram to Google Sheets",
  "description": "## Automated Financial Reporting Using Google Vision OCR, Telegram & Google Sheets\n\n\nThis workflow automates the process of recording financial transactions from photos of receipts or shopping receipts. Users simply send an image of the receipt via Telegram. The image is processed using the Google Vision API to detect text, then extracted and structured by LLM via OpenRouter. The final result is saved to Google Sheets and also displayed to the user via a Telegram bot.\n\n**🧾 Google Sheets Template**\nCreate a Google Sheet using this template: [Financial Reporting](https://docs.google.com/spreadsheets/d/11oT95lKoGNFlZtV129ampaBNOxnnKAJnUn1fAlqYZvY/edit?usp=sharing)\n\n## 🛠️ Key Features\n- The workflow starts when a user sends a photo of a receipt to the Telegram bot.\n- The image is converted to text using the Google Vision API's OCR.\n- Data processing with LLM (OpenRouter) helps identify and structure transaction elements such as: date, vendor name & address, receipt/invoice number, item list (product name, quantity, unit price, total), and transaction category.\n- Cleaned and structured data is automatically recorded to Google Sheets per item.\n- The system also sends a summary of the recording results in an easy to read text format.\n- Users can also send text messages to the bot to query stored transaction data, which will be answered by a Google Sheets-based AI Agent.\n\n## 🔧 Requirements\n- Active Telegram Bot + API Token\n- Google Vision API Key\n- OpenRouter Account + API Key\n- Google Sheets connected to n8n\n\n## 🧩 Setup Instructions\n1. Replace all API keys and tokens with your own in the relevant nodes.\n   - Google Vision API Key: Set in 'Set Vision API' node.\n   - Telegram Bot Token: Set in 'Set Telegram Token' node and all Telegram nodes.\n   - OpenRouter API Key: Set in all OpenRouter nodes.\n   - Google Sheets: Connect your own Google Sheets credential.\n2. Use the provided Google Sheets template or your own.\n3. Activate the workflow after configuration.\n4. (Optional) Review sticky notes for step-by-step explanations.\n",
  "featuredImage": "/data/workflows/6359/6359.webp",
  "author": {
    "id": 101,
    "slug": "budisj",
    "name": "Budi SJ",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2732,
  "downloads": 273,
  "createdAt": "2025-07-24T04:26:51.512Z",
  "updatedAt": "2026-01-16T08:44:35.251Z",
  "publishedAt": "2025-07-24T04:26:51.512Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6359"
}