{
  "id": 11797,
  "slug": "11797",
  "title": "YouTube video optimization & cross-platform distribution with GPT-4o",
  "description": "This workflow automates the post-publish process for YouTube videos, combining advanced SEO optimization, cross-platform promotion, and analytics reporting. It is designed for creators, marketers, and agencies who want to maximize the reach and performance of their YouTube content with minimal manual effort.\n\n---\n\n## Features\n\n- **SEO Automation**\n  - Fetches video metadata and analyzes competitor and trending data.\n  - Uses AI to generate SEO-optimized titles, descriptions, and tags.\n  - Calculates an SEO score and applies A/B testing logic to select the best title.\n  - Updates the video metadata on YouTube automatically.\n\n- **Cross-Platform Promotion**\n  - Generates platform-specific promotional content (LinkedIn, X/Twitter, Instagram, Facebook, etc.) using AI.\n  - Publishes posts to each connected social channel.\n  - Extracts video clips and analyzes thumbnails for enhanced promotion.\n\n- **Engagement Monitoring & Analytics**\n  - Monitors YouTube comments, detects negative sentiment, and drafts AI-powered replies.\n  - Logs all key data (videos, comments, analytics) to Google Sheets for tracking and reporting.\n  - Runs a weekly analytics job to aggregate performance, calculate engagement/viral indicators, and email a detailed report.\n\n- **Notifications & Alerts**\n  - Sends Slack alerts when a new video is published or when viral potential/negative comments are detected.\n\n---\n\n## How It Works\n\n1. **Trigger**\n   - The workflow starts automatically when a new YouTube video is published (via webhook) or on a weekly schedule for analytics.\n\n2. **Video Intake & SEO**\n   - Fetches video details (title, description, tags, stats).\n   - Gathers competitor and trending topic data.\n   - Uses AI to generate improved SEO assets and calculates an SEO score.\n   - Selects the best title (A/B test) and updates the video metadata.\n\n3. **Clip & Thumbnail Processing**\n   - If the video is long enough, runs thumbnail analysis and extracts short clips for social media.\n\n4. **Cross-Platform Promotion**\n   - Generates and formats promotional posts for each social platform.\n   - Publishes automatically to enabled channels.\n\n5. **Engagement & Comment Monitoring**\n   - Fetches comments, detects negative sentiment, and drafts AI-powered replies.\n   - Logs comments and responses to Google Sheets.\n\n6. **Analytics & Reporting**\n   - Aggregates weekly analytics, calculates engagement and viral indicators.\n   - Logs insights and sends a weekly report via email.\n\n7. **Notifications**\n   - Sends Slack alerts for new video publications and viral/negative comment detection.\n\n---\n\n## Setup Instructions\n\n1. **Connect YouTube**\nSet up YouTube API credentials and required IDs in the **Workflow Configuration** node.\n\n2. **Connect OpenAI**\nAdd your OpenAI credentials for AI-powered content generation.\n\n3. **Connect Slack**\nConfigure Slack credentials and specify alert channels.\n\n4. **Connect Google Sheets**\nSet up service account credentials for logging video, comment, and analytics data.\n\n5. **Configure Social Platforms**\nAdd credentials for LinkedIn, Twitter (X), Instagram, and Facebook as needed.\n\n6. **Test the Workflow**\nPublish a test video and verify that metadata updates, social posts, logging, and weekly reports are working as expected.\n\n---\n\n## Use Cases\n\n- **YouTube Creators:** Automate SEO, promotion, and analytics to grow your channel faster.\n- **Marketing Teams:** Streamline multi-channel video campaigns and reporting.\n- **Agencies:** Deliver consistent, data-driven YouTube growth for multiple clients.\n\n---\n\n## Requirements\n\n- YouTube API credentials\n- OpenAI API key\n- Slack API token\n- Google Sheets service account\n- (Optional) LinkedIn, Twitter, Instagram, Facebook API credentials\n\n---\n\n## Limitations\n\n- Requires valid API credentials for all connected services.\n- AI-powered features depend on OpenAI API access.\n- Social posting is limited to platforms with available n8n nodes and valid credentials.\n\n---\n\n**Tip:**  \nYou can easily customize prompts, scoring logic, and enabled platforms to fit your channel’s unique needs.",
  "featuredImage": "/data/workflows/11797/11797.webp",
  "author": {
    "id": 101,
    "slug": "tuguidragos",
    "name": "Țugui Dragoș",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 351,
  "downloads": 35,
  "createdAt": "2025-12-14T19:55:17.993Z",
  "updatedAt": "2026-01-16T09:10:08.386Z",
  "publishedAt": "2025-12-14T19:55:17.993Z",
  "nodes": 56,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11797"
}