{
  "id": 6936,
  "slug": "6936",
  "title": "Auto-generate sales insights from Sheets using Gemini and notify teams instantly",
  "description": "\n# Daily Sales Metrics Auto-Insight with Gemini, Google Sheets, Calendar, Telegram, Trello and Gmail\n\n### Who’s it for\nThis workflow is ideal for sales managers, operations teams, and business owners who need daily automated sales summaries and team notifications. It eliminates the hassle of manually gathering, analyzing, and reporting daily sales data, providing instant insights and proactive notifications to keep your team aligned.\n\n### How it works / What it does\nThis advanced workflow automates the entire daily sales reporting pipeline with actionable team alerts:\n- Webhook captures new sales entries in real-time.\n- The data is logged into Google Sheets.\n- It retrieves all rows to compile current sales metrics.\n- A custom node concatenates the data into an AI-friendly format.\n- The Google Gemini Chat Model generates concise sales insights.\n- HTML tags are cleaned up with a Remove HTML Tags node.\n- The insights are classified (Good, Bad, Very Bad) using AI.\n- Based on the classification:\n-- Teams are alerted via Telegram group messages.\n-- For negative insights, a Trello card backlog is created for follow-up.\n-- A Google Calendar meeting is scheduled automatically to discuss issues.\n- An email summary is also sent out via Gmail to ensure no update is missed\n\n### How to set up\n- Import the workflow into your n8n instance.\n- Configure the Webhook URL in your data source (POS, CRM, etc.).\n- Connect Google Sheets, Google Gemini API, Trello, Telegram, and Google Calendar.\n- Adjust classification logic inside the Classify Insight node if needed.\n- Customize the message templates for email and Telegram.\n- Test the workflow with sample data to validate automation flow.\n\n### Requirements\n- n8n account with active workflows.\n- Google Sheets API credentials.\n- Google Gemini API access.\n- Telegram Bot Token & Group ID.\n- Trello API Key & Token.\n- Google Calendar API setup.\n- Gmail or SMTP credentials for email notifications.\n\n### How to customize the workflow\n- Adjust the Concat Sales Data node if you want to include more fields or different data formats.\n- Modify the Gemini prompt for personalized insight summaries.\n- Change the classification thresholds (Good, Bad, Very Bad) based on your business KPIs.\n- Update the notification messages in Telegram and Email nodes.\n- Add or remove post-classification actions, like creating different task cards or sending escalations to other platforms (Slack, Microsoft Teams, etc.).\n\nAutomate daily sales insights from Google Sheets using Gemini AI, classify results, and notify your team via email, Telegram, Trello, and Google Calendar instantly.\n\n\n\n### Email Preview\n![image.png](fileId:1945)",
  "featuredImage": "/data/workflows/6936/6936.webp",
  "author": {
    "id": 101,
    "slug": "rullysaputra15",
    "name": "Rully Saputra",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 606,
  "downloads": 60,
  "createdAt": "2025-08-03T13:51:49.297Z",
  "updatedAt": "2026-01-16T08:47:42.861Z",
  "publishedAt": "2025-08-03T13:51:49.297Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6936"
}