{
  "id": 12017,
  "slug": "12017",
  "title": "Prevent employee burnout with AI analysis of Slack and tasks data to Google Sheets",
  "description": "\n\n# Monitor employee stress levels from Slack and tasks to Google Sheets\n\nThis workflow functions as an automated \"Chief Wellness Officer,\" helping HR teams and managers prevent employee burnout before it happens. It aggregates data from communication channels and work tools to provide an AI-driven daily assessment of employee well-being, while prioritizing privacy through data anonymization.\n\n## Who is this for\n- **HR & People Operations Teams** wanting to track organizational health trends without invading personal privacy.\n- **Remote-first Companies** where physical cues of burnout are harder to spot.\n- **Team Managers** looking for data-backed insights to support their direct reports.\n\n## What it does\n1.  **Daily Trigger:** Runs automatically every morning (default: 2 AM) to analyze the previous day's activity.\n2.  **Data Collection:**\n    *   Fetches public Slack messages to analyze communication tone.\n    *   Retrieves attendance data (work hours, late arrivals) and task completion rates via API.\n3.  **AI Analysis:** Uses **OpenAI** to process the data, predicting a \"Stress Level\" based on sentiment and workload metrics.\n4.  **Privacy-First Reporting:** Hashes employee IDs to anonymize data, then logs stress scores to **Google Sheets** for trend analysis.\n5.  **Direct Intervention:** If the AI detects \"High\" stress, it sends a private, empathetic DM to the employee on **Slack** offering support or counseling resources.\n\n## Requirements\n- **n8n** (Self-hosted or Cloud)\n- **Slack** Workspace (with a Bot User OAuth Token).\n- **OpenAI** API Key.\n- **Google Sheets** (for the dashboard).\n- **Postgres** (optional, for logging counseling actions).\n- **HR/Task Management Tools** (e.g., Jira, Asana, BambooHR) accessible via API.\n\n## How to set up\n1.  **Configure Credentials:** Set up your credentials for Slack, OpenAI, Google Sheets, and Postgres in n8n.\n2.  **Prepare Google Sheet:** Create a sheet with headers: `employee_hash`, `department`, `stress_score`, `stress_level`, and `analysis_date`.\n3.  **Connect Data Sources:**\n    *   The workflow uses **HTTP Request** nodes as placeholders for Attendance and Task data. You must update these URLs to point to your specific HRIS or Project Management tool APIs (or replace them with native n8n nodes like Asana or Jira).\n4.  **Update Slack Settings:** Ensure the Slack node has the correct permissions (`channels:history`, `chat:write`, `users:read`) and target channel/user mapping.\n\n## How to customize\n- **Adjust Sensitivity:** Modify the system prompt in the *AI Stress Level Prediction* node to change how \"High\" stress is defined.\n- **Change Data Sources:** Replace the generic HTTP Request nodes with specific n8n nodes for services like **Harvest**, **Jira**, or **Trello** depending on your stack.\n- **Modify Action:** Instead of a direct DM, you can change the final step to alert a manager or create a ticket in a sensitive HR service desk.\n\n",
  "featuredImage": "/data/workflows/12017/12017.webp",
  "author": {
    "id": 101,
    "slug": "uekusa",
    "name": "satoshi",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 23,
  "downloads": 2,
  "createdAt": "2025-12-22T10:41:09.420Z",
  "updatedAt": "2026-01-16T09:11:01.285Z",
  "publishedAt": "2025-12-22T10:41:09.420Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12017"
}