{
  "id": 12097,
  "slug": "12097",
  "title": "Create an all-in-one Discord assistant with Gemini, Llama Vision & Flux images",
  "description": "This n8n template demonstrates how to build **O'Carla**, an advanced all-in-one Discord AI assistant. It intelligently handles natural conversations, professional image generation, and visual file analysis within a single server integration.\n\nUse cases are many: Deploy a smart community manager that remembers past interactions, an on-demand artistic tool for your members, or an AI that can \"read\" and explain uploaded documents and images!\n\n## Good to know\n* **API Costs:** Each interaction costs vary depending on the model used (Gemini vs. OpenRouter). Check your provider's dashboard for updated pricing.\n* **Infrastructure:** This workflow requires a separate Discord bot script (e.g., Node.js) to forward events to the n8n Webhook. It is recommended to host the bot using **PM2** for 24/7 uptime.\n\n## How it works\n1. **Webhook Trigger:** Receives incoming data (text and attachments) from your Discord bot.\n2. **Intent Routing:** The workflow uses conditional logic to detect if the user wants an image (via keyword `gambar:`), a vision analysis (via attachments), or a standard chat.\n3. **Multi-Model Intelligence:**\n   * **Gemini 2.5:** Powers rapid and high-quality general chat reasoning.\n   * **Llama 3.2 Vision (via OpenRouter):** Specifically used to describe and analyze images or text-based files.\n   * **Flux (via Pollinations):** Uses a specialized AI Agent to refine prompts and generate professional-grade images.\n4. **Contextual Memory:** A 50-message buffer window ensures O'Carla maintains the context of your conversation based on your Discord User ID.\n5. **Clean UI Output:** Generated image links are automatically shortened via **TinyURL** to keep the Discord chat interface tidy.\n\n## How to use\n1. Connect your **Google Gemini** and **OpenRouter** API keys in the respective nodes.\n2. Replace the Webhook URL in your bot script with this workflow's **Production Webhook URL**.\n3. Type `gambar: [your prompt]` in Discord to generate images.\n4. Upload an image or file to Discord to trigger the AI Vision analysis.\n\n## Requirements\n* n8n instance (Self-hosted or Cloud).\n* Google Gemini API Key.\n* OpenRouter API Key.\n* Discord Bot Token and hosting environment.\n\n## Customising this workflow\nO'Carla is highly flexible. You can change her personality by modifying the **System Message** in the Agent nodes, adjust the memory window length, or swap the LLM models to specialized ones like Claude 3.5 or GPT-4o.\n\n",
  "featuredImage": "/data/workflows/12097/12097.webp",
  "author": {
    "id": 101,
    "slug": "asla",
    "name": "Aslamul Fikri Alfirdausi",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 65,
  "downloads": 6,
  "createdAt": "2025-12-24T10:19:30.386Z",
  "updatedAt": "2026-01-16T09:11:24.015Z",
  "publishedAt": "2025-12-24T10:19:30.386Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12097"
}