{
  "id": 6464,
  "slug": "6464",
  "title": "Transform event notes to LinkedIn posts with Telegram, Google Calendar & Claude AI",
  "description": "### **Description**\nThis workflow transforms your quick event notes into polished LinkedIn posts. Simply send a message via Telegram with your event name and personal notes, and the system will match it with your calendar events, generate a professional LinkedIn post. \n\nAnd even if you don't feel like posting it on LinkedIn, it still serves you because it saves everything to your database for future reference. In this way you can build a ***personal library of your professional networking activities and insights***!\n\n### Who Is This For?\n- Professional Networkers: Business professionals who attend events regularly and want to share insights on LinkedIn without spending time on content creation.\n- Event Enthusiasts: Conference attendees, meetup participants, and workshop goers who want to document and share their experiences professionally.\n- Busy Professionals: Anyone who wants to maintain an active LinkedIn presence but lacks time to craft posts from scratch after events.\n\n### What Problem Does This Workflow Solve?\nAfter attending events, I struggle with several challenges:\n\n- Time Constraints: Writing thoughtful LinkedIn posts takes time.\n- Writer's Block: Difficulty transforming my raw notes and experiences into engaging social media content.\n- Data Organization: Keeping track of event details, personal insights, and networking opportunities in one place.\n\n### How It Works\n\n- Telegram Input: Send a message to your Telegram bot with the format \"Event Name: Your personal notes\"\n- Message Parsing: The system extracts the event name and your personal notes from the message\n- Calendar Matching: Searches your Google Calendar for events from the past 7 days that match the event name\n- Data Enrichment: Combines your personal notes with event details (date, location, attendees) from your calendar\n- AI Content Generation: Uses Claude Opus 4 to transform your notes into a professional LinkedIn post with relevant hashtags\n- Database Storage: Saves the complete event information and generated LinkedIn post to Supabase\n- Ready to Post: Provides you with a polished LinkedIn post ready for publication\n\n\n### Setup Instructions\n\n- n8n (Cloud or self-hosted)\n- Telegram Bot (Create via @BotFather)\n- Google Calendar API (OAuth2 credentials)\n- Anthropic API (Claude access)\n- Supabase (Database and API credentials)\n\n\n**My Supabase table consists these columns:**\n\n- Event Date (datetime)\n- Event Title (text)\n- Location (text)\n- Personal Notes (text)\n- LinkedIn Post (text)\n- Created Date (datetime)\n\n\n\n\nThis workflow transforms the tedious task of creating LinkedIn content into an automated, intelligent system that helps you maintain an active professional presence while building a valuable archive of your networking and learning experiences.\n\n",
  "featuredImage": "/data/workflows/6464/6464.webp",
  "author": {
    "id": 101,
    "slug": "xyzhang",
    "name": "Xiaoyuan Zhang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 353,
  "downloads": 35,
  "createdAt": "2025-07-25T22:11:33.036Z",
  "updatedAt": "2026-01-16T08:45:06.969Z",
  "publishedAt": "2025-07-25T22:11:33.036Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6464"
}