{
  "id": 6705,
  "slug": "6705",
  "title": "QuickBooks customer welcome emails with Google Sheets tracking",
  "description": "# Automated QuickBooks New Customer Welcome Emails\n\nThis workflow provides a robust solution for QuickBooks users looking to automate their new customer onboarding process. It solves the time-consuming and error-prone task of manually sending welcome emails by creating a fully automated system that ensures every new customer receives a timely, personalized, and professional welcome.\n\nThe workflow periodically checks your QuickBooks Online account for new entries. To prevent sending duplicate emails to existing customers, it cleverly uses a Google Sheet as a simple database, tracking every customer who has already been contacted. This makes the process reliable and safe to run on an automated schedule.\n\nThis template was crafted with care by the team at **Elegant Biztech** to help you build stronger customer relationships through smart automation.\n\n## How the Workflow Operates\n\n1.  **Scheduled Trigger:** The workflow initiates on a customizable schedule (e.g., every hour).\n2.  **Fetch Data:** It simultaneously fetches all customer data from your QuickBooks account and the list of already-processed customer IDs from your Google Sheet.\n3.  **Find New Customers:** It compares the two lists to isolate only the new customers who have not yet been processed.\n4.  **Log New Customers:** For each new customer found, the workflow performs two logging actions:\n    *   It appends their full details (Name, Company, Email, etc.) to a \"log\" sheet for your records.\n    *   It adds their unique Customer ID to the \"tracking\" sheet to ensure they are not emailed again in the future.\n5.  **Craft Personalized Email:** A `Email Template` node dynamically generates a beautiful, responsive HTML email, personalized with the customer's name, company, and location details.\n6.  **Send Welcome Email:** The final node sends the uniquely crafted email to the new customer.\n\n## Prerequisites\n\nBefore you begin, please ensure you have the following:\n*   An active n8n instance.\n*   A QuickBooks Online account with API access.\n*   A Google account.\n*   An email service (e.g., SMTP, Gmail, Outlook) connected to n8n as credentials.\n\n## Step-by-Step Setup Guide\n\nFollow these instructions carefully to configure the workflow for your use.\n\n### 1. Create the Google Sheet\nThis workflow requires a Google Sheet with two specific tabs to function as its database.\n\n1.  Create a new Google Sheet.\n2.  Rename the first tab to **`Processed IDs`**. In cell **A1**, create the header: `CustomerIds`.\n3.  Create a second tab and name it **`New Customer Logs`**. In row 1, create the following headers: `Customer_Name`, `Company_Name`, `Email_ID`, `Phone_No`, `Customer_ID`.\n\n### 2. Connect Your Accounts\nYou must authenticate your accounts in the designated nodes.\n\n*   **`Get many Customers` node:** Select this node and connect your QuickBooks Online credentials.\n*   **`Read Old Customers` node:** Connect your Google Sheets account credentials here. This will be automatically used by the other Google Sheets nodes.\n*   **`Send Personalized Welcome Email` node:** Connect the credentials for the email account you wish to send from.\n\n### 3. Configure the Google Sheets Nodes\nPoint the workflow to the correct sheet and tabs you just created.\n\n*   **`Read Old Customers` node:**\n    *   In the **Document ID** field, select your new Google Sheet.\n    *   In the **Sheet Name** field, select the **`Processed IDs`** tab.\n*   **`Log New Customer Details` node:**\n    *   Verify the **Document ID** field is correctly set to your Google Sheet.\n    *   In the **Sheet Name** field, select the **`New Customer Logs`** tab.\n*   **`Log New Customer ID for Tracking` node:**\n    *   Verify the **Document ID** is correct.\n    *   In the **Sheet Name** field, select the **`Processed IDs`** tab.\n\n### 4. Customize the Email Template\nPersonalize the welcome email to match your brand.\n\n1.  Open the **`Code`** node.\n2.  Inside the code editor, find and replace these four placeholder values:\n    *   **Your Logo URL:** Replace the placeholder link with a public URL to your company's logo.\n    *   **Your Website Link:** Replace the placeholder with a link to your website's dashboard or homepage.\n    *   **Your Support Email:** Replace the `mailto:` link with your company's support email.\n    *   **Your Company Name:** Update the company name in the copyright footer.\n3.  Next, select the **`Send Personalized Welcome Email`** node and update the **Subject** field with your company's name.\n\n### 5. Activate the Workflow\n1.  Open the **`Scheduler`** node to set the schedule for how often you want the workflow to run.\n2.  **Save** the workflow.\n3.  Click the **Active** toggle at the top right of the screen.\n\nYour automated welcome email system is now live! For questions or to explore more custom solutions, visit us at [elegantbiztech.com](https://www.elegantbiztech.com).\n",
  "featuredImage": "/data/workflows/6705/6705.webp",
  "author": {
    "id": 101,
    "slug": "ebworkflows",
    "name": "Elegant Biztech",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 161,
  "downloads": 16,
  "createdAt": "2025-07-30T15:37:31.365Z",
  "updatedAt": "2026-01-16T08:46:37.264Z",
  "publishedAt": "2025-07-30T15:37:31.365Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6705"
}