{
  "id": 8051,
  "slug": "8051",
  "title": "Customer personality (BaZi, DISC, Numerology) with Gemini & Google Sheets",
  "description": "## 📄 What this workflow does\n This workflow turns your n8n into an automated personality-insights engine driven by Google Sheets. When a row is updated with Analysis Status = Run, it:\n- Computes Lunar Date of Birth and Four Pillars (BaZi) from DOB and optional birth time.\n- Calculates Numerology (Life Path, Birth Day, Pinnacles/Challenges, Expression, Soul Urge, Personality, Maturity) and a phone “vibration” number.\n- Generates concise, sales-oriented bullet-point analyses with Gemini for BaZi, Numerology, and DISC (from Notes).\n- Merges results and writes back to the sheet: Lunar Date of Birth, Four Pillars, Numerology, Four Pillars Analysis, Numerology Analysis, DISC Analysis, and a combined Personality summary—then flips Analysis Status to Done.\n- Handles missing data gracefully and logs clear warnings in the sheet fields.\n\n\n## 👤 Who is this for\n- Sales teams working from spreadsheets who want fast personality cues for outreach.\n- Coaches/consultants providing light BaZi/Numerology/DISC summaries at scale.\n- SMBs maintaining lead/customer lists in Google Sheets and wanting auto-generated insights.\n\n\n## ✅ Requirements\n- An n8n instance.\n- Google Sheets with these columns (English): No, Full Name, Date of Birth, Birth Time, Gender, Email, Phone, Status, Analysis Status, Purchase Value, Notes, Four Pillars, Four Pillars Analysis, Lunar Date of Birth, Numerology, Numerology Analysis, DISC Analysis, Personality, Script.\n- Google Sheets OAuth2 credentials connected in n8n.\n- Google Gemini API credentials (nodes use models like models/gemini-1.5-flash and models/gemini-2.5-flash).\n- (Optional) Confirm timezone (+07:00) used in the BaZi lunar calculations fits your use case.\n\n\n## ⚙️ How to set up\n- Import the provided workflow JSON into n8n.\n- Connect Google Sheets credentials and point to your spreadsheet + sheet (gid).\n- Connect Gemini credentials and keep/adjust the default model IDs.\n- Ensure your sheet has the listed English column headers.\n- (Optional) Adjust the timezone constant in the Code nodes if you’re not in GMT+7.\n- Set Analysis Status = Run in any row you want analyzed and trigger a row update.\n\n\n🔁 How it works\n1. Trigger → Google Sheets Trigger fires on row update where Analysis Status = Run.\n2. Pre-processing → Code computes Lunar DOB + Four Pillars; Code1 computes Numerology and phone metric.\n3. Conditional flows → IF nodes check available inputs (BaZi/Numerology/Notes) and call the relevant Gemini nodes.\n4. LLM Generation → Gemini returns three focused analyses (BaZi, Numerology, DISC) plus a combined Personality summary.\n5. Merge/Aggregate → Results are merged for a single row.\n6. Write-back → Google Sheets nodes update Lunar Date of Birth, Four Pillars, Numerology, Four Pillars Analysis, Numerology Analysis, DISC Analysis, Personality and set Analysis Status = Done.\n\n## 💡 About Margin AI\n[Margin AI](https://marginai.co/) is an AI-services agency that acts as your AI Service Companion. We design intelligent, human-centric automation solutions—turning your team’s best practices into scalable workflows and tools. Industries like marketing, sales, and operations benefit from our tailored AI consulting, automation tools, and chatbot development.\n\n\n\n\n",
  "featuredImage": "/data/workflows/8051/8051.webp",
  "author": {
    "id": 101,
    "slug": "cong-nguyen",
    "name": "Cong Nguyen",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 75,
  "downloads": 7,
  "createdAt": "2025-08-30T09:53:17.303Z",
  "updatedAt": "2026-01-16T08:53:51.940Z",
  "publishedAt": "2025-08-30T09:53:17.303Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8051"
}