{
  "id": 10284,
  "slug": "10284",
  "title": "Monitor stock market with AI: news analysis & multi-channel alerts via Slack & Telegram",
  "description": "# AI Customer Support Triage with Gmail, OpenAI, Airtable & Slack\n\n## How it Works\nThis workflow monitors your Gmail support inbox every minute, automatically sending each unread email to OpenAI for intelligent analysis. The AI evaluates sentiment (Positive/Neutral/Negative/Critical), urgency level (Low/Medium/High/Critical), categorizes requests (Technical/Billing/Feature Request/Bug Report/General), extracts key issues, and generates professional response templates.\n\nThe system calculates a priority score (0-110) by combining urgency and sentiment weights, then routes tickets accordingly. Critical issues trigger immediate Slack alerts with full context and 30-minute SLA reminders, while routine tickets post to standard monitoring channels. Every ticket logs to Airtable with complete analysis and thread tracking, then updates a Google Sheets dashboard for real-time analytics.\n\nA secondary AI pass generates strategic insights (trend identification, risk assessment, actionable recommendations) and stores them back in Airtable. The entire process takes seconds from email arrival to team notification, eliminating manual triage and ensuring critical issues get immediate attention.\n\n---\n\n## Who is this for?\n- Customer support teams needing automated prioritization for high email volumes\n- SaaS companies tracking support metrics and response times\n- Startups with lean teams requiring intelligent ticket routing\n- E-commerce businesses managing technical, billing, and return inquiries\n- Support managers needing data-driven insights into customer pain points\n\n---\n\n## Setup Steps\n- **Setup time:** 20-30 minutes\n- **Requirements:** Gmail, OpenAI API key, Airtable account, Google Sheets, Slack workspace\n\n1. **Monitor Support Emails:** Connect Gmail via OAuth2, configure INBOX monitoring for unread emails\n2. **AI Analysis Engine:** Add OpenAI API key, system prompt pre-configured for support analysis\n3. **Parse & Enrich Data:** JavaScript code automatically calculates priority scores (no changes needed)\n4. **Route by Urgency:** Configure routing rules for critical vs routine tickets\n5. **Slack Alerts:** Create Slack app, get bot token and channel IDs, replace placeholders in nodes\n6. **Airtable Database:** Create base with \"tblSupportTickets\" table, add API key and Base ID (replace `appXXXXXXXXXXXXXX`)\n7. **Google Sheets Dashboard:** Create spreadsheet, enable Sheets API, add OAuth2 credentials, replace Sheet ID (`1XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX`)\n8. **Generate Insights:** Second OpenAI call analyzes patterns, stores insights in Airtable\n9. **Test:** Send test email, verify Slack alerts, check Airtable/Sheets data logging\n\n---\n\n## Customization Guidance\n- **Priority Scoring:** Adjust urgency weight (25) and sentiment weight (10) in Code node to match your SLA requirements\n- **Categories:** Modify AI system prompt to add industry-specific categories (e.g., healthcare: appointments, prescriptions)\n- **Routing Rules:** Add paths for High urgency, VIP customers, or specific categories\n- **Auto-Responses:** Insert Gmail send node after routine tickets for automatic acknowledgment emails\n- **Multi-Language:** Add Google Translate node for non-English support\n- **VIP Detection:** Query CRM APIs or match email domains to flag enterprise customers\n- **Team Assignment:** Route different categories to dedicated Slack channels by department\n- **Cost Optimization:** Use GPT-3.5 (~$0.001/email) instead of GPT-4, self-host n8n for unlimited executions\n\n---\n\nOnce configured, this workflow operates as your intelligent support triage layer—analyzing every email instantly, routing urgent issues to the right team, maintaining comprehensive analytics, and generating strategic insights to improve support operations.\n\n---\n\n**Built by Daniel Shashko**  \n[Connect on LinkedIn](https://www.linkedin.com/in/daniel-shashko/)",
  "featuredImage": "/data/workflows/10284/10284.webp",
  "author": {
    "id": 101,
    "slug": "tomax",
    "name": "Daniel Shashko",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 361,
  "downloads": 36,
  "createdAt": "2025-10-29T15:22:06.167Z",
  "updatedAt": "2026-01-16T09:04:17.870Z",
  "publishedAt": "2025-10-29T15:22:06.167Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10284"
}