{
  "id": 11360,
  "slug": "11360",
  "title": "Generate local business leads with Google Places API & website email scraping",
  "description": "# Purpose & Audience\nThis workflow automates the process of finding and collecting contact information for local businesses in any city or region. Built entirely with free-tier APIs, it eliminates the need for expensive scraping services while delivering professional-quality lead generation results.\nPerfect for agencies, freelancers, sales teams, and entrepreneurs who need to build targeted prospect lists without breaking the bank or dealing with complex scraping tools.\n\n## What It Does\nThis comprehensive automation workflow:\n1. Searches Google Places for businesses by type and location (restaurants, gyms, salons, etc.)\n2. Retrieves up to 60 businesses per city using built-in pagination across 3 pages\n3. Extracts complete business details: name, address, phone, website, rating, and description\n4. Scrapes business websites to find email addresses automatically\n5. Handles edge cases gracefully: businesses without websites, failed scrapes, or missing data\n6. Batches API requests with intelligent rate limiting to respect Google's quotas\n7. Makes clean CSV files available for download with all collected data ready for outreach\n8. (Optional) Sends results/csv via email automatically when scraping completes\n\n## Who Is It For?\nIdeal Users:\n- Marketing Agencies building prospect lists for local business campaigns\n- Sales Teams targeting specific industries in multiple cities\n- Freelancers offering services to local businesses (web design, SEO, consulting)\n- Entrepreneurs researching competitors or potential partners\n- Recruiters finding company contact information\n- Event Organizers building vendor or sponsor lists\n\n## Use Cases:\n1. Build email lists for cold outreach campaigns\n2. Research local market competitors\n3. Find potential clients in specific industries\n4. Gather vendor contact information\n5. Create business directories\n6. Market research and analysis\n\n## Expected Results\n**Per Search:**\n60 businesses maximum (with pagination)\n70-85% will have websites\n40-60% websites will contain email addresses\nProcessing time: ~5-10 minutes per city/search\n\n## Monthly Capacity/Quota (Free Tier):\n- Places API: 150 requests per day ( = ~5,000 per month) to stay within the free tier\n- Places API (New): 300 autocomplete requests per day ( = ~10,000 per month), 300 GetPlace requests per day ( = ~10,000 per month)\n\n\n## Key Features:\n✅ Form-based input for easy use (no coding required)\n✅ Pagination support for maximum results (60 per search)\n✅ Smart email extraction with false-positive filtering\n✅ Fallback handling for businesses without websites\n✅ Rate limiting to stay within free API tiers (see the Quota for awareness)\n✅ Batch processing for efficient execution\n✅ CSV export for immediate use in CRMs\n",
  "featuredImage": "/data/workflows/11360/11360.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 134,
  "downloads": 13,
  "createdAt": "2025-11-29T21:03:35.885Z",
  "updatedAt": "2026-01-16T09:08:28.115Z",
  "publishedAt": "2025-11-29T21:03:35.885Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11360"
}