{
  "id": 12641,
  "slug": "12641",
  "title": "Create Bosta shipping orders from Odoo invoices using OpenAI GPT models",
  "description": "## What Problem Does It Solve?\n- **Manual Data Entry Bottlenecks:** Moving shipping data from Odoo to Bosta manually is slow and prone to errors, especially during high-volume periods.\n- **Address Mismatches:** Odoo stores addresses as unstructured text, while Bosta requires strict Zone/District IDs. Mismatches lead to failed deliveries and returns.\n- **Messy Labels:** Long ERP product names look unprofessional on shipping labels.\n- **This workflow solves these by:**\n  - Instantly creating the shipping order in Bosta when an Odoo invoice is confirmed.\n  - Using an **AI Agent** to intelligently parse raw addresses and map them to the exact Bosta ID.\n  - Ensuring the high operational standards required by automating data cleaning and COD rounding.\n\n## How to Configure It\n### 1. Odoo Setup\n- Create an Automation Rule in Odoo that sends a POST request to this workflow's Webhook URL when an invoice state changes to \"Confirmed\".\n\n### 2. Credentials\n- Connect your **Odoo**, **OpenAI**, and **Telegram** accounts in the respective n8n nodes.\n- Add your **Bosta API Key** in the Header parameters of the `Create Bosta Order` node.\n\n### 3. Product Mapping\n- Open the `Summarize Items` code node and update the `NAME_MAP` object to link your Odoo product names to short shipping labels.\n\n### 4. Data Table\n- Ensure the `Fetch Zones` node is connected to your Bosta Zones/Districts data table in n8n.\n\n## How It Works\n- **Trigger:** The workflow starts automatically when an invoice is confirmed in Odoo.\n- **Fetch & Process:** It pulls customer details and invoice items, then aggregates quantities (e.g., turning 3 lines of \"Shampoo\" into \"Shampoo (3)\").\n- **AI Analysis:** The AI Agent cross-references the raw address with the official Bosta zones list to strictly select the correct IDs.\n- **Execution:** The order is created in Bosta. If successful, the process is complete.\n- **Error Handling:** If any step fails, a Telegram message is sent immediately with the invoice number to alert the **operations team**.\n\n## Customization Ideas\n- **Write Back:** Add a node to update the Odoo invoice with the generated Bosta tracking number.\n- **Multi-Courier:** Add a switch node to route orders to different couriers (e.g., Aramex, Mylerz) based on the city.\n- **Campaign Logging:** Log successful shipments to a spreadsheet to track fulfillment metrics.\n- **Notification Channels:** Change the error alert from Telegram to Slack or Email.\n\nIf you need any help [Get in Touch](https://www.linkedin.com/in/abdallaelshikh0/)",
  "featuredImage": "/data/workflows/12641/12641.webp",
  "author": {
    "id": 101,
    "slug": "abdullah01",
    "name": "Abdullah Alshiekh",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2,
  "downloads": 0,
  "createdAt": "2026-01-11T17:40:22.671Z",
  "updatedAt": "2026-01-16T09:12:48.346Z",
  "publishedAt": "2026-01-11T17:40:22.671Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12641"
}