{
  "id": 6413,
  "slug": "6413",
  "title": "Automate security incident response with Google Sheets, email alerts and EDR isolation",
  "description": "👤 Who it’s for\nSOC teams, incident responders, or solo defenders who need to automatically act on critical threats without manual triage.\n\nIdeal for BlueOps users who’ve already classified alerts via GPT (Module 4) and want to auto-execute response steps like email alerts, logging, or EDR isolation.\n\n⚙️ How it works / What it does\nReads critical alerts from a classified incident log (e.g., Module 4 output)\n\nFilters alerts by severity = Critical\n\nSends alert summary via email (custom HTML formatting)\n\nLogs all details to a central incident response sheet\n\nOptionally sends a request to your EDR/Isolation API (e.g. CrowdStrike or simulated API)\n\n🛠️ How to set up\nReplace Placeholder API Key\nSwap in your secure ISOLATION_API_KEY from your EDR or proxy tool\n\nUpdate Email Settings\nInsert your FROM_EMAIL and TO_EMAIL credentials in the Email node\n\nConnect Sheets\nAuthorize access to both your Classified Alerts sheet and Incident Log sheet\n\nSchedule the Run\nDefault trigger is weekly — change it to run hourly, on webhook, or via logic hook\n\n📋 Requirements\nEDR or endpoint proxy API accepting POST requests\n\nOpen or pre-classified incident sheet (Module 4 required)\n\nSMTP email provider or Gmail API access\n\nGoogle Sheets or internal DB to log actions\n\n🧩 How to customize the workflow\nReplace Google Sheets with Supabase or your internal SQL\n\nSwap email alerts with ticketing system (e.g., Jira or Slack alerts)\n\nTrigger downstream actions (e.g. auto-pause cloud assets)\n\nModify aggregation or isolation logic to your threat model\n\n📦 This is a live-fire auto-responder workflow.\nMake sure to test with dummy data before enabling full EDR triggers.\nAll sensitive variables are clearly marked with placeholders.\n\n🚨 This module is part of the CYBERPULSEBlueOps Pro Incident Response Suite.\nView the full lineup at 👉 cyberpulsesolutions.com/blueops",
  "featuredImage": "/data/workflows/6413/6413.webp",
  "author": {
    "id": 101,
    "slug": "adnantariq",
    "name": "Adnan Tariq",
    "avatar": ""
  },
  "categories": [
    "SecOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 83,
  "downloads": 8,
  "createdAt": "2025-07-25T06:31:05.615Z",
  "updatedAt": "2026-01-16T08:44:54.391Z",
  "publishedAt": "2025-07-25T06:31:05.615Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6413"
}