{
  "id": 8013,
  "slug": "8013",
  "title": "Automate scraping Y Combinator startups with Apify & Google Sheets",
  "description": "## Disclaimer\nCommunity nodes are used, and template can only be used on self-hosted n8n instances.\n\n![workflow overview.PNG](fileId:2280)\n\n## This n8n template from [Intuz](https://www.intuz.com/) provides a complete solution to automate the process of scraping company and founder data from Y Combinator. \n\nIt systematically extracts valuable information from your target search and organizes it directly into a Google Sheet, building a powerful prospecting list with minimal effort.\n\n## Who's this workflow for?\n- Sales Teams & SDRs\n- Venture Capitalists \n- Angel Investors\n- Market Researchers\n- Startup Founders\n\n## How it works\n**1. Trigger the Scrape:** You start the workflow manually whenever you want to gather new company data.\n\n**2. Scrape Y Combinator:** An Apify actor automatically visits your specified Y Combinator search URL (e.g., filtered by batch, industry, or region) and scrapes the details of each company listed.\n\n**3. Retrieve Structured Data:** The workflow fetches the neatly structured data from Apify, including company names, descriptions, websites, founder details, and more.\n\n**4. Log to Google Sheets:** All the scraped information is added or updated as new rows in your designated Google Sheet, creating an organized and actionable database.\n\n## Setup Instructions\n**1. Apify Configuration:**\n- In the Run an Actor node, connect your Apify account.\n- Select the Y Combinator Directory Scraper actor.\n- In the Custom Body field, replace {YOUR_Y_COMBINATOR_SEARCH_URL} with the actual URL from the Y Combinator website after you've applied your desired filters.\n- You can adjust the maxCompanies value to control how many companies are scraped per run.\n\n**2. Google Sheets Configuration:**\n- In the Add data to Google Sheet node, connect your Google Sheets account.\n- Select the Document (spreadsheet) and Sheet where you want to save the data. Make sure the sheet has the required columns listed in the \"Key Requirements\" section.\n\n**3. Execute the Workflow:**\n- Click the \"Execute workflow\" button to run the scraper and populate your Google Sheet.\n\n## Key Requirements to Use This Template\n- n8n Instance: An active n8n account (Cloud or self-hosted).\n- Apify Account: An active Apify account with an API key. You will also need sufficient credits or a subscription plan to run the Y Combinator Directory Scraper actor.\n- Google Account & Sheet: A Google account and a pre-made Google Sheet. The sheet must have the following columns created in advance: Company, Location, Website, LinkedIn, Founded, Description, Industry Tags, Founder 1 Name, Founder 1 LinkedIn, Founder 2 Name, and Founder 2 LinkedIn.\n\n## Connect with us\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n## For Custom Worflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n\n\n",
  "featuredImage": "/data/workflows/8013/8013.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 212,
  "downloads": 21,
  "createdAt": "2025-08-29T06:50:56.787Z",
  "updatedAt": "2026-01-16T08:53:35.525Z",
  "publishedAt": "2025-08-29T06:50:56.787Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8013"
}