{
  "id": 11765,
  "slug": "11765",
  "title": "Generate AI images with Telegram bot & auto-publish to social media using Nano Banana PRO",
  "description": "This n8n workflow allows you to generate AI images using **Nano Banana PRO** through a **Telegram bot** interface, with optional automatic publishing to social media platforms.\n\nUsers interact with the workflow entirely via Telegram commands and forms. The workflow supports multiple image generation modes and can automatically enhance prompts, compress images, generate captions, and publish content to Facebook, Instagram, and X.\n\nThis template is especially useful for product visuals, lifestyle scenes, and content creation workflows where manual image generation and posting would otherwise be repetitive.\n\nHow it works\n------------\n\n1.  A user sends a command to the Telegram bot (text-to-image, image-to-image, or multi-image fusion).\n2.  The workflow collects the required inputs (text prompt, uploaded images, aspect ratio, quality).\n3.  If enabled, an AI Agent enhances the user prompt before image generation.\n4.  The workflow sends the request to [Kie.ai](https://kie.ai), which runs the Nano Banana PRO image model.\n5.  The workflow waits for the image generation task to complete and retrieves the result.\n6.  The generated image is downloaded and sent back to the user via Telegram.\n7.  Optionally, the image is compressed using [TinyPNG](https://tinypng.com/developers).\n8.  If social sharing is enabled:\n    *   An AI Agent generates platform-optimized captions.\n    *   The image and captions are published automatically to selected platforms (Facebook, Instagram, X) via [Blotato](https://blotato.com/?ref=nocodehack).\n\nHow to use\n----------\n\n1.  Create a Telegram bot using **@BotFather** and add the bot token to the Telegram Trigger credentials.\n2.  Configure the required API credentials (see Requirements).\n3.  Activate the workflow in n8n.\n4.  Send a command to your Telegram bot:\n    *   `/text_to_image`\n    *   `/image_to_image`\n    *   `/multi_image`\n5.  Follow the Telegram form prompts to generate and optionally publish images.\n\nRequirements\n------------\n\nThe following services are required for the workflow to function:\n\n*   **Telegram Bot** – user interaction\n*   **Kie.ai API** – Nano Banana PRO image generation ([Get access](https://kie.ai))\n*   **Cloudinary** – image hosting for uploaded files ([Create an account](https://cloudinary.com))\n*   **OpenAI API** – prompt enhancement and caption generation\n\nOptional services:\n\n*   **TinyPNG** – image compression ([Get an API key](https://tinypng.com/developers))\n*   **Blotato** – social media publishing ([Connect accounts](https://blotato.com/?ref=nocodehack))\n\nCustomising the workflow\n------------------------\n\n*   You can disable image compression by removing the TinyPNG nodes.\n*   Social media auto-publishing can be disabled by removing the Blotato nodes.\n*   Prompt enhancement behavior can be adjusted in the AI Agent system prompt.\n*   Additional platforms or posting logic can be added after the caption generation step.\n*   The workflow can be adapted to other AI image models by replacing the Kie.ai API calls.\n\nNotes\n-----\n\n*   This is a self-hosted n8n workflow.\n*   All API keys and credentials must be provided by the user.\n*   The workflow is modular and can be partially enabled depending on your use case.",
  "featuredImage": "/data/workflows/11765/11765.webp",
  "author": {
    "id": 101,
    "slug": "nocodehack",
    "name": "ing.Seif",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 470,
  "downloads": 47,
  "createdAt": "2025-12-13T14:08:56.797Z",
  "updatedAt": "2026-01-16T09:10:02.288Z",
  "publishedAt": "2025-12-13T14:08:56.797Z",
  "nodes": 51,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11765"
}