{
  "id": 11215,
  "slug": "11215",
  "title": "Automate job applications with AI resume tailoring using GPT-4o, LinkedIn & Gmail",
  "description": "## Overview\nStop applying manually. This workflow acts as your personal AI recruiter, automating the end-to-end process of finding high-quality jobs, tailoring your resume, and preparing personalized outreach emails to decision-makers.\n\n## What this workflow does\n* **Scrapes Real-Time Jobs:** Uses Apify to pull live job listings from LinkedIn based on your specific keywords (e.g., \"AI Automation\").\n* **Smart Filtering:** Uses GPT-4o-mini to analyze job descriptions against your skills and automatically discards roles that aren't a good fit.\n* **Hyper-Personalized Resume:** Uses GPT-4o to rewrite your \"Master Resume\" specifically for the target job description.\n* **Document Generation:** Creates a new Google Doc with the tailored resume and automatically sets sharing permissions.\n* **Decision Maker Enrichment:** Uses Anymail Finder to locate the verified email address of the Company CEO or Hiring Manager.\n* **Cold Email Draft:** Generates a personalized pitch in Gmail (Drafts folder) with the link to your custom resume attached.\n\n## Setup Requirements\nTo run this workflow, you will need to set up credentials in n8n for the following services. Please ensure you use n8n credentials and do not hardcode API keys into the HTTP nodes:\n* **Google Drive & Docs:** To read your master resume and create new application files.\n* **Apify Account:** To run the LinkedIn Job Scraper actor.\n* **OpenAI API Key:** For logic (GPT-4o-mini) and writing (GPT-4o).\n* **Anymail Finder API:** To find contact email addresses.\n* **Gmail:** To create the draft emails.\n\n## How to use\n1. **Upload Resume:** Paste your \"Master Resume\" text into the first Google Docs node or connect your existing file.\n2. **Configure Credentials:** Add your API keys in the n8n credentials section for all services listed above.\n3. **Set Search Criteria:** Update the JSON body in the Apify node with your desired LinkedIn job search URL.\n4. **Run:** Execute the workflow and watch your drafts folder fill up with ready-to-send applications.",
  "featuredImage": "/data/workflows/11215/11215.webp",
  "author": {
    "id": 101,
    "slug": "websensepro",
    "name": "Websensepro",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1013,
  "downloads": 101,
  "createdAt": "2025-11-25T12:27:27.184Z",
  "updatedAt": "2026-01-16T09:07:57.863Z",
  "publishedAt": "2025-11-25T12:27:27.184Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11215"
}