{
  "id": 8936,
  "slug": "8936",
  "title": "Automate invoice-bank statement reconciliation with Mistral AI and OpenAI GPT-4",
  "description": "**Cash Reconciliation with AI**\n\nThis template automates daily cash reconciliation by comparing your open invoices against bank statement transactions. Instead of manually scanning statements line by line, the workflow uses AI to:\n\n1. Match transactions to invoices and assign confidence scores\n2. Flag unapplied or review-needed payments\n3. Produce a reconciliation table with clear metrics (match %, unmatched count, etc.)\n\nThe end result: faster cash application, fewer errors, and better visibility into your cash flow.\n\n**Good to know**\n\n1. Each AI transaction match call will consume credits from your OpenAI account. Check OpenAI pricing for costs.\n2. OCR is used to extract data from PDF bank statements, so you’ll need a Mistral OCR API key.\n3. This workflow assumes invoices are stored in an Excel or CSV file. You may need to tweak column names to match your file headers.\n\n**How it works**\n\n1. Import files:The workflow pulls your invoice file (Excel/CSV) and daily bank statement (from OneDrive, Google Drive, or local storage).\n2. Extract and normalize data: OCR is applied to bank statements if needed. Both data sources are cleaned and aligned into comparable formats.\n3. AI matching: The AI agent compares statement transactions against invoice records, assigns a confidence score, and flags items that require manual review.\n4. Reconciliation output:A ready-made table shows matched invoices (with amounts and confidence), unmatched items, and summary stats.\n\n**How to use**\n\n1. Start with the manual trigger node to test the flow. Once validated, replace it with a schedule trigger to run daily.\n2. Adjust thresholds (like date tolerances or amount variances) in the code nodes to fit your business rules.\n3. Review the reconciliation table each day most of the work is automated, you just handle exceptions.\n\n**Requirements**\n\n1. OpenAI API key\n2. Mistral OCR API key (for PDF bank statements)\n3. Microsoft OneDrive API key and Microsoft Excel API key\n4. Access to your invoice file (Excel/CSV) and daily bank statement source\n\n**Setup steps**\n\n**Connect accounts**:\nEnter your API keys (OpenAI, Mistral OCR, OneDrive, Excel).\n\n**Configure input nodes**: \n\n1. Point the Excel/CSV node to your invoice file.\n2. Connect the Get Bank Statement node to your statement storage.\n\n**Configure AI agent**: Add your OpenAI API credentials to the AI node.\n\n**Customize if needed**\n\n1. Update column mappings if your file uses different headers.\n2. Adjust matching thresholds and tolerance logic.\n",
  "featuredImage": "/data/workflows/8936/8936.webp",
  "author": {
    "id": 101,
    "slug": "vgangidi",
    "name": "Vinay Gangidi",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 708,
  "downloads": 70,
  "createdAt": "2025-09-25T22:30:46.203Z",
  "updatedAt": "2026-01-16T08:58:28.739Z",
  "publishedAt": "2025-09-25T22:30:46.203Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8936"
}