{
  "id": 9240,
  "slug": "9240",
  "title": "Daily LinkedIn job alerts with Apify scraper, Google Sheets & Gmail",
  "description": "## Overview\nEvery day, this workflow scrapes LinkedIn jobs based on your keywords, saves them in a Google Sheet, and sends them by email.\n\n## How it works\n- The workflow runs every day at noon.\n- The Apify node sends a request to a LinkedIn scraper actor on Apify, which scrapes and returns the data.\n- The code node formats the data we want and builds the HTML needed to make the emails look good. We use inline if statements for cases where the salary isn't listed or the job doesn’t say if it’s on-site, remote, or hybrid.\n- At the same time, we add the LinkedIn jobs we scraped to a Google Sheet so we can check them later.\n- We combine everything into one list.\n- The Gmail node uses the `map()` function to list all the items we scraped and formatted. It customizes the subject line and heading of the email to include the current date.\n\n## Setup steps\n1. Create a new Google Sheet and add the headers you want. Adjust the Google Sheets node to use your newly created Sheet.\n2. Customize the JSON in the `Get LinkedIn jobs` node. Note that this workflow currently uses the [`LinkedIn Jobs Scraper - No Cookies`](https://apify.com/apimaestro/linkedin-jobs-scraper-api) actor on Apify.  \n   - Leave `date_posted` as is.  \n   - Adjust `keywords` to change the job you want to scrape. You can use Boolean operators like AND or NOT in your search.  \n   - Adjust `limit` to the number of jobs you want to scrape.  \n   - Adjust `location` to match your location.  \n   - Leave `sort` as is to get the most recent jobs first.  \n3. *(Optional)* Edit the HTML in the code node to change how the listings will look in the email.  \n4. Add your email to the Gmail node.\n\n## Requirements\n- [Apify account](https://apify.com/)  \n- Apify community node installed. If you don’t want to install the community node, you can use a regular HTTP node and call the HTTP directly. Check [their API docs](https://docs.apify.com/api/v2) to see what endpoint to call.  \n- Google Sheets API enabled in Google Cloud Console and credentials added to n8n\n- Gmail API enabled in Google Cloud Console credentials added to n8n\n\n## Possible customizations\n- Add full job descriptions to the Google Sheet and email  \n- Continue the flow to create a tailored CV for each job  \n- Use AI to read the job descriptions and pull out the key skills the job posting is asking for  \n",
  "featuredImage": "/data/workflows/9240/9240.webp",
  "author": {
    "id": 101,
    "slug": "robingeuens",
    "name": "Robin Geuens",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1001,
  "downloads": 100,
  "createdAt": "2025-10-03T12:37:14.606Z",
  "updatedAt": "2026-01-16T08:59:37.071Z",
  "publishedAt": "2025-10-03T12:37:14.606Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9240"
}