{
  "id": 6534,
  "slug": "6534",
  "title": "AI proposal generator",
  "description": "\n## Overview\nStop spending hours formatting proposals. This workflow turns a short post-call form into a high-converting, fully-personalized PandaDoc proposal—plus updates your CRM and drafts the follow-up email for you.\n\nAfter a sales call, just fill out a 3-minute form summarizing key pain points, solutions pitched, and the price. The workflow uses AI to generate polished proposal copy, then builds a PandaDoc draft using dynamic data mapped into the JSON body (which you can fully customize per business). It also updates the lead record in ClickUp with the proposal link, company name, and quote—then creates an email draft in Gmail, ready to send.\n\n### Who’s it for\n- Freelancers and consultants sending service proposals  \n- Agencies closing deals over sales calls  \n- Sales reps who want to automate proposal follow-up  \n- Teams using ClickUp as their lightweight CRM  \n\n### How it works\n- After a call, fill out a short form with client details, pitch notes, and price  \n- AI generates professional proposal copy based on form input  \n- Proposal is formatted and sent to PandaDoc via HTTP request  \n- ClickUp lead is updated with:\n  - Company Name  \n  - Proposal URL  \n  - Quote/price  \n- A Gmail draft is created using the proposal link and a thank-you message  \n\n### Example use case\n&gt; You hop off a call, fill out:  \n&gt; - Prospect: Shopify agency  \n&gt; - Pain: No lead gen system  \n&gt; - Solution: Automated cold outreach  \n&gt; - Price: $2,500/month  \n&gt;  \n&gt; 3 minutes later: PandaDoc proposal is ready, CRM is updated, and your email draft is waiting to be sent.\n\n### How to set up\n1. Replace the form with your preferred tool (e.g. Tally, Typeform)  \n2. Connect PandaDoc API and structure your proposal template  \n3. Customize the JSON body inside the HTTP request to match your business  \n4. Link your ClickUp space and custom fields  \n5. Connect Gmail (or other email tool) for final follow-up draft  \n\n### Requirements\n- Form tool for capturing sales call notes  \n- OpenAI or LLM key for generating proposal copy  \n- PandaDoc API access  \n- ClickUp custom fields set up for lead tracking  \n- Gmail integration\n\n### How to customize\n- Customize your PandaDoc proposal fields in the JSON body of the HTTP node  \n- Replace ClickUp with another CRM like HubSpot or Notion  \n- Adjust AI tone (casual, premium, corporate) for proposal writing  \n- Add Slack or Telegram alerts when the draft is ready  \n- Add PDF generation or auto-send email step\n",
  "featuredImage": "/data/workflows/6534/6534.webp",
  "author": {
    "id": 101,
    "slug": "abdulmir",
    "name": "Abdul Mir",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2716,
  "downloads": 271,
  "createdAt": "2025-07-27T15:40:45.891Z",
  "updatedAt": "2026-01-16T08:45:31.783Z",
  "publishedAt": "2025-07-27T15:40:45.891Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6534"
}