{
  "id": 12368,
  "slug": "12368",
  "title": "Analyze mobile app build-time hotspots with Gradle, CocoaPods, Airtable, GitHub, Gmail and GPT-4.1-mini",
  "description": "# Mobile App Build Time Hotspot Tracker - Gradle/CocoaPods Analyzer Alerting\n\nThis workflow automates the monitoring and analysis of CI/CD build performance for mobile projects using Gradle and CocoaPods. It triggers upon build completion, compares metrics against historical performance stored in Airtable, and leverages AI to identify regressions. The system provides automated feedback via GitHub PR comments and email alerts for critical performance drops.\n\n### ⚡ Quick Implementation Steps\n\n1. Configure CI Pipeline: Set your CI job to send a POST request with build metrics to the workflow's Webhook URL.\n2. Set Configuration: Adjust the regressionThreshold (default: 20%) and excludeModules in the Set Configuration node.\n3. Connect Airtable: Link your credentials to the Fetch Historical Builds and Store Build Data nodes.\n4. Connect GitHub & Gmail: Authenticate your GitHub and Gmail OAuth2 credentials for reporting.\n5. Verify AI Model: Ensure the OpenAI Chat Model is connected to power the performance analysis.\n\n## What It Does\n\nThe workflow acts as an intelligent performance gatekeeper for development pipelines:\n\n1. **Metric Collection:** Captures detailed task durations, build IDs, and PR context directly from CI/CD webhooks.\n2. **Historical Comparison:** Automatically retrieves the last 10 builds for a specific repository to calculate average baselines.\n3. **AI-Powered Diagnostics:** Uses a specialized AI agent to analyze slowdowns, identify root causes, and provide optimization recommendations.\n4. **Automated Reporting:** Categorizes findings by severity (Critical, Warning, Info) and updates stakeholders through PR comments and high-priority emails.\n\n## Who’s It For\n\n- Mobile Engineering Teams looking to prevent \"death by a thousand cuts\" in build time slowdowns.\n- DevOps/Platform Engineers who need automated auditing of build infrastructure health.\n- Release Managers requiring an audit trail of performance regressions across different pull requests.\n\n## Technical Workflow Breakdown\n\n### Entry Points (Triggers)\n\n1. Webhook: Listens for POST requests at /webhook/build-hotspot-tracker containing build metrics and repository metadata.\n\n### Processing & Logic\n\n1. Set Configuration: Defines static variables like regression sensitivity and modules to ignore (e.g., test modules).\n2. Historical Analysis: Aggregate nodes calculate min, max, and average build times from historical records.\n3. AI Build Analyzer: An AI Agent utilizing GPT-4.1-mini to synthesize current build data with historical trends and PR context.\n4. Route by Severity: A switch node that directs the workflow based on whether the AI classifies the regression as Critical, Warning, or Info.\n\n### Output & Integrations\n\n1. GitHub (Comment on PR): Posts a formatted markdown report including a severity badge, regressions list, and root causes.\n2. Airtable (Store Build Data): Logs the build ID, total duration, and AI recommendations for long-term tracking.\n3. Gmail (Notify Email): Sends immediate alerts to the team for critical regressions, including a direct link to the affected PR.\n\n## Customization\n\n### Adjust Sensitivity\n\nModify the regressionThreshold in the Set Configuration node to change how aggressive the system is in flagging slowdowns (e.g., set to 10 for stricter monitoring).\n\n### Module Filtering\n\nUpdate the excludeModules parameter to ignore specific tasks like linting or unit tests that may have volatile durations but do not represent core build performance.\n\n### Analysis Detail\n\nThe AI Build Analyzer prompt can be customized to focus on specific platform needs, such as focusing heavily on CocoaPods link times or Gradle configuration phases.\n\n## Troubleshooting Guide\n\n| Issue                       | Possible Cause                             | Solution                                                                                   |\n| :-------------------------- | :----------------------------------------- | :----------------------------------------------------------------------------------------- |\n| **No PR Comments**          | GitHub permissions or incorrect PR number. | Verify your GitHub token has write access and the CI payload includes a valid prNumber.    |\n| **Historical Data Missing** | Airtable Filter failure.                   | Ensure the repository and prNumber fields in Airtable match the incoming Webhook data.     |\n| **AI Analysis Errors**      | OpenAI credits or model timeout.           | Check your OpenAI API quota and verify the gpt-4.1-mini model is available in your region. |\n| **Emails Not Sending**      | Gmail OAuth2 expired.                      | Re-authenticate the Gmail node in your n8n credentials settings.                           |\n\n\n## Need Help?\n\nIf you need assistance customizing this workflow, adding new features or integrating more systems (like JIRA, Slack or Google Sheets), feel free to reach out. Our [n8n automation experts](https://www.weblineindia.com/hire-n8n-developers/) at WeblineIndia are here to support you in scaling your automation journey.",
  "featuredImage": "/data/workflows/12368/12368.webp",
  "author": {
    "id": 101,
    "slug": "weblineindia",
    "name": "WeblineIndia",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2026-01-01T07:48:35.448Z",
  "updatedAt": "2026-01-16T09:12:17.319Z",
  "publishedAt": "2026-01-01T07:48:35.448Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12368"
}