{
  "id": 4088,
  "slug": "4088",
  "title": "Extract and merge Twitter (X) threads using TwitterAPI.io",
  "description": "## Twitter (X) Thread Fetcher: Extract and Merge Tweets from Threads\n### What it does\n\n- **Thread Detection:** Automatically detects whether the provided Twitter link is a single tweet or a thread.\n- **Tweet Extraction:** Fetches and returns the content of a single tweet, or gathers all tweets in a thread by retrieving the first tweet and all connected replies.\n- **Thread Merging:** Merges all tweets in the correct order to reconstruct the complete thread, filtering out any empty results.\n- **Seamless Integration:** Easily trigger this workflow from other n8n workflows to automate Twitter thread extraction from various sources.\n\n### How it works\n- Accepts a Twitter link as input-either a single tweet or a thread.\n- If the link is for a single tweet, fetches and returns the tweet content.\n- If the link is for a thread, fetches the first tweet, then iteratively retrieves all connected replies that form the thread, ensuring only relevant tweets are included.\n- Merges the first tweet and all subsequent thread tweets in order, filters out any empty results, and returns the complete thread.\n- Uses [twitterapi.io](https://twitterapi.io) for all Twitter API requests.\n\n### Set up steps\n- Setup typically takes just a few minutes. You’ll need to configure your Twitter API credentials for [twitterapi.io](https://twitterapi.io).\n- You can trigger this workflow manually for testing or call it from another workflow to automate thread fetching from sources like Notion, spreadsheets, or other platforms.\n- For best results, create a separate workflow to gather Twitter links from your preferred source, then trigger this workflow to fetch and return the full thread.\n\n&gt; *Detailed configuration instructions and node explanations are included as sticky notes within the workflow canvas.*\n\n### Benefits\n\n- **Light speed:** Fetches a 15-tweet thread in just **3 seconds** for rapid results.\n- **Cost effective:** Processes a **15-tweet thread** for only **$0.0027**, making it highly affordable. *(Cost may vary depending on the density of replies in the thread.)*",
  "featuredImage": "/data/workflows/4088/4088.webp",
  "author": {
    "id": 101,
    "slug": "ecingoz",
    "name": "enes cingoz",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2732,
  "downloads": 273,
  "createdAt": "2025-05-15T22:37:55.997Z",
  "updatedAt": "2026-01-16T08:32:59.086Z",
  "publishedAt": "2025-05-15T22:37:55.997Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4088"
}