{
  "id": 9505,
  "slug": "9505",
  "title": "Make UGC ads from app screen recordings with Gemini, Sora 2, and VideoBGRemover",
  "description": "## Who's it for\n\nThis workflow is perfect for app developers, SaaS founders, and mobile growth teams who need constant UGC-style video ads without hiring creators or agencies. If you're spending $500+ per creator and waiting weeks for videos, this automates the entire process for $2-5 per video in 8 minutes.\n\n## How it works\n\nUpload an app screen recording, and this n8n workflow handles everything: Gemini AI analyzes the recording and generates a UGC ad structure (hook, problem, solution, CTA with word limits). It describes the ideal actor, emotional journey, and visual style. Sora 2 then generates a hyper-realistic AI actor delivering the script naturally. VideoBGRemover removes the actor's background and composites them picture-in-picture over your screen recording with audio mixing. The result is a scroll-stopping UGC ad ready for TikTok, Instagram, and Facebook.\n\n## Set up steps\n\nSetup takes ~10 minutes and requires 3 API keys:\n\n1. Get your **Gemini API key** from Google AI Studio\n2. Get your **FAL AI key** for Sora 2 access\n3. Get your **VideoBGRemover API key** at https://videobgremover.com/n8n\n4. Add all three keys to n8n environment variables\n5. Connect Google Drive for output storage\n6. Test with the included sample screen recording\n\nThe workflow includes 7 detailed sticky notes explaining each section (Gemini analysis, Sora generation, VideoBGRemover composition, output handling).\n\n## Requirements\n\n- Google Gemini API key (for video analysis)\n- FAL AI API key (for Sora 2 access)\n- VideoBGRemover API key\n- Google Drive account (for final video storage)\n- App screen recordings in vertical format (9:16 recommended, 4-12 seconds)\n\n## How to customize\n\nModify the Gemini prompt to adjust ad tone, script word limits, or actor descriptions. Change composition settings in the VideoBGRemover node (position, size, audio mix). Add your own post-processing nodes for branding, captions, or multi-platform exports.",
  "featuredImage": "/data/workflows/9505/9505.webp",
  "author": {
    "id": 101,
    "slug": "paul",
    "name": "Paul Roussel",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1019,
  "downloads": 101,
  "createdAt": "2025-10-12T06:53:25.115Z",
  "updatedAt": "2026-01-16T09:00:46.661Z",
  "publishedAt": "2025-10-12T06:53:25.115Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9505"
}