{
  "id": 3199,
  "slug": "3199",
  "title": "Google Drive to Pinecone vector storage workflow",
  "description": "# Document Chat Bot with Automated RAG System\n\nThis workflow creates a conversational assistant that can answer questions based on your Google Drive documents. It automatically processes various file types and uses Retrieval-Augmented Generation (RAG) to provide accurate answers based on your document content.\n\n## How It Works\n\n1. **Monitors Google Drive for New Documents**: Automatically detects when files are created or updated in designated folders\n2. **Processes Multiple File Types**: Handles PDFs, Excel spreadsheets, and Google Docs\n3. **Builds a Knowledge Base**: Converts documents into searchable vector embeddings stored in Supabase\n4. **Provides Chat Interface**: Users can ask questions about their documents through a web interface\n5. **Retrieves Relevant Information**: Uses advanced RAG techniques to find and present the most relevant information\n\n## Setup Steps (Estimated time: 25-30 minutes)\n\n1. **API Credentials**: Connect your OpenAI API key for text processing and embeddings\n2. **Google Drive Integration**: Set up Google Drive triggers to monitor specific folders\n3. **Supabase Configuration**: Configure Supabase vector database for document storage\n4. **Chat Interface Setup**: Deploy the web-based chat interface using the provided webhook\n\nThe workflow automatically chunks documents into manageable segments, generates embeddings, and stores them in a vector database for efficient retrieval. When users ask questions, the system finds the most relevant document sections and uses them to generate accurate, contextual responses.",
  "featuredImage": "/data/workflows/3199/3199.webp",
  "author": {
    "id": 101,
    "slug": "asadtech",
    "name": "Muhammad Asadullah",
    "avatar": ""
  },
  "categories": [
    "AI",
    "Personal Productivity"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 281,
  "downloads": 28,
  "createdAt": "2025-03-17T12:26:52.124Z",
  "updatedAt": "2026-01-16T08:28:40.666Z",
  "publishedAt": "2025-03-17T12:26:52.124Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3199"
}