{
  "id": 8002,
  "slug": "8002",
  "title": "Create e-commerce promotional carousels with Gemini 2.5 & social publishing",
  "description": "![Captura de pantalla 20250828 a las 20.56.55.png](fileId:2279)\n\nThis automation workflow is designed for e-commerce businesses, digital marketers, and entrepreneurs who need to create high-quality promotional content for their products quickly and efficiently. From a single product image and description, the system automatically generates 4 promotional carousel-style images, perfect for social media, advertising campaigns, or web catalogs.\n\n***Note: This workflow uses Gemini 2.5 Flash API for image generation, imgbb for image storage, and upload-post.com for automatic Instagram, Tiktok, Facebook and Youtube publishing***\n\n## Who Is This For?\n- **E-commerce Owners:** Transform basic product photos into professional promotional content featuring real people using products in authentic situations.\n- **Digital Marketers & Agencies:** Generate multiple advertising content variations for Facebook Ads, Instagram Stories, and digital marketing campaigns.\n- **Small Businesses & Entrepreneurs:** Create professional promotional material without expensive photo shoots or graphic designers.\n- **Social Media Managers:** Produce engaging and authentic content that drives engagement and conversions across all social platforms.\n\n## What Problem Does This Workflow Solve?\nCreating quality promotional content requires time, resources, and design skills. This workflow addresses these challenges by:\n- **Automatic Carousel Generation:** Converts a single product photo into 4 promotional images featuring people using the product naturally.\n- **Authentic & Engaging Content:** Generates images showing real product usage, increasing credibility and conversions.\n- **Integrated Promotional Text:** Automatically includes visible offers, benefits, and call-to-actions in the images.\n- **Social Media Optimization:** Produces vertical 9:16 format images, perfect for Instagram, TikTok, and Facebook Stories.\n- **Automatic Publishing:** Optionally publishes the complete carousel directly to Instagram with AI-generated optimized descriptions.\n\n## How It Works\n1. **Product Upload:** Upload a product image and provide detailed description through the web form.\n2. **Smart Analysis:** The AI agent analyzes the product and creates a storyboard of 4 different promotional images.\n3. **Image Generation:** Gemini 2.5 Flash generates 4 variations showing people using the product in authentic contexts.\n4. **Automatic Processing:** Images are automatically processed, optimized, and stored in imgbb.\n5. **Promotional Description:** GPT-4 generates an attractive, social media-optimized description based on the created images.\n6. **Optional Publishing:** The system can automatically publish the complete carousel to Instagram.\n\n## Setup\n1. **fal.ai Credentials:** Sign up at [fal.ai](https://fal.ai) and add your API token to the Gemini 2.5 Flash nodes.\n2. **imgbb API:** \n   - Create an account at [imgbb.com](https://imgbb.com)\n   - Get your API key and configure it in the \"Set APIs Vars\" node\n3. **Upload-Post (Optional):** For automatic Instagram publishing:\n   - Register your account at [upload-post.com](https://upload-post.com)\n   - Connect your Instagram business account\n   - Configure credentials in the \"Upload Post\" node\n4. **OpenAI API:** Configure your OpenAI API key for promotional description generation.\n\n## Requirements\n- **Accounts:** n8n, fal.ai, imgbb.com, OpenAI, upload-post.com (optional), Instagram business (optional).\n- **API Keys:** fal.ai token, imgbb API key, OpenAI API key, upload-post.com credentials.\n- **Image Format:** Any standard image format (JPG, PNG, WebP) of the product to promote.\n\n## Features\n- **Advanced Generative AI:** Uses Gemini 2.5 Flash to create realistic images of people using products\n- **Smart Storyboard:** Automatically creates 4 different concepts to maximize engagement\n- **Integrated Promotional Text:** Includes offers, benefits, and CTAs directly in the images\n- **Optimized Format:** Generates vertical 9:16 images perfect for social media\n- **Parallel Processing:** Generates all 4 images simultaneously for maximum efficiency\n- **Automatic Publishing:** Option to publish directly to Instagram with optimized descriptions\n\nUse this template to transform basic product photos into complete promotional campaigns, saving time and resources while generating high-quality content that converts visitors into customers.",
  "featuredImage": "/data/workflows/8002/8002.webp",
  "author": {
    "id": 101,
    "slug": "carlosgracia",
    "name": "Juan Carlos Cavero Gracia",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1082,
  "downloads": 108,
  "createdAt": "2025-08-28T19:00:30.450Z",
  "updatedAt": "2026-01-16T08:53:29.388Z",
  "publishedAt": "2025-08-28T19:00:30.450Z",
  "nodes": 33,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8002"
}