{
  "id": 9251,
  "slug": "9251",
  "title": "Turn TikTok comments into AI avatar videos with Dumpling AI, GPT-4 & Captions.ai",
  "description": "## Who’s it for\n\nThis template is perfect for TikTok creators, content marketers, and social media teams who want to turn viral comments into engaging short-form videos without manually scripting, recording, or editing. If you want to keep up with trends and consistently publish high-quality avatar videos, this workflow automates the entire process from comment selection to enhanced final video.\n\n---\n\n## What it does\n\nThe workflow takes TikTok video URLs and their top comments from a Data Table, extracts the transcript using **Dumpling AI**, and uses **GPT-4** to write a natural and engaging TikTok script inspired by the comment. It then generates a full AI avatar video through **Captions.ai**, enhances it with subtitles and B-roll using **Submagic**, and finally saves all video details into **Airtable** for tracking.\n\nHere’s what happens step by step:  \n1. Pulls TikTok videos and their top comments from a Data Table  \n2. Sends video URLs to **Dumpling AI** to retrieve transcripts  \n3. Feeds both transcript and comment into **GPT-4** to generate a conversational TikTok script  \n4. Cleans and formats the script using JavaScript  \n5. Sends the script to **Captions.ai** to produce an AI avatar video  \n6. Checks video status and retries if needed  \n7. Enhances the final video with **Submagic** for captions and effects  \n8. Receives the enhanced video via webhook and logs details into **Airtable**\n\n---\n\n## How it works\n\n1. **Schedule Trigger**: Runs automatically at set intervals to start the workflow  \n2. **Data Table**: Retrieves TikTok video URLs and associated comments  \n3. **Dumpling AI**: Extracts transcripts from the video URLs  \n4. **GPT-4**: Generates a compelling TikTok script based on the comment  \n5. **JavaScript Node**: Cleans up script formatting for a smooth avatar generation  \n6. **Captions.ai**: Creates an AI avatar video from the cleaned script  \n7. **Wait & Check**: Monitors video creation status and retries if necessary  \n8. **Submagic**: Enhances the video with captions, zooms, and B-roll effects  \n9. **Webhook & Airtable**: Receives final video data and saves URL and ID for future use\n\n---\n\n## Requirements\n\n- ✅ **Dumpling AI API key** stored as HTTP header credentials  \n- ✅ **OpenAI GPT-4 credentials**  \n- ✅ **Captions.ai API credentials**  \n- ✅ **Submagic API credentials**  \n- ✅ **Airtable base** with fields for `Video URL` and `Caption Video ID`  \n- ✅ A properly structured Data Table containing TikTok `Keywords` or video URLs\n\n---\n\n## How to customize\n\n- Adjust the GPT-4 system prompt to shape the tone, style, or format of the TikTok script  \n- Change the avatar or creator settings in Captions.ai to match your brand personality  \n- Modify Submagic settings to control subtitle styling or B-roll effects  \n- Integrate approval steps before final video generation if needed  \n- Extend the workflow to auto-publish videos to TikTok or store them in cloud drives\n\n---\n\n&gt; This workflow lets you transform TikTok comments into engaging AI avatar videos with captions and edits, completely on autopilot. It’s a powerful way to scale content output and stay ahead of trends without manual scripting or filming.\n",
  "featuredImage": "/data/workflows/9251/9251.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 292,
  "downloads": 29,
  "createdAt": "2025-10-03T19:14:25.825Z",
  "updatedAt": "2026-01-16T08:59:40.147Z",
  "publishedAt": "2025-10-03T19:14:25.825Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9251"
}