{
  "id": 10651,
  "slug": "10651",
  "title": "Create RAG vector database from Google Drive documents using Gemini & Supabase",
  "description": "## How it works\n\nThis workflow automates the process of converting Google Drive documents into searchable vector embeddings for AI-powered applications:\n\n• Takes a Google Drive folder URL as input\n• Initializes a Supabase vector database with pgvector extension\n• Fetches all files from the specified Drive folder\n• Downloads and converts each file to plain text\n• Generates 768-dimensional embeddings using Google Gemini\n• Stores documents with embeddings in Supabase for semantic search\n\n**Built for the Study Agent workflow** to power document-based Q&A, but also works perfectly for any RAG system, AI chatbot, knowledge base, or semantic search application that needs to query document collections.\n\n## Set up steps\n\n**Prerequisites:**\n• Google Drive OAuth2 credentials\n• Supabase account with Postgres connection details\n• Google Gemini API key (free tier available)\n\n**Setup time:** ~10 minutes\n\n**Steps:**\n1. Add your Google Drive OAuth2 credentials to the Google Drive nodes\n2. Configure Supabase Postgres credentials in the SQL node\n3. Add Supabase API credentials to the Vector Store node\n4. Add Google Gemini API key to the Embeddings node\n5. Update the input with your Drive folder URL\n6. Execute the workflow\n\n**Note:** The SQL query will drop any existing \"documents\" table, so backup data if needed. Detailed node-by-node instructions are in the sticky notes within the workflow.\n\n**Works with:** Study Agent (main use case), custom AI agents, chatbots, documentation search, customer support bots, or any RAG application.\n",
  "featuredImage": "/data/workflows/10651/10651.webp",
  "author": {
    "id": 101,
    "slug": "mantakamahir",
    "name": "Mantaka Mahir",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 451,
  "downloads": 45,
  "createdAt": "2025-11-09T10:12:23.542Z",
  "updatedAt": "2026-01-16T09:05:49.411Z",
  "publishedAt": "2025-11-09T10:12:23.542Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10651"
}