{
  "id": 3050,
  "slug": "3050",
  "title": "Build your first AI data analyst chatbot",
  "description": "Enhance your data analysis by connecting an AI Agent to your dataset, using n8n tools.\n\nThis template teaches you how to build an AI Data Analyst Chatbot that is capable of pulling data from your sources, using tools like Google Sheets or databases. It's designed to be easy and efficient, making it a good starting point for AI-driven data analysis.\n\nYou can easily replace the current Google Sheets tools for databases like Postgres or MySQL.\n\n![image_template_data.png](fileId:969)\n\n### How It Works\nThe core of the workflow is the AI Agent. It's connected to different data retrieval tools, to get data from Google Sheets (or your preferred database) in many different ways.\n\nOnce the data is retrieved, the Calculator tool allows the AI to perform mathematical operations, making your data analysis precise.\n\n### Who is this template for\n- **Data Analysts & Researchers:** Pull data from different sources and perform quick calculations.\n- **Developers & AI Enthusiasts:** Learn to build your first AI Agent with easy dataset access.\n- **Business Owners:** Streamline your data analysis with AI insights and automate repetitive tasks.\n- **Automation Experts:** Enhance your automation skills by integrating AI with your existing databases.\n\n### How to Set Up\nYou can find detailed instructions in the workflow itself.\n\n### Check out my other templates\n👉 [**https://n8n.io/creators/solomon/**](https://n8n.io/creators/solomon/)",
  "featuredImage": "/data/workflows/3050/3050.webp",
  "author": {
    "id": 101,
    "slug": "solomon",
    "name": "Solomon",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 161465,
  "downloads": 16146,
  "createdAt": "2025-03-01T12:08:21.886Z",
  "updatedAt": "2026-01-16T08:27:52.372Z",
  "publishedAt": "2025-03-01T12:08:21.886Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3050"
}