{
  "id": 7604,
  "slug": "7604",
  "title": "Automatic FTP file backup to Google Drive with scheduled sync",
  "description": "## What this workflow does\nThis workflow automatically **downloads files from an FTP folder** and **uploads them to Google Drive**.  \nIt’s useful for backup, reporting, or syncing data between systems.\n\n## How it works\n1. **Cron Trigger** runs on a schedule (default: every hour).  \n2. **FTP List node** checks the specified folder on your FTP server.  \n3. **FTP Download node** fetches each file found.  \n4. **Google Drive Upload node** saves the file into your chosen Google Drive folder.\n\n## Pre-conditions / Requirements\n- An active FTP server with accessible login credentials.  \n- A Google account with access to the Drive folder you want to sync into.  \n- Make sure the target Google Drive folder exists, and copy its Folder ID.  \n- Ensure files in your FTP folder have unique names if you want to avoid overwriting in Google Drive.\n\n\n## Setup\n- **FTP:** Add your FTP credentials and replace `{{FTP_FOLDER}}` with the path of the folder you want to sync.  \n- **Google Drive:** Connect your Google Drive account and replace `{{GDRIVE_FOLDER_ID}}` with the folder ID where files should be stored.  \n- Adjust the Cron schedule (e.g. daily, weekly) depending on how often you need the sync.\n\n## Customization Options\n- **File filtering:** Add an *IF node* after the FTP List node to only download files matching certain extensions (e.g., `.csv`, `.pdf`).  \n- **File renaming:** Use a *Set node* to rename files before uploading to Google Drive (helpful for timestamping or avoiding duplicates).  \n- **Archiving:** Add a second Google Drive or FTP Upload node to store processed files in an archive folder.  \n- **Error handling:** Connect an *Error Trigger* to notify you via Slack or email if a file transfer fails.\n\n## Benefits & Use Cases — FTP to Google Drive File Sync\n\n## Benefits\n- **Hands-free backups:** Automatically transfers files from FTP to Google Drive.  \n- **Data security:** Ensures files are stored in cloud storage with built-in redundancy.  \n- **Reliability:** Reduces risk of missed uploads or manual errors.  \n- **Scalable:** Works with any FTP folder and Google Drive directory.\n\n\n## Use Cases\n- Regularly back up reports or exports from legacy systems (ERP, CRM, POS).  \n- Sync daily logs or CSVs into Google Drive for analytics and team access.  \n- Automate delivery of partner or client files without manual uploads.  \n- Centralize files from multiple FTP sources into one Drive folder.\n",
  "featuredImage": "/data/workflows/7604/7604.webp",
  "author": {
    "id": 101,
    "slug": "ziadadel",
    "name": "Ziad Adel",
    "avatar": ""
  },
  "categories": [
    "File Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 166,
  "downloads": 16,
  "createdAt": "2025-08-19T19:00:19.065Z",
  "updatedAt": "2026-01-16T08:51:20.140Z",
  "publishedAt": "2025-08-19T19:00:19.065Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7604"
}