{
  "id": 7153,
  "slug": "7153",
  "title": "Auto-publish NASA APOD to LinkedIn with AI translation and hashtags",
  "description": "# Auto-publish NASA APOD to LinkedIn with AI translation and hashtags\nTransform NASA's daily astronomical wonders into engaging LinkedIn content automatically. This workflow fetches NASA's Astronomy Picture of the Day, translates it to Brazilian Portuguese using AI, generates strategic hashtags, and publishes everything to your LinkedIn profile with the stunning space image attached.\n\n## Who's it for\nContent creators, astronomy enthusiasts, science communicators, and anyone wanting to share high-quality educational content consistently on LinkedIn. Perfect for Portuguese-speaking professionals who want to engage their network with fascinating space discoveries while building their personal brand as a science advocate.\n\n## How it works\nThe workflow runs on a daily schedule and handles the complete content pipeline automatically. It fetches the latest NASA APOD through the official API, including both the image and detailed explanation. The English description gets professionally translated to selected language using Google Gemini 2.5 Flash, while maintaining scientific accuracy and terminology.\n\nSmart hashtag generation combines fixed branding tags with content-specific ones, mixing Portuguese and English for maximum reach. The final post includes the NASA image, translated description, and strategic hashtags, then gets published to your LinkedIn profile automatically.\n\n## How to set up\nYou'll need accounts for Google AI Studio (free), LinkedIn Developer (free), and a Telegram bot for notifications. The setup takes about 15 minutes and uses only free services and APIs.\n\nFirst, create your Google AI Studio account and get an API key for the AI translation services. Then set up a LinkedIn OAuth2 application to enable posting permissions. Create a Telegram bot through BotFather and get your chat ID for notifications.\n\nConfigure the Settings node with your Telegram chat ID and preferred language. The workflow comes with all prompts and configurations ready to use. Test each component individually before activating the daily automation.\n\n## Requirements\n- LinkedIn account with posting permissions\n- Google AI Studio API key (free tier available)\n- Telegram bot token and your chat ID\n- Basic understanding of OAuth2 setup for LinkedIn\n- NASA API key (optional - demo key included)\n\nAll services used have generous free tiers, making this workflow completely free to operate indefinitely.\n\n## How to customize the workflow\nThe centralized Settings node makes customization simple. Change the target language from Brazilian Portuguese to any other language by updating the translate_to_language variable. Modify the posting schedule in the CRON trigger to match your preferred timing.\n\nCustomize the post template in the \"Create Final Post Text\" node to match your personal brand voice. Adjust the hashtag strategy by editing the AI prompt in the \"Generate Hashtags\" node. Add additional social platforms by duplicating the LinkedIn publisher with different credentials.\n\nThe AI prompts can be fine-tuned for different writing styles or specific astronomical topics. You can also extend the workflow to include additional content processing, image enhancements, or cross-posting to multiple platforms while maintaining the core NASA APOD automation.",
  "featuredImage": "/data/workflows/7153/7153.webp",
  "author": {
    "id": 101,
    "slug": "vikthyr",
    "name": "Vitorio Magalhães",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 279,
  "downloads": 27,
  "createdAt": "2025-08-07T23:44:08.181Z",
  "updatedAt": "2026-01-16T08:48:44.774Z",
  "publishedAt": "2025-08-07T23:44:08.181Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7153"
}