{
  "id": 4463,
  "slug": "4463",
  "title": "Automated workflow backups to GitHub with PR creation & Slack notifications",
  "description": "## Who is this for?\n\nThis template is ideal for DevOps engineers, automation specialists, and n8n users who manage multiple workflows and want a reliable version control system for backups. It’s especially useful for teams collaborating via GitHub.\n\n## What problem is this workflow solving?\n\nManually backing up n8n workflows to GitHub can be time-consuming and error-prone. This workflow solves that by automating the backup of new and updated n8n workflows, ensuring your GitHub repository always reflects the latest changes.\n\n## What this workflow does\n- Retrieves all workflows from your local n8n instance.\n- Decodes their content and compares it with existing GitHub files.\n- Detects newly created or updated workflows.\n- Creates a new Git branch and commits changes.\n- Opens a pull request (PR) to the main branch.\n- Sends a Slack notification when the PR is created.\n\nThe system uses GitHub API, n8n, Merge, Set, and Slack nodes for full automation.\n\n## Setup\n1. GitHub credentials: Add your GitHub API credentials in n8n.\n2. Slack integration: Connect your Slack Bot token if you want PR notifications.\n3. Repository details: Update github_owner, repo_name, and workflow directory path in the “Define Local Variables” node.\n4. n8n API key - [Check this doc](https://docs.n8n.io/api/authentication/)\n\n## How to customize this workflow to your needs\n- Change the workflow directory from workflows/ to a custom path.\n- Modify the Slack message or add email notification support.\n- Add filters to back up only specific workflows based on naming or tags.\n- Adjust branch naming conventions or use different GitHub base branches.\n\nThis workflow provides a seamless backup and versioning pipeline, minimizing manual Git interactions and supporting collaborative automation development.",
  "featuredImage": "/data/workflows/4463/4463.webp",
  "author": {
    "id": 101,
    "slug": "duynb",
    "name": "Bao Duy Nguyen",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 623,
  "downloads": 62,
  "createdAt": "2025-05-28T15:59:53.436Z",
  "updatedAt": "2026-01-16T08:34:30.522Z",
  "publishedAt": "2025-05-28T15:59:53.436Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4463"
}