{
  "id": 10220,
  "slug": "10220",
  "title": "Generate event marketing content with GPT-4, Google Sheets & Slack",
  "description": "This n8n workflow automates the generation of personalized marketing content for events, including emails, social media posts, and advertisements. Leveraging AI, it tailors content based on event details and target audience preferences, enhancing promotional efforts and engagement for organizers.\n\n### Key Features\n- Generates customized email, social media, and ad content for event promotion.\n- Personalizes content based on event specifics and audience insights.\n- Streamlines content creation with AI-driven suggestions and formatting.\n- Delivers content ready for distribution across multiple channels.\n- Supports real-time updates and adjustments for campaign optimization.\n\n### Workflow Process\n- The **Webhook for Event Planning** node receives event details and marketing preferences to initiate the workflow.\n- The **Read Event Details** node extracts and organizes event data from Google Sheets for content creation.\n- The **Set Variables** node defines key parameters and audience targeting criteria.\n- The **AI Agent for Event Plan** node uses AI to generate optimized marketing content, including emails, social media posts, and ads.\n- The **Format Plan** node structures the generated content into a polished, actionable format.\n- The **Save to Google Sheets** node stores the generated content for tracking and future use.\n- The **Email Report** node compiles a comprehensive event marketing plan and sends it to organizers via email.\n- The **Send Email Report** node delivers the finalized report to the organizer.\n\n### Setup Instructions\n- Import the workflow into n8n and configure the Webhook for Event Planning with your event management system's API credentials.\n- Set up Google Sheets integration for the Read Event Details and Save to Google Sheets nodes.\n- Configure the AI Agent for Event Plan node with a suitable language model for content generation.\n- Set up email credentials for the Email Report and Send Email Report nodes.\n- Test the workflow by inputting sample event data to verify content generation and delivery.\n- Monitor the output and adjust AI parameters or node settings as needed for optimal results.\n\n### Prerequisites\n- Webhook integration with the event management or input system.\n- Google Sheets account for data storage and retrieval.\n- AI/LLM service for content generation and personalization.\n- Email service for report delivery.\n- Access to event details and audience data for customization.\n\n### Modification Options\n- Modify the **Read Event Details** node to include additional data fields or sources.\n- Adjust the **Set Variables** node to incorporate specific audience segments or branding guidelines.\n- Customize the **AI Agent for Event Plan** node to focus on particular content types (e.g., video scripts, banners).\n- Add social media posting nodes to directly publish content from the **Format Plan** node.\n- Configure the **Email Report** node to include additional metrics or campaign analytics.",
  "featuredImage": "/data/workflows/10220/10220.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 142,
  "downloads": 14,
  "createdAt": "2025-10-27T14:53:35.197Z",
  "updatedAt": "2026-01-16T09:04:00.324Z",
  "publishedAt": "2025-10-27T14:53:35.197Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10220"
}