{
  "id": 7771,
  "slug": "7771",
  "title": "Automated Google Sheet to CSV conversion via Slack messages",
  "description": "Step 1: Slack Trigger\n\nThe workflow starts whenever your Slack bot is mentioned or receives an event in a channel. The message that triggered it (including text and channel info) is passed into the workflow.\n\nStep 2: Extract the Sheet ID\n\nThe workflow looks inside the Slack message for a Google Sheets link. If it finds one, it extracts the unique spreadsheet ID from that link. It also keeps track of the Slack channel where the message came from. If no link is found, the workflow stops quietly.\n\nStep 3: Read Data from Google Sheet\n\nUsing the sheet ID, the workflow connects to Google Sheets and reads the data from the chosen tab (the specific sheet inside the spreadsheet). This gives the workflow all the rows and columns of data from that tab.\n\nStep 4: Convert Data to CSV\n\nThe rows pulled from Google Sheets are then converted into a CSV file. At this point, the workflow has the spreadsheet data neatly packaged as a file.\n\nStep 5: Upload CSV to Slack\n\nFinally, the workflow uploads the CSV file back into Slack. It can either be sent to a fixed channel or directly to the same channel where the request came from. Slack users in that channel will see the CSV as a file upload.\n\n\n============================================\n\nHow it works\n\nThe workflow is triggered when your Slack bot is mentioned or receives a message.\n\nIt scans the message for a Google Sheets link.\n\nIf a valid link is found, the workflow extracts the unique sheet ID.\n\nIt then connects to Google Sheets, reads the data from the specified tab, and converts it into a CSV file.\n\nFinally, the CSV file is uploaded back into Slack so the requesting user (and others in the channel) can download it.\n\nHow to use\n\nIn Slack, mention your bot and include a Google Sheets link in your message.\n\nThe workflow will automatically pick up the link and process it.\n\nWithin a short time, the workflow will upload a CSV file back into the same Slack channel.\n\nYou can then download or share the CSV file directly from Slack.\n\nRequirements\n\nSlack App & Credentials: Your bot must be installed in Slack with permissions to receive mentions and upload files.\n\nGoogle Sheets Access: The Google account connected in n8n must have at least read access to the sheet.\n\nn8n Setup: The workflow must be imported into n8n and connected to your Slack and Google Sheets credentials.\n\nCorrect Sheet Tab: The workflow needs to know which tab of the spreadsheet to read (set by name or by sheet ID).\n\nCustomising this workflow\n\nChannel Targeting: By default, the file can be sent back to the channel where the request came from. You can also set it to always post in a fixed channel.\n\nFile Naming: Change the uploaded file name (e.g., include the sheet title or today’s date).\n\nSheet Selection: Adjust the configuration to read a specific tab or allow the user to specify the tab in their Slack message.\n\nError Handling: Add extra steps to send a Slack message if no valid link is detected, or if the Google Sheet cannot be accessed.\n\nFormatting: Extend the workflow to clean, filter, or enrich the data before converting it into CSV.",
  "featuredImage": "/data/workflows/7771/7771.webp",
  "author": {
    "id": 101,
    "slug": "aloksingh20",
    "name": "Alok Singh",
    "avatar": ""
  },
  "categories": [
    "File Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 219,
  "downloads": 21,
  "createdAt": "2025-08-23T18:23:17.920Z",
  "updatedAt": "2026-01-16T08:52:17.049Z",
  "publishedAt": "2025-08-23T18:23:17.920Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7771"
}