{
  "id": 10665,
  "slug": "10665",
  "title": "University FAQ & calendar assistant with Telegram, MongoDB and Gemini AI",
  "description": "# 🤖 Interactive Academic Chatbot (Telegram + MongoDB)\n\n## Overview 📋\n\nThis project is a template for building a complete academic virtual assistant using n8n. It connects to Telegram, answers frequently asked questions by querying MongoDB, keeps the community informed about key dates (via web scraping), and collects user feedback for continuous improvement.\n\n![image.png](fileId:3268)\n\n## How It Works\n\n## Architecture and Workflow ⚙️\n\nn8n: Orchestration of 3 workflows (chatbot, scraping worker, announcer).\n\nTelegram: Frontend for user interaction and sending announcements.\n\nMongoDB: Centralized database for FAQs, academic calendar, and feedback logs.\n\nWeb Scraping: HTTP Request and HTML Extract nodes to read the university's web calendar.\n\nCron: For automatic periodic executions (daily and weekly).\n\n## Core Processes 🧠\n\nReal-time reception of user queries via Telegram.\n\nQuerying MongoDB collections for FAQ answers and calendar dates.\n\nDaily scraping of the university website to keep the calendar updated.\n\nInstant logging of user feedback (👍/👎) in MongoDB.\n\nProactive sending of weekly announcements to the Telegram channel.\n\n## Key Benefits ✅\n\nComplete automation of student communication 24/7.\n\nAn always-accurate academic calendar database without manual intervention.\n\nA built-in continuous improvement system through user feedback.\n\nProactive communication of important events to the entire community.\n\n## Use Cases 💼\n\nAutomation of student support in universities, colleges, and institutions.\n\nA virtual assistant for any organization needing to manage FAQs and a dynamic calendar.\n\nAn automated announcements channel to keep a community informed.\n\n## Requirements 👨‍💻\n\nn8n instance (self-hosted or cloud).\n\nCredentials for a Telegram Bot (obtained from @BotFather).\n\nCredentials for a MongoDB database (Connection URI).\n\nURL of the academic calendar to be scraped.\n\n## Authors 👥\n- Doménica Amores\n- Nicole Guevara\n- Adrián Villamar\n- Mentor: Jaren Pazmiño\n\nApplicants to the CIAP Polytechnic Artificial Intelligence Club\n\n![Logo_CIAP Tortuga y letras 2.png](fileId:3267)",
  "featuredImage": "/data/workflows/10665/10665.webp",
  "author": {
    "id": 101,
    "slug": "ciap",
    "name": "Club de Inteligencia Artificial Politécnico CIAP",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2622,
  "downloads": 262,
  "createdAt": "2025-11-09T20:36:53.243Z",
  "updatedAt": "2026-01-16T09:05:51.584Z",
  "publishedAt": "2025-11-09T20:36:53.243Z",
  "nodes": 91,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10665"
}