{
  "id": 11284,
  "slug": "11284",
  "title": "Automate lead nurturing with ChatGPT-4o & Gemini for personalized email drafting",
  "description": "## Overview\nThis n8n workflow automates the entire process of capturing leads, enriching their data with company information using an AI Agent, and then generating highly personalized introductory emails (using ChatGPT-4o) saved as drafts in your Gmail account. This prepares your sales team for a high-quality outreach with minimal manual effort.\n\n## Requirements\nTo use this workflow, you need the following accounts and credentials:\n\n#### Google Sheets Account: \nTo store and track lead information (the workflow uses a sheet with ID).\nBelow are the columns of the sheet\nFirst name\nLast name\nEmail ID\t\nCompany Name\t\nCompany Information\t\nDesignation\t\nMessage\t\nLocation\t\nStatus\t\nIntro email Date\t\nReminder 1 needed?\t\nReminder 1 Email Date\n\n#### OpenAI API Key (for ChatGPT-4o): \nFor drafting the personalized introductory emails.\n\n#### Google Gemini API Key: \nFor the AI Agent to perform online company research.\n\n#### Gmail Account: \nTo save the final personalized emails as drafts.\n\n\n## How It Works\nThe workflow is structured into two main phases: Lead Capture & Enrichment, and Personalized Email Drafting.\n\n#### Phase 1: Lead Capture and Enrichment\nThis phase collects user inquiries and uses an AI Agent to search the web for additional company details to enrich the lead profile.\n\nOn form submission (Form Trigger): The workflow starts when a potential lead fills out the embedded lead capture form, which collects details like First Name, Last Name, Company Name, Email ID, Designation, and a Message/inquiry. This is optional as many company may have other ways to capture leads.\n\nAppend row in sheet (Google Sheets): The initial lead data collected from the form is added to your Google Sheet tracker, setting the Status to To Send.\n\nAI Agent: The AI Agent is prompted to search online for the client's company name to gather two pieces of information:\n\nA 1-2 sentence Company Description (what they do).\n\nThe Company Location, categorized as Delhi/NCR, Bangalore, Mumbai, or Other. This should be changed basis your need.\n\nCode: This node processes the structured text output from the AI Agent and separates the Company Description and Company Location into distinct fields.\n\nUpdate row in sheet (Google Sheets): The newly researched Company Information and Location are updated and added to the lead's row in the Google Sheet, matching on Email ID.\n\n#### Phase 2: Personalized Email Drafting and Logging\nThis phase retrieves leads ready for outreach, drafts a personalized email using AI, and saves it for the sales team.\n\nGet row(s) in sheet (Google Sheets): The workflow fetches all leads whose Status is either To send or To Send (using an OR filter).\n\nIntroductory email (OpenAI - ChatGPT-4o): For each lead, the OpenAI node is used as a B2B marketing assistant to write a personalized introductory email based on a predefined template.\n\nThe prompt uses the lead's data (First Name, Company Name, Message, etc.) and instructs the AI to:\n\nCreate a subject line: Following up on your interest in &lt;your company name&gt; for [shorter version of pain point].\n\nPersonalize the body by referencing their pain points and suggesting how &lt;your company&gt; has helped similar companies.\n\nInclude a call-to-action (CTA) for a quick 15-minute chat.\n\nProvide a P.S. line about a relevant success story that your company has delivered.\n\nThe output is structured into EmailSubject, EmailContent, and Emailid variables.\n\nCreate a draft (Gmail): The personalized email is saved as a draft in the specified Gmail account, using the AI-generated Subject and Content.\n\nBest Practice: It is recommended to add an auto-signature in the Gmail account used for the draft.\n\nAppend or update row in sheet (Google Sheets): The lead's row is updated to reflect the outreach effort. The Status is set to Drafted, and the current date is logged in the Intro email Date column.\n\n#### Customization Notes\nInitial Data: You can replace the On form submission trigger with a Google Sheets Trigger or a Webhook to capture leads from other sources (e.g., a CRM or LinkedIn).\n\nAI Prompt: To ensure the best results, update the agent prompt in the Introductory email node to make it more relevant for your company.\n\nSender: Ensure the email ID used for drafting corresponds to the sales team's email.",
  "featuredImage": "/data/workflows/11284/11284.webp",
  "author": {
    "id": 101,
    "slug": "aiagentpriyanka",
    "name": "Priyanka Rana",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 283,
  "downloads": 28,
  "createdAt": "2025-11-27T10:05:54.157Z",
  "updatedAt": "2026-01-16T09:08:15.955Z",
  "publishedAt": "2025-11-27T10:05:54.157Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11284"
}