{
  "id": 9739,
  "slug": "9739",
  "title": "Qualify & route leads across channels with GPT-4o, Slack & CRM integration",
  "description": "\n## This n8n template demonstrates how to use AI to **capture, qualify, and route inbound leads** automatically from email or web forms.\n\nIt extracts key business information using AI, scores the lead based on your ideal customer profile, creates CRM records, notifies your team on Slack, and logs all activity—including failures—to Google Sheets.\n\n**Use cases include:** automating sales inboxes, qualifying form leads for agencies or SaaS products, routing high-fit prospects to the right territory owner, and keeping your sales and ops teams aligned without manual data entry.\n\n---\n\n### Good to know\n\n* The OpenAI model is used for lead data extraction and will incur a small cost per run depending on volume.\n* This workflow supports either **Salesforce** or **HubSpot** as the CRM system—select which one in the configuration node.\n* You’ll need valid credentials for Gmail (or another email service), OpenAI, Slack, Google Sheets, and your chosen CRM before running.\n\n---\n\n### How it works\n\n1. **Triggers:**\n\n   * A Gmail trigger polls for new inbound emails.\n   * A Webhook node receives submissions from any online form.\n     Both sources merge into a single pipeline.\n\n2. **Validation:**\n   Incoming data is checked for required fields (email or text). Invalid entries are routed to the **Dead Letter Queue (DLQ)** for review.\n\n3. **AI Extraction:**\n   The OpenAI node extracts structured fields like company name, size, industry, role, region, problem statement, and budget signals from free-form text.\n\n4. **Parsing & Scoring:**\n   The AI output is parsed, then a code node calculates a **0–100 lead score** based on transparent criteria—industry, size, role, problem clarity, and budget mentions. It also assigns a lead tier (Hot, Warm, Cold, Unqualified).\n\n5. **CRM Routing:**\n   Depending on your configuration, the workflow creates a **Salesforce lead** (default) or can be easily adapted for HubSpot. Territory or CRM owner routing can be extended here.\n\n6. **Slack Notification:**\n   A rich Slack message summarizes the lead score and reasoning and includes a “Create intro email” button for quick action.\n\n7. **Logging:**\n   All successful leads are logged to Google Sheets for reporting. Any failed or invalid leads are logged separately to the DLQ tab for auditing.\n\n---\n\n### How to use\n\n* Configure your credentials for Gmail, OpenAI, Slack, Google Sheets, and your CRM.\n* Open the **Workflow Configuration** node and fill in your target industries, buyer roles, company size, Slack channel ID, Google Sheets URL, and CRM choice.\n* Create corresponding tabs in your Google Sheet for **Leads** and **DLQ**.\n* Test by sending a sample email or form submission, then watch the workflow extract, score, route, and notify automatically.\n\n---\n\n### Requirements\n\n* OpenAI account for text extraction\n* Gmail (or other email provider) for the email trigger\n* Slack for lead notifications\n* Google Sheets for logging leads and DLQ entries\n* Salesforce or HubSpot account for CRM integration\n\n---\n\n### Customizing this workflow\n\nThis template can be expanded in many ways:\n\n* Add **HubSpot** routing on the first Switch output.\n* Integrate a **Slack button handler** to auto-generate intro emails.\n* Add **retry and backoff logic** for resilience.\n* Modify the scoring rubric in the code node to match your unique ICP.\n* Connect additional sources, such as LinkedIn forms or landing page builders, for omnichannel lead capture.\n\n---\n\n",
  "featuredImage": "/data/workflows/9739/9739.webp",
  "author": {
    "id": 101,
    "slug": "robertsantini",
    "name": "NodeAlchemy",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 197,
  "downloads": 19,
  "createdAt": "2025-10-16T01:02:52.141Z",
  "updatedAt": "2026-01-16T09:01:42.358Z",
  "publishedAt": "2025-10-16T01:02:52.141Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9739"
}