{
  "id": 12377,
  "slug": "12377",
  "title": "Reconcile bank transactions and generate reports with GPT-4 and Gmail",
  "description": "## How It Works\nThis workflow automates end-to-end financial transaction processing for finance teams managing high-volume bank data. It eliminates manual reconciliation by intelligently classifying transactions, detecting anomalies, and generating executive summaries. The system pulls transaction data from Fable Bank, routes it through multiple AI models (OpenAI GPT-4, NVIDIA NIM) for classification and analysis, reconciles accounts, and distributes formatted reports via email. Finance managers and accounting teams benefit from reduced processing time, improved accuracy, and real-time anomaly detection. The workflow handles transaction categorization, reconciliation schema generation, account matching, journal entry creation, and comprehensive reporting—transforming hours of manual work into minutes of automated processing with AI-enhanced accuracy.\n\n## Setup Steps\n1. Configure Fable Bank API credentials for transaction data access \n2. Add OpenAI API key for GPT-4 classification and reconciliation models \n3. Set up NVIDIA NIM credentials for anomaly detection services \n4. Connect Google Sheets for reconciliation schema storage \n5. Configure Gmail account for automated report distribution  \n\n## Prerequisites\nOpenAI API account with GPT-4 access\n\n## Use Cases\nMonthly financial close automation, daily transaction monitoring for fraud detection\n\n## Customization\nReplace Fable Bank with your banking API\n\n## Benefits\nReduces reconciliation time by 90%, eliminates manual data entry errors\n\n\n \n\n",
  "featuredImage": "/data/workflows/12377/12377.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 42,
  "downloads": 4,
  "createdAt": "2026-01-01T15:28:58.671Z",
  "updatedAt": "2026-01-16T09:12:19.894Z",
  "publishedAt": "2026-01-01T15:28:58.671Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12377"
}