{
  "id": 6485,
  "slug": "6485",
  "title": "Generate & rank animal advocacy content with Claude AI, Open Paws & Hugging Face",
  "description": "# Multi-Version Content Generator with AI Scoring & Advocacy Preference Ranking ✍️\n\n## Who’s it for 🐾  \nThis workflow is ideal for animal advocates, campaign managers, and content creators who want to generate multiple versions of written content—such as blog posts, emails, or social media captions—and identify the most effective and persuasive options using advanced AI scoring models.\n\n## How it works / What it does ⚙️  \nThe flow takes user input specifying content type, tone, style, and topic. It calls a powerful research and content generation subworkflow to produce five fully written content variations. These are split and passed to a scoring subworkflow that uses Open Paws AI models trained on real-world social media and email marketing data, combined with evaluations from animal advocacy experts. Finally, it aggregates the content with their performance and prediction scores, outputting a ranked list of content options.\n\n## How to set up 🛠️  \nAdd the following subworkflows to your n8n instance before running this flow:  \n- [Multi-Tool Research Agent for Animal Advocacy](https://n8n.io/workflows/5588-multi-tool-research-agent-for-animal-advocacy-with-openrouter-serper-and-open-paws-db/)  \n- [Evaluate Animal Advocacy Text with Hugging Face & Open Paws AI Models](https://n8n.io/workflows/5587-evaluate-animal-advocacy-text-with-hugging-face-open-paws-ai-models/)  \n\n## Requirements 📋  \n- n8n instance  \n- API key for OpenRouter\n- The linked research and scoring subworkflows installed and accessible\n\n## How to customize the workflow 🎨  \nModify the user input fields to change content type, tone, style, and topic. You can extend the scoring node or integrate this flow as a subworkflow within larger automation pipelines—for example, to schedule posting or feed an AI agent for content selection.\n",
  "featuredImage": "/data/workflows/6485/6485.webp",
  "author": {
    "id": 101,
    "slug": "openpaws",
    "name": "Open Paws",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 252,
  "downloads": 25,
  "createdAt": "2025-07-26T11:12:35.236Z",
  "updatedAt": "2026-01-16T08:45:14.868Z",
  "publishedAt": "2025-07-26T11:12:35.236Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6485"
}