{
  "id": 8253,
  "slug": "8253",
  "title": "WordPress SEO publisher with Anthropic AI, Google Docs & media auto",
  "description": "## 📄 What this workflow does\n This workflow turns a spreadsheet row into a fully formatted, media-rich WordPress article. It pulls the outline and brand context from Google Sheets/Docs, drafts the article with Anthropic or Gemini, enriches it with internal links, converts it to WordPress-ready HTML, uploads images to the WordPress Media Library, and updates your Google Sheet with links and statuses. Optionally, it can create WooCommerce products (kept disabled by default).\n\n## 👤 Who is this for\n- Content & SEO teams who publish long-form articles at scale.\n- E-commerce teams creating product blogs/landing pages with galleries.\n- Agencies and freelancers who want a repeatable, trackable content pipeline.\n- Founders/marketers who want “brief → draft → images → publish” in one click.\n\n\n## ✅ Requirements\n- Google Sheets (content tracker with columns like Title, Query, Outline Link, Image Links, Status).\n- Google Docs (for outline sources and saving final content).\n- Anthropic &/or Gemini API access (drafting + transformations).\n- WordPress site with REST API enabled (Basic/App Password auth) to upload media (and optionally create posts/products).\n- SerpAPI key (for Google Images cover search) — optional; can be removed.\n- (Optional) Perplexity API if you want the “read official docs once” tool for specs.\n\n\n## ⚙️ How to set up\n- Connect Google Sheets and select your tracking sheet/tab.\n- Connect Google Docs (for reading the outline and saving the final article).\n- Add Anthropic and/or Gemini credentials in n8n.\n- Add WordPress credentials (REST API) in the HTTP Request nodes used for media upload (and product/post creation if enabled).\n- (Optional) Add SerpAPI key for the image-cover search node.\n- (Optional) Add Perplexity key in the Sonar node if you’ll parse official docs/specs.\n- Publish/enable the Webhook (or your trigger), then test with a sample row (Status Writing = “Run”).\n\n\n## 🔁 How it works\n1. Trigger → Get Info (Sheets): Picks the next row marked to run and sets “Processing.”\n2. Fetch Outline (Docs): Opens the outline link from the sheet.\n3. Content Outline Generator & On-page (Anthropic/Gemini): Writes the article using brand context, E-E-A-T rules, and (optionally) reads official docs once via Perplexity Sonar.\n4. Previous Posts → Aggregate → Add Internal Links (Gemini): Loads summaries/keywords of prior posts and injects at least 5 high-relevance internal links into the draft.\n5. HTML Version: Converts the draft to strict WordPress-ready HTML (H1–H4, justified paragraphs, links, lists, blockquotes).\n6. Post image to WordPress (sub-flow)\n- Image Covers (SerpAPI): Finds a cover image by query.\n- Google Sheets + Code: Parses Image Links and Product Image columns; converts Google Drive shares into direct downloads.\n- Split & HTTP Requests: Downloads each image and uploads to WordPress Media Library.\n- Aggregate + Code: Builds an HTML gallery snippet from uploaded URLs.\n7. Update Google Doc: Inserts the final article content into a Google Doc and stores the link.\n8. Merge → Update Status to Sheet: Writes back Content Final, Outline Link, statuses (Draft/Complete), and any media links.\n9. (Optional) Create WooCommerce Product: Disabled by default—enable if you want automatic product creation using the article HTML and gallery.\n\n## 💡 About Margin AI\n[Margin AI](https://marginai.co/) is an AI-services agency that acts as your AI Service Companion. We design intelligent, human-centric automation solutions—turning your team’s best practices into scalable workflows and tools. Industries like marketing, sales, and operations benefit from our tailored AI consulting, automation tools, and chatbot development.\n\n",
  "featuredImage": "/data/workflows/8253/8253.webp",
  "author": {
    "id": 101,
    "slug": "cong-nguyen",
    "name": "Cong Nguyen",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 52,
  "downloads": 5,
  "createdAt": "2025-09-04T13:12:43.809Z",
  "updatedAt": "2026-01-16T08:54:57.059Z",
  "publishedAt": "2025-09-04T13:12:43.809Z",
  "nodes": 41,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8253"
}