{
  "id": 11289,
  "slug": "11289",
  "title": "Monitor NASA asteroid threats with AI fact-check and multi-channel alerts",
  "description": "## Who Is This For?\n\nThis workflow is designed for space enthusiasts, science educators, journalists, fact-checkers, and researchers who want to stay informed about near-Earth asteroid threats while filtering out media sensationalism. It's also valuable for anyone studying how different regions cover space-related news.\n\n## What It Does\n\nThis workflow creates an automated planetary defense monitoring system that:\n\n- Scans NASA's Near Earth Object database for potentially hazardous asteroids over a 7-day window\n- Searches news coverage across three regions (US, Japan, EU) to compare media reporting\n- Uses AI (GPT-4o-mini) to fact-check news claims against official NASA data\n- Detects misinformation and measures media sensationalism levels\n- Generates visual charts comparing actual threat levels vs media panic\n- Sends alerts through multiple channels (Slack, Discord, Email)\n- Logs all alerts to Google Sheets for historical analysis\n\n## How It Works\n\n1. **Trigger**: Runs daily at 9 AM or on-demand via webhook\n2. **NASA Data Fetch**: Retrieves 7-day asteroid forecast from NASA NeoWs API\n3. **Threat Analysis**: Identifies potentially hazardous asteroids and assigns alert levels (LOW/MEDIUM/HIGH)\n4. **News Search**: Searches news in US, Japan, and EU using Apify's Google Search Scraper\n5. **AI Fact-Check**: GPT-4o-mini compares news claims against NASA data, detecting misinformation\n6. **Visualization**: Generates gauge charts for threat level and media panic, plus regional comparison bar chart\n7. **Multi-Channel Alerts**: Sends formatted reports to Slack, Discord, Email, and logs to Google Sheets\n\n## Set Up Steps\n\nEstimated time: 15-20 minutes\n\n1. **NASA API** (Required): Get your free API key at [api.nasa.gov](https://api.nasa.gov/)\n2. **Apify** (Required): Create account and connect via OAuth\n3. **OpenAI** (Required): Add your API key from [platform.openai.com](https://platform.openai.com/)\n4. **Notification Channels** (Choose at least one):\n   - Slack: Create OAuth app and connect\n   - Discord: Create webhook URL\n   - Email: Configure SMTP settings\n5. **Google Sheets** (Optional): Create a sheet for logging with columns: Date, Alert Level, Hazardous Count, Threat Score, Media Panic Score, Misinformation Detected, Top Asteroid, Most Accurate Region\n\n## Requirements\n\n- NASA API key (free)\n- Apify account (free tier available)\n- OpenAI API key (paid)\n- At least one notification channel configured\n- n8n version 1.0+\n\n## How to Customize\n\n- **Change scan frequency**: Modify the Schedule Trigger node\n- **Add more regions**: Edit the \"Configure Regional Search\" code node\n- **Adjust alert thresholds**: Modify lunar distance threshold (currently 10) in \"Analyze Asteroid Threats\"\n- **Disable channels**: Simply remove connections to notification nodes you don't need\n- **Customize messages**: Edit the \"Format Multi-Channel Messages\" node",
  "featuredImage": "/data/workflows/11289/11289.webp",
  "author": {
    "id": 101,
    "slug": "asuka-ai",
    "name": "Asuka",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 70,
  "downloads": 7,
  "createdAt": "2025-11-27T12:14:17.883Z",
  "updatedAt": "2026-01-16T09:08:20.209Z",
  "publishedAt": "2025-11-27T12:14:17.883Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11289"
}