{
  "id": 4980,
  "slug": "4980",
  "title": "Reddit Sentiment Analysis for Apple WWDC25 with Gemini AI and Google Sheets",
  "description": "This workflow automates sentiment analysis of Reddit posts related to Apple's WWDC25 event. It extracts data, categorizes posts, analyzes sentiment of comments, and updates a Google Sheet with the results. \n\n\n### Preliquisites\n1. Bright Data Account: You need a Bright Data account to scrape Reddit data. Ensure you have the correct permissions to use their API. https://brightdata.com/\n2. Google Sheets API Credentials: Enable the Google Sheets API in your Google Cloud project and create credentials (OAuth 2.0 Client IDs).\n3. Google Gemini API Credentials: You need a Gemini API key to run the sentiment analysis. Ensure you have the correct permissions to use their API. https://ai.google.dev/\". You can use any other models of choice\n\n### Setup\n\n\n1. **Import the Workflow:** Import the provided JSON workflow into your n8n instance.\",\n2. **Configure Bright Data Credentials:**,\nIn the 'scrap reddit' and the 'get status' nodes, in Header Parameters find the Authorization field, replace `Bearer 1234` with your Bright Data API key. Apply this to every node that utilizes your Bright Data API Key.,\n3. **Set up the Google Sheets API credentials**,\n       - In the 'Append Sentiments' node, set up the Google Sheets API by connecting your Google Sheets account through oAuth 2 credentials. \",\n4. **Configure the Google Gemini Credential ID**,\n     - In the ' Sentiment Analysis per comment' node, set up the Google Gemini API by connecting your Google AI account through the API credentials. ,\n5. **Configure Additional Parameters:**,\n    - In the 'scrap reddit' node, modify the JSON body to adjust the search term, date, or sort method.,\n   - In the 'Wait' node, alter the 'Amount' to adjust the polling interval for scraping status, it is set to 15 seconds by default.,\n   - In the 'Text Classifier' node, customize the categories and descriptions to suit the sentiment analysis needs. Review categories such as 'WWDC events' to ensure relevancy.,\n   - In the 'Sentiment Analysis per comment' node, modify the system prompt template to improve context.\n   \n### customization_options\n\n1. Bright Data API parameters to adjust scraping behavior.\n2. Wait node duration to optimize polling.\n3. Text Classifier categories and descriptions.\n4. Sentiment Analysis system prompt. \n\n\n### Use Case Examples\n\n- **Brand Monitoring:** Track public sentiment towards Apple during and after the WWDC25 event.\n- **Product Feedback Analysis:** Gather insights into user reactions to new product announcements.\n- **Competitive Analysis:** Compare sentiment towards Apple's announcements versus competitors.\n- **Event Impact Assessment:** Measure the overall impact of the WWDC25 event on various aspects of Apple's business.\n       \n### Target_audiences: \n- Marketing professionals in the tech industry,\n- Brand managers,\n- Product managers,\n- Market research analysts,\n- Social media managers\n\n### Troubleshooting: \n1. Workflow fails to start.\nCheck that all necessary credentials (Bright Data and Google Sheets API) are correctly configured and that the Bright Data API key is valid.\n2. Data scraping fails.\nVerify the Bright Data API key, ensure the dataset ID is correct, and inspect the Bright Data dashboard for any issues with the scraping job.\n3. Sentiment analysis is inaccurate.\nRefine the categories and descriptions in the 'Text Classifier' node. Check that you have the correct Google Gemini API key, as the original is a placeholder.\n4. Google Sheets are not updating.\nEnsure the Google Sheets API credentials have the necessary permissions to write to the specified spreadsheet and sheet. Check API usage limits.\n5. Workflow does not produce the correct output.\nCheck the data connections, by clicking the connections, and looking at which data is being produced. Check all formulas for errors.\n\nHappy productivity!",
  "featuredImage": "/data/workflows/4980/4980.webp",
  "author": {
    "id": 101,
    "slug": "imperolq",
    "name": "Zacharia Kimotho",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 687,
  "downloads": 68,
  "createdAt": "2025-06-17T06:55:47.611Z",
  "updatedAt": "2026-01-16T08:37:09.757Z",
  "publishedAt": "2025-06-17T06:55:47.611Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4980"
}