{
  "id": 4893,
  "slug": "4893",
  "title": "Automated daily email analysis & summary with GPT-4o and Gmail",
  "description": "# Daily Email Pulse Summary:\n\nThis agent summarizes a user's daily emails into a clean, actionable summary. It uses OpenAI to analyze content and sends a formatted \"Daily Pulse\" email at the end of each day.\n\n## Main use cases:\nKeep track of open loops and next steps across all email conversations\n\nIdentify high-potential leads and flag conversations going nowhere\n\nEliminate the need to manually review your inbox at day’s end\n\nBuild a smart summary layer using AI without hallucination or noise\n\n## How it works\nThis workflow can be divided into eight core nodes, each serving a distinct purpose in helping a user stay on top of their day. The result is a curated, AI-generated summary delivered to your inbox — crafted from real message content, not guesswork.\n\n1. Schedule Trigger (Trigger Node – Runs Daily at Set Time)\n\n- Kicks off the workflow at a specific time each day (e.g. 6:00 PM).\n- Ensures you receive your Daily Pulse consistently, without needing to run it manually.\n\n2. Date Transformer (Function Node – Define Today & Tomorrow Range)\n- Uses JavaScript to calculate the current day’s date range:\n\t - today: Start of day (00:00:00)\n\t - tomorrow: Start of next day (used as a cutoff)\n- This ensures only emails from today are analyzed, keeping the summary focused and current.\n\n3. Get All Messages (Gmail Node – Fetch Filtered Emails)\n- Pulls in all Gmail messages with internalDate between today and tomorrow.\n- Outputs structured data: from, subject, and body text of each email.\n- This forms the raw data for the daily business pulse.\n\n4. Aggregator (Function or Item Lists Node – Combine Message Fields)\n- Aggregates each message into a readable format:\n\n```\nFrom: John@example.com  \nSubject: Demo Follow-up  \nBody: Let’s schedule a time this week...\n```\n\n- All messages are stitched together into a single combinedText string for analysis.\n- This gives the AI model full context for the day in one unified document.\n\n5. Email Cleanup (Function Node – Remove Noise & Normalize Text)\n- Cleans the combinedText blob to remove:\n\t- HTML tags\n\t- Marketing footers (e.g., unsubscribe links)\n\t- Redundant whitespace or formatting artifacts\n- Ensures GPT gets clean, relevant message content with no distractions.\n\n6. Agent (OpenAI Node – Generate Structured Summary)\n- Uses a System Prompt to define its role as an AI Chief of Staff.\n- Uses a User Prompt that instructs it to categorize messages into sections:\n\n\t- 📝 Open Loops / Pending Follow-Up\n\t- 🚀 Next Steps You’ve Committed To\n\t- 🧲 Leads Worth Following Up On\n\t- 🛑 Conversations That Aren’t Leading Anywhere\n\t- 🧠 Strategy Notes\n\t- ✅ Top 3 Tasks for Tomorrow\n\n- Built-in guardrails ensure the model only uses real content (no hallucination).\n- Sections with no relevant data are omitted to keep it concise.\n\n7. HTML Formatter (Function Node – Wrap Markdown in Email-Ready HTML)\n- Wraps the GPT-generated markdown summary in a simple &lt;html&gt;&lt;body&gt;<pre> structure.\n- Applies white-space: pre-wrap to preserve formatting and spacing.\n- The result is a clean, readable email that renders well across all inboxes (especially Gmail).\n\n8. Email Send (Email Node – Deliver the Final Pulse)\n- Sends the formatted summary to your email inbox.\n- Subject: Your Daily Business Pulse – {{today}}\n- HTML body: Uses the formatted output from the previous step.\n- Final output: a well-organized, scannable summary of the day’s communication — focused on what matters.\n\n## Why It Works\n- Automates the end-of-day review ritual without effort\n- Prioritizes follow-ups, action items, and time-sensitive leads\n- Filters out noise and low-value conversations\n- Leverages GPT without risk of hallucination or irrelevant output\n- Delivers clarity, helping you focus on tomorrow’s most important tasks```language\n\n```\n",
  "featuredImage": "/data/workflows/4893/4893.webp",
  "author": {
    "id": 101,
    "slug": "ajenta",
    "name": "Zach @BrightWayAI",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2820,
  "downloads": 282,
  "createdAt": "2025-06-12T04:19:38.502Z",
  "updatedAt": "2026-01-16T08:36:48.369Z",
  "publishedAt": "2025-06-12T04:19:38.502Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4893"
}