{
  "id": 12381,
  "slug": "12381",
  "title": "Translate Chinese audio into multilingual voiceovers with GPT-4o and ElevenLabs",
  "description": "## How It Works\nThis workflow automates end-to-end audio translation with quality assurance for content creators, educators, and international teams managing multilingual content. It solves the challenge of translating audio into multiple languages while ensuring accuracy and maintaining organized delivery. The system receives audio files via webhook, splits them into target languages (Arabic, French, Spanish, Chinese, Hindi), and processes each through NVIDIA's Parakeet TDT translation model. OpenAI validates translation quality, and results are enhanced with comprehensive metadata. Successfully translated files are uploaded to Google Drive with organized naming, combined into a summary spreadsheet, and delivered via email notification. Failed translations trigger quality alerts, ensuring reliable output while minimizing manual oversight and reducing translation turnaround time from hours to minutes.\n\n## Setup Steps\n1. Configure NVIDIA API credentials in the \"Generate Audio with ElevenLabs\" \n2. Add OpenAI API key for quality evaluation in the \"OpenAI Chat Model\" node\n3. Set up Google Drive OAuth connection and specify target folder ID for uploads\n4. Configure Gmail SMTP credentials for notification delivery\n5. Update webhook URL in source applications to trigger workflow\n6. Customize target languages in \"Split Languages\" node if needed\n\n## Prerequisites\nActive accounts: NVIDIA (build.nvidia.com), OpenAI, Google Drive, Gmail. API credentials for all services. \n\n## Use Cases\nInternational podcast distribution, e-learning course localization\n\n## Customization\nModify target languages in Split node, adjust quality thresholds in OpenAI evaluation\n\n## Benefits\nReduces translation time by 90%, eliminates manual quality checks through automated validation\n\n\nHere are **clear, professional subheadings** for each *What / Why* pair. They’re concise, action-oriented, and fit well in technical workflow documentation.\n\n \n",
  "featuredImage": "/data/workflows/12381/12381.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 4,
  "downloads": 0,
  "createdAt": "2026-01-02T04:46:50.393Z",
  "updatedAt": "2026-01-16T09:12:20.798Z",
  "publishedAt": "2026-01-02T04:46:50.393Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12381"
}