{
  "id": 9149,
  "slug": "9149",
  "title": "Multimodal Slack AI assistant with voice, image & video processing",
  "description": "# What it's for:\nThis is a base template for anyone trying to develop a Slack bot AI Agent. This base allows for multiple inputs (Voice, Picture, Video, and Text inputs) to be processed by an AI model of their choosing to a get a User started. From here, the User may connect any tools that they see fit to the AI Agent for their n8n workflows.\n\n#### NOTE: This build is specifically for integrating a Slack bot into a CHAT Channel\nIf you want to allow the Slack bot to be integrated into the whole workspace, you'll need to adjust some of the nodes and bot parameters\n\n# How it works:\n**Input**: Slack message mentioning a bot in a chat channel\n\n**n8n Processing**: Switch node determines the type:\n1. Voice Message\n2. Picture Message\n3. Video Message\n4. Text Message\n\n(Currently uses OpenAI and Gemini to analyze Voice/Photo/Video content but feel free to change these nodes with other models)\n\n**AI Agent Proccessing**: LLM of your choosing examines message and based on system prompt, generates an output\n\n**Output**: AI Output is sent back in Slack Message\n\n# How to use:\n ### 1. Create your Slack bot and generate access token\nThis part will be longest part of the guide but feel free to Youtube search \"How to install Slack AI agent\" or soemthing similar in case it's hard to follow\n\n- Sign in to the Slack website then go to:\nhttps://api.slack.com/apps/ \n- Click \"Create App\" (Top Right Corner)\n- Choose \"From Scratch\"\n- Enter desired name of App (bot) and desired workspace\n- Go to \"OAuth and Permissions\" tab on the left side of the webpage\n- Scroll to \"Bot Token Scopes\" and Add Permissions:\n\t\t- app_metions:read\n\t\t- channels:history\n\t\t- channels:join\n\t\t- channels:read\n\t\t- chat:write\n\t\t- files:read\n\t\t- links:read\n\t\t- links:write\n(Feel free to add other permissions here. These are just the ones that will be needed for the automation to work)\n- Next, go to \"Event Subscriptions\" and paste your n8n webhook URL (Find webhook URL by clicking on the Slack trigger node and there should be a dropdown for webhook URL at the very top)\n- Go back to \"OAuth & Permissions\" Tab and install your bot to the Slack workspace (should be a green button under the \"Bot User OAuth Token\" \n(Remember where this token is for later because you'll need it to create the n8n credentials)\n- Add the bot to your channel by going to your channel, then type \"@[your bot name]\"\n- Should be a message from Slack to add bot to Channel\n- Congrats for following along, you've added the bot to your channel!\n\n ### 2. Create Credentials in n8n\n- Open Slack trigger node\n- Click create credential\n- Paste access token \n(If you followed the steps above, it'll be under \"OAuth & Permissions\" -&gt; Copy the \"Bot User OAuth Token\" and paste it in n8n accesss\n- Save\n\n### 3. Add Bot Token to HTTP Request nodes\n- Open HTTP Request Nodes (Nodes under the \"Downlaod\" Note\t\t\t\t\t\t\t- Scroll down and paste your Bot Access token under \"Header Parameters\". Should be a placeholder \"[Your bot access token goes here]\".\n- **NOTE**: Replace everything, including the square brackets\n- **Do not** remove \"Bearer\". Only replace the placeholder. \nFinalized Authorization value should be:\n\"Bearer + [Your bot access token]\"\nNOT\n\"[Your bot access token ONLY]\"\n\n### 4. Change ALL Slack nodes to your Slack Workspace and Channel\n- Open the nodes, change workspace to your workspace\n- Change channel to your channel\n- Do this for all nodes\n\n### 5. Create LLM access token\n (Different per LLM but search your LLM + API in google)\n- (You will have to create an account with the LLM platform)\n- Buy credits to use LLM API\n- Generate Access token\n- Paste token in LLM node\n- Choose your model\n\n# Requirements:\n- Slack Bot Access Token\n- Google Gemini Access Token (For Picture and Video messages)\n- OpenAI Access Token (For Voice messages)\n- LLM Access Token (Your preference for the AI Agent)\n\n# Customizing this workflow:\n- To personalize the AI Output, adjust the system prompt (give context or directions on the AI's role)\n- Add tools to the AI agent to give it more utility besides a personalied LLM (Example: Calendars, Databases, etc).",
  "featuredImage": "/data/workflows/9149/9149.webp",
  "author": {
    "id": 101,
    "slug": "keithuy",
    "name": "Keith Uy",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 426,
  "downloads": 42,
  "createdAt": "2025-10-01T11:11:23.959Z",
  "updatedAt": "2026-01-16T08:59:13.992Z",
  "publishedAt": "2025-10-01T11:11:23.959Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9149"
}