{
  "id": 6822,
  "slug": "6822",
  "title": "Automate web research with GPT-4, Claude & Apify for content analysis and insights",
  "description": "This n8n template demonstrates how to automate comprehensive web research using multiple AI models to find, analyze, and extract insights from authoritative sources.\n\nUse cases are many: Try automating competitive analysis research, finding latest regulatory guidance from official sources, gathering authoritative content for reports, or conducting market research on industry developments!\n\n## Good to know\n\nEach research query typically costs $0.08-$0.34 depending on the number of sources found and processed. The workflow includes smart filtering to minimize unnecessary API calls.\n\nThe workflow requires multiple AI services and may need additional setup time compared to simpler templates.\n\nQdrant storage is optional and can be removed without affecting performance.\n\n## How it works\n\nYour research question gets transformed into optimized Google search queries that target authoritative sources while filtering out low-quality sites.\n\nApify's RAG Web Browser scrapes the content and converts pages to clean markdown format.\n\nClaude Sonnet 4 evaluates each article for relevance and quality before full processing.\n\nArticles that pass the filter get analyzed in parallel - one pipeline creates focused summaries while another extracts specific claims and evidence.\n\nGPT-4.1 Mini ranks all findings and presents the top 3 most valuable insights and summaries.\n\nAll processed content gets stored in your Qdrant vector database to prevent duplicate processing and enable future reference.\n\n## How to use\n\nThe manual trigger node is used as an example but feel free to replace this with other triggers such as webhook, form submissions, or scheduled research.\n\nYou can modify the configuration variables in the Set Node to customize Qdrant URLs, collection names, and quality thresholds for your specific needs.\n\n## Requirements\n\nOpenAI API account for GPT-4.1 Mini (query optimization, summarization, ranking)\nAnthropic API account for Claude Sonnet 4 (content filtering)\nApify account for web scraping capabilities\nQdrant vector database instance (local or cloud)\nOllama with nomic-embed-text model for embeddings\n\n## Customizing this workflow\n\nWeb research automation can be adapted for many specialized use cases. Try focusing on specific domains like legal research (targeting .gov and .edu sites), medical research (PubMed and health authorities), or financial analysis (SEC filings and analyst reports).",
  "featuredImage": "/data/workflows/6822/6822.webp",
  "author": {
    "id": 101,
    "slug": "zendzipr",
    "name": "Peter Zendzian",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1038,
  "downloads": 103,
  "createdAt": "2025-08-01T19:55:13.142Z",
  "updatedAt": "2026-01-16T08:47:12.493Z",
  "publishedAt": "2025-08-01T19:55:13.142Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6822"
}