{
  "id": 11930,
  "slug": "11930",
  "title": "Auto-schedule Instagram & Facebook posts from Google Sheets",
  "description": "**How it works**\n\nThis workflow automatically publishes Instagram and Facebook posts using Google Sheets as a content calendar. Users add post details to a sheet, and the workflow handles scheduling, image processing, posting, and status updates without manual intervention.\n\n**Step-by-step**\n\n**Scheduled Trigger**\nThe workflow runs automatically at a fixed interval (for example, every 15 minutes) to check for posts that are ready to be published.\n\n**Configuration & Credentials**\nA configuration step stores reusable values such as spreadsheet ID, sheet name, and platform settings, keeping the workflow easy to customize and secure.\n\n**Data Retrieval & Filtering**\nPosts are read from Google Sheets and filtered to include only rows marked as “Pending” and scheduled for the current time or earlier.\n\n**Image Handling**\nIf an image link is provided, the workflow downloads the image from Google Drive. If no image is present, the post continues as text-only.\n\n**Platform Routing**\nBased on the selected platform (Instagram, Facebook, or both), the workflow routes the post to the appropriate publishing path.\n\n**Social Media Publishing**\nThe post is published to Instagram and/or Facebook using the connected business account credentials.\n\n**Status Update**\nAfter publishing, the workflow updates the original Google Sheet with the post status (Success or Failed), published timestamp, and error message if applicable.",
  "featuredImage": "/data/workflows/11930/11930.webp",
  "author": {
    "id": 101,
    "slug": "jamesdinakar",
    "name": "Dinakar Selvakumar",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 213,
  "downloads": 21,
  "createdAt": "2025-12-18T16:46:53.529Z",
  "updatedAt": "2026-01-16T09:10:43.877Z",
  "publishedAt": "2025-12-18T16:46:53.529Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11930"
}