{
  "id": 6013,
  "slug": "6013",
  "title": "Create personal notes with voice transcription using local LLaMA and Telegram",
  "description": "## PersonalNotesAssistant – Organize and Understand Your Thoughts with Local AI\n\n## PersonalNotesAssistant is an offline-capable, AI-powered agent that helps you store, summarize, retrieve, and reflect on your personal notes and voice memos — all processed locally and sent via Telegram. Built to run efficiently on a Raspberry Pi 5, this agent supports a variety of note-taking styles and acts as your private memory extension.\n\n## 🧠 What It Can Do\nAccept voice or text notes via Telegram\n\nTranscribe audio messages into clean, structured text (using Whisper)\n\nAutomatically summarize or categorize notes with a local LLM\n\nAnswer questions based on your past notes\n\nRetrieve relevant entries by topic, date, or keyword\n\nHelp you journal or reflect by asking follow-up questions\n\nWork completely offline — no cloud or external APIs\n\n## 🔧 How It Works\nCapture Notes via Telegram\nYou send a voice message or text to your Telegram bot. The assistant supports both quick thoughts and long-form content.\n\n## Transcription with Whisper (Local)\nIf the input is a voice message, it is transcribed into text using Whisper running locally on your Raspberry Pi.\n\n## AI Summarization & Tagging\nThe transcribed or typed note is sent to LLaMA 3.2 via Ollama, which summarizes it, suggests tags, and stores it with metadata (e.g., timestamp, mood, theme).\n\n## Storage & Retrieval\nNotes are stored in a local database (e.g., SQLite or JSON). You can later query the assistant with prompts like:\n\n“What did I say about stress last week?”\n\n“Summarize my ideas from this month.”\n\n“Show notes tagged with 'travel'.”\n\nFollow-Up & Reflection\nThe agent can optionally engage with reflective prompts to help you deepen your thoughts or gain insight from what you’ve recorded.\n\n## 💡 Use Cases\nTrack personal growth, habits, or therapy progress\n\nCreate voice memos while walking or commuting\n\nMaintain a structured journal without typing\n\nUse as a second brain to help you remember and revisit important thoughts\n\n## 🔐 Privacy by Default\nEverything runs locally:\n\nNo notes are uploaded to cloud platforms\n\nNo audio is sent to third-party transcription services\n\nNo LLM processing happens outside your device\n\nIdeal for privacy-minded users, psychologists, researchers, or digital minimalists who want AI assistance without surveillance.\n\n## ⚙️ Technical Stack\nRaspberry Pi 5: Low-power edge device\n\nWhisper (local): For voice-to-text conversion\n\nOllama + LLaMA 3.2: For summarization, classification, and retrieval\n\nTelegram Bot API: For input/output\n\nCustom Database (e.g., JSON/SQLite): For storing and querying notes\n\n## 🧪 Real-Life Use\nThis agent is actively used daily by the developer to log ideas, emotions, and plans. It has proven effective for lightweight journaling and context-aware memory assistance, even when offline.",
  "featuredImage": "/data/workflows/6013/6013.webp",
  "author": {
    "id": 101,
    "slug": "albertob12",
    "name": "Alberto",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1879,
  "downloads": 187,
  "createdAt": "2025-07-14T22:28:24.991Z",
  "updatedAt": "2026-01-16T08:42:40.206Z",
  "publishedAt": "2025-07-14T22:28:24.991Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6013"
}