{
  "id": 2579,
  "slug": "2579",
  "title": "Handling job application submissions with AI and n8n forms",
  "description": "This n8n template leverages n8n's multi-form feature to build a 2 part job application submission journey which aims to eliminate the need for applicants to re-enter data found on their CVs/Resumes.\n\n## How it works\n* The application submission process starts with an n8n form trigger to accept CV files in the form of PDFs.\n* The PDF is validated using the text classifier node to determine if it is a valid CV else the applicant is asked to reupload.\n* A basic LLM node is used to extract relevant information from the CV as data capture. A copy of the original job post is included to ensure relevancy.\n* Applicant's data is then sent to an ATS for processing. For our demo, we used airtable because we could attach PDFs to rows.\n* Finally, a second form trigger is used for the actual application form. However, it is prefilled to save the applicant's time and allow them to amend any of the generated application fields.\n\n## How to use\n* Ensure to change the redirect URL in the **form ending** node to use the host domain of your n8n instance.\n\n## Requirements\n* OpenAI for LLM\n* Airtable to capture applicant data\n\n## Customising the workflow\n* Application form is pretty basic for this demonstration but could be extended to ask more in-depth questions.\n* If it fits the job, why not ask applicants to upload portfolio works and have AI describe/caption them.",
  "featuredImage": "/data/workflows/2579/2579.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 12370,
  "downloads": 1237,
  "createdAt": "2024-11-26T17:34:46.794Z",
  "updatedAt": "2026-01-16T08:25:30.535Z",
  "publishedAt": "2024-11-26T17:34:46.794Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2579"
}