{
  "id": 11910,
  "slug": "11910",
  "title": "Translate multilingual content with DeepL, GPT-4, WordPress, Slack and Sheets",
  "description": "#Multi-Language Content Translation Pipeline with AI Quality Control\n\nThis workflow provides a professional-grade translation pipeline that combines the speed of DeepL with the intelligent reasoning of OpenAI's GPT-4. It is designed to help teams scale their global content reach without sacrificing linguistic accuracy or cultural nuance.\n\n## Who’s it for\nThis template is ideal for content managers, digital marketing teams, and global publishers who need to localize high volumes of articles or documentation while maintaining a \"human-in-the-loop\" quality standard.\n\n## How it works\nThe workflow automates the entire translation lifecycle through the following steps:\n1. **Trigger:** Content is ingested via a Webhook or a recurring Schedule.\n2. **Translation:** The source text is translated into multiple target languages simultaneously using the DeepL API.\n3. **AI Quality Guard:** An OpenAI agent evaluates each translation, assigning a quality score based on accuracy and fluency.\n4. **Automated Publishing:** Content that meets your quality threshold is automatically uploaded as a draft to WordPress.\n5. **Manual Review:** Any translations that fall below the threshold are flagged in Slack for human intervention.\n6. **Data Logging:** All results are saved to Google Sheets to build a searchable translation memory.\n\n## How to set up\n1. **Credentials:** Connect your DeepL, OpenAI, WordPress, Slack, and Google Sheets accounts.\n2. **Configuration:** In the 'Translation Configuration' node, define your source language and a list of target languages (e.g., DE, FR, JA).\n3. **Google Sheets:** Create a sheet with headers: `contentId`, `title`, `sourceLanguage`, `targetLanguage`, `translatedText`, and `qualityScore`.\n4. **Slack:** Choose the notification channels for alerts and summary reports.\n\n## Requirements\n- DeepL API key\n- OpenAI API key (GPT-4o or GPT-4o-mini recommended)\n- WordPress site with Application Passwords enabled\n- A Slack workspace and a Google Sheets account\n\n## How to customize the workflow\n- **Adjust Quality Standards:** Change the `qualityThreshold` value in the configuration node to make the AI verification more or less strict.\n- **Add Platforms:** Replace the WordPress node with other CMS nodes like Ghost, Strapi, or Contentful to match your stack.\n- **Advanced QA:** Modify the AI Quality Reviewer’s prompt to focus on specific brand guidelines or industry terminology.",
  "featuredImage": "/data/workflows/11910/11910.webp",
  "author": {
    "id": 101,
    "slug": "tomo-0310",
    "name": "TOMOMITSU ASANO",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2025-12-18T04:32:46.313Z",
  "updatedAt": "2026-01-16T09:10:38.736Z",
  "publishedAt": "2025-12-18T04:32:46.313Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11910"
}