{
  "id": 7695,
  "slug": "7695",
  "title": "Automate weekly Meta Ad reports with Claude AI, GoMarble MCP & Google Slides",
  "description": "This automation workflow transforms Meta advertising data into executive ready presentation decks, eliminating manual report creation while ensuring stakeholders receive consistent performance insights. It generates professional Google Slides presentations from your ad campaigns and delivers them automatically via email to designated recipients. By combining scheduled data extraction with AI-powered analysis and automated presentation building, you'll receive polished, actionable reports that facilitate strategic advertising decisions and client communication\n\n\n**Key Features:**\nScheduled automated summary deck generation (daily, weekly, or monthly)\nAI powered data analysis using advanced language models\nIntelligent presentation generation with actionable recommendations\nDirect email delivery of formatted summary decks\n\n**Prerequisites:**\nGoMarble MCP account and API access\nAnthropic account\nGoogle Slides, Google Drive & Gmail accounts\nn8n instance (cloud or self-hosted)\n\n\n**Configuration Time:** ~15-20 minutes\n\n**Step By Step Setup:**\n\n**1. Connect GoMarble MCP to n8n**\n\nFollow the integration guide: [GoMarble MCP Setup](https://docs.google.com/presentation/d/1uBu4Bky-8WiPxLCcoQHzLU6itk5UE752HPbCUhPDmVA/edit?slide=id.g37064fd59c7_0_31#slide=id.g37064fd59c7_0_31)\n\nConfigure your Meta Ads account credentials in GoMarble platform\n\n**2. Configure the Schedule Trigger**\n\n**3.Customize the Ad Account Settings.**\n Update the account name to match your ad account name.\n \n**4. Customise the Report Prompt**\n(Although the workflow includes a pre configured template report prompt)\n\nDefine specific metrics and KPIs to track\nSet analysis parameters and report format preferences\n\n**5. Set up AI Agent Configuration**\nConfigure Anthropic Claude model with your API credentials\nConnect the GoMarble MCP tools for Meta advertising data\n\n**6. Configure Google Services Integration**\nSet up Google Slides OAuth2 API for presentation creation\nConfigure Google Drive OAuth2 API for file management\nLink Gmail OAuth2 for automated email delivery\n\n**7. Customize Email Delivery**\nSet recipient email addresses for stakeholders\nCustomize email subject line and message content\nAdvanced Configuration\nModify report prompt to include specific metrics and KPIs\nAdjust slide content structure (5-slide format: Executive Snapshot, Channel KPIs, Top Campaigns, Under-performers, Action Recommendations)\n\n\n**What You'll Get**\n\nAutomated Presentation Creation: Weekly Google Slides decks generated without manual intervention\nProfessional Ads Analysis: Executive-ready performance summaries with key metrics and insights\nStructured Intelligence: Consistent 5-slide format covering spend, ROAS, campaign performance, and strategic recommendations\nDirect Stakeholder Delivery: Presentations automatically emailed as attachments to specified recipients\nData-Driven Insights: AI-powered analysis of campaign performance with actionable next steps\nScalable Reporting: Easy to modify timing, recipients, or content structure as business needs evolve\nPerfect for marketing teams, agencies, and business owners who need regular Meta advertising performance updates delivered professionally without manual report creation.\n",
  "featuredImage": "/data/workflows/7695/7695.webp",
  "author": {
    "id": 101,
    "slug": "sankalpthedev",
    "name": "Sankalp Dev",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 445,
  "downloads": 44,
  "createdAt": "2025-08-21T09:22:07.081Z",
  "updatedAt": "2026-01-16T08:51:51.715Z",
  "publishedAt": "2025-08-21T09:22:07.081Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7695"
}