{
  "id": 8620,
  "slug": "8620",
  "title": "Transfer workflows with credentials & sub-workflow management between n8n instances",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# Export Workflows Between n8n Instances\nCopy workflows between n8n instances — with optional credential export and automatic sub-workflow adjustments.\n\n## 🧠 How it Works\nThis workflow copies a selected workflow from a **SOURCE** n8n server to a **TARGET** server and guides you through safe checks:\n\n- **Name conflict check**: If a workflow with the same name exists on the target the export is stopped.\n- **Sub-workflows**: Detects calls to sub-workflows.\n  - If all sub-workflows exist on the target (same names), references are auto-updated and the export continues.\n  - If any are missing, the form shows what’s missing and lets you cancel or proceed anyway.\n- **Credentials**: Detects nodes using credentials and lets you export those credentials along with the workflow.\n  - The workflow can only apply credential corrections for the credentials that you choose to export with it. \n  - At the end, the form lists which credentials were successfully exported.\n\n💡 For in-depth behavior and edge cases, see the Notes inside the workflow (Setup, How It Works, and Credential Issues).\n\n## 🚀 How to Use\n1. Run this workflow on your **SOURCE** server.  \n2. Follow the step-by-step form: pick the workflow to export, choose whether to include credentials, and review sub-workflow checks. Done.\n\n## ⚙️ Setup\n- Create an **n8n API key** on both servers (SOURCE and TARGET).\n- On the SOURCE server, create **two n8n API credentials** in n8n: one for SOURCE and one for TARGET (using the respective base URL and key).\n- Configure the nodes in this workflow with these two credentials.\n- Detailed step-by-step instructions are available in the workflow notes.\n\n\n✅ Once configured, you’ll be ready to migrate workflows between servers in just a few clicks.",
  "featuredImage": "/data/workflows/8620/8620.webp",
  "author": {
    "id": 101,
    "slug": "arthurmb",
    "name": "Arthur Braghetto",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 319,
  "downloads": 31,
  "createdAt": "2025-09-16T00:17:07.812Z",
  "updatedAt": "2026-01-16T08:56:53.583Z",
  "publishedAt": "2025-09-16T00:17:07.812Z",
  "nodes": 54,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8620"
}