{
  "id": 12173,
  "slug": "12173",
  "title": "Extract & organize email invoices with Gmail, Drive & OpenAI GPT",
  "description": "## Who’s it for\n\nThis template is for founders, finance teams, and solo operators who receive lots of invoices by email and want them captured automatically in a single, searchable source of truth. If you’re tired of hunting through your inbox for invoice PDFs or “that one receipt from three months ago,” this is for you.\n\n## What it does / How it works\n\nThe workflow polls your Gmail inbox on a schedule and fetches new messages including their attachments. A JavaScript Code node restructures all attachments, and a PDF extraction node reads any attached PDFs.  \nAn AI “Invoice Recognition Agent” then analyzes the email body and attachments to decide whether the email actually contains an invoice. If not, the workflow stops.\n\nIf it is an invoice, a second AI “Invoice Data Extractor” pulls structured fields such as `date_email`, `date_invoice`, `invoice_nr`, `description`, `provider`, `net_amount`, `vat`, `gross_amount`, `label` (saas/hardware/other), and `currency`. Depending on whether the invoice is in an attachment or directly in the email text, the workflow either:\n\n- uploads the invoice file to Google Drive, or  \n- document a direct link to the mail,\n\nthen appends/updates a row in Google Sheets with all invoice parameters plus a Drive link, and finally marks the Gmail message as read.\n\n## How to set up\n\n1. Add and authenticate:\n   - Gmail credentials  \n   - Google Sheets credentials  \n   - Google Drive credentials  \n   - OpenAI (or compatible) credentials for the AI nodes\n2. Create or select a Google Sheet with the expected columns (date_email, date_invoice, invoice_nr, description, provider, net_amount, vat, gross_amount, label, currency, link).\n3. Create or select a Google Drive folder where invoices/docs should be stored.\n4. Adjust the Gmail Trigger filters (labels, search query, polling interval) to match the mailbox you want to process.\n5. Update node credentials and resource IDs (Sheet, Drive folder) via the node UIs, not hardcoded in HTTP nodes.\n\n## Requirements\n\n- n8n instance (cloud or self-hosted)  \n- Gmail account with OAuth2 setup  \n- Google Drive and Google Sheets access  \n- OpenAI (or compatible) API key configured in n8n  \n- Sufficient permissions to read emails, read/write Drive files, and edit the target Sheet\n\n## How to customize the workflow\n\n- **Change invoice categories**: Extend the `label` enum (e.g., add “services”, “subscriptions”) in the extraction schema and adjust any downstream logic.\n- **Refine invoice detection**: Tweak the AI prompts to be more or less strict about what counts as an invoice or receipt.\n- **Add notifications**: After updating the Sheet, send a Slack/Teams message or email summary for high-value invoices.\n- **Filter by sender or subject**: Narrow the Gmail Trigger to specific vendors, labels, or keywords.\n- **Extend the data model**: Add fields (e.g., cost center, project code) to the extractor prompt and Sheet mapping to fit your bookkeeping setup.",
  "featuredImage": "/data/workflows/12173/12173.webp",
  "author": {
    "id": 101,
    "slug": "ferasdabour",
    "name": "Feras Dabour",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 246,
  "downloads": 24,
  "createdAt": "2025-12-26T12:15:09.966Z",
  "updatedAt": "2026-01-16T09:11:38.399Z",
  "publishedAt": "2025-12-26T12:15:09.966Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12173"
}