{
  "id": 9157,
  "slug": "9157",
  "title": "Ai-powered email triage & auto-response system with OpenAI agents & Gmail",
  "description": "# AI Email Dispatcher: Classify, Process, and Route Emails with Multiple Agents\n\nThis n8n template automatically classifies incoming emails (Sales, Support, Internal, Finance, Promotions) and routes them to a dedicated **OpenAI LLM Agent** for processing. Depending on the category, the agent will then:\n\n* **Internal/Customer Support:** Draft a reply and send it.\n* **Sales/Finance/Promotions:** Generate a summary, notification, or draft reply for a human to review.\n\nThis is the ultimate workflow for managing a high volume of emails, ensuring every message gets a fast, appropriate, and structured AI-powered response or initial analysis.\n\n## How it works\n\n* The **Gmail Trigger** node monitors your inbox for unread emails.\n* The **Text Classifier** node uses AI to read the email body and subject to categorize it as Internal, Customer Support, Sales, Promotions, or Admin/Finance.\n* The workflow then uses a **Split In Batches** node and multiple **If** nodes to send the email data to a specific, specialized **OpenAI Agent** (LLM node) based on the classification.\n* Each AI Agent has a custom system prompt (e.g., \"Customer Support Agent,\" \"Promotions Analyst\") to ensure it processes the email with the right rules, tone, and output format.\n* Finally, the workflow either automatically **replies** via Gmail (for Internal and Support) or creates a **draft/summary** and sends a **notification** (for Sales, Finance, and Promotions) for human review.\n\n## Set up steps\n\nSetting up the accounts and nodes should take about **10–15 minutes**.\n\n1.  **Gmail Account:** You'll need to set up two Gmail credentials for the workflow:\n    * One for the **Gmail Trigger** to watch for new unread emails.\n    * A second one for the **Gmail** action nodes to label, draft, and reply to messages.\n2.  **OpenAI Account:** Connect your **OpenAI API Key** to the five different LLM Agent nodes.\n3.  **Telegram/Slack:** Set up your Telegram or Slack credentials to receive the 'New Sales Opportunity' and 'New Finance' notifications.\n4.  **Labels in Gmail:** Before activating the workflow, make sure you have created the necessary labels in your Gmail account for the classifier (Internal, Customer Support, Promotions, Admin/Finance, Sales Opportunity).\n5.  **Review Agent Prompts:** The instructions and logic for each AI Agent are in the system messages. You might want to review and customize these prompts to match your specific business rules and tone.\n\n## Requirements\n\n* **Gmail** Account\n* **OpenAI** Account (or another LLM provider for the agents)\n* **Telegram** (or Slack/other notification tool of your choice)\n\n## Customising this workflow\n\nYou can easily adapt this template to suit your needs!\n\n* **New Categories:** Modify the **Text Classifier** node to add or remove categories (e.g., \"Job Applications,\" \"Partnerships\"). You would then add a new LLM Agent and routing logic for the new category.\n* **Different LLMs:** You can swap the OpenAI nodes for any other LLM service supported by n8n, such as **Gemini** or **Anthropic Claude**, by simply changing the node type or model ID.\n* **More Actions:** Instead of just sending a notification to Telegram, you could modify the logic to create a task in **ClickUp**, a lead in **Salesforce**, or an entry in a **Google Sheet** when a \"Sales Opportunity\" email is identified. 📬✨",
  "featuredImage": "/data/workflows/9157/9157.webp",
  "author": {
    "id": 101,
    "slug": "abdosman06",
    "name": "Abdullahi Ahmed",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 556,
  "downloads": 55,
  "createdAt": "2025-10-01T15:02:27.867Z",
  "updatedAt": "2026-01-16T08:59:18.135Z",
  "publishedAt": "2025-10-01T15:02:27.867Z",
  "nodes": 68,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9157"
}