{
  "id": 8252,
  "slug": "8252",
  "title": "Crypto market analysis with Chart-img, BrowserAI & GPT insights to Telegram",
  "description": "**AI powered Automated Crypto Insights with Chart-img and BrowserAI**\n\n*Tired of paying for costly crypto updates? Or reading long analyses?*\n\nThis n8n workflow automates the delivery of personalized crypto insights, using **[Chart-img](https://chart-img.com)** for capturing coin graphs of **BTC, ETH, SOL**, and **XRP** as base64 images, and **[BrowserAI](https://browser.ai)** for web scraping and information gathering of news and articles. This setup ensures thorough market coverage and timely updates, without breaking the bank.\n\n## Overview\nDesigned for crypto enthusiasts, traders, and analysts, this workflow automates the process of collecting and distributing valuable crypto information.\nIt’s perfect for anyone wanting consistent and accurate updates conveniently.\n\n## Setup Instructions\n\n### Pre-conditions\n1. **Chart-img Account:** Register for a Chart-img account and obtain an API key [here](https://chart-img.com/account/api).\n2. **BrowserAI Account:** Sign up for BrowserAI and get your API key from your [BrowserAI dashboard](https://browser.ai/dashboard/page/account/tab/api_key).\n\n## Step-by-Step Setup\n\n**🗓️ Schedule and Date Calculation**\n- Triggers twice daily at 8AM and 8PM to ensure up-to-date insights, and can be changed to your like.\n- Calculates yesterday’s date dynamically for accurate data retrieval.\n\n**📊 Coin Graph Capture with Chart-img**\n- Uses Chart-img API to capture 24-hour graphs for **BTC, ETH, SOL**, and **XRP**.\n- Converts images to base64 strings for easy integration into analysis.\n\n**🌐 Web Scraping with BrowserAI**\n- Creates tasks in BrowserAI to gather the latest crypto news and insights.\n- Automates data extraction for comprehensive market analysis.\n\n**⌛ Monitor and Complete Tasks**\n- Incorporates status checks to ensure BrowserAI tasks complete successfully before proceeding.\n\n**✏️ Analyze and Synthesize Information**\n- Combines graph data with web-scraped insights for an enriched summary.\n- Uses AI to generate simple, informative descriptions under 60 words to not overload you.\n\n**📩 Deliver Insights Efficiently**\n- Sends the compiled analysis to your Telegram, with easy options to switch to WhatsApp, email, or any other communication channel.\n\n## Customization Guidance\n- **Content Personalization:** Customize the datasets and keywords for tailored updates.\n- **Modify Schedule:** Adjust triggering times according to your needs using n8n’s scheduling options.\n\nThis workflow delivers a seamless and cost-effective approach to staying informed about crypto market trends, combining the latest technology for superior insights.\n\n++WARNING:++ This template is intended for personal use only and does not constitute financial advice. Any actions taken using this tool are solely the user's responsibility.",
  "featuredImage": "/data/workflows/8252/8252.webp",
  "author": {
    "id": 101,
    "slug": "alexg",
    "name": "Alex Gurinovich",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 786,
  "downloads": 78,
  "createdAt": "2025-09-04T11:35:11.254Z",
  "updatedAt": "2026-01-16T08:54:56.303Z",
  "publishedAt": "2025-09-04T11:35:11.254Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8252"
}