{
  "id": 9160,
  "slug": "9160",
  "title": "Automatic re-engagement for inactive Shopify customers via Beex",
  "description": " \n## Summary\n\nRe-engage your customers with your Shopify store through a personalized contact sequence.\n## How it works\n1. The workflow is triggered by a Scheduler Trigger and immediately reviews your Shopify customers by retrieving their last_order_id.\n\n2. For customers with a non-null last_order_id, the workflow proceeds to fetch detailed order information from Shopify, including the order closing date and the products involved.\n\n3. Based on the order date, the workflow calculates the number of days the customer has been inactive. If this period exceeds a defined threshold (e.g., 30 days), the corresponding records are sent via API to Beex, where each customer enters a multi-step contact sequence that may include WhatsApp, email, and other channels. \n\nExample: \"Customers can then expect to receive a limited-time discount coupon invitation as part of the reactivation strategy\".\n\n![beex_sequence.PNG](fileId:2768)\n\n## How to set up\n1. Before importing the template, make sure to install the Beex node using the following package name: n8n-nodes-beex\n2. Configure your Shopify credentials according to your store’s settings. You will need to provide:\n\t- Your store subdomain\n\t- Your Access Token\n\t- Your App Secret Key\n3. For Beex users with platform access (if you need a trial, please contact frank@beexcc.com), go to the main dashboard and navigate to:\nPlatform Settings → API KEY & Callback\nThere, you can retrieve your API key and insert it into the corresponding Beex node within n8n.\n\n![beex_api_key.PNG](fileId:2769)\n\n## Requirements\n- You need accounts for: \n\t- Beex (omnichannel contact platform)\n\t- Shopify (E-commerce platform builder)\n- You need in Beex (Node): \n\t- Portfolio ID\n\t- Sequence ID\n- The above determines the sequence of contact that customers are subjected to.\n## How to customize\n- You can also change the threshold to define from what extent you consider that a client is inactive.\n- You can configure a particular sequence in Beex to contact your inactive customers to insert them into the node.\n",
  "featuredImage": "/data/workflows/9160/9160.webp",
  "author": {
    "id": 101,
    "slug": "zapix",
    "name": "Beex",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 162,
  "downloads": 16,
  "createdAt": "2025-10-01T16:47:46.911Z",
  "updatedAt": "2026-01-16T08:59:17.908Z",
  "publishedAt": "2025-10-01T16:47:46.911Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9160"
}