{
  "id": 6449,
  "slug": "6449",
  "title": "Generate AI video sales letters with Google VEO3, Creatomate captions & Facebook publishing",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# VEO3 VSL Generator & Facebook Auto-Publisher\n\n## What this workflow does\n\nThis n8n workflow automates the full process of creating a short-form Video Sales Letter (VSL) using Google VEO3, adding captions via Creatomate, and publishing the final video directly to a Facebook Page.\n\nIt's designed for creators, ecommerce brands, and marketers who want to generate and publish high-converting videos without video editing, manual uploads, or third-party tools.\n\n## Technologies used\n\n- Google Vertex AI (VEO3) – for AI-generated video generation\n- Creatomate – for dynamic captioning\n- Google Cloud Storage – for video hosting (public access)\n- Upload Post – for direct video publishing\n- OpenAI (optional) – for script generation\n- n8n – as the automation engine\n\n## Required inputs\n\nThe workflow starts from a form and expects:\n\n- `Product Name` – the product or offer to promote\n- `Product Image` – a visual representation of the product\n\nOptional:\n- `Prompt override` – custom prompt text if you want to bypass the AI script generation\n\n## Output\n\n- One AI-generated vertical video (9:16), rendered via VEO3\n- Captions applied automatically via Creatomate\n- Final video posted to your connected Facebook Page\n- File stored in Google Cloud Storage with public access\n\n## Documentation\n\nThis template includes full step-by-step setup instructions:\n\n- Setting up JWT credentials for Google VEO3\n- Configuring a public GCS bucket\n- Creating and connecting a Creatomate API key\n- Generating a long-lived Facebook Page token\n- Connecting credentials inside n8n\n- Editing the form, caption templates, and upload destination\n- Notes on maintenance, quota limits, and API behavior\n\n## Customization\n\nThis workflow is modular and easy to adapt. You can:\n\n- Replace the form trigger with Google Sheets, Airtable, or webhook\n- Swap Facebook with Instagram, LinkedIn, or Telegram\n- Modify prompt structure, voice, visual style, or caption format\n\n## Summary\n\nJust submit a product name and image via form — and get a ready-to-publish VSL on your Facebook Page. Fast, automated, and fully editable.\n",
  "featuredImage": "/data/workflows/6449/6449.webp",
  "author": {
    "id": 101,
    "slug": "lukaszb",
    "name": "LukaszB",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 158,
  "downloads": 15,
  "createdAt": "2025-07-25T16:40:49.309Z",
  "updatedAt": "2026-01-16T08:45:03.136Z",
  "publishedAt": "2025-07-25T16:40:49.309Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6449"
}