{
  "id": 8780,
  "slug": "8780",
  "title": "🛠️ Re-Access Binary Data from Any Previous Node",
  "description": "## How it works\n\nEver had binary data (like images, PDFs, or files) disappear in your n8n workflow after an intermediate node processed it? This workflow provides a powerful solution by demonstrating how to re-access and re-attach binary data from *any* previous node, even if it was dropped along the way. Think of it like having a reliable backup copy of your file always available, no matter what happens to the original as it moves through your workflow.\n\nHere's how this template works step-by-step:\n\n1.  **Initial Binary Fetch:** The workflow starts by fetching a binary image (the n8n logo) from a URL using an `HTTP Request` node. This is our original binary data.\n2.  **Simulated Data Loss:** A `Set` node then processes this data. Crucially, by default, `Set` nodes (and many others) do not pass binary data to subsequent nodes. This step intentionally simulates a common scenario where your binary data might seem to \"disappear\" from the workflow's output.\n3.  **Re-Access and Re-Attach:** The core of the solution is a `Code` node. It uses a specific n8n expression (`$(nodeName).item`) to reach back to the *original* node that produced the binary data (`Get n8n Logo (Binary)`). It then retrieves that binary data and uses `this.helpers.prepareBinaryData()` to correctly re-attach it to the current item, making it available for all subsequent nodes.\n\n## Set up steps\n\n**Setup time: 0 minutes!**\n\nThis is a self-contained tutorial workflow, so no external accounts or credentials are required.\n\n1.  Simply click the **\"Execute Workflow\"** button to run it.\n2.  Observe the output of the `Re-Access Binary Data from Previous Node` to see the binary data successfully re-attached.\n3.  **Important for Customization:** If you adapt this technique to your own workflows, remember to update the `previousNodeName` variable within the `Re-Access Binary Data from Previous Node` (Code node) to match the exact name of the node that originally produced the binary data you wish to retrieve.",
  "featuredImage": "/data/workflows/8780/8780.webp",
  "author": {
    "id": 101,
    "slug": "lucaspeyrin",
    "name": "Lucas Peyrin",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "File Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1139,
  "downloads": 113,
  "createdAt": "2025-09-20T15:28:27.172Z",
  "updatedAt": "2026-01-16T08:57:38.695Z",
  "publishedAt": "2025-09-20T15:28:27.172Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8780"
}