{
  "id": 9551,
  "slug": "9551",
  "title": "Indonesian stock market research agent with Sectors App, Gemini & Tavily",
  "description": "### This n8n workflow demonstrate how to configure AI Agent for financial research purposes especially for IDX data through Sectors App API.\nuse cases: \n* research stock market in Indonesia.\n* analyze the performance of companies belonging to certain subsectors or company\n* comparing financial metrics between BBCA and BBRI\n* providing technical analysis for certain ticker stock movement\n* *and many more*\n\nall from conversational agent UI chat.\n\n### Main components \n* **Input-n8nChatNative**: handling and process input from native n8n chat ui\n* **Input-TelegramBot**: handling and process input from Telegram Bot\n* **Input-WebUI(Webhook)**: handling and process input from hosted Web UI through webhook\n* **Main Agent**: processing raw user queries and delegate task to specialized agent if needed.\n* **Spec Agent - Sectors App**: make request to Sectors App API to get real time financial data listed in IDX from available endpoint\n* **Spec Agent - Web Search**: make web search from Google Grounding (Gemini API) and Tavily Search.\n* **Vector Document Processing**: process document upload from user into embedding and vector store.\n\n### How it works\n* user queries may received from multiple platform (we use three here: Telegram, hosted Web UI, and native n8n chat UI)\n* if user also uploading document, it will process the document and store it in vector store\n* the request send to the Main Agent to process the queries\n* the Main Agent decide the task to delegate to Specialized Agent if nedded.\n* the result then sent back to user based on the platform\n\n### How to use\nYou need this API:\n* Gemini API: get it free from https://aistudio.google.com/\n* Tavily API: get it free from https://www.tavily.com/\n* Sectors App API: get it from https://sectors.app/api/\n\n*you can optionally change the model or adding fallback model to handle token request, cause it may use quite many tokens.*\n",
  "featuredImage": "/data/workflows/9551/9551.webp",
  "author": {
    "id": 101,
    "slug": "hoorahyeah",
    "name": "Dzaky Jaya",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 220,
  "downloads": 22,
  "createdAt": "2025-10-13T04:21:14.900Z",
  "updatedAt": "2026-01-16T09:00:55.520Z",
  "publishedAt": "2025-10-13T04:21:14.900Z",
  "nodes": 44,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9551"
}