{
  "id": 6521,
  "slug": "6521",
  "title": "Automated email validation for Google Sheets using Rapid Email Verifier",
  "description": "# **Automated Email Verification for Google Sheets**\n\nThis n8n template demonstrates how to automatically validate email addresses from your Google Sheets using a reliable email verification API. Perfect for cleaning contact lists, validating leads, and ensuring email deliverability before marketing campaigns.\n\nUse cases are many: Lead qualification for sales teams, contact list cleaning for marketing, subscriber validation for newsletters, or CRM data hygiene maintenance!\n\n## **Good to know**\n- The rapid-email-verifier API is free for up to 1,000 verifications per month\n- Each email verification typically takes less than 500ms to complete\n- The workflow runs automatically every hour, checking for new entries\n- Only processes emails that haven't been verified yet, preventing duplicate API calls\n\n## **How it works**\n1. **Monitor Google Sheets**: The trigger watches your spreadsheet for new email entries every hour\n2. **Smart Filtering**: Only emails with empty \"Email Verified\" columns are processed to avoid duplicates\n3. **Batch Processing**: Emails are processed one by one to respect API rate limits and ensure reliability\n4. **API Verification**: Each email is sent to the rapid-email-verifier service which returns validation status\n5. **Results Update**: The original sheet is updated with verification results (valid/invalid/unknown) using the Serial Number as a match key\n\nThe verification accuracy is consistently above 95% and shows excellent detection of invalid, disposable, and risky email addresses!\n\n## **How to use**\n1. The Google Sheets trigger monitors your spreadsheet automatically, but you can also test manually\n2. Simply add new rows with email addresses to your connected Google Sheet\n3. Leave the \"Email Verified\" column empty for new entries\n4. The workflow will automatically process and update the verification status\n\nTechnically, you can process unlimited emails, but consider API rate limits and costs for large batches.\n\n## **Requirements**\n- **Google Sheets account** with a spreadsheet containing columns: SrNo, Name, Email, Email Verified\n- **Google Sheets credentials** configured in n8n for both trigger and update operations\n- **Internet connection** for API access (no additional API key required for rapid-email-verifier)\n\n## **Customising this workflow**\nEmail verification can be enhanced for many use-cases:\n- **Add webhook trigger** for real-time verification when leads are captured\n- **Connect to CRM systems** like HubSpot or Salesforce for direct integration  \n- **Add email categorization** to separate personal vs business emails\n- **Include bounce detection** by connecting to your email service provider\n- **Set up notifications** to alert when invalid emails are detected in important lists\n\nThis template is perfect for marketing managers, sales professionals, data analysts, and anyone managing contact databases who needs reliable email validation!",
  "featuredImage": "/data/workflows/6521/6521.webp",
  "author": {
    "id": 101,
    "slug": "ramse",
    "name": "Gaurav Ramse",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 222,
  "downloads": 22,
  "createdAt": "2025-07-27T07:25:12.737Z",
  "updatedAt": "2026-01-16T08:45:25.897Z",
  "publishedAt": "2025-07-27T07:25:12.737Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6521"
}