{
  "id": 11590,
  "slug": "11590",
  "title": "Automate personalized lead responses with website scraping, GPT-4o, and Airtable CRM",
  "description": "This n8n template automatically processes inbound form leads, researches their company via their website, and uses AI to write and send a highly personalized \"speed to lead\" email instantly. It also tracks subsequent appointment bookings to keep your CRM up to date.\n\nUse cases are focused on high velocity sales: Perfect for agency owners, founders, and sales teams who need to respond to new leads in seconds while maintaining a high quality, personal touch.\n\n## Good to know\nAt the time of writing, this template is optimized for GPT-4o to ensure the highest quality personalization.\nThis template was originally designed using a Lovable form, but it works with any form builder (Typeform, Webflow, WordPress) that can send data via a webhook.\n\n## How it works\n* The workflow starts when a new lead submits your contact form via the Webhook node.\n* It immediately checks your Airtable CRM to ensure the lead is new and not a duplicate.\n* The system scrapes the provided website URL and uses custom code to clean the HTML data.\n* AI analyzes the cleaned website data to generate a concise summary of the business.\n* A second AI step uses this summary and the lead's goals to draft and send a personalized email via Gmail.\n* The lead data and website summary are logged into your Airtable base.\n* A parallel flow monitors your inbox for booking confirmations and updates the CRM automatically.\n\n## How to use\n* Create the necessary Base and Table in Airtable to store your leads.\n* Connect your website form to the Webhook URL in the workflow.\n* Update the OpenAI node prompts with your specific email signature and phone number.\n* Run a test submission to ensure the website scraper is capturing data correctly.\n\n## Requirements\n* Airtable account\n* OpenAI account (GPT-4o model recommended)\n* Gmail account\n\n## Customising this workflow\nYou can easily adapt this for different communication channels. Try swapping the Gmail node for a Slack notification to alert your team of high value leads, or connect it to HubSpot instead of Airtable for enterprise CRM management.",
  "featuredImage": "/data/workflows/11590/11590.webp",
  "author": {
    "id": 101,
    "slug": "jordan-ai-16",
    "name": "Jordan",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 97,
  "downloads": 9,
  "createdAt": "2025-12-08T06:08:01.442Z",
  "updatedAt": "2026-01-16T09:09:14.142Z",
  "publishedAt": "2025-12-08T06:08:01.442Z",
  "nodes": 51,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11590"
}