{
  "id": 8863,
  "slug": "8863",
  "title": "Create personalized news digests from RSS feeds with GPT & Gemini via email/Telegram",
  "description": "This workflow provides an intelligent automation solution for **processing RSS feeds** using **ScrapeGraph API** and **delivering personalized news summaries** via email and Telegram. \n\n---\n\n### Key Benefits\n\n**Time-Saving Automation**\n- ✅ Eliminates manual news monitoring by automatically processing RSS feeds\n- ✅ Filters content to show only articles from the last 24 hours\n- ✅ Reduces information overload by limiting to the 3 most recent relevant articles\n\n**Multi-Channel Distribution**\n- ✅ Delivers summaries simultaneously via email and Telegram\n- ✅ Ensures you stay informed across your preferred communication platforms\n- ✅ Provides flexibility in how you consume your daily news digest\n\n**AI-Powered Content Processing**\n- ✅ Uses [ScrapeGraphAI](https://dashboard.scrapegraphai.com/?via=n3witalia) to convert web articles into clean, readable markdown\n- ✅ Employs multiple AI models (OpenAI GPT and Google Gemini) for robust content extraction\n- ✅ Generates structured, coherent summaries that highlight key concepts and main ideas\n\n**Quality Content Filtering**\n- ✅ Automatically filters out outdated content (older than 24 hours)\n- ✅ Focuses on the most recent and relevant articles\n- ✅ Processes only high-quality content through intelligent extraction algorithms\n\n---\n\n### **How it Works**\n\n\n1.  **Trigger & Data Fetching:** The workflow starts manually. It reads a specified RSS feed and immediately filters the items to keep only those published within the last 24 hours, ensuring the digest is current.\n\n2.  **Content Processing:** For each recent article (up to a limit of 3), the workflow performs a two-step process:\n    *   **Scraping:** It visits the article's URL using [ScrapeGraphAI](https://dashboard.scrapegraphai.com/?via=n3witalia) to extract the main content and convert it into clean text.\n    *   **Information Extraction:** A Language Model (Google Gemini) analyzes the scraped text to identify and extract the most relevant information, discarding superfluous content like ads or navigation menus.\n\n3.  **Digest Generation & Delivery:** The extracted content from all articles is aggregated. A powerful Language Model (OpenAI) is then instructed to synthesize this information into a well-structured summary with a clear subject and body, formatted as an email. Finally, this generated digest is sent simultaneously to a specified email address via Gmail and to a Telegram channel or chat.\n---\n\n\n### **Set up Steps**\n\nBefore executing the workflow, you need to configure the following steps:\n\n1.  **Install the Community Node:** Install the **ScrapeGraphAI node** from the n8n community nodes list. This node is essential for scraping article content and is not part of the core n8n installation.\n\n2.  **Configure Credentials:** Ensure the following credentials are correctly set up in your n8n instance:\n    *   `ScrapegraphAI account`: For the web scraping functionality.\n    *   `OpenAi account`: For the summary generation.\n    *   `Gmail account`: To send the email.\n    *   `Telegram account`: To send the Telegram message.\n\n3.  **Set Key Parameters:** Update the workflow with your specific details:\n    *   In the **\"RSS Read\"** node: Replace `URL_FEED` with the actual URL of the RSS feed you want to monitor.\n    *   In the **\"Send to Telegram\"** node: Replace `YOUR_CHAT_ID` with the unique identifier of your Telegram channel or chat.\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/).",
  "featuredImage": "/data/workflows/8863/8863.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 585,
  "downloads": 58,
  "createdAt": "2025-09-23T11:27:16.827Z",
  "updatedAt": "2026-01-16T08:58:04.484Z",
  "publishedAt": "2025-09-23T11:27:16.827Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8863"
}