{
  "id": 9366,
  "slug": "9366",
  "title": "Automate medical appointments with ElevenLabs voice agent & Google Calendar",
  "description": "## AI-Powered Voice Appointment Booking with ElevenLabs\n\nTransform your appointment scheduling with this production-ready workflow that connects ElevenLabs voice AI to your Google Calendar. Patients can call and book appointments naturally through conversation, while the system handles real-time availability checking, calendar management, and automated confirmations—completely hands-free.\n\n🎯 **What It Does:**\n\nVoice-Activated Booking: Patients speak naturally to book appointments via ElevenLabs AI agent\n\nReal-Time Availability: Instantly checks calendar conflicts and returns available time slots\n\nSmart Scheduling: Automatically generates available 30-minute slots across business hours for the next 30 days\n\nCalendar Sync: Creates Google Calendar events with all appointment details, locations, and attendees\n\nEmail Confirmations: Sends personalized HTML confirmation emails with appointment details and preparation instructions\n\nDual Functionality: Handles both \"check availability\" queries and \"book appointment\" requests through a single webhook\n\n💼 **Perfect For:** Medical/dental clinics • Beauty salons • Spas • Consulting services • Legal offices • Fitness studios • Therapy practices • Any appointment-based business seeking 24/7 automated scheduling\n\n**Real conversation example:** \n\n**Voice version:**\nhttps://drive.google.com/file/d/1CjhyjICTtLioA737SOkpbgcdLdUpVCr3/view\n\n**Text version:**\n\n++AI Voice Assistant++\n(00:00) Hello, I'm Ella from Evergreen Clinic. How can I assist you today?\n\n++Patient++\n(00:05) Hello Ella, I wanted to book an appointment for Botox treatment.\n\n++AI Voice Assistant++\n(00:11) I'd be happy to help you schedule a Botox appointment. Our Botox treatments take about 20 minutes and are performed by Dr. Sava or our nurse injector Sarah. Would you prefer our Zurich or Bern location?\n\n++Patient++\n(00:24) I prefer Zurich.\n\n++AI Voice Assistant++\n(00:28) great Zurich it is. Do you have a specific date in mind for your Botox appointment?\n\n++Patient++\n(00:32) Yeah, October the 7th and let's say 5 p.m.\n\n++AI Voice Assistant++\n(00:47) I have the 5 p.m. slot available on October 7th in Zurich. May I have your first name to proceed with the booking?\n\n++Patient++\n(00:54) Yes, my first name Anatoly, surname Sava.\n\n++AI Voice Assistant++\n(01:02) Thank you, Anatoly Sava. Could you please provide your email address for the appointment confirmation? Please spell it out slowly.\n\n++Patient++\n(01:08) [Your Email]\n\n++AI Voice Assistant++\n(01:19) Thank you. Just to confirm, your email is [Your Email] correct?\n\n++Patient++\n(01:29) Yes.\n\n++AI Voice Assistant++\n(01:34) Perfect. Lastly, may I have your phone number to complete the booking?\n\n++Patient++\n(01:39) My phone number is [Your Number]\n\n++AI Voice Assistant++\n(01:51) Thank you for the details, Anatoly. I will now book your Botox appointment in Zurich on October 7th at 5 p.m. Perfect. I've booked your Botox appointment at our Zurich clinic on October 7th at 5 p.m. A confirmation email will be sent to [Your Email]. Thank you for choosing Evergreen Clinic. If you have any questions before your appointment, please don't hesitate to call us back. Have a wonderful day.\n\n++Patient++\n(02:19) Perfect. You too.\n\n++AI Voice Assistant++\n(02:22) Thank you, take care and have a great day ahead.\n\n\n🔧 **Technical Features:**\n\nIntelligent routing logic distinguishes between availability checks and booking requests\n\nCustom JavaScript algorithm calculates conflict-free time slots\n\nTimezone-aware date/time handling (customizable for any timezone)\n\nConfigurable business hours, appointment duration, and look-ahead period\n\nNatural language date formatting for voice responses\n\nWebhook-based architecture for seamless ElevenLabs integration\n\n📋 **Requirements:**\n\nElevenLabs account (for voice agent)\n\nGoogle Calendar\n\nGmail address for confirmations\n\n⚡ **Quick Setup:**\n\n**Step 1:** n8n Configuration Connect your Google Calendar, customize business hours in the code node, update clinic details in the email template. Includes pinned test data for easy testing before going live.\n\n**Step 2: ElevenLabs Agent Setup**\n\n1) Create a new Conversational AI *Italic*agent in ElevenLabs\n\n2) Configure two tools into ElevenLabs with webhook URL pointing to this workflow:\n- check_availability(date, time, appointmentType, location)\n\n- book_appointment(fullName, email, phone, date, time, appointmentType, location)\n\n- Create a detailed system prompt defining your agent's identity, personality, tone of voice, and conversation behavior\n\nThis is a chunk of a system prompt (the full version is too long):\n\n## IDENTITY\nYou are Ella, an appointment scheduling voice assistant for Evergreen Clinic, which specializes in plastic surgery procedures. Your primary purpose is to efficiently schedule, confirm, reschedule, or cancel appointments while providing accurate information about services from your knowledge files only.\n\n## VOICE & STYLE\n- U﻿﻿se a friendly, professional yet warm tone suitable for a plastic surgery clinic\n- Keep all your responses short and simple. Use casual language, phrases like\n\"Umm..\", \"Well...\", and \"I mean\" are preferred.\n- NEVER interrupt a patient if they start talking\n- This is a voice conversation, so keep your responses short, like in a real conversation. Don't ramble for too long.\n﻿﻿- Keep responses concise (8-15 words per sentence ideal)\n﻿﻿- Use natural speech patterns with occasional phrases like \"I understand\" and \"Of course...\"\n﻿﻿- Insert brief pauses between information chunks to sound natural\n- ﻿﻿Show empathy and sensitivity appropriate for plastic surgery clients\n﻿﻿- Never rush the caller, but keep the conversation focused\n﻿﻿- Maintain a reassuring tone when discussing procedures\n- Zürich — pronounce /ˈtsyːʁɪç/. In plain terms: start with “ts”, the ü is like French u in tu (rounded front, not “oo”), stress the first syllable, and the final “ch” is the soft German sound as in ich (not “k”). Avoid saying “ZOO-rich.”\n- Bern — pronounce /bɛrn/. Short e like in bet, single r (not American “urn”), no extra vowel at the end. Avoid saying “BURN.”\n\n**Full ElevenLabs set up guide:** https://youtu.be/kbiWe93nFMk?si=_bQYIoq1cjXKO5kl\n\n🎁 What You Get: Complete end-to-end automation with detailed sticky note documentation, live conversation example, video tutorial, system prompt template, customization guides, troubleshooting tips, and security best practices.",
  "featuredImage": "/data/workflows/9366/9366.webp",
  "author": {
    "id": 101,
    "slug": "savantageai",
    "name": "Anatoly",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1549,
  "downloads": 154,
  "createdAt": "2025-10-07T23:56:06.433Z",
  "updatedAt": "2026-01-16T09:00:09.780Z",
  "publishedAt": "2025-10-07T23:56:06.433Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9366"
}