{
  "id": 4971,
  "slug": "4971",
  "title": "Automated breaking news headlines with LLaMA3, Google Search and X posting",
  "description": "This n8n workflow automates the process of finding, summarizing, and posting breaking news headlines on X (formerly Twitter). It combines Google Custom Search for finding the latest news articles with Groq's LLaMA 3 model to generate short, engaging headlines — complete with hashtags — and posts them on your X account.\n\n🔧 **Features**\n\nCustom topic support (e.g., \"AI\", \"health\", \"technology\")\n\nAutomated scheduling every few hours\n\nGoogle Custom Search to find the most recent news articles\n\nGroq LLaMA3-based headline generation with hashtags\n\n**Auto-post to X (Twitter)**\n\nBuilt-in credential separation for API keys and access tokens\n\n📦 **Included Nodes**\n\nSchedule Trigger\n\nSet (Set Topic, Google API Key, Custom Search CX, etc.)\n\nHTTP Request (Google Search API)\n\nCode Node (Format prompt and extract article data)\n\nHTTP Request (Groq API for headline generation)\n\nTwitter Node (Post to X)\n\n⚙️ **How It Works (Step-by-Step)**\n\nTrigger\n- The workflow starts on a scheduled interval (default: every 5 hours, at a random minute within the hour).\n\nSet Topic\n- You can define your own topic keyword (e.g., AI, mental health, climate change) by editing the Set Topic node.\n\nBuild Search Query\n- Constructs a Google search query like:\nlatest {topic} news.\n\nGoogle API Config\n- Injects your own Google API Key and Custom Search CX (replace the placeholders in the Google Config node).\n\nSearch for News\n- Performs a real-time search using Google Custom Search API and fetches the latest article result.\n\nGenerate Prompt for AI\n- A JavaScript Function node extracts the top article’s title and link, formats it into a clean prompt including instructions to append hashtags.\n\nGroq AI Request\n- Sends the prompt to Groq’s LLaMA 3 model to generate a concise, tweet-length headline with 1–2 relevant hashtags.\n\nPost to Twitter (X)\n- The generated headline is posted to your connected X account via the Twitter OAuth2 API.\n\n✅ **Requirements**\n\n- Google API Key\n\n- Google Custom Search Engine (CX)\n\n- Groq API Key\n\n- Twitter Developer App with OAuth2 credentials\n\n💡 **Customization Tips**\n\n- Change the topic in the Set Topic node to anything you like.\n\n- Adjust the posting frequency in the Schedule Trigger node.\n\n- Modify prompt behavior in the Function node to fit a specific tone or brand voice.\n\n- Add logging, filtering, or multiple post variations as needed.",
  "featuredImage": "/data/workflows/4971/4971.webp",
  "author": {
    "id": 101,
    "slug": "sky-twinclouds",
    "name": "Afnan",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3884,
  "downloads": 388,
  "createdAt": "2025-06-16T13:31:51.696Z",
  "updatedAt": "2026-01-16T08:37:05.922Z",
  "publishedAt": "2025-06-16T13:31:51.696Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4971"
}