{
  "id": 5833,
  "slug": "5833",
  "title": "Automate Instagram carousel posts with Google Sheets, Drive & Cloudinary",
  "description": "## Who is this for?\n\nThis workflow is ideal for social media managers, content creators, marketers, and small businesses who want to automate Instagram Carousel posts using Google Sheets and Google Drive. It is also suitable for anyone looking to streamline repetitive Instagram publishing tasks with n8n, Cloudinary, and the Instagram Graph API.\n\n## What problem is this workflow solving? / Use case\n\nManaging and publishing Instagram Carousel posts manually can be time-consuming, especially when handling multiple accounts or campaigns. This workflow solves that by automatically fetching scheduled posts from Google Sheets, uploading images from Google Drive to Cloudinary, and publishing them to Instagram, saving time and reducing the risk of errors.\n\n## What this workflow does\n\nThis n8n workflow checks a Google Sheet every 5 minutes for new Carousel posts marked as \"ToDo.\" When found, it uploads images from a specified Google Drive folder to Cloudinary, prepares the media on Instagram using the Graph API, and publishes the Carousel post with the given caption.\n\n## Setup\n\n- Prepare a Google Sheet to track posts and image folder URLs.\n Example : https://docs.google.com/spreadsheets/d/1WEUHeQXFMYsWVAW3DykWwpANxxD3DxH-S6c0i06dW1g/edit?usp=sharing\n- Upload post images to a dedicated Google Drive folder.\n- Set up a Cloudinary account and gather API credentials.\n- Obtain Instagram `access_token` and `ig_business_id` for API publishing.\n- Configure the n8n workflow with required credentials and your custom intervals.\n\n## How to customize this workflow to your needs\n\n- Adjust the schedule trigger interval to fit your publishing frequency.\n- Expand the Google Sheet with additional metadata as required.\n- Modify the filter logic to support different content types or statuses.\n- Add extra automation steps, such as sending notifications after publishing.\n",
  "featuredImage": "/data/workflows/5833/5833.webp",
  "author": {
    "id": 101,
    "slug": "henry",
    "name": "Henry",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 6605,
  "downloads": 660,
  "createdAt": "2025-07-10T08:29:17.367Z",
  "updatedAt": "2026-01-16T08:41:38.146Z",
  "publishedAt": "2025-07-10T08:29:17.367Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5833"
}