{
  "id": 6496,
  "slug": "6496",
  "title": "Extract Gmail metadata to Google Sheets",
  "description": "Extract Gmail Metadata to Google Sheets\n\nThis n8n template shows how to fetch new emails from a Gmail account, extract key metadata (sender name, email, subject, and message body), and append each email as a new row in a Google Sheet for record-keeping or follow-up workflows.\n\nGood to Know\n\nGmail API Quotas: Gmail’s API has usage limits—make sure your application stays under 2500 read requests per day or implement exponential backoff on rate limit errors.\n\nOAuth Credentials: You’ll need to configure OAuth2 credentials in n8n to authenticate with Gmail.\n\nSheet Structure: Prepare your Google Sheet with columns: Timestamp, Sender Name, Sender Email, Subject, Message.\n\nHow It Works\n\nGmail Trigger: Watches for new emails matching your search criteria (e.g., is:unread).\n\nExtract Metadata: A Function node reads the incoming payload and pulls:\n\nName and Email from headers or body text\n\nSubject from common subject fields\n\nMessage from body, text, or snippet\n\nTimestamp from current system time\n\nAppend to Sheet: The Google Sheets node appends each processed email as a row in your target spreadsheet.\n\nHow to Use\n\nImport the Template: Click \"Use Template\" in your n8n instance.\n\nConfigure Credentials:\n\nGmail OAuth2: Set up your Gmail account credentials in n8n.\n\nGoogle Sheets: Authorize with your Google account and select the spreadsheet.\n\nAdjust Search Criteria: Modify the Gmail Trigger to filter specific labels or queries.\n\nActivate and Test: Enable the workflow and send a test email.\n\nVerify Sheet: Check your Google Sheet for new rows with the extracted email data.\n\nRequirements\n\nn8n@latest\n\nGmail OAuth2 Credentials\n\nGoogle Sheets API enabled in your Google Cloud project\n\nCustomizing This Workflow\n\nAdditional Fields: Extend the Function node to capture attachments, threads, or labels.\n\nNotification Flow: Add Slack or email nodes to notify your team of important messages.\n\nData Enrichment: Integrate with NLP or sentiment analysis APIs to annotate messages.\n\n",
  "featuredImage": "/data/workflows/6496/6496.webp",
  "author": {
    "id": 101,
    "slug": "mohammedabid",
    "name": "Mohammed Abid",
    "avatar": ""
  },
  "categories": [
    "Ticket Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 663,
  "downloads": 66,
  "createdAt": "2025-07-26T17:22:54.604Z",
  "updatedAt": "2026-01-16T08:45:17.521Z",
  "publishedAt": "2025-07-26T17:22:54.604Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6496"
}