{
  "id": 5086,
  "slug": "5086",
  "title": "Generate personalized tour itineraries via email with GPT-4o and Pinecone",
  "description": "# **🏖️ AI-Based Tour Itineraries via Email Using OpenAI & Pinecone Vector Search**\n\n## **Overview**\nThis workflow automates the process of handling new tour package requests received via email, analyzes the request, and provides personalized tour package recommendations using AI and a vector database. It’s designed to streamline customer interactions and deliver quick, relevant responses.\n\n## **Precondition** \n1. Create a Embedded Tour Package Database (refer to the link below):\n[Pinecone Database setup](https://creators.n8n.io/workflows/5085)\n2. Register and create API Keys for OpenAI, Pinecone Database.\n3. Copy Mail Credentials to access Email Inbox from n8n node \n![image.png](fileId:1755)\n\nThis workflow automates the process of extracting tour information from PDF files stored in a Google Drive folder, processes and vectorizes the extracted data, and stores it in a Pinecone vector database for efficient querying. This is especially useful for building AI-powered search or recommendation systems for travel packages.\n\n\n\n## **🛠️ Tools & Nodes Used**\n**Email Trigger (IMAP):** Monitors the inbox for new tour package requests.\n**Text Classifier:** Categorizes incoming emails (e.g., New Request, Follow-up, Other).\n**Code Node:** Extracts and structures relevant data from the email (subject, sender, content, etc.).\n**Tour Recommendation AI Agent:** An AI agent that interprets the request and formulates a prompt for package recommendations.\n**OpenAI & OpenRouter Chat Models:** Used for natural language understanding and generating responses.\n**Simple Memory:** Maintains context for ongoing conversations.\n**Pinecone Vector Store:** Stores and retrieves tour packages using semantic search.\n**Embeddings (OpenAI):** Converts text data into vector embeddings for similarity search.\n**Answer Questions with a Vector Store:** Retrieves the most relevant packages from Pinecone.\n**Send Email:** Sends the AI-generated recommendations back to the customer.\n\n### **🔄 Process & Flow**\n**Email Reception:** The workflow starts with the Email Trigger (IMAP) node, which listens for new emails in the inbox.\n**Classification:** The Text Classifier node determines if the email is a new tour package request.\n**Data Extraction:** The Code node parses the email, extracting key details like sender, subject, and content.\n**AI Agent Processing:** The Tour Recommendation AI Agent receives the structured request and crafts a prompt for package recommendations.\n**Vector Search:** The agent queries the Pinecone Vector Store, which holds previously created tour packages, using OpenAI embeddings for semantic matching.\n![image.png](fileId:1754)\n**Recommendation Generation:** The AI agent selects the top 3 most relevant packages and generates a friendly, personalized response.\n**Response Delivery:** The Send Email node sends the recommendations back to the customer.\n\n**🚀 Recommendations & Improvements for Next Version**\n**Error Handling:** Add error handling nodes to manage failed email parsing or AI response issues.\n**Logging & Analytics:** Integrate logging to track requests, recommendations, and customer responses for continuous improvement.\n**Personalization:** Enhance the AI agent to consider customer history or preferences for even more tailored recommendations.\n**Multi-language Support:** Add language detection and translation for international customers.\n**Feedback Loop:** Include a mechanism for customers to rate recommendations, feeding this data back into the system for improved future suggestions.\n**Attachment Handling:** Enable the workflow to process attachments (e.g., customer itineraries or preferences).\n**Scalability:** Consider batching or queueing requests if email volume increases.\n\n### **💡 Conclusion**\nThis workflow demonstrates how n8n, combined with AI and vector databases, can automate and personalize customer service in the travel industry. With a few enhancements, it can become even more robust and customer-centric!",
  "featuredImage": "/data/workflows/5086/5086.webp",
  "author": {
    "id": 101,
    "slug": "mohan",
    "name": "Mohan Gopal",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI RAG"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 215,
  "downloads": 21,
  "createdAt": "2025-06-21T06:48:00.254Z",
  "updatedAt": "2026-01-16T08:37:34.893Z",
  "publishedAt": "2025-06-21T06:48:00.254Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5086"
}