{
  "id": 10656,
  "slug": "10656",
  "title": "Transform video transcripts into multi-platform social media posts with Groq AI",
  "description": "# Overview\n\nThis workflow automates the process of turning your video transcripts into platform-specific social media posts using AI.\nIt reads any uploaded transcript file, analyzes the text, and automatically generates full-length, engaging posts with image prompts for Facebook, LinkedIn, Instagram, Reddit, and WhatsApp.\n\nPerfect for creators, marketers, and automation builders who want to repurpose long-form content into viral posts, all in one click.\n\n# How it Works\n\n- The Manual Trigger starts the workflow.\n\n- The Read Binary File node imports your video transcript (TXT format).\n- The Move Binary Data and Set nodes convert it into a text string for processing.\n- The AI Agent (LangChain) powered by Groq AI analyzes the transcript and generates human-like social media posts with realistic image prompts.\n- The Function Node parses and structures the output by platform.\n- The Google Sheets Node automatically saves all content — ready for scheduling or publishing.\n- The SerpAPI Integration enhances contextual awareness by referencing real-time search trends.\n\n# Set Up Steps\n\n- Setting up this workflow typically takes 5–10 minutes.\n- Connect your Google Sheets account (OAuth2).\n- Connect your Groq AI and SerpAPI credentials.\n- Upload your transcript file (e.g., from YouTube or podcast).\n- Run the workflow to instantly generate platform-specific posts and prompts.\n- View all results automatically saved in Google Sheets.\n- Detailed instructions are included as sticky notes inside the workflow.\n\n# Use Cases\n\n- Turn YouTube videos or podcasts into multi-platform social content\n- Auto-generate daily social posts using transcripts\n- Build AI-powered repurposing systems for agencies or creators\n- Save creative teams hours of manual copywriting work\n\n# Requirements\n\n- n8n account (self-hosted or cloud)\n- Groq AI API Key\n- SerpAPI Key (for optional trend enhancement)\n- Google Sheets connection",
  "featuredImage": "/data/workflows/10656/10656.webp",
  "author": {
    "id": 101,
    "slug": "shaheer03",
    "name": "Muhammad Shaheer Awan",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 70,
  "downloads": 7,
  "createdAt": "2025-11-09T13:54:45.191Z",
  "updatedAt": "2026-01-16T09:05:49.743Z",
  "publishedAt": "2025-11-09T13:54:45.191Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10656"
}