{
  "id": 5589,
  "slug": "5589",
  "title": "Create a multi-modal Telegram support bot with GPT-4 and Supabase RAG",
  "description": "## 🧠 What It Does\nThis n8n workflow turns your Telegram bot into a smart, multi-modal AI assistant that accepts **text**, **documents**, **images**, and **audio** messages, interprets them using OpenAI models, and responds instantly with context-aware answers.\nIt integrates a **Supabase vector database** to store document embeddings and retrieve relevant information before sending a prompt to OpenAI — enabling a full **RAG** experience\n\n## 💡 Why This Workflow?\nMost support bots can only handle basic text input. This workflow:\n- Supports multiple input formats (voice, documents, images, text)\n- Dynamically extracts and processes data from uploaded files\n- Implements RAG by combining user input with relevant memory or vector-based context\n- Delivers more accurate, relevant, and human-like AI responses.\n\n\n## 👤 Who It's For\n\n- Businesses looking to automate support using Telegram\n- Freelancers or solopreneurs offering AI Chatbots for businesses.\n- Creators building AI-powered bots for real use cases as it's great for Customer support knowledge, Legal or Policy document, long FAQs, Project documentation, and Product information retrieval.\n- Devs or analysts exploring AI + multi-format input + vector memory.\n\n## ⚙️ How It Works\n### 🗂️ Knowledge Base Setup\nRun the **“Add to Supabase Vector DB”** workflow manually to upload a document from your google drive and embed it into your vector database. This powers the Telegram chatbot’s ability to answer questions using your content. \n### 🔁 Telegram Message Routing\n1. **Telegram Trigger** captures the user message (Text, Image, Voice, Document)\n2. **Message Router** routes input by type using a Switch node\n3. Each type is handled separately:\n     - **Voice** → Translate recording to text (.ogg, .mp3)\n     - **Image** → Analyze image to text.\n     -  **Text** → Sent directly to AI Agent (.txt).\n     - **Document** → Parsed (e.g. .docx to .txt) accordingly.\n\n       #### 📎 Document Type Routing\n\n       Before routing documents by type, the **Supported  Document File Types** node first checks if the file extension is allowed. If not supported, it exits early with an error message — preventing unnecessary processing.\nSupported documents are then routed using the **Document Router** node, and converted to text for further processing.\n\n       #### Supported Document File Types\n       **.jpg**   **.jpeg**   **.png**   **.webp**   **.pdf**   **.doc**   **.docx**   **.xls**   **.xlsx**   **.json**   **.xml**.\n\n4. The text content is combined with stored memory and embedded knowledge using a **RAG** approach, enabling the AI to respond based on real uploaded data.\n   #### 🧠 RAG via Supabase\n   Uploaded documents are vectorized using OpenAI Embeddings. Embeddings are stored in Supabase with metadata. On new questions, the chatbot:\n   - Extracts question intent\n   - Queries Supabase for semantically similar chunks\n   - Ranks retrieved chunks to find the most relevant match.\n   - Injects them into the prompt for OpenAI. \n   - OpenAI generates a grounded response based on actual document content.\n\n5. Response is sent to the Telegram user with content awareness.\n\n## 🛠 How to Set It Up\n\n1. Open [n8n](https://www.n8n.io) or your local/self-hosted instance.\n2. Import the `.json\n` workflow file.\n3. Set up these credentials:\n   - **Google drive API Key**\n   - **Telegram API (Bot Token) [Guide](https://docs.n8n.io/integrations/builtin/credentials/telegram/?utm_source=n8n_app&utm_medium=credential_settings&utm_campaign=create_new_credentials_modal)**\n   - **OpenAI API**\n   - **Supabase API Key + Environment**\n   - **ConvertAPI API Key**\n   - **Postgres API Key**\n   - **Cohere API Key**\n   - **Add a prompt suited to your business.** Add a custom AI agent prompt that reflects your business domain, tone, and purpose. This is very important. Without it, your agent won't know how best to respond.\n4. Activate the workflow.\n5. Start testing by sending a message or document to your Telegram bot.\n",
  "featuredImage": "/data/workflows/5589/5589.webp",
  "author": {
    "id": 101,
    "slug": "kingsley",
    "name": "Ezema Kingsley Chibuzo",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 10579,
  "downloads": 1057,
  "createdAt": "2025-07-02T09:02:20.931Z",
  "updatedAt": "2026-01-16T08:40:25.357Z",
  "publishedAt": "2025-07-02T09:02:20.931Z",
  "nodes": 51,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5589"
}