{
  "id": 8209,
  "slug": "8209",
  "title": "Build a smart chatbot with GPT-5-nano, web search & conversational memory",
  "description": "This is an n8n workflow designed to implement an **advanced AI chatbot** with real-time conversation and search capabilities. Configured with a minimalist European design, this chatbot is ready to be integrated into any website.\n\n---\n\n#### What Does This Workflow Do?\n\nThe workflow uses a combination of nodes to create a complete chatbot:\n\n1.  **Chat Trigger**: Starts the process when a user sends a message. The configuration includes a customized visual design (minimalist European CSS), welcome messages, and titles.\n2.  **AI Agent**: Acts as the chatbot's brain. It coordinates interaction with the language model, memory, and tools to generate intelligent responses.\n3.  **Conversational Memory**: Allows the chatbot to remember the context of the conversation, providing a smoother and more coherent experience.\n4.  **Language Model (GPT)**: Generates the chat responses.\n5.  **Search Tool**: Enables the AI agent to search for information on the web and answer questions it doesn't already know.\n6.  **Respond to Chat**: Sends the final response back to the user.\n\n---\n\n#### Use Cases\n\n* **Customer Support**: Answers frequently asked questions and transfers complex conversations to a human agent.\n* **Virtual Assistant**: Provides information about products or services, helps users navigate your website, or completes simple tasks.\n* **Content Generator**: Serves as an assistant for generating ideas, writing drafts, or summarizing texts.\n\n---\n\n#### Who Is This For?\n\nThis workflow is ideal for:\n\n* **Businesses and developers** looking for a versatile and customizable chatbot solution without having to build it from scratch.\n* **Business owners** who want to improve customer service and user interaction in an automated way.\n* **Curious individuals** and AI enthusiasts who want to explore how chatbots are built and experiment with their own configurations.\n\nThis workflow includes **detailed documentation** that explains how each node works and how to customize it for your needs.",
  "featuredImage": "/data/workflows/8209/8209.webp",
  "author": {
    "id": 101,
    "slug": "oxsr11",
    "name": "Oriol Seguí",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1608,
  "downloads": 160,
  "createdAt": "2025-09-03T09:49:20.033Z",
  "updatedAt": "2026-01-16T08:54:40.094Z",
  "publishedAt": "2025-09-03T09:49:20.033Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8209"
}