{
  "id": 9885,
  "slug": "9885",
  "title": "Automate Instagram influencer lead collection with Apify, GPT and PostgreSQL",
  "description": "![Screen Shot 20251019 at 3.59.42 PM.png](fileId:3015)\nThis workflow is built for digital marketers, sales professionals, influencer agencies, and entrepreneurs who want to automate Instagram lead generation. If you’re tired of manually searching for profiles, copying email addresses, and updating spreadsheets, this automation will save you hours every week.\nIt turns your process into a smart system that finds, extracts, and stores leads while you focus on growing your business.\n\nHow it works / What it does\n\nThis n8n automation completely transforms how you collect Instagram leads using AI and API integrations.\n\nHere’s a simple breakdown of how it works:\n\n- Set your targeting parameters using the Edit Fields node. You can specify your platform (Instagram), field of interest such as “beauty & hair,” and target country like “USA.”\n\n- Generate intelligent search queries with an AI Agent powered by GPT-4o-mini. It automatically creates optimized Google search queries to find relevant Instagram profiles in your chosen niche and location.\n\n- Extract results from Google using Apify’s Google Search Scraper, which collects hundreds of Instagram profile URLs that match your search criteria.\n\n- Fetch detailed Instagram profile data using Apify’s Instagram Scraper. This includes usernames, follower counts, and profile bios where contact information usually appears.\n\n- Use AI to extract emails from the profile biographies with the Information Extractor node powered by GPT-3.5-turbo. It identifies emails even when they are hidden or creatively formatted.\n\n- Store verified leads in a PostgreSQL database. The workflow automatically adds new leads or updates existing ones with fields like username, follower count, email, and niche.\n\nOnce everything is set up, the system runs on autopilot and keeps building your database of quality leads around the clock.\n\nHow to set up\n\nFollow these steps to get your Instagram Lead Generation Machine running:\n\n1. Import the JSON file into your n8n instance.\n\n2. Add your API credentials:\n\n3. Apify token for the Google and Instagram scrapers\n\n4. OpenAI API key for the AI-powered nodes\n\n5. PostgreSQL credentials for storing leads\n\n6. Open the Edit Fields node and set your platform, field of interest, and target country.\n\n7. Run the workflow manually using the Manual Trigger node to test it.\n\nOnce confirmed, replace the manual trigger with a schedule or webhook to run it automatically.\nCheck your PostgreSQL database to ensure the leads are being saved correctly.\n\nRequirements\n\nBefore running the workflow, make sure you have the following:\n\n- An n8n account or instance (self-hosted or n8n Cloud)\n\n- An Apify account for accessing the Google and Instagram scrapers\n\n- OpenAI API access for generating smart search queries and extracting emails\n\n- A PostgreSQL database to store your leads\n\n- Basic understanding of how n8n workflows and nodes operate\n\nHow to customize the workflow\n\nThis workflow is flexible and can be customized to fit your business goals. Here’s how you can tailor it:\n\n- Change your niche or location by updating the Edit Fields node. You can switch from “beauty influencers in the USA” to “fitness coaches in Canada” in seconds.\n\n- Add more data fields to collect additional information such as engagement rates, bio keywords, or profile categories. Just modify the PostgreSQL node and database schema.\n\n- Connect to your CRM or email system to automatically send introduction emails or add new leads to your marketing pipeline.\n\n- Use different triggers such as a scheduled cron trigger for daily runs or a webhook trigger to start the workflow through an API call.\n\n- Filter higher-quality leads by adding logic to capture only profiles with a minimum number of followers or verified emails.",
  "featuredImage": "/data/workflows/9885/9885.webp",
  "author": {
    "id": 101,
    "slug": "fayzul-noor",
    "name": "Fayzul Noor",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 573,
  "downloads": 57,
  "createdAt": "2025-10-19T09:56:49.209Z",
  "updatedAt": "2026-01-16T09:02:28.116Z",
  "publishedAt": "2025-10-19T09:56:49.209Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9885"
}