{
  "id": 11407,
  "slug": "11407",
  "title": "Book club manager & recommendation engine with Mistral AI and Gemini Vision",
  "description": "## 📚 The Literary Curator: AI Book Club Manager & Recommendation Engine\nTransform your n8n instance into a sophisticated, automated backend for a book club. This \"Literary Curator\" workflow acts as an all-in-one administrator, archivist, and reading guide. It intelligently analyzes your club's collective reading history to generate personalized recommendations, onboard new members, and manage all your club's data via email, chat, and web forms.\n\n## ✨ Key Features\nAutomated Recommendation Engine: A weekly scheduled agent (using Mistral AI) analyzes the club's \"Book Archive\" to generate 10 fresh, non-duplicate book recommendations with witty, personalized \"Why This Read\" justifications.\n\nVisual Bookshelf Scanning: Uses Google Gemini Vision to analyze photos of physical bookshelves or Goodreads screenshots and automatically populate the database.\n\nThe \"Literary Oracle\" Chatbot: A conversational AI agent that has full context of the club's history. It can answer questions, add books to the archive, or manage members via chat.\n\nFull Member Management: Automated onboarding flows for new members, including welcome emails and database entry.\n\nMulti-Channel Interaction: Users can interact via Webhooks (API), n8n Forms, or Chat.\n\nWeekly Newsletters: Automatically compiles the AI's \"Vibe Check\" summary and top 10 recommendations into a beautifully formatted HTML email sent via Gmail.\n\n## 🤖 AI Models Used\nMistral Cloud (Large/Medium): Powers the core reasoning, recommendation logic, and the chat Oracle.\n\nGoogle Gemini (PaLM/Flash): Used for vision analysis (scanning bookshelf photos) and generating discussion prompts.\n\n## 🛠️ Setup Guide\nPrerequisites:\n\n\tn8n version with LangChain support.\n\n\tMistral Cloud API Key\n\n\tGoogle Gemini API Key\n\n\tGmail OAuth2 Credentials\n\n## 🚀 How to Use\n#### Automated Schedule\nBy default, the workflow runs every Friday at 7:00 PM. It checks the archive, generates a new weekly summary and recommendation list, saves it to the database, and emails all members.\n\n#### User Forms\nThe workflow includes built-in n8n Forms for user interaction:\n\n#### Feedback Form\nFor members to rate books or request specific genres.\n\nIdea Board: For submitting general reading ideas.\n\n#### Upload Form \nAccepts images of bookshelves or Goodreads exports to bulk-import reading history.\n\n\n### API / App Backend\nThis workflow exposes several POST webhooks (e.g., /api/ai/chat, /api/archive/add), allowing you to build a custom frontend (React, Glide, etc.) on top of this n8n workflow.",
  "featuredImage": "/data/workflows/11407/11407.webp",
  "author": {
    "id": 101,
    "slug": "jordanhoyle",
    "name": "Jordan Hoyle",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 20,
  "downloads": 2,
  "createdAt": "2025-12-01T17:30:45.572Z",
  "updatedAt": "2026-01-16T09:08:35.592Z",
  "publishedAt": "2025-12-01T17:30:45.572Z",
  "nodes": 170,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11407"
}