{
  "id": 11049,
  "slug": "11049",
  "title": "Generate professional documents with Claude AI skills🤹🤖 & upload to Google Drive",
  "description": "🤹🤖 This workflow (AI Document Generator with Anthropic Agent Skills and Uploading to Google Drive) automates the process of generating, downloading, and storing professionally formatted files (PDF, DOCX, PPTX, XLSX) using the **Anthropic Claude API** and **Google Drive**.\n\nThis workflow connects user prompts with the Anthropic API to generate professional documents in multiple formats, automatically retrieves and uploads them to Google Drive — providing a complete AI-powered document automation system.\n\n---\n\n### **Key Advantages**\n\n* **✅ Full Automation**\nFrom user input to file delivery, the entire pipeline — creation, extraction, download, and upload — runs without manual intervention.\n\n* **✅ Multi-Format Support**\nHandles four major business document types:\n\t* PPTX (Presentations)\n\t* PDF (Reports)\n\t* DOCX (Documents)\n\t* XLSX (Spreadsheets)\n\n* **✅ Professional Output**\nEach format includes tailored **Claude system prompts** with detailed formatting and design principles:\n\t* Layout structure\n\t* Typography\n\t* Visual hierarchy\n\t* Consistency and readability\n\n\tThis ensures that every file produced follows professional standards.\n\n* **✅ Easy Customization**\n\tYou can modify the prompt templates or add new **Skills** using the “Get All Skills” node.\n\tThe form and switch logic make it simple to extend with additional file types or workflows.\n\n* **✅ Seamless Cloud Integration**\n\tGenerated files are automatically uploaded to a **Google Drive folder**, enabling:\n\t* Centralized storage\n\t* Easy sharing and access\n\t* Automatic organization\n\n* **✅ Reusable and Scalable**\n\tThis workflow can be used as a foundation for:\n\t* Automated report generation\n\t* Client deliverables\n\t* Internal documentation systems\n\t* AI-driven content creation pipelines\n\n---\n\n### How it Works\n\nThis n8n workflow enables users to create professional documents using Anthropic's Claude AI and automatically save them to Google Drive. The process works as follows:\n\n1. **Form Trigger**: The workflow starts with a web form where users submit a prompt and select their desired file type (PPTX, PDF, DOCX, or XLSX).\n\n2. **Document Type Routing**: A switch node routes the request based on the selected file type to the appropriate document creation node.\n\n3. **AI Document Generation**: Each document type has a dedicated HTTP Request node that calls Anthropic's Messages API with:\n   - Specific system prompts tailored for each document type (PowerPoint, PDF, Word, or Excel)\n   - The user's input prompt\n   - Appropriate Anthropic skills (pptx, pdf, docx, xlsx) for specialized document creation\n   - Code execution capabilities for complex formatting\n\n4. **File ID Extraction**: Custom JavaScript code nodes extract the generated file ID from Anthropic's response using recursive search algorithms to handle nested response structures.\n\n5. **File Download**: HTTP Request nodes download the actual file content from Anthropic's Files API using the extracted file ID.\n\n6. **Cloud Storage**: Finally, the downloaded files are automatically uploaded to a specified Google Drive folder, organized and ready for use.\n---\n\n\n### Set Up Steps\n\n1. **API Configuration**:\n   - Set up HTTP Header authentication with Anthropic API\n   - Add `x-api-key` header with your Anthropic API key\n   - Configure required headers: `anthropic-version` and `anthropic-beta`\n\n2. **Google Drive Integration**:\n   - Connect Google Drive OAuth2 credentials\n   - Specify the target folder ID where documents will be uploaded\n   - Ensure proper permissions for file upload operations\n\n3. **Custom Skills (Optional)**:\n   - Use the \"Get All Skills\" node to retrieve available custom skills\n   - Update skill_id fields in JSON bodies if using custom Anthropic skills\n   - Modify the form dropdown to include custom skill options if needed\n\n4. **Form Configuration**:\n   - The form is pre-configured with prompt field and file type selection\n   - No additional setup required for basic functionality\n\n5. **Execution**:\n   - Activate the workflow\n   - Access the form trigger URL\n   - Submit prompts and select desired output formats\n   - Generated files will automatically appear in the specified Google Drive folder\n\nThe workflow handles the entire process from AI-powered document creation to cloud storage, providing a seamless automated solution for professional document generation.\n\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/).",
  "featuredImage": "/data/workflows/11049/11049.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 655,
  "downloads": 65,
  "createdAt": "2025-11-20T14:53:06.110Z",
  "updatedAt": "2026-01-16T09:07:17.616Z",
  "publishedAt": "2025-11-20T14:53:06.110Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11049"
}