{
  "id": 5692,
  "slug": "5692",
  "title": "Automatic lead export from Fluentform to Google Sheets with form categorization",
  "description": "## ❓ What Problem Does It Solve?\n\nManual exporting or copying of leads and newsletter signups from web forms to spreadsheets is time-consuming, error-prone, and delays follow-ups or marketing activities. Traditional workflows can lose data due to mistakes or lack of automation.  The **Fluentform Export** workflow automates the capture and organization of form submissions and newsletter signups into Google Sheets\n\n## 💡 Why Use this workflow?\n\n- **Save Time:** Automate tedious manual data entry for form leads and newsletter signups\n- **Avoid Data Loss:** Ensure all submissions are reliably logged with real-time updates\n- **Organized Data:** Separate sheets for newsletter and contact form data maintain clarity\n- **Easy Integration:** Works seamlessly with Fluentform submissions and Google Sheets\n- **Flexible & Scalable:** Quickly adapt to changes in form structure or spreadsheet columns\n\n## ⚡ Who Is This For?\n\n- **Marketers & Growth Teams:** Automatically gather leads and newsletter contacts to fuel campaigns\n- **Small to Medium Businesses:** Reduce overhead from manual data management and errors\n- **Customer Support Teams:** Keep track of form submissions in a centralized, accessible place\n- **Website Admins:** Simplify data workflow from Fluentform plugins without coding\n\n\n## 🔧 What This Workflow Does\n\n- **⏱ Trigger:** Listens for incoming POST requests from Fluentform via webhook\n- **📎 Step 2:** Evaluates if the submission is a newsletter signup or a form based on a specific token\n- **🔄 Step 3 (Newsletter Path):** Maps email from newsletter submissions and appends/updates Google Sheets \"News Letter\" tab\n- **🔄 Step 3 (Form Path):** Extracts full name, email, phone, subject, and message fields and appends/updates the Google Sheets \"form\" tab\n- **💌 Step 4:** Sends a JSON success response back to Fluentform confirming receipt\n\n## 🔐 Setup Instructions\n\n1. **Import** the provided `.json` workflow file into your n8n instance\n2. **Set up credentials:**\n   - Google Sheets OAuth2 credential with access to your target spreadsheets\n3. **Customize** workflow elements:\n   - Update Fluentform webhook URL in your Fluentform settings to the n8n webhook URL generated\n   - Adjust field names or spreadsheet columns if your form structure changes\n4. **Update** spreadsheet IDs and sheet names used in the Google Sheets nodes to match your own Sheets\n5. **Test** workflow thoroughly with actual Fluentform submissions to verify data flows correctly\n\n## 🧩 Pre-Requirements\n\n- Running **[n8n instance](https://n8n.partnerlinks.io/khaisastudio) (Cloud or self-hosted)**\n- Google account with access to Google Sheets and OAuth credentials\n- Fluentform installed on your website with ability to set webhook URL\n- Target Google Sheets prepared with tabs named \"News Letter\" and \"form\" with expected columns\n\n## 🧠 Nodes Used\n\n- Webhook (POST - Retrieve Leads)\n- If (Form or newsletter?)\n- Set (newsletter and form data preparation)\n- Google Sheets (Append/update for newsletter and form sheets)\n- Respond to Webhook\n\n## 📞 Support\n\n**Made by:** [khaisa Studio](khaisa.studio)  \n**Tag:** automation, Google Sheets, Fluentform, Leads \n**Category:** Marketing  \n**Need a custom?** **[Contact Me](https://khmuhtadin.com)**",
  "featuredImage": "/data/workflows/5692/5692.webp",
  "author": {
    "id": 101,
    "slug": "khmuhtadin",
    "name": "Khairul Muhtadin",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 788,
  "downloads": 78,
  "createdAt": "2025-07-05T09:00:56.355Z",
  "updatedAt": "2026-01-16T08:40:58.432Z",
  "publishedAt": "2025-07-05T09:00:56.355Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5692"
}