{
  "id": 3626,
  "slug": "3626",
  "title": "Create animated illustrations from text prompts with Midjourney and Kling API",
  "description": "### What does the workflow do?\nThis workflow is primarily designed to generate animated illustrations for content creators and social media professionals with Midjourney (unoffcial) and Kling (unofficial) API served by [**PiAPI**](https://piapi.ai). \nPiAPI is an API platform which provides professional API service. With service provided by PiAPI, users could generate a fantastic animated artwork simply using workflow on n8n without complex settings among various AI models.\n\n### What is animated illustration?\nAn animated illustration is a digitally enhanced artwork that combines traditional illustration styles with subtle, purposeful motion to enrich storytelling while preserving its original artistic essence.\n\n### Who is this workflow for?\n\n1. **Social Media Content Creators**: Produces animated illustrations for social media posts.\n2. **Digital Marketers**: Generates marketing materials with motion graphics.\n3. **Independent Content Producers**: Creates animated content without specialized animation skills.\n\n### Step-by-step Setting Instructions\nTo simplify workflow settings, usually users just need to change basic prompt of the image and the motion of the final video following the instrution below:\n1. Sign in your PiAPI account and get your [X-API-Key](https://piapi.ai/workspace/key).\n2. Fill in your [X-API-Key](https://piapi.ai/workspace/key) of PiAPI account in Midjourney and Kling nodes.\n3. Enter your desired image prompt in the Prompt node.\n4. Enter the motion prompt in Kling Video Generator node.\n\nFor more complex or customization settings, users could also add more nodes to get more output images and generate more videos. Also, they could change the target image to gain a better result. As for recommendation,  users could change the video models for which we would recommend live-wallpaper LoRA of [Wanx](https://piapi.ai/docs/wanx-lora/use-case). Users could check API doc to see more use cases of video models and image models for best practice.\n\n\n### Use Case\n**Input Prompt**\nA gentle girl and a fluffy rabbit explore a sunlit forest together, playing by a sparkling stream. Butterflies flutter around them as golden sunlight filters through green leaves. Warm and peaceful atmosphere, 4K nature documentary style. --s 500 --sref 4028286908  --niji 6\n\n**Output Video**\n <video src=\"https://static.piapi.ai/n8n-instruction/motion-illustration/example1.mp4\" controls />\n### When there is troubleshooting\n1. Check if the X-API-Key has been filled in nodes needed.\n2. Check your task status in Task History in [**PiAPI**](https://piapi.ai) to get more details about task status. \n![image](https://i.ibb.co/DDV4WDZ9/image.jpg)\n\n### More Generation Case for Reference\n<video src=\"https://static.piapi.ai/n8n-instruction/motion-illustration/example2.mp4\" controls />",
  "featuredImage": "/data/workflows/3626/3626.webp",
  "author": {
    "id": 101,
    "slug": "piapi",
    "name": "PiAPI",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3191,
  "downloads": 319,
  "createdAt": "2025-04-21T08:38:58.884Z",
  "updatedAt": "2026-01-16T08:30:42.362Z",
  "publishedAt": "2025-04-21T08:38:58.884Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3626"
}