{
  "id": 6002,
  "slug": "6002",
  "title": "Track OpenAI Admin API usage and costs automatically with Google Sheets",
  "description": "## Overview\nThis  workflow aims to help you and your team track your expenses with OpenAI\nIt automatically collects your OpenAI organization’s API usage and cost data every few days and saves it to a ready-to-use Google Sheets template. \nIt pulls detailed metrics for every project and API key, including token usage, model breakdowns, and costs per line item, making it easy for your team to analyze and track spend over time!\n\n## Who is it for\n* Finance or ops teams tracking AI usage and spend\n* Data/analytics teams needing detailed project-level breakdowns\n* Technical leads or admins managing OpenAI organization usage and cost\n* Anyone needing a simple audit trail or historical record of OpenAI API activity\n\n## How to get started\n* Access to your organization’s [OpenAI Admin API key](https://platform.openai.com/settings/organization/admin-keys) -&gt; Note: **it's a different API than the one you use to call the models.**\n* Add your credentials in all `OpenAI Admin` nodes as Predefined Credentials &gt; OpenAI.\n* Create your [Google Sheets credentials](https://docs.n8n.io/integrations/builtin/credentials/google/)\n* Get the [Google Sheets template](https://docs.google.com/spreadsheets/d/1n7P9tsi3s8Y3Z_zErjxyRu5fyGaHByMEJMeYT2jHrhg/edit?usp=sharing) (copy to your Drive)\n\n## How it works\n1. **Trigger:** The workflow runs automatically on a schedule (every 3 days by default, but you can adjust).\n2. **Fetch Data:** Calls OpenAI’s Admin API to get all token usage and cost details for the reporting window.\n3. **Enrich Data:** Resolves project names and API key names for clarity in reports.\n4. **Write to Sheets:** Appends new usage and cost data to your Google Sheet, with one row per project/key/period.\n\n## Google Sheets Template\n* Use our [template to track OpenAI's cost and usage](https://docs.google.com/spreadsheets/d/1n7P9tsi3s8Y3Z_zErjxyRu5fyGaHByMEJMeYT2jHrhg/edit?usp=sharing)\n\n## Notes\n* All data is appended, so your sheet keeps historical records. But ⚠️ if you run the workflow manually or change the schedule, you could end up with duplicated rows\n* API key and project enrichment makes reports easier to read.\n* You can adapt the workflow to save results anywhere: BigQuery, Airtable, DB, or even another spreadsheet.\n* Easy to change schedule or reporting window to fit your team’s needs.\n\n## Extra\n* Depending on your internal processes, you could also generate monthly files and automatically send the report to your finance team via email or Slack, for example. The possibilities are endless!\n* Note that we intended to do the same with Anthropic and Gemini via API and n8n built-in methods. At this stage, it is not possible to do it, but it could probably be done using Browser Agents!\n\n## Service\nIf you need help implementing the template or modifying it, [just reach out 💌](mailto:hello@agentstudio.io?subject=Store%20OpenAI%20API%20Cost%20and%20Usage)",
  "featuredImage": "/data/workflows/6002/6002.webp",
  "author": {
    "id": 101,
    "slug": "agentstudio",
    "name": "Agent Studio",
    "avatar": ""
  },
  "categories": [
    "Document Extraction"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 200,
  "downloads": 20,
  "createdAt": "2025-07-14T14:10:20.032Z",
  "updatedAt": "2026-01-16T08:42:36.695Z",
  "publishedAt": "2025-07-14T14:10:20.032Z",
  "nodes": 40,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6002"
}