{
  "id": 9441,
  "slug": "9441",
  "title": "Web content to Telegram publisher with AI enhancement & image watermarking",
  "description": "## 🤖 This **n8n workflow** automatically parses news articles from a webpage, enhances them with AI, and publishes them to a Telegram channel with a watermarked image.\nUnlike the RSS-based setup, this workflow directly fetches and processes content from any specified webpage.\n\n---\n\n### **Use Cases**\n\n* Automatically post new website articles to your **Telegram channel**.\n* Use **AI** to rewrite or summarize text for better readability.\n* Add branded watermarks to images and keep your channel visually consistent.\n\n---\n\n### **How It Works**\n\n1. **Schedule Trigger:** Runs the workflow on a custom schedule.\n2. **Fetch Web Page:** Retrieves the HTML content of your chosen website.\n3. **Extract Links:** Parses article links from the HTML source.\n4. **Check & Update Google Sheet:** Skips already processed links and records new ones.\n5. **Fetch & Clean Article:** Retrieves, extracts, and formats the article text.\n6. **AI Text Customization:** Uses an AI agent to enhance the text.\n7. **Image Watermarking:** Fetches the article image and applies a watermark.\n8. **Telegram Publishing:** Posts the final image and AI-enhanced text to your channel.\n\n---\n\n### **Setup Steps**\n\n* **Google Sheet:** Create and share a sheet to track processed links.\n* **Web URL:** Enter your target webpage in the HTTP Request node.\n* **AI Agent:** Choose a model and prompt for text customization (e.g., OpenRouter or Gemini).\n* **Telegram Bot:** Add your bot token and chat ID.\n* **Run & Test:** Execute once manually, then let it run on schedule.\n\n---\n\n### **Tips**\n\n* AI usage may incur costs depending on the model provider.\n* Some AI models can be geo-restricted — check availability if you get “model not found.”\n* Customize watermark style (font, color, size) to match your branding.\n* Use Telegram Markdown for rich message formatting.\n\n---\n\n✅ **Key Advantage:**\nNo RSS required — the workflow directly parses websites, enhances content with AI, and automates publishing to Telegram.\n\n",
  "featuredImage": "/data/workflows/9441/9441.webp",
  "author": {
    "id": 101,
    "slug": "octik5",
    "name": "octik5",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 215,
  "downloads": 21,
  "createdAt": "2025-10-09T21:12:39.844Z",
  "updatedAt": "2026-01-16T09:00:32.913Z",
  "publishedAt": "2025-10-09T21:12:39.844Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9441"
}