{
  "id": 8185,
  "slug": "8185",
  "title": "Analyze images & extract text with GPT-4o Vision and Telegram",
  "description": "![image.png](fileId:2307)\n\n## Who’s it for\n\nTeams and makers who want a plug-and-play vision bot: users send a photo in Telegram, the bot returns a concise description plus OCR text. No custom servers required—just n8n, a Telegram bot, and an AIMLAPI key.\n\n## What it does / How it works\n\nThe workflow listens for new Telegram messages, fetches the highest-resolution photo, converts it to base64, normalizes the MIME type, and calls AIMLAPI (GPT-4o Vision) via the HTTP Request node using the OpenAI-compatible `messages` format with an `image_url` data URI. The model returns a short caption and extracted text. The answer is sent back to the same Telegram chat.\n\n## Requirements\n\n* n8n instance (self-hosted or cloud)\n* Telegram bot token (from @BotFather)\n* AIMLAPI account and API key (OpenAI-compatible endpoint)\n\n## How to set up\n\n1. Create a Telegram bot with @BotFather and copy the token.\n2. In n8n, add Telegram credentials (no hardcoded tokens in nodes).\n3. Add AIMLAPI credentials with your API key (base URL: `https://api.aimlapi.com/v1`).\n4. Import the workflow JSON and connect credentials in the nodes.\n5. Execute the trigger and send a photo to your bot to test.\n\n## How to customize the workflow\n\n* Modify the vision prompt (e.g., add brand, language, or formatting rules).\n* Switch models within AIMLAPI (any vision-capable model using the same `messages` schema).\n* Add an IF branch for text-only messages (reply with guidance).\n* Log usage to Google Sheets or a database (user id, file id, response).\n* Add rate limits, user allowlists, or Markdown formatting in Telegram responses.\n* Increase timeouts/retries in the HTTP Request node for long-running images.\n",
  "featuredImage": "/data/workflows/8185/8185.webp",
  "author": {
    "id": 101,
    "slug": "d1m7asis",
    "name": "AI/ML API | D1m7asis",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 926,
  "downloads": 92,
  "createdAt": "2025-09-02T18:12:38.293Z",
  "updatedAt": "2026-01-16T08:54:31.932Z",
  "publishedAt": "2025-09-02T18:12:38.293Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8185"
}