{
  "id": 5381,
  "slug": "5381",
  "title": "Automate startup research & profiling with Extruct AI to Google Sheets",
  "description": "**Who’s it for:**  \nInvestors, analysts, and startup enthusiasts who need a complete overview of startups, including industry, product, funding, and leadership information.\n\n**How it works / What it does:**  \nEnter a startup’s name into the form, and the workflow will automatically collect and organize details such as the company’s industry, product, investors, and key decision-makers. All this information is neatly updated in your Google Sheet, making it easy to track and compare startups.\n\n**How to set up:**  \n1. Sign up for Extruct at [www.extruct.ai/](https://www.extruct.ai/?utm_source=n8n_workflows&utm_medium=referral&utm_campaign=n8n_startup_overview).  \n2. Open the Extruct table template, copy the table ID from the URL, and save it.  \n3. Copy the Google Sheets template to your own Drive.  \n4. Paste the table ID into the variables node in your n8n flow.  \n5. Set up Bearer authentication in each HTTP Request node using your Extruct API token.  \n6. In the Google Sheets node, paste your template link and connect your Google account.  \n7. Run the flow once to reveal the mapping fields, then match each field to the correct column.  \n8. Activate the flow and add startups via the form.\n\n**Requirements:**  \n- Extruct account and API token  \n- Extruct table template  \n- Google account with Google Sheets\n\n**How to customize the workflow:**  \nAdd new columns in both the Extruct table and your Google Sheet, then map them in the Google Sheets node to track additional startup data.",
  "featuredImage": "/data/workflows/5381/5381.webp",
  "author": {
    "id": 101,
    "slug": "extruct-ai",
    "name": "Extruct AI",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 598,
  "downloads": 59,
  "createdAt": "2025-06-26T16:28:06.204Z",
  "updatedAt": "2026-01-16T08:39:19.401Z",
  "publishedAt": "2025-06-26T16:28:06.204Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5381"
}