{
  "id": 5777,
  "slug": "5777",
  "title": "Text-to-image generation with Google Gemini & enhanced prompts via Telegram Bot",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# 🤖 AI Image Generator Telegram Bot\nTransform simple text descriptions into stunning AI-generated images through a Telegram bot powered by Google's Gemini 2.0 Flash image. This workflow automatically enhances user prompts with professional prompt engineering techniques and delivers high-quality images directly to your Telegram chat.\n## 🎯 What This Workflow Does\nThis automation creates an intelligent Telegram bot that:\n- **Receives text messages** from users describing what image they want\n- **Enhances prompts** using AI-powered prompt engineering to add artistic details, lighting, composition, and style specifications\n- **Generates images** using Google's Gemini 2.0 Flash image generation model\n- **Delivers results** instantly back to the user's Telegram chat\n## ⚡️ Key Features\n- **Smart Prompt Enhancement**: Automatically transforms basic requests like \"a cat on a windowsill\" into detailed, professional prompts with lighting, composition, and style details\n- **Professional Image Quality**: Leverages Google's latest Gemini 2.0 Flash model for high-quality image generation\n- **Instant Delivery**: Images are generated and sent back to users within seconds\n- **User-Friendly**: Simple text-to-image conversion through familiar Telegram interface\n- **Structured Output**: Uses JSON schema to ensure consistent prompt formatting\n## 🛠️ How It Works\n1. **Telegram Trigger**: Listens for incoming messages from users\n2. **AI Prompt Enhancement**: Uses Gemini 2.5 Flash Lite to analyze and expand user requests into detailed prompts\n3. **Structured Processing**: Formats the enhanced prompt using JSON schema for consistency\n4. **Image Generation**: Sends the enhanced prompt to Gemini 2.0 Flash image generation API\n5. **File Conversion**: Converts the generated image data to a file format\n6. **Delivery**: Sends the generated image back to the user via Telegram\n## 🎭 Use Cases\n- **Creative Content Creation**: Generate artwork, illustrations, and visual concepts\n- **Social Media Content**: Create unique images for posts and stories\n- **Concept Visualization**: Turn ideas into visual representations\n- **Educational Materials**: Generate images for presentations and learning materials\n- **Personal Projects**: Create custom artwork for personal use\n## 📋 Prerequisites\nBefore setting up this workflow, you'll need:\n### Required Accounts & APIs:\n- **Telegram Bot Token**: Create a bot via [@BotFather](https://t.me/botfather)\n- **Google AI Studio Account**: Access to [Gemini API](https://aistudio.google.com/apikey) services\n### Required Credentials:\n- Telegram Bot API credentials\n- Google Gemini API key with access to:\n  - Gemini 2.5 Pro (for prompt enhancement)\n  - Gemini 2.0 Flash Preview (for image generation)\n## 🚀 Setup Instructions\n1. **Import the Workflow**: Copy the workflow JSON into your n8n instance\n2. **Configure Telegram Bot**:\n   - Create a new bot using [@BotFather](https://t.me/botfather)\n   - Add your bot token to the Telegram credentials in n8n\n3. **Set Up Google Gemini API**:\n   - Create API key from [Google AI Studio](https://aistudio.google.com/apikey) and add to n8n credentials\n4. **Activate the Workflow**: Enable the workflow to start receiving messages\n## 💡 Customization Options\n- **Prompt Templates**: Modify the prompt enhancement instructions for different artistic styles\n- **Image Parameters**: Adjust generation settings for different image formats and qualities\n- **Response Formats**: Customize how images are delivered (with captions, multiple formats, etc.)\n## 📊 Example Interaction\n**User Input**: \"Generate a beautiful image of a dragon from game of thrones\"\n**Enhanced Prompt**: \"A majestic, formidable dragon, reminiscent of those from Game of Thrones, perched atop a jagged, snow-capped mountain peak. The dragon is depicted with immense, leathery wings unfurled, scales glinting with iridescent blues and deep charcoals under the harsh, cold light. Its eyes glow with an inner, fiery amber. The scene is captured with a dramatic, low-angle wide shot, emphasizing the dragon's sheer scale against a turbulent, stormy sky filled with dark, bruised clouds and streaks of lightning. The atmosphere is oppressive and foreboding, with biting wind and swirling snow creating a sense of raw power and danger. The color palette is dominated by icy blues, stark greys, deep blacks, and the contrasting fiery glow of the dragon's eyes and perhaps a hint of internal fire. Rendered in a hyperrealistic, cinematic digital art style, with exceptional attention to detail on the scales, musculature, and the texture of the rocky environment. Lighting is dramatic and high-contrast, with sharp highlights on the dragon's form and deep, impenetrable shadows. Quality specifications include ultra-high detail, 8K resolution, photorealistic rendering, and an epic, awe-inspiring mood, evoking the grandeur and terror of powerful fantasy creatures.\"\n**Result**:\n<a href=\"https://ibb.co/hJpRqHZL\"><img src=\"https://i.ibb.co/W4SWTFPG/file.png\" alt=\"file\" /></a>\n## 🔧 Technical Details\n- **AI Models**: Google Gemini 2.5 Pro (prompt enhancement) + Gemini 2.0 Flash Preview (image generation)\n- **Messaging**: Telegram Bot API\n- **Output Format**: High-quality images in standard formats\n- **Processing Time**: Typically 10-15 seconds per image for Gemini 2.5 Flash and 25-30 seconds Gemini for 2.5 Pro",
  "featuredImage": "/data/workflows/5777/5777.webp",
  "author": {
    "id": 101,
    "slug": "appstonelab",
    "name": "AppStoneLab Technologies LLP",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3725,
  "downloads": 372,
  "createdAt": "2025-07-08T12:30:07.929Z",
  "updatedAt": "2026-01-16T08:41:21.485Z",
  "publishedAt": "2025-07-08T12:30:07.929Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5777"
}