{
  "id": 6950,
  "slug": "6950",
  "title": "Scrape product info from website URLs in Google Sheets using Dumpling AI",
  "description": "## 📄 What this workflow does\n\nThis workflow automatically scrapes product information from any website URL entered into a Google Sheet and stores the extracted product details into another sheet. It uses Dumpling AI to extract product data such as name, price, description, and reviews.\n\n---\n\n## 👤 Who is this for\n\nThis is ideal for:\n- Lead generation specialists capturing product info from prospect websites\n- eCommerce researchers collecting data on competitor product listings\n- Sales teams building enriched product databases from lead URLs\n- Anyone who needs to automate product scraping from multiple websites\n\n---\n\n## ✅ Requirements\n\n- A **Google Sheet** with a column labeled `Website` where URLs will be added\n- A second sheet (e.g., `product details`) where extracted data will be saved\n- **Dumpling AI** API access to perform the extraction\n- Connected **Google Sheets** credentials in n8n\n\n---\n\n## ⚙️ How to set up\n\n1. Replace the Google Sheet and tab IDs in the workflow with your own.\n2. Make sure your source sheet includes a `Website` column.\n3. Connect your Dumpling AI and Google Sheets credentials.\n4. Make sure the output sheet has the following headers:\n   - `productName`\n   - `price`\n   - `productDescription`  \n   *(The workflow supports `review`, but it’s optional.)*\n5. Activate the workflow to start processing new rows.\n\n---\n\n## 🔁 How it works (Workflow Steps)\n\n1. **Watch New Website URL in Google Sheets**: Triggers when a new row is added with a website URL.\n2. **Extract Product Info with Dumpling AI**: Sends the URL to Dumpling AI’s extract endpoint using a defined schema for product details.\n3. **Split Extracted Products**: Separates multiple products into individual items if the page contains more than one.\n4. **Append Product Info to Google Sheets**: Adds the structured results to the specified product details sheet.\n\n---\n\n## 🛠️ Customization Ideas\n\n- Add a column to store the original source URL alongside each product\n- Use OpenAI to generate short SEO summaries for each product\n- Add filters to ignore pages without valid product details\n- Send Slack or email notifications when new products are added to the sheet\n",
  "featuredImage": "/data/workflows/6950/6950.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1246,
  "downloads": 124,
  "createdAt": "2025-08-03T18:11:03.282Z",
  "updatedAt": "2026-01-16T08:47:46.067Z",
  "publishedAt": "2025-08-03T18:11:03.282Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6950"
}