{
  "id": 6637,
  "slug": "6637",
  "title": "Weekly competitor content digest with Gemini & OpenAI, Google Sheets, and Firecrawl",
  "description": "**Who is this template for?**\nThis workflow is perfect for competitive‑intel analysts, product managers, content marketers, and anyone who tracks multiple company blogs or news sources. If you need a weekly snapshot of fresh, on‑topic articles—without wading through dozens of tabs—this template is for you.\n\n**What does it do?**\nThe workflow reads a curated list of candidate URLs from Google Sheets, filters out duplicates and off‑topic pages with an AI agent, scrapes the surviving links, generates three‑sentence summaries, logs the results back to Sheets, and delivers a polished HTML digest to your inbox every week.\n\n**Why is it useful?**\nInstead of manually opening competitor links, checking for relevance, copying highlights, and pasting them into reports, this automation does the grunt work for you. It turns scattered URLs into a searchable knowledge base and a ready‑to‑share email, freeing you to focus on insights and strategy—not housekeeping.\n\n**How does it work?**\nA Sunday‑morning cron trigger kicks things off. The workflow pulls links from the Input Links tab, compares them to the existing Summary tab, and passes fresh candidates to an AI “bouncer” that keeps only blog posts, tutorials, news, and product updates. Firecrawl then scrapes each page; Gemini 2.5‑Flash and OpenAI condense the content into title, author, date, and summary. The structured data is appended to your Summary sheet and formatted into a company‑grouped HTML digest, which lands in your email before the workweek starts.\n\n\n\n**Set up steps**\n\n1. Clone the workflow\n- Import the JSON into your n8n Cloud workspace.\n\n2. Create the Google Sheet\n- Make a new spreadsheet with two tabs: Input Links and Summary (names must match).\n- In Input Links, add columns Company, Page Type, and Link (or rename to match the node mapping).\n- Leave Summary blank—the workflow will populate it.\n- Copy the Sheet URL; you’ll paste it into two Google Sheets nodes.\n\n\n3. Add credentials (n8n ▸ Credentials)\n- Google Sheets OAuth2 – Authorise with the Google account that owns the spreadsheet.\n- Gmail OAuth2 – Authorise the Gmail account that should send the digest.\n- Firecrawl HTTP Header Auth – Set Authorization: Bearer &lt;YOUR_FIRECRAWL_API_KEY&gt;.\n\n\n4. Point nodes to your Sheet\n- Open each Google Sheets node (Input Links, Read_Url_Summary_Tool, Append row in sheet, Get row(s) in sheet).\n- Paste the Document ID (found in the Sheet URL) and select the correct tab (Input Links or Summary).\n\n5. Update email recipients\n- In the Send a message (Gmail) node, replace the sample addresses with your own distribution list.\n\n\n6. Adjust scheduling (optional)\n- Double‑click the Schedule Trigger node and change the cron expression if you prefer a different day/time.\n\n\n7. Tune AI models (optional)\n- OpenAI o4‑mini and Gemini 2.5‑Flash nodes default to cost‑efficient settings. Feel free to switch models or tweak temperature to suit your tone.\n\n\n8. Test with a single URL\n- Add one row in Input Links, then execute the workflow manually (▶ Run).\n- Verify that a new row appears in Summary and an email lands in your inbox.\n\n\n9. Go live\n- Activate the workflow (toggle in top bar).\n- Confirm the green status badge and wait for the next scheduled run.\n\nTip: The Firecrawl Free tier limits you to ~10 requests/min. If you scale beyond that, raise the batching interval in both Firecrawl nodes or upgrade your Firecrawl plan.",
  "featuredImage": "/data/workflows/6637/6637.webp",
  "author": {
    "id": 101,
    "slug": "nymichaelyang",
    "name": "Michael Yang",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 620,
  "downloads": 62,
  "createdAt": "2025-07-29T13:13:51.603Z",
  "updatedAt": "2026-01-16T08:46:06.555Z",
  "publishedAt": "2025-07-29T13:13:51.603Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6637"
}