{
  "id": 3493,
  "slug": "3493",
  "title": "Monitor SSL certificate expiry with Google Sheets and multi-channel alert",
  "description": "## SSL Expiry Alert System\n\n### Who is this for?\nThis workflow is ideal for administrators or IT professionals responsible for monitoring SSL certificates of multiple websites to ensure they do not expire unexpectedly.\n\n### Problem\nSSL certificates play a crucial role in ensuring secure communication over the internet. However, if not monitored closely, they can expire, leading to potential security risks and service disruption. This workflow helps in proactively monitoring SSL certificate expiry dates.\n\n### Functionality\n1. Pulls URLs to monitor from a Google Sheet.\n2. Checks SSL certificates using SSL-Checker.io.\n3. Updates Google Sheet with SSL details such as expiry date and certificate status.\n4. Sends email alerts for SSL certificates nearing expiry (&lt;30 days) or invalid certificates.\n\n### Setup\n1. Clone the provided Google Sheet and update the Google Sheet URL in the \"URLs to Monitor\" node.\n2. Set up Google Sheets and Gmail credentials in n8n.\n3. Configure the Discourse Trigger for weekly monitoring.\n4. Customize email/telegram/ntfy alert settings as needed.\n\n### Customization\n- Modify the frequency of monitoring by adjusting the trigger interval in the \"Weekly Trigger\" node.\n- Customize email content and recipients in the \"Send Alert Email\" node.\n- Extend functionality by adding additional checks or actions based on SSL certificate status.\n\n### Note\nEnsure proper authentication and authorization for accessing Google Sheets, SSL-Checker.io, and Gmail accounts within the workflow.",
  "featuredImage": "/data/workflows/3493/3493.webp",
  "author": {
    "id": 101,
    "slug": "cultrix",
    "name": "Jesse Davids",
    "avatar": ""
  },
  "categories": [
    "SecOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2052,
  "downloads": 205,
  "createdAt": "2025-04-09T07:25:10.177Z",
  "updatedAt": "2026-01-16T08:30:01.807Z",
  "publishedAt": "2025-04-09T07:25:10.177Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3493"
}