{
  "id": 6113,
  "slug": "6113",
  "title": "Generate job application icebreakers with GPT-4 and Indeed data from Google Sheets",
  "description": "Part two of the Indeed Job Scraper, Filter, and Enrichment workflow, this workflow takes information about the scraped and filtered job listings on Indeed via Apify, which is stored in Google Sheets to generate a customized, five-line email icebreaker that implies the rest of the icebreaker is personalized. Personalized IJSFE (Indeed Job Scraper For Enrichment). ++ I am an engineering student, so I love my acronyms.\n\n### Benefits\n\nInstant Icebreaker Generation - Convert hours of research, copywriting and personalization into seconds automatically\nLive Integration - Generate and send personalized icebreakers whenever, wherever \nVirtually Complete Automation - From research into company and job description to personalized response with the AI solution, this workflow does it in a click.\nProfessional Presentation - Because the chatbot has context about the company and the job listing, it generates an icebreaker that makes the reader think that there was some research done\n\n\n#### How It Works\n\n1. Google Sheets Search:\n\n- Google sheets node fetches all rows where the icebreaker column is empty\n- Each row is an item returned that contains information about the company and the job listing\n\n2. AI Personalization:\n\n- Uses sophisticated GPT-4 prompting\n- Converts a bunch of information about a job posting and company into a customized, five-line personalized email icebreaker \n- Applies a consistent and casual tone automatically to seem more human-written\n\n3. Database Update:\n\n- Updates all rows fetched in the search and updates only the icebreaker column with the new personalized icebreaker\n- Each item is returned as a row that contains information about the company, the job listing and the icebreaker\n\n### Required Template Setup\n\nGoogle Sheets Template: Create a Google Sheet with these variables:\n\njobUrl - Unique identifier for job listings\ntitle - Position Title\ndescriptionText - Description of job listing\nhiringDemand/isHighVolumeHiring - Are they hiring at high volume?\nhiringDemand/isUrgentHire - Are they hiring at high urgency?\nisRemote - Is this job remote?\njobType/0 - Job type: In person, Remote, Part-time, etc.\ncompanyCeo/name - CEO name collected from Tavily’s search\nicebreaker - AI-generated icebreakers for each job listing\nscrapedCeo - CEO name collected from Apify Scraper\nemail - Email listed on for job listing\ncompanyName - Name of the company that posted the job\ncompanyDescription - Description of the company that posted the job\ncompanyLinks/corporateWebsite - Website of the company that posted the job\ncompanyNumEmployees - Number of employees the company listed that they have\nlocation/country - Location of where job is to take place\nsalary/salaryText - Salary on job listing\n\nSetup Instructions:\n\nGoogle Sheets Search & Update Setup:\n\nCreate a new Google Sheet with these column headers in the first row\nName the sheet whatever you please\nConnect your Google Sheets OAuth credentials in n8n\nUpdate the document ID in the workflow nodes\n\nThe search logic in the first Google Sheets node relies on the ID column for icebreaker generation, so this structure is essential for the workflow to function correctly.\nFeel free to reach out for additional help or clarification at my Gmail: terflix45@gmail.com, and I'll get back to you as soon as I can.\n\n\nAI Icebreaker Generation Setup:\n\nConfigure OpenAI API for sophisticated proposal writing\nImplement example-based training with input/output for more specific output\nSet up JSON formatting for structure (Personally, I think JSON is easier to handle as an output)\n\n\n### Setup Steps:\n\n1. Search & Fetch Rows Setup\n\n- Create a Google Sheets database with the provided column structure\n- Connect Google Sheets OAuth credentials\n- Configure the filer on the get rows node to only include empty icebreaker columns\n\n2. Set up AI Personalization\n\n- Add OpenAI API credentials for personalized icebreaker generation\n- Customize the AI prompts for your specific niche, requirements or interest\n\n3. Update Google Sheets Setup\n\n- Remember to map all items to their respective columns based on the row number\n- All fields in the update sheets node should have the same value as the first sheets node, and the icebreaker field is to take the ChatGPT output as its value",
  "featuredImage": "/data/workflows/6113/6113.webp",
  "author": {
    "id": 101,
    "slug": "adrian-bent",
    "name": "Adrian Bent",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 580,
  "downloads": 58,
  "createdAt": "2025-07-18T04:06:55.531Z",
  "updatedAt": "2026-01-16T08:43:15.009Z",
  "publishedAt": "2025-07-18T04:06:55.531Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6113"
}