{
  "id": 11985,
  "slug": "11985",
  "title": "Automatic Instagram content creation with OpenAI, Nano Banana and Telegram check",
  "description": "|Overview |Sample|\n|-|-|\n|This template is the first of its kind: it **automatically generates both the caption and the image for your Instagram posts by analysing your existing feed**, with zero spreadsheets or manual steps. Once configured, the workflow runs on a schedule, fetches your past posts, and uses a custom AI agent to craft a new caption and image prompt. Then creates the image via OpenRouter (Nano Banana) and stores everything in Airtable. A Telegram message gives you one‑tap control to **confirm, regenerate or cancel**; if confirmed, the post is published directly to Instagram. **Perfect for creators and marketers** who want fresh, on‑brand content without daily manual effort. | ![Preview](https://i.imgur.com/xcNLCbf.gif)|\n\n---\n## Good to Know\n\n- **Fully hands‑off:** No need to prepare datasets or manually upload assets. The workflow reads your Instagram history via the Graph API and generate new content.\n- **AI‑powered creativity:** Uses OpenAI for caption generation and Nano Banana via OpenRouter for image synthesis.\n- **Privacy‑friendly:** Your content stays within your Airtable and n8n instance; only the AI models receive anonymised prompts.\n- **Nano Banana:** Currently the gemini-2.5-flash-image-preview model is used but you can use any available in Open Route.\n\n---\n\n## How It Works\n\n1. **Scheduling:** A schedule trigger initiates the workflow at your chosen time.\n2. **Feed Analysis:** The workflow uses your Instagram business account ID and access token to fetch past posts.\n3. **AI Content Generation:** A custom AI agent analyses your captions, applies category tag, and writes a new caption and a detailed image prompt. If there is no content it will be based on the category to create something new.\n\n4. **Image Creation:** The prompt is sent to the Nano Banana model on OpenRouter to generate a new image. The binary is converted to JPEG and stored in Airtable wih the caption and prompt.\n5. **Approval via Telegram:** A Telegram bot sends you the generated image, caption and three inline buttons: **Confirm**, **Regenerate** and **Cancel**.\n    - ✅ *Confirm*: Uploads the image to Instagram via a Graph API call.\n    - ♻️ *Regenerate*: Re‑runs just the AI ​​creation steps, generating a different title and image.\n    - ❌ *Cancel*: Updates the Telegram message to note the cancellation and removes the buttons.\n6. **Publishing:** When confirmed, the workflow uses the image’s public URL (generated in Airtable and served via an n8n webhook) to create and publish the post on Instagram. \n\n---\n\n## How to Use\n\n1. **Prepare your accounts:**\n    - Instagram Business Account connected to a Facebook Page (get your IG Business ID and a long‑lived Graph API access token).\n    - Airtable base and table with fields: `id`, `img_prompt`, `caption`, `data_binary`, `action`, `mime_type`, `created_at`.\n    - Personal access token for Airtable, Telegram bot token and chat ID, OpenAI and OpenRouter API keys.\n2. **Create workflows:** Four workflows are included: schedule trigger, webhook to serve the image, main content‑generation workflow and Telegram response workflow.\n3. **Replace placeholders:** Fill in your account IDs, token values, n8n instance URL and webhook paths.\n4. **Define Category:** Adjust the `Define Category` node to steer the content theme (e.g. *natural landscapes*, *urban fashion*).\n5. **Activate and test:**\n    - Activate the workflows **\"ebhook to serve the image** and **Telegram response workflow**.\n    - Configure **Schedule Trigger** workflow to call the **Main Content-Generation Workflow**.\n    - Run the **Main Content-Generation Workflow** once to create a sample post and test the Telegram buttons.\n    - Activate the schedule for the generation of automatic posts.\n---\n\n## Requirements\n\n- Instagram Business account & Facebook Graph API (tokens with `instagram_basic` and `instagram_content_publish` permissions)\n- Airtable base & personal access token\n- Telegram bot (token & chat ID)\n- OpenAI API key\n- OpenRouter API key \n---\n\n## Customization\n\n- **Caption tone:** Modify the AI Agent prompt to change tone (flirtatious, motivational, mysterious).\n- **Schedule:** Set your preferred posting time via the schedule trigger.\n- **Additional fields:** Expand the Airtable schema and 'Take Caption' node to include hashtags, analysis summaries or performance metrics.\n\n---",
  "featuredImage": "/data/workflows/11985/11985.webp",
  "author": {
    "id": 101,
    "slug": "nafri",
    "name": "Adrian",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 56,
  "downloads": 5,
  "createdAt": "2025-12-20T12:25:44.831Z",
  "updatedAt": "2026-01-16T09:10:54.305Z",
  "publishedAt": "2025-12-20T12:25:44.831Z",
  "nodes": 50,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11985"
}