{
  "id": 12058,
  "slug": "12058",
  "title": "Automate business card management with LINE, AI, and Google Sheets",
  "description": "# Automate Business Card Management with LINE, AI, and Google Sheets\n\n## Who's it for\n\nThis workflow is designed for business professionals and sales teams who receive business card images via LINE and want to quickly digitize contact information with minimal manual work.\n\nIt is best suited for users who process business cards one image at a time and want a simple, reliable automation rather than a high-volume ingestion pipeline.\n\n## What it does\n\nThis workflow processes a single business card image sent via LINE, extracts text using Google Gemini AI, and stores the structured contact information in Google Sheets.\n\nThe workflow focuses on simplicity and clarity: it receives an image, performs AI-based OCR, parses the extracted text, saves the result, uploads the original image for reference, sends a thank-you email, and replies with the extracted data on LINE.\n\n## How it works\n\n1. A single business card image is sent to the LINE bot.\n2. The workflow is triggered via a LINE webhook.\n3. The image file is downloaded and sent to Google Gemini AI for OCR.\n4. The extracted text is parsed into structured fields.\n5. The data is appended to Google Sheets.\n6. The image is uploaded to Google Drive.\n7. A thank-you email is sent via Gmail.\n8. The extracted information is sent back as a LINE reply.\n\nThis workflow is intentionally designed to handle **one image per execution**.\n\n## Requirements\n\nTo use this workflow, you will need:\n\n- A LINE Messaging API account  \n- A Google Gemini API key  \n- A Google account with access to Google Sheets and Google Drive  \n- A Gmail account for sending thank-you emails  \n- A Google Sheets document with the following column names:\n  - Company Name  \n  - Contact Name  \n  - Department  \n  - Address  \n  - Email Address  \n  - Phone Number  \n\n## Important limitations\n\n- This workflow **does not support multiple images sent in a single message**.\n- Sending images in quick succession may trigger multiple executions and lead to unexpected results.\n- Only the first image in an event payload is processed.\n- OCR accuracy depends on image quality, lighting, and card design.\n\nThese limitations are intentional to keep the workflow simple and easy to understand.\n\n## How to set up\n\n1. Create a LINE Messaging API channel and obtain a Channel Access Token.\n2. Generate a Google Gemini API key.\n3. Update the Config node with your LINE token, Google Sheets ID, and Google Drive folder ID.\n4. Configure credentials for LINE, Google Gemini, Google Sheets, Google Drive, and Gmail.\n5. Register the n8n webhook URL in your LINE channel settings.\n6. Activate the workflow in n8n and test it with a single business card image.\n\n## How to customize\n\n- Modify the AI prompt in the “Extract Card Info” node to support different languages or fields.\n- Adjust the parsing logic to match different business card layouts.\n- Replace Google Sheets with a CRM or database.\n- Add queueing or locking logic if you want to support batch or sequential image uploads.\n\n---\n\n**Note:**  \nThis workflow was tested using real business card images sent individually via the LINE Messaging API.  \nFor production use, testing with your own card samples is strongly recommended.\n",
  "featuredImage": "/data/workflows/12058/12058.webp",
  "author": {
    "id": 101,
    "slug": "okp29",
    "name": "Oka Hironobu",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 19,
  "downloads": 1,
  "createdAt": "2025-12-23T09:48:46.314Z",
  "updatedAt": "2026-01-16T09:11:13.182Z",
  "publishedAt": "2025-12-23T09:48:46.314Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12058"
}