{
  "id": 5790,
  "slug": "5790",
  "title": "Automated HR screening with VAPI AI calls, Gemini analysis & Google Sheets",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n**This n8n template automates candidate outreach, call transcription, and structured feedback capture for HR teams and recruiters. It triggers on a new candidate row added in a Google Sheet, initiates a call using Vapi.ai, processes the transcript using Google Gemini, extracts key information like CTC, experience, and notice period, and then updates the same Google Sheet with parsed insights.\n\nThis is ideal for recruiters or HR teams conducting high-volume candidate outreach and wanting to scale initial data collection using automated voice bots and AI transcription analysis.**\n\n## How it works\n1. Trigger: Listens for new rows added to a Google Sheet (e.g., a new candidate lead).\n\n2. Call Initiation: Uses Vapi.ai to make a phone call to the candidate using an assistant bot.\n\n3. Transcript Retrieval: After the call, fetches the conversation transcript from the Vapi API.\n\n4. AI Transcript Analysis: Google Gemini parses the transcript and extracts structured fields like:\n- Work experience\n- Current & expected CTC\n- Notice period & negotiability\n- Work preferences and location\n \n5. Data Mapping: Extracted insights are mapped to structured JSON fields.\n \n6. Google Sheet Update: The same row in the source Sheet is updated with the collected information.\n\n## Use Cases\nPre-screening calls for job applicants\n\nCollecting missing candidate information asynchronously\n\nReplacing manual HR data entry with AI-powered automation\n\nSmart CRM updates from voice interactions\n\n## Requirements\nBefore you run this workflow, ensure the following:\n\n✅ Google account with access to Google Sheets API\n\n✅ Vapi.ai account with:\n\n- Assistant ID\n- Phone number ID\n- Active API key\n\n✅ Google Gemini API (via PaLM) enabled\n\n✅ n8n version 1.40.0 or later with relevant credentials configured\n\n## How to use\nImport the workflow into n8n.\n\nSet up your credentials for:\n\n- Google Sheets Trigger\n- Google Sheets\n- Vapi.ai (add Bearer token)\n- Google Gemini\n\nReplace the placeholder values in:\n\n- Assistant ID\n- Phone number ID\n- Google Sheet ID and tab\n\nStart the workflow and add a row to the Google Sheet.\n\nWait for the automated call and let the AI extract and populate the data.\n\n## Customising this workflow\nReplace Google Gemini with OpenAI or Claude if preferred.\n\nAdd sentiment analysis on the transcript using an LLM.\n\nModify the Sheet column structure to add additional fields.\n\nAdd a filter node to skip candidates with incomplete phone numbers.\n\nUse a Webhook trigger instead of Google Sheets to integrate with job portals or ATS.\n\n",
  "featuredImage": "/data/workflows/5790/5790.webp",
  "author": {
    "id": 101,
    "slug": "arpanjain29",
    "name": "Agentick AI",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2143,
  "downloads": 214,
  "createdAt": "2025-07-08T17:46:11.316Z",
  "updatedAt": "2026-01-16T08:41:25.129Z",
  "publishedAt": "2025-07-08T17:46:11.316Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5790"
}