{
  "id": 10359,
  "slug": "10359",
  "title": "Automate CV screening and candidate scoring with Gemini AI and Google Sheets",
  "description": "\n![Screenshot 20251030 174902.png](fileId:3149)\n## Who’s it for\n\nFor HR professionals, recruiters, and hiring managers who want to automate the initial CV screening and candidate evaluation process. This workflow helps teams efficiently assess applicants based on submitted answers and resume data — saving hours of manual review and ensuring fair, consistent scoring.\n\n## How it works\n\nThis workflow automates CV screening using Google Drive, Google Sheets, and Gemini AI.\nWhen a candidate submits a form with their answers and CV, the file is uploaded to Drive, converted from PDF to plain text, and merged with the form data.\nGemini AI then analyzes both inputs, comparing skills, experience, and responses to generate consistency, job-fit, and final scores.\nFinally, the results are parsed, saved to Google Sheets, and automatically sorted by score, providing a ranked list of candidates for easy review.\n\n## How to set up\n\n1. Connect your Google Drive and Google Sheets credentials in n8n.\n2. Configure your Form Trigger to capture candidate answers and CV uploads.\n3. Set up the Extract from File node to parse PDF files into text.\n4. Add your Gemini AI credentials securely using n8n’s credential system (no hardcoded keys).\n5. Execute the workflow once to verify that CVs are uploaded, analyzed, and ranked in the connected Google Sheet.\n\n## Requirements\n\n1. n8n account (cloud or self-hosted).\n2. Google Drive and Google Sheets integrations.\n3. Gemini AI (Chat Model) API credentials.\n4. A connected form (e.g., Typeform, n8n Form Trigger)\n\n## How to customize\n\nYou can modify the AI prompt to align with your company’s job criteria or evaluation style.\nAdd more scoring categories (e.g., education, technical skills, experience).\nChange the output destination — send results to Airtable, Notion, or Slack.\nEnhance it with dashboards or extra nodes for reporting and analytics.\n\n## ⚠️ Disclaimer\n\nThis workflow uses Gemini AI, which may require self-hosting for community node compatibility.\nEnsure that no personal or sensitive candidate data is shared externally when using AI services.",
  "featuredImage": "/data/workflows/10359/10359.webp",
  "author": {
    "id": 101,
    "slug": "asfandyar-malik",
    "name": "Asfandyar Malik",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 371,
  "downloads": 37,
  "createdAt": "2025-10-30T18:24:00.983Z",
  "updatedAt": "2026-01-16T09:04:46.124Z",
  "publishedAt": "2025-10-30T18:24:00.983Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10359"
}