{
  "id": 10947,
  "slug": "10947",
  "title": "AI-powered company documents Q&A assistant with Google Drive and GPT-4 mini",
  "description": "# Company Knowledge Base Assistant\n\n## Who's it for\n\nThis workflow is designed for companies looking to onboard new employees and interns efficiently. It's perfect for HR teams, team leaders, and organizations that want to provide instant access to company knowledge without manual intervention. Whether you're a startup or an established company, this assistant helps your team find answers quickly from your existing documentation.\n\n## What it does\n\nThis AI-powered chatbot automatically learns from your company documents stored in Google Drive and provides accurate, contextual answers to employee questions. The system continuously monitors a designated Drive folder, processes new documents, and makes them instantly searchable through a conversational interface.\n\nKey features:\n- Automatic document ingestion from Google Drive\n- Intelligent search across all company documents\n- Conversational interface with memory\n- Source citation for answers\n- Real-time updates when new documents are added\n\n## How it works\n\nThe workflow has two main components:\n\n**Document Processing Pipeline**: Monitors your Google Drive folder every minute for new files. When a document is added, it's automatically downloaded, split into searchable chunks, converted into vector embeddings, and stored in an in-memory knowledge base.\n\n**Chat Interface**: Users send questions via webhook, the AI agent searches the knowledge base for relevant information, maintains conversation history for context, and returns accurate answers with source citations.\n\n## Requirements\n\n- Google Drive account with OAuth2 credentials\n- Google Service Account for document downloads\n- OpenAI API key for embeddings and chat model\n- Designated Google Drive folder for company documents\n\n## Setup Instructions\n\n1. **Configure Google Drive**:\n   - Set up Google Drive OAuth2 credentials in the \"Watch Company Docs Folder\" node\n   - Set up Google Service Account credentials in the \"Fetch New Document\" node\n   - Select your company documents folder in the trigger node\n\n2. **Configure OpenAI**:\n   - Add your OpenAI API key to both embedding nodes\n   - The workflow uses GPT-4 Mini for cost-effective responses\n\n3. **Upload Your Documents**:\n   - Add company handbooks, policies, procedures, and FAQs to the designated Drive folder\n   - Documents will be automatically processed within minutes\n\n4. **Test the Chat Interface**:\n   - The webhook endpoint accepts POST requests with this format:\n   ```json\n   {\n     \"data\": \"Your question here\",\n     \"session_id\": \"unique-user-id\"\n   }\n   ```\n\n5. **Integrate with Your Tools**:\n   - Connect the webhook to Slack, Teams, or your internal chat platform\n   - Each user gets their own conversation history via session_id\n\n## How to customize\n\n- **Change check frequency**: Adjust polling interval in \"Watch Company Docs Folder\" from every minute to hourly or daily\n- **Adjust chunk size**: Modify the \"Split into Searchable Chunks\" node to change how documents are segmented\n- **Increase context**: Change `topK` parameter in \"Search Company Documents\" to retrieve more relevant sections\n- **Extend memory**: Adjust `contextWindowLength` in \"Conversation History\" to remember more previous messages\n- **Switch AI model**: Replace GPT-4 Mini with GPT-4 or other models based on your accuracy needs\n- **Add filters**: Modify the system prompt to focus on specific departments or document types\n- **Custom responses**: Update the system message in \"Company Knowledge Assistant\" to match your company's tone\n\n## Tips for best results\n\n- Use clear, descriptive file names for documents in Drive\n- Organize documents by department or topic in subfolders\n- Include FAQ documents with common questions and answers\n- Regularly update outdated documents to maintain accuracy\n- Monitor the assistant's responses and refine the system prompt as needed\n\n---\n",
  "featuredImage": "/data/workflows/10947/10947.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 127,
  "downloads": 12,
  "createdAt": "2025-11-18T04:10:32.078Z",
  "updatedAt": "2026-01-16T09:06:53.415Z",
  "publishedAt": "2025-11-18T04:10:32.078Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10947"
}