{
  "id": 7790,
  "slug": "7790",
  "title": "News-to-blog automation with GPT, Leonardo AI & WordPress publishing",
  "description": "This workflow automates the end-to-end process of generating and publishing blog posts from live news headlines.\n\nFetch Headlines – Collects the latest top stories from Google News and GDELT, merges them, and removes duplicates.\n\nHeadline Selection & Classification – Picks top headlines, checks relevance, and applies style rules.\n\nDraft Generation – Uses GPT to create an initial blog article in a natural, human tone.\n\nTone & Expansion – Refines the draft for clarity, length, and style (customized to your own writing voice).\n\nImage Generation – Sends the article topic to Leonardo AI, waits for the image to finish rendering, and retrieves the final asset.\n\nPublish to WordPress – Uploads the generated image, assigns alt-text, creates a WordPress post with the article and image, and logs the publication to Google Sheets for tracking.\n\nPurpose\n\nDesigned for hands-off content automation, this workflow continuously produces SEO-ready blog posts enriched with AI-generated images and publishes them directly to WordPress. It’s ideal for:\n\nRunning an automated blog that reacts to trending news.\n\nKeeping websites updated with fresh, styled content without manual effort.\n\nCreating a repeatable content engine that combines research, writing, and media assets in one pipeline.\n\n\nSetup Instructions:\nAdd Your Credentials\n\nGo to Credentials in n8n and create:\n\nOpenAI (for article generation)\n\nLeonardo AI (for image generation)\n\nWordPress (to publish posts)\n\n(Optional) Google Sheets (to log published articles)\n\nAttach these credentials to the matching nodes in the workflow.\n\nCheck the WordPress Node\n\nUpdate the WordPress site URL to your own blog.\n\nMake sure the category, tags, and status (publish/draft) are set the way you want.",
  "featuredImage": "/data/workflows/7790/7790.webp",
  "author": {
    "id": 101,
    "slug": "dingofister",
    "name": "Dean Gallop",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 494,
  "downloads": 49,
  "createdAt": "2025-08-24T14:59:55.003Z",
  "updatedAt": "2026-01-16T08:52:23.792Z",
  "publishedAt": "2025-08-24T14:59:55.003Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7790"
}