{
  "id": 3472,
  "slug": "3472",
  "title": "Automate WordPress contact form (CF7) responses and classification with Gemini",
  "description": "This workflow optimizes the management of inquiries received through a **contact form (Contact Form 7 - CF7 Plugin)** on a **WordPress site**, automating the process of classification, response drafting, and data storage.\n\nThis workflow is particularly useful for businesses that receive multiple daily inquiries and want to improve their efficiency in managing customer communications. \n\n### **Benefits:**  \n✅ **Automation & Speed** – Reduces the time needed to handle inquiries manually.  \n✅ **Better Email Management** – Ensures every message receives a timely and accurate response.  \n✅ **Customization** – The generated draft can be edited before sending, maintaining a personal touch.  \n✅ **Inquiry History** – Storing data in Google Sheets allows for easy tracking of customer interactions.  \n✅ **Easy Integration** – Works seamlessly with Contact Form 7 without complex configurations. \n\n\n---- \n\n### How It Works  \n1. **Form Submission Handling**: The workflow starts with a WordPress form submission captured via a webhook. The form data (first name, last name, email, phone, and message) is extracted and structured using the \"Set Fields\" node.  \n2. **Message Classification**: The submitted message is classified into predefined categories (e.g., \"Product Info,\" \"Order Info,\" or \"Other\") using the \"Message Classifier\" node, powered by Google Gemini.  \n3. **Automated Email Drafting**: Based on the classification, the workflow generates a professional email draft using one of three \"Email Writer\" nodes (for Product, Order, or Other requests). Each node uses Google Gemini to craft a personalized response with a structured format (subject and body).  \n4. **Email Draft Creation**: The drafted email is sent as a Gmail draft to the appropriate department, including the original form data for context.  \n5. **Data Logging**: All submissions, along with their classifications and email drafts, are logged in a Google Sheets spreadsheet for record-keeping and further action.  \n\n---\n\n### Set Up Steps  \n1. **Install WordPress Plugin**: Install the \"CF7 to Webhook\" plugin on WordPress and configure it to send form submissions to the n8n webhook URL.  \n2. **Configure Webhook in n8n**: Set up the \"From Wordpress\" webhook node in n8n to receive POST requests from the WordPress form.  \n3. **Google Gemini Integration**: Ensure the Google Gemini nodes are properly authenticated with the correct API credentials.  \n4. **Gmail and Google Sheets Setup**: Authenticate the Gmail and Google Sheets nodes with the appropriate OAuth2 credentials and specify the target spreadsheet and sheet name.  \n5. **Customize Classification Categories**: Adjust the categories in the \"Message Classifier\" node to match your business needs.  \n6. **Test the Workflow**: Trigger a test form submission to verify the workflow processes data correctly, classifies the message, generates an email draft, and logs the data.  \n\n---\n\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/). ",
  "featuredImage": "/data/workflows/3472/3472.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2084,
  "downloads": 208,
  "createdAt": "2025-04-08T09:34:12.687Z",
  "updatedAt": "2026-01-16T08:29:54.802Z",
  "publishedAt": "2025-04-08T09:34:12.687Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3472"
}