{
  "id": 6783,
  "slug": "6783",
  "title": "Daily Magento 2 customer sync to Google Contacts & Sheets without duplicates",
  "description": "### Automatically sync newly registered Magento 2 customers to Google Contacts and Google Sheets every 24 hours — with full duplication control and seamless automation.\n\nThis workflow is a plug-and-play customer contact automation system designed for Magento 2 store owners, marketers, and CRM teams. It fetches customer records registered within the last 24 hours (from 00:00:00 to 23:59:59), checks against an existing Google Sheet to avoid reprocessing, and syncs only the new ones into Google Contacts. This ensures your contact list is always fresh and up to date — without clutter or duplicates.\n\n#### ✅ What This Workflow Does:\n1. Automates Customer Syncing\n2. Every day, it fetches newly registered Magento 2 customers via API based on the exact date range (midnight to midnight).\n3. Deduplicates Using Google Sheets\n4. A master Google Sheet tracks already-synced emails. Before adding a customer, the workflow checks this list and skips if already present.\n5. Creates Google Contacts Automatically\n6. For each unique customer, it creates a new contact in your Google Contacts, saving fields like first name, last name, and email.\n7. Logs New Entries to Google Sheets\n8. In Google Sheets, it even records magento 2 customer group, created_at, website_id & store_id\n8. After syncing, it adds each new email to the tracking sheet, building a cumulative record of synced contacts.\n9. Fully Scheduled & Automated\n10. Can be scheduled with the Cron node to run daily (e.g., 12:05 AM) with no manual intervention required.\n\n#### 🔧 Modules Used:\n- HTTP Request (Magento 2 API)\n- Date & Time (for filtering registrations)\n- Google Sheets (for reading/writing synced emails)\n- Google Contacts (for contact creation)\n- Set, IF, and Merge nodes (for control logic)\n- Cron (for scheduling the automation)\n\n#### 💼 Use Cases:\n- Keep your email marketing tools synced with Magento 2 customer data.\n- Build a CRM-friendly contact base in Google Contacts without duplicates.\n- Share customer data with sales or support teams through synced Google Sheets.\n- Reduce manual work and human error in data transfer processes.\n\n#### 🔒 Credentials Required\n\n- Magento 2 Bearer Auth: Set up as a credential in n8n using your Magento 2 API access token.\n- Google API \n\n#### 📂 Category\n\nE-commerce → Magento 2 (Adobe Commerce)\n\n#### 💬 Need Help?\n\n💡 Having trouble setting it up or want to customize this workflow further?\nFeel free to reach out — I’m happy to help with setup, customization, or Magento 2 API integration issues.\n\nContact: Author\n\n### 👤 Author\n\nKanaka Kishore Kandregula\nCertified Magento 2 Developer\nhttps://gravatar.com/kmyprojects\nhttps://www.linkedin.com/in/kanakakishore",
  "featuredImage": "/data/workflows/6783/6783.webp",
  "author": {
    "id": 101,
    "slug": "kmyprojects",
    "name": "Kanaka Kishore Kandregula",
    "avatar": ""
  },
  "categories": [
    "CRM"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 152,
  "downloads": 15,
  "createdAt": "2025-08-01T13:44:39.529Z",
  "updatedAt": "2026-01-16T08:47:05.082Z",
  "publishedAt": "2025-08-01T13:44:39.529Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6783"
}