{
  "id": 3851,
  "slug": "3851",
  "title": "Automate Etsy data mining with Bright Data Scrape & Google Gemini",
  "description": "### Who this is for?\nThe Automate Etsy Data Mining with Bright Data Scrape & Google Gemini workflow is designed for eCommerce analysts, product researchers, and AI developers seeking to extract actionable insights from Etsy listings at scale. \n\nIt is ideal for:\n\n- **eCommerce Entrepreneurs** - Researching product demand and competition.\n\n- **Market Analysts** - Tracking pricing, reviews, and trends across Etsy categories.\n\n- **Product Managers** - Identifying niche opportunities and design inspirations.\n\n- **Data Scientists & AI Engineers** - Automating product intelligence pipelines.\n\n- **Growth Hackers** - Leveraging Etsy insights to refine product-market fit.\n\n### What problem is this workflow solving?\nManually browsing Etsy to analyze product listings, pricing, reviews, and seller activity is slow, inconsistent, and unscalable. Scraping Etsy requires unlocking JavaScript-heavy content and structuring noisy data for analysis.\n\nThis workflow solves:\n\n- Automated and scalable scraping of Etsy product listings using Bright Data’s infrastructure.\n\n- A fully paginated data structured Estry production data extraction via the Google Gemini LLM.\n\n- Enables faster decision-making for product research and competitive analysis via the fully automated paginated data extraction.\n\n### What this workflow does\n\n- Receives input: Sets the Esty URL for the data extraction and analysis.\n\n- Uses Bright Data's Web Unlocker to extract content from relevant sites.\n\n- Cleans and preprocesses the scraped content for readability.\n\n- Sends the content to Google Gemini for:\n\n\t- Enriched results including:\n\n\t\t- Data persistence over the disk.\n\n\t\t- Sends the response to a target system via Webhook notification.\n\n### Setup\n\n- Sign up at [Bright Data](https://brightdata.com/).\n- Navigate to Proxies & Scraping and create a new Web Unlocker zone by selecting Web Unlocker API under Scraping Solutions.\n- In n8n, configure the Header Auth account under Credentials (Generic Auth Type: Header Authentication).\n![Header Authentication.png](fileId:1241)\nThe Value field should be set with the \n**Bearer XXXXXXXXXXXXXX**. The XXXXXXXXXXXXXX should be replaced by the Web Unlocker Token.\n- A Google Gemini API key (or access through Vertex AI or proxy).\n- Update the **Set Esty Search Query** for setting the brand content URL and the Bright Data Zone name.\n- Update the Webhook HTTP Request node with the Webhook endpoint of your choice.\n\n### How to customize this workflow to your needs\n\n- **Input Sources** : Replace the static URL with dynamic input from Google Sheets, Webhook, or Airtable to research multiple niches.\n\n- **Prompt Customization** : Adjust Gemini prompts to extract specific insights for example:\n\n\t- List key features of the product\n\n\t- Summarization of the review themes\n- **Data Output Options** : Update the Webhook notification to save data to:\n\n\t- Google Sheets\n\t- Notion or Airtable\n\t- SQL/NoSQL\n\t- Slack/Email\n\n\n\n\n\n\n\n\n",
  "featuredImage": "/data/workflows/3851/3851.webp",
  "author": {
    "id": 101,
    "slug": "ranjancse",
    "name": "Ranjan Dailata",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5323,
  "downloads": 532,
  "createdAt": "2025-05-03T23:15:27.321Z",
  "updatedAt": "2026-01-16T08:31:46.552Z",
  "publishedAt": "2025-05-03T23:15:27.321Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3851"
}