{
  "id": 4067,
  "slug": "4067",
  "title": "Automated email assistant for suppliers using OpenAI and Google Sheets",
  "description": "## Automated Email Assistant for Busy Professionals\n\nThis assistant is designed for people who don't have time to write and send emails to suppliers. With just one request, it drafts and sends clear, professional messages automatically.\n\n## How It Works\nThe user makes a request (e.g., “Send an email to my fruit supplier asking for a quote on 1 crate of mangoes.”).\n\n## Workflow:\n\n1. The AI agent searches for the supplier in a Google Sheets database.\n\n2. It automatically drafts the email using OpenAI (with the tone and style you define).\n \n3. It sends the email using your Gmail account connected through n8n.\n \n## This assistant uses:\n\n- Google Sheets to manage your suppliers (name and email).\n\n- OpenAI to generate clear, natural messages.\n  \n- MCP (client-server logic) to handle request processing.\n  \n- Gmail as the sending channel for automated emails.\n  \n\n## Setup Instructions\n\n1. Create a Google Sheets document with the supplier name and email, like this:\n\n|Supplier name|Email|\n|-|-|\n|Proveedor de frutas Alvarez|fruteriaalvarez@alvarez.com|\n \n2. Connect your Google Sheets and Gmail accounts within n8n.\n \n3. Add your OpenAI API key.\n\nTest the automation by chatting with the integrated assistant.\nIt will generate and send the email automatically to the indicated supplier.\n\n## Requirements\n- OpenAI API key to generate email content.\n- Gmail account connected via OAuth2.\n- Google Sheets document with your supplier database.\n- n8n instance (cloud or self-hosted).\n\n## Customization\n\nAdjust the OpenAI prompt to make the email tone more formal, casual, or technical.\n\nAdd custom fields to your supplier sheet (location, notes, special conditions).\n\nReplace Google Sheets with a real database like Supabase or PostgreSQL for greater scalability.\n",
  "featuredImage": "/data/workflows/4067/4067.webp",
  "author": {
    "id": 101,
    "slug": "omarhdez",
    "name": "Omar Hdez",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1421,
  "downloads": 142,
  "createdAt": "2025-05-15T06:22:30.568Z",
  "updatedAt": "2026-01-16T08:32:52.386Z",
  "publishedAt": "2025-05-15T06:22:30.568Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4067"
}