{
  "id": 3986,
  "slug": "3986",
  "title": "Personalized AI tech newsletter using RSS, OpenAI and Gmail",
  "description": "## Combine Tech News in a Personalized Weekly Newsletter\n\nThis n8n template automates the collection, storage, and summarization of technology news from top sites, turning it into a concise, personalized weekly newsletter.\n\nIf you like staying informed but want to reduce daily distractions, this workflow is perfect for you. It leverages RSS feeds, vector databases, and LLMs to read and curate tech content on your behalf—so you only receive what truly matters.\n\n---\n\n## How it works\n\n* A **daily scheduled trigger** fetches articles from multiple popular tech RSS feeds like Wired, TechCrunch, and The Verge.\n* Fetched articles are:\n\n  * **Normalized** to extract titles, summaries, and publish dates.\n  * **Converted to vector embeddings** via OpenAI and stored in memory for fast semantic querying.\n* A **weekly scheduled trigger** activates the AI summarization flow:\n\n  * The AI is provided with your interests (e.g., *AI, games, gadgets*) and the desired number of items (e.g., 15).\n  * It queries the vector store to retrieve relevant articles and summarizes the most newsworthy stories.\n  * The summary is converted into a clean, email-friendly format and sent to your inbox.\n\n---\n\n## How to use\n\n1. Connect your **OpenAI** and **Gmail** accounts to n8n.\n2. Customize the list of RSS feeds in the “Set Tech News RSS Feeds” node.\n3. Update your interests and number of desired news items in the “Your Topics of Interest” node.\n4. Activate the workflow and let the automation run on schedule.\n\n---\n\n## Requirements\n\n* **OpenAI** credentials for embeddings and summarization\n* **Gmail** (or another email service) for sending the newsletter\n\n---\n\n## Customizing this workflow\n\n* Want to use different sources? Swap in your own RSS feeds, or use an API-based news aggregator.\n* Replace the in-memory vector store with **Pinecone**, **Weaviate**, or another persistent vector DB for longer-term storage.\n* Adjust the agent's summarization style to suit internal updates, industry-specific briefings, or even entertainment recaps.\n* Prefer chat over email? Replace the email node with a **Telegram bot** to receive your personalized tech newsletter directly in a Telegram chat.\n",
  "featuredImage": "/data/workflows/3986/3986.webp",
  "author": {
    "id": 101,
    "slug": "miha",
    "name": "Miha",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 64622,
  "downloads": 6462,
  "createdAt": "2025-05-11T19:47:23.634Z",
  "updatedAt": "2026-01-16T08:32:30.404Z",
  "publishedAt": "2025-05-11T19:47:23.634Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3986"
}