{
  "id": 6686,
  "slug": "6686",
  "title": "Track expenses from receipt photos with Telegram & Google Sheets using OCR.space",
  "description": "Hello automation enthusiasts! 👋\n\nWant to automatically track your expenses from receipts without hefty OCR service costs? I've got you covered!\n\nI've updated my Personal Finance Tracking Chatbot template to incorporate a **free OCR service (OCR.space)**. This powerful n8n workflow lets you effortlessly log your expenses by **sending a picture of your receipt to your Telegram bot**. The OCR will extract key details like amount, date, and description, which are then neatly saved into your **Google Sheets**!\n\n**Why use this template?**\n- 📸 Free OCR-Powered Expense Tracking: Simply send a photo of your receipt to your Telegram bot and let OCR.space do the heavy lifting – without breaking the bank!\n- 📊 Automated Google Sheets Entry: Extracted data is seamlessly appended to your Google Sheet for easy financial overview.\n- 💰 Manual Entry Still Available: Easily record incomes and expenses via text commands for transactions without receipts.\n- 🤖 Instant Telegram Confirmations: Get immediate feedback on successful recordings, whether manual or OCR-processed.\n- ✨ Customizable Parsing: The included Function node allows you to refine the data extraction logic to perfectly match your receipt formats.\n\n**What Do You Need?**\n- An n8n account (self-hosted or cloud)\n- Your own Telegram Bot (free and easy to create!)\n- A **free API Key from OCR.space**.\n- A Google account and an empty Google Spreadsheet for your financial data.\n- A Google Spreadsheet with \"Income\" and \"Expenses\" sheets (with columns like ***Date, Description, Amount, Category, Type, Source***).\n\n**Who Is This For?**\nThis template is perfect for anyone who wants to gain more control over their personal finances in an efficient and hassle-free way. No more complex apps, just use your personal chatbot!\n\n**How to Use It?**\n1. **Get Your Free OCR.space API Key**: Visit [ocr.space/OCRAPI](https://ocr.space/OCRAPI) and sign up for a free key.\n2. **Import this JSON template** into your n8n instance.\n3. **Configure Credentials**: Set your Telegram Bot Token, Google Sheet ID, and OCR.space API Key as environment variables in n8n.\n4. **Activate the workflow.**\n5. Start tracking your finances by sending text commands (e.g., income salary 5000, expense coffee 15 food) or just snapping a photo of your receipt to your Telegram bot!\n\nLet's simplify your financial management with automation! Feel free to try it out and modify it to suit your needs. If you have any questions, leave a comment below!\n",
  "featuredImage": "/data/workflows/6686/6686.webp",
  "author": {
    "id": 101,
    "slug": "candrareza",
    "name": "Candra Reza",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2292,
  "downloads": 229,
  "createdAt": "2025-07-30T09:02:35.042Z",
  "updatedAt": "2026-01-16T08:46:29.614Z",
  "publishedAt": "2025-07-30T09:02:35.042Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6686"
}