{
  "id": 7183,
  "slug": "7183",
  "title": "Auto-analyze Google Analytics data with Gemini AI & smart Gmail/Telegram routing",
  "description": "# Who’s it for\nThis workflow is ideal for marketing teams, growth analysts, and business owners who need regular Google Analytics insights without manually digging through data. It’s also perfect for organizations that want to ensure positive performance updates reach stakeholders quickly while negative trends get immediate attention from the internal team.\n\n# How it works / What it does\nThe workflow runs weekly on a set schedule, pulls key performance metrics from Google Analytics, and aggregates the data into a clean summary.\nAn AI Agent (powered by Google Gemini and connected to Simple Memory for historical context) analyzes the data, generates actionable insights, and classifies the sentiment as Positive, Negative, or Neutral.\n- Positive sentiment → Automatically emailed to stakeholders via Gmail.\n- Negative sentiment → Sent instantly to a designated Telegram group for faster response.\n\nThis ensures wins are celebrated, and issues are addressed promptly.\n\n# How to set up\n- Configure the Schedule Trigger for your preferred reporting day/time.\n- Connect the Google Analytics node with your property ID and metrics/dimensions.\n- Set up the AI Agent with Google Gemini/others model API credentials.\n- Connect Gmail and Telegram accounts to their respective nodes.\n- Adjust sentiment routing rules.\n\n# Requirements\n- Google Analytics account with API access\n- Google Gemini API key\n- Gmail account with OAuth connection\n- Telegram bot token and group chat ID\n\n# How to customize the workflow\n- Modify the AI prompt to include custom KPIs or industry-specific recommendations.\n- Change the schedule frequency (daily, monthly, or on-demand).\n- Add Neutral sentiment handling (e.g., log to Google Sheets).\n- Extend with Slack, Discord, or other notification channels.\n\n",
  "featuredImage": "/data/workflows/7183/7183.webp",
  "author": {
    "id": 101,
    "slug": "rullysaputra15",
    "name": "Rully Saputra",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1083,
  "downloads": 108,
  "createdAt": "2025-08-08T15:00:34.394Z",
  "updatedAt": "2026-01-16T08:48:54.159Z",
  "publishedAt": "2025-08-08T15:00:34.394Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7183"
}