{
  "id": 8076,
  "slug": "8076",
  "title": "Generate B2B lead opportunities from websites with Brightdata & OpenRouter AI",
  "description": "This workflow is designed for B2B professionals to automatically identify and summarize **business opportunities** from a company's website.\n\nBy leveraging **[Bright Data's](https://get.brightdata.com/unstoppable)** Web Unblocker and advanced AI models from OpenRouter, it scrapes relevant company pages (\"About Us\", \"Team\", \"Contact\"), analyzes the content for potential pain points and needs, and synthesizes a concise, actionable report.\n\nThe final output is formatted for direct use in documents, making it an ideal tool for sales, marketing, and business development teams to prepare for prospecting calls or personalize outreach.\n\n---\n\n## Who's it for\n\nThis template is ideal for:\n- **B2B Sales Teams:** Quickly find and qualify leads by identifying specific business needs before a cold call.\n- **Marketing Agencies:** Develop personalized content and value propositions based on a prospect's public website information.\n- **Business Development Professionals:** Efficiently research potential partners or clients and discover collaboration opportunities.\n- **Entrepreneurs:** Gain a competitive edge by understanding a competitor's strategy or a potential client's operations.\n\n---\n\n## How it works\n\n1.  The workflow is triggered by a chat message, typically a URL from an n8n chat application.\n2.  It uses Bright Data to scrape the website's sitemap and extract all anchor links from the homepage.\n3.  An AI agent analyzes the extracted URLs to filter for pages relevant to company information (e.g., \"about-us,\" \"team,\" \"contact\").\n4.  The workflow then scrapes the content of these specific pages.\n5.  A second AI agent summarizes the content of each page, looking for business opportunities related to AI-powered automation.\n6.  The summaries are merged and a final AI agent synthesizes them into a single, cohesive report, formatted for easy reading in a Google Doc.\n\n---\n\n## How to set up\n\n1.  **Bright Data Credentials:** Sign up for a Bright Data account and create a Web Unblocker zone. In n8n, create new [Bright Data API credentials](https://get.brightdata.com/unstoppable) and copy your API key.\n2.  **OpenRouter Credentials:** Create an account on OpenRouter and get your API key. In n8n, create new OpenRouter API credentials and paste your key.\n3.  **Chat Trigger Node:** Configure the \"When chat message received\" node. Copy the production webhook URL to integrate with your preferred chat platform.\n\n---\n\n## Requirements\n\n-   An active n8n instance.\n-   A [Bright Data](https://get.brightdata.com/unstoppable) account with a Web Unblocker zone.\n-   An OpenRouter account with API access.\n\n---\n\n## How to customize this workflow\n\n-   **AI Prompting:** Edit the \"systemMessage\" parameters in the \"AI Agent\", \"AI Agent1\", and \"AI Agent2\" nodes to change the focus of the opportunity analysis. For example, modify the prompts to search for specific technologies, industry jargon, or different types of business challenges.\n-   **Model Selection:** The workflow uses `openai/o4-mini` and `openai/gpt-5`. You can change these to other models available on OpenRouter by editing the `model` parameter in the OpenRouter Chat Model nodes.\n-   **Scraping Logic:** The `extract url` node uses a regular expression to find `<a>` tags. This can be modified or replaced with an HTML Extraction node to target different elements or content on a website.\n-   **Output Format:** The final output is designed for Google Docs. You can modify the last \"AI Agent2\" node's prompt to generate the output in a different format, such as a simple JSON object or a markdown list.\n\n---\n\n\n[Phil | Inforeole](https://inforeole.fr)\n\n🇫🇷 Contactez nous pour automatiser vos processus\n",
  "featuredImage": "/data/workflows/8076/8076.webp",
  "author": {
    "id": 101,
    "slug": "phil",
    "name": "phil",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 442,
  "downloads": 44,
  "createdAt": "2025-08-31T07:54:26.482Z",
  "updatedAt": "2026-01-16T08:54:01.725Z",
  "publishedAt": "2025-08-31T07:54:26.482Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8076"
}