{
  "id": 10650,
  "slug": "10650",
  "title": "Generate and email PDF payslips from Google Sheets with Gmail",
  "description": "This workflow automates the entire payslip process by pulling payroll data directly from Google Sheets, generating a professional and secure PDF for each employee, and emailing it to them instantly. Save hours of manual HR administration, eliminate human error, and ensure timely, confidential delivery of payslips every month.\n\n![Screenshot 20251109 at 15.44.02.png](fileId:3254)\n\n## Why Use This Workflow?\n\n**Time Savings:** Reduces the entire payslip generation and distribution process from hours of manual work to under 5 minutes.  \n**Cost Reduction:** Avoids monthly subscription fees for dedicated payroll software, potentially saving $50-$200 per month.  \n**Error Prevention:** Ensures 100% data accuracy by pulling data directly from the source sheet, eliminating risky copy-paste mistakes.  \n**Scalability:** Effortlessly handles payroll for 10 or 1,000+ employees without any changes to the core process.\n\n## Ideal For\n\n- **HR Departments:** For automating the monthly payslip distribution cycle, freeing up teams to focus on more strategic tasks.\n- **Small Business Owners:** For managing payroll professionally and efficiently without a dedicated HR team or expensive software.\n- **Finance & Operations Teams:** For streamlining a critical financial communication process, ensuring accuracy and creating an audit trail.\n\n## How It Works\n\n1.  **Trigger:** The workflow is initiated manually, giving you full control over when to run payroll.\n2.  **Configuration & Data Fetch:** It loads company-specific details (name, address) and fetches the complete payroll dataset from your designated Google Sheet.\n3.  **Filter Unsent:** The workflow intelligently filters the list to process only employees who have not yet been sent a payslip, checking a status column in your sheet.\n4.  **Iterate & Process:** It processes one employee record at a time in a loop.\n5.  **Prepare Payslip Data:** A Code node dynamically formats all financial data into local currency, generates itemized lists for income and deductions (only showing non-zero values), and even converts the final take-home pay amount into words (specifically in Indonesian).\n6.  **Generate PDF:** The prepared data is injected into a beautifully designed HTML template. Puppeteer then converts this HTML into a high-quality, print-ready A4 PDF document.\n7.  **Email Delivery:** The generated PDF is attached to a personalized email and sent directly to the employee using your Gmail account.\n8.  **Update Status:** Finally, the workflow updates the Google Sheet, marking the employee's payslip as \"sent\" to prevent duplicate emails in future runs.\n\n![Payslip.png](fileId:3253)\n\n\n## Setup Guide\n\n### Prerequisites\n\n| Requirement | Type | Purpose |\n| :--- | :--- | :--- |\n| [n8n instance](https://n8n.partnerlinks.io/khmuhtadin) | Essential | The platform to run the automation. |\n| Google Sheets Account | Essential | To store and manage employee payroll data. |\n| Gmail Account | Essential | To send the generated PDF payslips to employees. |\n| Google Cloud Project | Essential | To create OAuth2 credentials for Sheets and Gmail. |\n\n### Installation Steps\n\n1.  Import the JSON file to your [n8n instance](https://n8n.partnerlinks.io/khmuhtadin).\n2.  **Configure credentials:**\n    -   **Google Sheets:** Create or use existing OAuth2 credentials from the Google Cloud Console. Ensure the Google Sheets API is enabled.\n    -   **Gmail:** Create or use existing OAuth2 credentials. Ensure the Gmail API is enabled. Often, you can use the same credential for both services.\n3.  **Update environment-specific values:**\n    -   In the **Fetch Payroll Data** and **Mark Email Sent in Sheet** nodes, select your Google Sheet and specific tab containing the payroll data.\n    -   In the **Company Configuration** node, update the values with your company's name, address, and the current payroll period details.\n4.  **Customize settings:**\n    -   Review the email subject and body in the **Send Payslip Email** node and adjust the text as needed.\n    -   Modify the template in the **Generate Payslip HTML** node to match your company's branding (e.g., change the primary color).\n5.  **Test execution:**\n    -   Add a test row to your Google Sheet with your own email address. Make sure the `Is Email Sent` column is set to \"no\".\n    -   Run the workflow manually to verify the process works end-to-end.\n\n## Technical Details\n\n### Core Nodes\n\n| Node | Purpose | Key Configuration |\n| :--- | :--- | :--- |\n| **Google Sheets** | Reads payroll data and updates the 'sent' status. | `Spreadsheet ID`, `Sheet Name`, and `Bank Account` as the key for matching rows to update. |\n| **Filter** | Processes only employees who haven't received a payslip. | Condition: `{{ $json[\"Is Email Sent\"] }}` equals `no`. |\n| **Code** | Formats currency, creates dynamic tables, and converts numbers to words. | Maps input columns from the sheet to output variables for the HTML template. |\n| **Puppeteer** | Converts the styled HTML into a downloadable PDF file. | `page.pdf` settings define the format (A4), margins, and scale. |\n| **Gmail** | Emails the generated PDF to the corresponding employee. | `To`, `Subject`, and `Attachment` fields use expressions to pull data from previous nodes. |\n| **Set** | Stores global configuration like company name and payroll date. | All company-specific details that appear on the payslip. |\n\n### Workflow Logic\n\nThe workflow operates on an idempotent loop principle. It first reads all data, then filters out employees who have already been processed by checking an `Is Email Sent` column. For each remaining employee, it generates the PDF, sends the email, and critically, updates the status column in Google Sheets from \"no\" to \"yes\". This final step ensures that if the workflow is run again, it will not re-process and re-send payslips, preventing duplicates.\n\n## Customization Options\n\n**Basic Adjustments:**\n\n-   **Email Content:** Modify the subject and body in the `Send Payslip Email` node.\n-   **Payslip Branding:** In the `Generate Payslip HTML` node, change the CSS variables like `--primary-color` to match your company colors.\n-   **Company Info:** Update all company-specific text in the `Company Configuration` node.\n\n**Advanced Enhancements:**\n\n-   **Automated Scheduling:** Replace the `Manual Trigger` with a `Schedule Trigger` to run the workflow automatically on a specific day each month.\n-   **Cloud Storage:** Add a Google Drive or Dropbox node after PDF generation to save a copy of every payslip to a secure cloud folder for archival purposes.\n-   **Error Notifications:** Add an error route to send a notification to an HR administrator via Slack or email if any part of the process fails for an employee.\n\n\n## Troubleshooting\n\n**Common Issues:**\n\n| Problem | Cause | Solution |\n| :--- | :--- | :--- |\n| PDF formatting is broken or misaligned. | Invalid HTML/CSS in the template, or an expression is returning an empty value. | Verify all expressions in the `Generate Payslip HTML` node are linked correctly. Use an online validator to check for HTML syntax errors. |\n| Workflow processes the same employees again. | The `Mark Email Sent in Sheet` node failed, or the `Filter` is misconfigured. | Ensure the `Filter` node checks for \"no\" (case-sensitive). Verify the `Mark Email Sent` node has write permissions and is correctly identifying the row to update. |\n| Emails are not being sent. | Incorrect Gmail API permissions or invalid credentials. | Re-authenticate your Gmail credential in n8n. Check your Google Cloud Project to ensure the Gmail API is enabled and has not hit its usage quota. |\n\n## Use Case Examples\n\n### Scenario 1: The Small Business Owner\n\n**Challenge:** A small agency owner with 20 employees manages payroll in a Google Sheet. Every month, they spend half a day manually creating payslips in a Word template, saving each as a PDF, and emailing them one by one.  \n**Solution:** By implementing this workflow, they can trigger the entire process with a single click after finalizing the payroll sheet.  \n**Result:** What used to take 3 hours now takes less than 2 minutes. Employees receive professional, consistent payslips, and the owner has a clear record of delivery in their Google Sheet.\n\n### Scenario 2: The HR Manager\n\n**Challenge:** An HR manager at a 150-employee company needs to distribute payslips confidentially. The current process involves a mail merge that is prone to errors and requires manual verification.  \n**Solution:** The payroll report is exported to a Google Sheet, and this workflow handles the rest. It runs through the entire list, generating and sending each payslip individually.  \n**Result:** The risk of sending the wrong payslip to an employee is eliminated. The process is fully automated, secure, and provides an auditable trail directly in the spreadsheet, saving the HR department over a day of work each month.\n\n---\n\n**Created by:** [Khaisa Studio](https://khaisa.studio)  \n**Category:** HR & Recruiting | **Tags:** Google Sheets, Gmail, PDF, HR, Automation, Puppeteer, Payroll  \n**Need custom workflows?** [Contact us](https://khaisa.studio/contact)\n\n**Connect with the creator:**  \n[Portfolio](https://khmuhtadin.com) • [Workflows](https://khaisa.studio/products/) • [LinkedIn](https://www.linkedin.com/in/khmuhtadin/) • [Medium](https://medium.com/@khaisastudio) • [Threads](https://www.threads.com/@khmuhtadin)",
  "featuredImage": "/data/workflows/10650/10650.webp",
  "author": {
    "id": 101,
    "slug": "khmuhtadin",
    "name": "Khairul Muhtadin",
    "avatar": ""
  },
  "categories": [
    "HR"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 214,
  "downloads": 21,
  "createdAt": "2025-11-09T08:48:16.748Z",
  "updatedAt": "2026-01-16T09:05:48.154Z",
  "publishedAt": "2025-11-09T08:48:16.748Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10650"
}