{
  "id": 6322,
  "slug": "6322",
  "title": "Automated WooCommerce abandoned cart recovery with Google Sheets email reminders",
  "description": "## Recover lost revenue on autopilot with this powerful WooCommerce Abandoned Cart Automation.\n\nThis workflow connects directly to your WooCommerce store using the REST API to fetch all recent orders. It logs them in Google Sheets for easy tracking and visibility. Every day at a scheduled time, it checks for orders with the \"pending\" status that haven't received a reminder email yet — and sends a personalized follow-up email to the customer.\n\n## Use it to:\n\nAutomatically remind customers about unpaid orders\n\nRecover abandoned carts without any manual effort\n\nKeep clean logs of all orders and reminders via Google Sheets\n\nBoost conversion rates and revenue with timely, helpful emails\n\n\n## Requirements:\nTo use this workflow, you need:\n\nA WooCommerce store with REST API access\n\nA connected Google Sheets account\n\nNo external plugins are required in WooCommerce. Just make sure the REST API is enabled and credentials are added to n8n.\n\n### Google Sheets Configuration\nCreate a Google Sheet with the following column headers (first row): \n\nOrder ID | Buyer | E-mail | Products | Price | Status | Order date | Payment url | Reminder sent\n\n### Customize Mail:\nCustomize the reminder message to match your brand voice and offer incentives like a discount or free shipping to encourage payment.\n\nSet it once and let your abandoned cart recovery run in the background — 24/7.\n\ncontact: contact@streamlinemakers.com",
  "featuredImage": "/data/workflows/6322/6322.webp",
  "author": {
    "id": 101,
    "slug": "jacobgad",
    "name": "Jacob",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 76,
  "downloads": 7,
  "createdAt": "2025-07-23T14:57:27.215Z",
  "updatedAt": "2026-01-16T08:44:26.070Z",
  "publishedAt": "2025-07-23T14:57:27.215Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6322"
}