{
  "id": 8995,
  "slug": "8995",
  "title": "Automate lead response with Google Sheets, OpenAI, Gmail, and Slack notifications",
  "description": "![Screenshot 20250926 at 140039 ▶️ Lead Nurturing Agent  n8n.png](fileId:2690)\n\n## Generate and send personalized lead emails from Google Sheets via OpenAI to Gmail with Slack alerts\n## Description\n\nThis template triggers when a new row appears in Google Sheets (from any intake form that writes to the sheet). It validates key fields, performs light deduplication by email or phone, and sends the data to OpenAI to generate a concise, brand-safe first-touch email. At the same time, the model classifies each lead as High, Medium, or Low based on your criteria for budget, services, and timeline. The email is sent immediately from your connected Gmail (or SMTP) account. The sales team is notified in Slack with the lead’s name, contact details, services of interest, budget, and a deep link to the exact Google Sheets row. The Google Sheet is then updated with send status, lead type, and a timestamp for easy tracking.\n\n## Setup: \nConnect Google Sheets (read/write), Gmail/SMTP, Slack (webhook or app), and an OpenAI API key. Provide brief classifier rules and a short tone guide with one clear CTA (reply or booking link). Include a one-line opt-out in the email body to stay compliant. Expected headers are: Timestamp, Name, Email Address, Phone Number, Services Interested In, Budget Range, Preferred Contact Time, Project Timeline, and Additional Comments. The trigger checks the sheet every minute and processes after-hours submissions right away. You can extend the flow with calendar booking links, territory routing, or rate limits as needed.\n",
  "featuredImage": "/data/workflows/8995/8995.webp",
  "author": {
    "id": 101,
    "slug": "jack-bluecrabai",
    "name": "Jack Mason",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 244,
  "downloads": 24,
  "createdAt": "2025-09-26T21:29:10.073Z",
  "updatedAt": "2026-01-16T08:58:38.525Z",
  "publishedAt": "2025-09-26T21:29:10.073Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8995"
}