{
  "id": 6579,
  "slug": "6579",
  "title": "Send personalized product recommendations via email after Shopify purchases",
  "description": "## 🚀 Shopify Post-Purchase Upsell/Cross-sell Email Automation\n\n\n## Overview\nThis automation triggers when a new order is placed in your Shopify store. It then waits a short period, intelligently identifies complementary products based on the customer's purchase, retrieves those product details, and finally sends a personalized email showcasing the recommendations.\n\n\n## How it works\n\nThis automation triggers when a new order is placed in your Shopify store. It then waits a short period, intelligently identifies complementary products based on the customer's purchase, retrieves those product details, and finally sends a personalized email showcasing the recommendations.\n\n1. Order Detection: When a customer completes a purchase, the flow begins.\n\n2. Smart Delay: A brief pause ensures initial order confirmations are sent.\n\n3. Recommendation Engine: The workflow identifies relevant upsell or cross-sell products based on your predefined rules.\n\n4. Dynamic Email Creation: It fetches details for the recommended products and builds a visually appealing, personalized email.\n\n5. Email Delivery: The tailored email is sent to your customer, encouraging their next purchase.\n\n## Setup Steps\n\nGetting this automation ready will take approximately 1-2 hours, including populating your product recommendations.\n\nImport Workflow: Import the provided n8n JSON file into your n8n instance.\n\nConfigure Credentials: Set up your Shopify API and SMTP (email sending) credentials within n8n. Ensure your Shopify credential has read_orders and read_products permissions.\n\nDefine Recommendations: Open the Generate Recommendation IDs (Code) node. Crucially, update the recommendationsMap within this node to define which products should be suggested based on specific purchased product IDs from your Shopify store.\n\nCustomize Email & URLs: In the Send Upsell Email node, customize the fromEmail, subject, and the main HTML content to match your brand. Also, update YOUR_SHOPIFY_STORE_URL and YOUR_UNSUBSCRIBE_LINK placeholders in the Format Recommendations HTML (Code) and Send Upsell Email nodes.\n\nActivate & Test: Turn the workflow to Active and place a test order in your Shopify store to verify everything works as expected.\n\n(For detailed descriptions and troubleshooting, refer to the Sticky Notes located directly within the n8n workflow itself.)",
  "featuredImage": "/data/workflows/6579/6579.webp",
  "author": {
    "id": 101,
    "slug": "dae221",
    "name": "David Olusola",
    "avatar": ""
  },
  "categories": [
    "Social Media"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 173,
  "downloads": 17,
  "createdAt": "2025-07-28T12:33:18.515Z",
  "updatedAt": "2026-01-16T08:45:46.928Z",
  "publishedAt": "2025-07-28T12:33:18.515Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6579"
}