{
  "id": 7292,
  "slug": "7292",
  "title": "Smart helpdesk ticket alerts from Easy Redmine to Teams with GPT-4 summaries",
  "description": "# Automated Helpdesk Ticket Alerts to Microsoft Teams from Easy Redmine\n\n## Intro/Overview\nThis workflow automatically posts a Microsoft Teams message whenever a new helpdesk ticket is created in Easy Redmine. It’s perfect for IT teams who want real-time visibility into new issues without constantly checking ticket queues or inboxes. By integrating Easy Redmine with Teams, this setup ensures tickets are discussed and resolved faster, improving both response and resolution times.\n\n---\n\n## How it works\n\n1. **Catch Easy Webhook – New Issue Created**  \n   - Triggers whenever Easy Redmine sends a webhook for a newly created ticket.  \n   - Uses the webhook URL generated from Easy Redmine’s webhook settings.\n\n2. **Get a new ticket by ID**  \n   - Fetches full ticket details (subject, priority, description) via the Easy Redmine API using the ticket ID from the webhook payload.\n\n3. **Pick Description & Create URL to Issue**  \n   - Extracts the ticket description.  \n   - Builds a direct link to the ticket in Easy Redmine for quick access.\n\n4. **AI Agent – Description Processing**  \n   - Uses an AI model to summarize the ticket and suggest possible solutions based on the issue description.\n\n5. **MS Teams Message to Support Channel**  \n   - Formats and sends the ticket details, priority, summary, and issue link into a designated Microsoft Teams channel.  \n   - Uses the Teams message layout for clarity and quick scanning.\n\n---\n\n## How to Use\n\n1. **Import the workflow** into your n8n instance.\n2. **Set up credentials**:\n   - Easy Redmine API credentials with permission to read helpdesk tickets.\n   - Microsoft Teams credentials for posting messages to a channel.\n3. **Configure Easy Redmine webhook** \n\t- To trigger on ticket creation events. \n\t- Insert n8n webhook URL to your active Easy Redmine Webhook which can be created at https://easy-redmine-application.com/easy_web_hooks\n4. **Adjust node settings**:\n   - In the webhook node, use your Easy Redmine webhook URL.\n   - In the “Get a new ticket by ID” node, insert your API endpoint and authentication.\n   - In the Teams message node, select the correct Teams channel.\n5. **Adjust timezone or scheduling** if your team works across different time zones.\n6. **Test the workflow** by creating a sample ticket in Easy Redmine and confirming that it posts to Teams.\n\n---\n\n## Example Use Cases\n\n- **IT Helpdesk**: Notify the support team immediately when new issues are logged.\n- **Customer Support Teams**: Keep the entire team updated on urgent tickets in real time.\n- **Project Teams**: Ensure critical bug reports are shared instantly with the right stakeholders.\n\n---\n\n## Requirements\n\n- Easy Redmine application\n- Easy Redmine technical user for API calls with “read” permissions on tickets\n- Microsoft Teams technical user for API calls with “post message” permissions\n- Active n8n instance\n\n---\n\n## Customization\n\n- Change the AI prompt to adjust how summaries and solutions are generated.\n- Modify the Teams message format (e.g., bold priority, add emojis for urgency).\n- Add filters so only high-priority or specific project tickets trigger notifications.\n- Send alerts to multiple Teams channels based on ticket type or project.\n\n---\n\n**Workflow Improvement Suggestions:**  \n- Rename nodes for clarity (e.g., “Fetch Ticket Details” instead of “get-one-issue”).  \n- Ensure no private ticket data is exposed beyond intended recipients.  \n- Add error handling for failed API calls to avoid missing ticket alerts.\n",
  "featuredImage": "/data/workflows/7292/7292.webp",
  "author": {
    "id": 101,
    "slug": "easy8ai",
    "name": "Easy8.ai",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 905,
  "downloads": 90,
  "createdAt": "2025-08-12T13:12:42.398Z",
  "updatedAt": "2026-01-16T08:49:32.350Z",
  "publishedAt": "2025-08-12T13:12:42.398Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7292"
}