{
  "id": 12283,
  "slug": "12283",
  "title": "Monitor brand reputation and detect crises with GPT-4, Slack and Gmail",
  "description": "## How It Works\nThis workflow automates brand reputation monitoring by analyzing sentiment across news, social media, reviews, and forums using AI-powered trend detection. Designed for PR teams, brand managers, marketing directors, and crisis communication specialists requiring real-time awareness of reputation threats before they escalate.The template solves the challenge of manually tracking brand mentions across fragmented channels—news outlets, Twitter, Instagram, review sites, Reddit, industry forums—then identifying emerging crises hidden in sentiment shifts and volume spikes.Scheduled execution triggers four parallel HTTP nodes fetching data from news APIs, social media monitoring services, review aggregators, and forum discussion platforms. Merge node combines all sources, then normalization ensures consistent data structure. OpenAI GPT-4 with structured output parsing performs sophisticated sentiment analysis and trend detection, identifying sudden negative sentiment surges, coordinated criticism patterns, and viral complaint escalation. \n\n## Setup Steps\n1. Configure HTTP nodes with API credentials for news monitoring service \n2. Add OpenAI API key to Chat Model node for sentiment and trend analysis\n3. Connect Slack workspace and specify crisis response team channel \n4. Integrate Gmail account with PR leadership distribution list  \n5. Set up Google Sheets connection and create monitoring dashboard  \n\n## Prerequisites\nOpenAI API key, news monitoring API access\n\n## Use Cases\nConsumer brands monitoring product launch reception and identifying quality issues early\n\n## Customization\nModify AI prompts for industry-specific crisis indicators\n\n## Benefits\nReduces crisis detection time from hours to minutes enabling damage control before viral spread\n\n\n\n\n\n\n\n\n\n \n\n\n\n",
  "featuredImage": "/data/workflows/12283/12283.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 53,
  "downloads": 5,
  "createdAt": "2025-12-29T15:38:24.070Z",
  "updatedAt": "2026-01-16T09:11:58.332Z",
  "publishedAt": "2025-12-29T15:38:24.070Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12283"
}