{
  "id": 6668,
  "slug": "6668",
  "title": "Daily company online presence monitor with AI sentiment analysis & multi-platform tracking",
  "description": "How it works\n\nThis workflow provides a comprehensive daily overview of your chosen company's online presence. It automatically:\n\n- Scans diverse online sources including Google News, Reddit, and YouTube for mentions of your specified company and keywords.\n\n- Leverages Artificial Intelligence to analyze the sentiment (positive, negative, neutral) and provide concise summaries for each new mention.\n\n- Intelligently tracks and deduplicates content using a persistent local database, ensuring you only receive alerts for genuinely new discussions or articles, preventing redundant notifications.\n\n- Compiles a structured, categorized daily report detailing new mentions by source and sentiment.\n\n- Delivers this insightful report directly to your email inbox.\n\nGain unparalleled visibility into your company's online reputation and public perception across various digital channels!\n\n**Set up steps**\n\nSetting up this comprehensive workflow is more involved, typically taking around 25-50 minutes, due to multiple data sources, AI integration, and database management. You'll need to:\n\n- Define your company's name and a comprehensive list of search keywords.\n\n- Authenticate your preferred email service (e.g., Gmail).\n\n- Obtain an API key for your chosen AI service (e.g., OpenAI).\n\n- Authenticate your Reddit account.\n\n- Authenticate your Google (YouTube) account (for YouTube API access).\n\n- Understand the nuances of general internet monitoring, acknowledging that capturing \"all\" content is practically impossible without highly specialized (and expensive) enterprise tools.\n\nAll detailed setup instructions and specific configuration guidance are provided within the workflow itself using sticky notes.",
  "featuredImage": "/data/workflows/6668/6668.webp",
  "author": {
    "id": 101,
    "slug": "piotrsobolewski",
    "name": "Piotr Sobolewski",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 498,
  "downloads": 49,
  "createdAt": "2025-07-29T19:43:16.419Z",
  "updatedAt": "2026-01-16T08:46:23.236Z",
  "publishedAt": "2025-07-29T19:43:16.419Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6668"
}