{
  "id": 4272,
  "slug": "4272",
  "title": "Generate a personal newsfeed using Bright Data web scraping and GPT-4.1",
  "description": "![Personal newsfeed Bright Data MCP  OpenAI.png](fileId:1360)\n\n## How it Works\n\n**Disclaimer: This template is for self-hosted n8n instances only.**\n\nThis workflow is designed for developers, data analysts, and automation enthusiasts seeking to automate personalized news collection and delivery. It seamlessly combines n8n, OpenAI (e.g., GPT-4.1), and [Bright Data’s Model Context Protocol (MCP)](https://github.com/luminati-io/brightdata-mcp) to collect, extract, and email the latest global news headlines.  \nOn a schedule or via a manual trigger, the workflow prompts an AI agent to gather fresh news. The agent leverages context-aware memory and integrated MCP tools to conduct both search engine queries and direct web page scraping in real time, delivering more than just meta search results—it extracts actual on-page headlines and trusted links. Results are formatted and delivered automatically by email via your SMTP provider, requiring zero manual effort once configured.\n\n---\n\n## Who is this for?\n\n- Developers, data engineers, or automation pros wanting an AI-powered, fully automated newsfeed\n- Teams needing up-to-date news digests from trusted global sources\n- Anyone self-hosting n8n who wishes to combine advanced LLMs with real-time web data\n\n---\n\n## Setup Steps\n\n- Setup time: Approx. 15–30 minutes (n8n install, API configuration, node setup)\n- Requirements:\n    - Self-hosted n8n instance\n    - OpenAI API key\n    - Bright Data MCP account credentials\n    - SMTP/email provider details\n- Install the community MCP node (`n8n-nodes-mcp`) for n8n and set up Bright Data MCP access.\n- Configure these nodes:\n    - **Schedule Trigger:** For automated delivery at your chosen interval.\n    - **Edit Fields:** To inject your AI news collection prompt.\n    - **AI Agent:** Connects to OpenAI and MCP, enabled with memory for context.\n    - **OpenAI Chat Model:** Connects via your OpenAI credentials.\n    - **MCP Clients:** Configure at least two—one for search (e.g. `search_engine`) and one for scraping (e.g. `scrape_as_markdown`).\n    - **Send Email:** Set up with recipient and SMTP information.\n- Credentials must be entered into their respective nodes for successful execution.\n\n---\n\n## Customization Guidance\n\n- **Prompt Tweaks:** Refine your AI news prompt to target specific genres, regions, or sources, or broaden/narrow the coverage as needed.\n- **Tool Configuration:** Carefully define tool descriptions and parameters in MCP client nodes so the agent can pick the best tool for each step (e.g., only scrape real news sites).\n- **Delivery Settings:** Adjust email recipient(s) and SMTP details as needed.\n- **Workflow Enhancements:** Use sticky notes in n8n for extended documentation, alternate prompts, or troubleshooting tips.\n- **Run Frequency:** Set schedule as needed—from hourly to daily updates.\n\n---\n\nOnce configured, this workflow will automatically gather, extract, and email curated news headlines and links—no manual curation required!\n\n",
  "featuredImage": "/data/workflows/4272/4272.webp",
  "author": {
    "id": 101,
    "slug": "tomax",
    "name": "Daniel Shashko",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1445,
  "downloads": 144,
  "createdAt": "2025-05-21T08:13:35.560Z",
  "updatedAt": "2026-01-16T08:33:40.571Z",
  "publishedAt": "2025-05-21T08:13:35.560Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4272"
}