{
  "id": 9059,
  "slug": "9059",
  "title": "Auto-generate social media posts from URLs with AI, Telegram & multi-platform posting",
  "description": "## How it works\n\nThis workflow turns any URL sent to a Telegram bot into ready-to-publish social posts:\n\t1.\tTrigger: Telegram message (checks if it contains a URL).\n\t2.\tFetch & parse: Downloads the page and extracts readable text + title.\n\t3.\tAI writing: Generates platform-specific copy (Facebook, Instagram, LinkedIn).\n\t4.\tImage: Creates an AI image and stores it in Supabase Storage.\n\t5.\tPublish: Posts to Facebook Pages, Instagram Business, LinkedIn.\n\t6.\tLogging: Updates Google Sheets with post URLs and sends a Telegram confirmation (image + links).\n\n## Setup\n\t1.\tTelegram – create a bot, connect via n8n Telegram credentials.\n\t2.\tOpenAI / Gemini – add API key in n8n Credentials and select it in the AI nodes.\n\t3.\tFacebook/Instagram (Graph API) – create a credential called facebookGraph with:\n\t•\taccessToken (page-scoped or system user)\n\t•\tpageId (for Facebook Page photos)\n\t•\tigUserId (Instagram Business account ID)\n\t•\toptional fbApiVersion (default v19.0)\n\t4.\tLinkedIn – connect with OAuth2 in the LinkedIn node (leave as credential).\n\t5.\tSupabase – credential supabase with url and apiKey. Ensure a bucket exists (default used in the Set node is social-media).\n\t6.\tGoogle Sheets – replace YOUR_GOOGLE_SHEET_ID and Sheet1. Grant your n8n Google OAuth2 access.\n\n## Notes\n\t•\tNo API keys are stored in the template. Everything runs via n8n Credentials.\n\t•\tYou can change bucket name, image size/quality, and AI prompts in the respective nodes.\n\t•\tThe confirmation message on Telegram includes direct permalinks to the published posts.\n\n## Required credentials\n\t•\tTelegram Bot\n\t•\tOpenAI (or Gemini)\n\t•\tFacebook/Instagram Graph\n\t•\tLinkedIn OAuth2\n\t•\tSupabase (url + apiKey)\n\t•\tGoogle Sheets OAuth2\n\n## Inputs\n\t•\tA Telegram message that contains a URL.\n\n## Outputs\n\t•\tSocial posts published on Facebook, Instagram, LinkedIn.\n\t•\tRow appended/updated in Google Sheets with post URLs and image link.\n\t•\tTelegram confirmation with the generated image + post links.",
  "featuredImage": "/data/workflows/9059/9059.webp",
  "author": {
    "id": 101,
    "slug": "smart-camp-ai",
    "name": "Karol Otręba",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 999,
  "downloads": 99,
  "createdAt": "2025-09-28T21:52:49.972Z",
  "updatedAt": "2026-01-16T08:58:54.406Z",
  "publishedAt": "2025-09-28T21:52:49.972Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9059"
}