{
  "id": 11879,
  "slug": "11879",
  "title": "Generate comprehensive client brief reports with Llama 3 AI & Google Workspace",
  "description": "**How It Works**\n\n- Trigger:\nThe workflow starts automatically when a new file (PDF, DOCX, or TXT) is uploaded to a specific Google Drive folder for client briefs.\n\n- Configuration:\nThe workflow sets up key variables, such as the folder for storing reports, the account manager’s email, the tracking Google Sheet, and the error notification email.\n\n- File Type Check & Text Extraction:\nIt checks the file type and extracts the text using the appropriate method for PDF, DOCX, or TXT files.\n\n- Extraction Validation:\nIf text extraction fails or the file is empty, an error notification is sent to the designated email.\n\n- AI Analysis:\nThe extracted text is analyzed using Groq AI (Llama 3 model) to summarize the brief, extract client needs, goals, challenges, and more.\n\n- Industry Research:\nThe workflow performs additional AI-powered research on the client’s industry and project type, using Wikipedia and Google Search tools.\n\n- Report Generation:\nThe analysis and research are combined into a comprehensive, formatted report.\n\n- Google Doc Creation:\nThe report is saved as a new Google Doc in a specified folder.\n\n- Logging:\nKey details are logged in a Google Sheet for tracking and record-keeping.\n\n- Notification:\nThe account manager receives an email with highlights and a link to the full report.\n\n- Error Handling:\nIf any step fails (e.g., text extraction), an error email is sent with troubleshooting advice.\n\n**Setup Steps**\n\n1. Google Drive Folders:\nCreate a folder for incoming client briefs.\nCreate a folder for storing generated client summary reports.\n\n2. Google Sheet:\nCreate a Google Sheet with a sheet/tab named “Brief Analysis Log” for tracking analysis results.\n\n3. Google Cloud Project:\nSet up a Google Cloud project and enable APIs for Google Drive, Google Docs, Google Sheets, and Gmail.\nCreate OAuth2 credentials for n8n and connect them in your n8n instance.\n\n4.  Groq AI Credentials:\nObtain API credentials for Groq AI and add them to n8n.\n\n5. SerpAPI (Optional, for Google Search):\nIf using Google Search in research, get a SerpAPI key and add it to n8n.\n\n**n8n Workflow Configuration:**\n\nIn the “Workflow Configuration” node, set the following variables:\n- clientSummariesFolderId: Google Drive folder ID for reports.\n- accountManagerEmail: Email address to notify.\n- trackingSheetId: Google Sheet ID for logging.\n- errorNotificationEmail: Email for error alerts.\n\n**Connect All Required Credentials:**\n\nMake sure all Google and AI nodes have the correct credentials selected in n8n.\nTest the Workflow:\n\nUpload a sample client brief to the monitored Google Drive folder.\nCheck that the workflow runs, generates a report, logs the result, and sends the notification email.",
  "featuredImage": "/data/workflows/11879/11879.webp",
  "author": {
    "id": 101,
    "slug": "digimetalab",
    "name": "DigiMetaLab",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 111,
  "downloads": 11,
  "createdAt": "2025-12-17T00:01:50.122Z",
  "updatedAt": "2026-01-16T09:10:31.794Z",
  "publishedAt": "2025-12-17T00:01:50.122Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11879"
}