{
  "id": 10948,
  "slug": "10948",
  "title": "Automate outbound lead follow-up & qualification",
  "description": "## How it works\nThis workflow pulls pending leads from Google Sheets on a scheduled trigger and processes each record individually. For every lead, an AI agent generates a structured subject and HTML body based on predefined rules. A tracking ID is then created and injected into the outgoing email before sending via Gmail. Once sent, Gmail metadata is retrieved and forwarded to your tracking API to initiate a follow-up sequence, and the corresponding lead entry in Google Sheets is updated.\n\n## Step-by-step\n\n- **Lead intake**\n  - **Schedule Trigger** – Runs daily and initiates lead retrieval.\n  - **Get row(s) in sheet** – Fetches only rows marked with “Pending”.\n  - **Loop Over Items** – Iterates through each lead entry.\n\n- **Email generation**\n  - **AI Agent** – Generates subject and HTML body using provided lead fields.\n  - **OpenAI Chat Model** – Executes the LLM instructions powering the email creation.\n  - **Structured Output Parser** – Validates that the AI returns compliant JSON.\n\n- **Tracking setup**\n  - **Generates Tracking ID** – Calls your tracking API and receives a unique tracking identifier.\n  - The tracking ID is embedded into the email through a tracking pixel.\n\n- **Email dispatch**\n  - **Send a message** – Sends the personalized email from Gmail using the AI-generated subject and body.\n\n- **Metadata retrieval**\n  - **Fetches Email Data** – Retrieves the sent email’s messageId, threadId, and related metadata.\n\n- **Sequence initiation**\n  - **Starts Sequence** – Posts metadata and tracking ID to your tracking API to activate the automated follow-up sequence.\n\n- **Lead status update**\n  - **Append or update row in sheet** – Marks the processed lead as “Done” and updates Google Sheets.\n\n## Why use this?\n- Automates outbound lead processing without manual input or oversight.\n- Delivers consistent, structured, AI-generated email outreach.\n- Ensures every email is tracked with unique identifiers for engagement analytics.\n- Pushes metadata to your tracking system for reliable follow-up sequences.\n- Updates your Google Sheets lead pipeline automatically to prevent duplicate outreach.\n",
  "featuredImage": "/data/workflows/10948/10948.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 255,
  "downloads": 25,
  "createdAt": "2025-11-18T04:54:08.115Z",
  "updatedAt": "2026-01-16T09:06:55.871Z",
  "publishedAt": "2025-11-18T04:54:08.115Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10948"
}