{
  "id": 7379,
  "slug": "7379",
  "title": "Generate website sitemaps & visual trees with Firecrawl and Google Sheets",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# Website sitemap generator and visual tree creator\n## Who's it for\nWeb developers, SEO specialists, UX designers, and digital marketers who need to analyze website structure, create visual sitemaps, or audit site architecture for optimization purposes.\n## What it does\nThis workflow automatically generates a comprehensive sitemap from any website URL and creates an organized hierarchical structure in Google Sheets. It follows the website's sitemap to discover all pages, then organizes them by navigation levels (Level 1, Level 2, etc.) with proper parent-child relationships. The output can be further processed to create visual tree diagrams and mind maps.\n## How it works\nThe workflow follows a five-step automation process:\n\nURL Input: Accepts website URL via chat interface\nSite Crawling: Uses Firecrawl to discover all pages following the website's sitemap only\nSuccess Validation: Checks if crawling was successful (some sites block external crawlers)\nHierarchical Organization: Processes URLs into a structured tree with proper level relationships\nGoogle Sheets Export: Creates a formatted spreadsheet with the complete site architecture\n\nThe system respects robots.txt and follows only sitemap-declared pages to ensure ethical crawling.\n## Requirements\n\nFirecrawl API key (for website crawling and sitemap discovery)\nGoogle Sheets access\nGoogle Drive access (for template duplication)\n\n## How to set up\n### Step 1: Prepare your template (recommended)\nIt's recommended to create your own copy of the base template:\n\nAccess the base Google Sheets template\nMake a copy for your personal use\nUpdate the workflow's \"Copy template\" node with your template's file ID (replace the default ID: 12lV4HwgudgzPPGXKNesIEExbFg09Tuu9gyC_jSS1HjI)\nThis ensures you have control over the template formatting and can customize it as needed\n\n### Step 2: Configure API credentials\nSet up the following credentials in n8n:\n\nFirecrawl API: For crawling websites and discovering sitemaps\nGoogle Sheets OAuth2: For creating and updating spreadsheets\nGoogle Drive OAuth2: For duplicating the template file\n\n### Step 3: Configure Firecrawl settings (optional)\nThe workflow uses optimized Firecrawl settings:\n\nignoreSitemap: false - Respects the website's sitemap\nsitemapOnly: true - Only crawls URLs listed in sitemap files\nThese settings ensure ethical crawling and faster processing\n\n### Step 4: Access the workflow\n\nThe workflow uses a chat trigger interface - no manual configuration needed\nSimply provide the website URL you want to analyze when prompted\n\n## How to use the workflow\n### Basic usage\n\nStart the chat: Access the workflow via the chat interface\nProvide URL: Enter the website URL you want to analyze (e.g., \"https://example.com\")\nWait for processing: The system will crawl, organize, and export the data\nReceive your results: Get an automatic direct clickable link to your generated Google Sheets - no need to search for the file\n\n### Error handling\n\nInvalid URLs: If the provided URL is invalid or the website blocks crawling, you'll receive an immediate error message\nGraceful failure: The workflow stops without creating unnecessary files when errors occur\nCommon causes: Incorrect URL format, robots.txt restrictions, or site security settings\n\n### File organization\n\nAutomatic naming: Generated files follow the pattern \"[Website URL] - n8n - Arborescence\"\nGoogle Drive storage: Files are automatically organized in your Google Drive\nInstant access: Direct link provided immediately upon completion\n\n### Advanced processing for visual diagrams\n#### Step 1: Copy sitemap data\nOnce your Google Sheets is ready:\n\nCopy all the hierarchical data from the generated spreadsheet\nPrepare it for AI processing\n\n#### Step 2: Generate ASCII tree structure\nUse any AI model with this prompt:\nCreate a hierarchical tree structure from the following website sitemap data. Return ONLY the tree structure using ASCII tree formatting with ├── and └── characters. Do not include any explanations, comments, or additional text - just the pure tree structure. The tree should start with the root domain and show all pages organized by their hierarchical levels. Use proper indentation to show parent-child relationships. Here is the sitemap data: [PASTE THE SITEMAP DATA HERE] \n\nRequirements: \n- Use ASCII tree characters (├── └── │) \n- Show clear hierarchical relationships \n- Include all pages from the sitemap \n- Return ONLY the tree structure, no other text \n- Start with the root domain as the top level\n#### Step 3: Create visual mind map\n\nVisit the Whimsical Diagrams GPT\nRequest a mind map creation using your ASCII tree structure\nGet a professional visual representation of your website architecture\n\n## Results interpretation\n### Google Sheets output structure\nThe generated spreadsheet contains:\n\nNiv 0 to Niv 5: Hierarchical levels (0 = homepage, 1-5 = navigation depth)\nURL column: Complete URLs for reference\nHyperlinked structure: Clickable links organized by hierarchy\nMulti-domain support: Handles subdomains and different domain structures\n\n### Data organization features\n\nAutomatic sorting: Pages organized by navigation depth and alphabetical order\nParent-child relationships: Clear hierarchical structure maintained\nDomain separation: Main domains and subdomains processed separately\nClean formatting: URLs decoded and formatted for readability\n\n## Workflow limitations\n\nSitemap dependency: Only discovers pages listed in the website's sitemap\nCrawling restrictions: Some websites may block external crawlers\nLevel depth: Limited to 5 hierarchical levels for clarity\nRate limits: Respects Firecrawl API limitations\nTemplate dependency: Requires access to the base template for duplication\n\n## Use cases\n\nSEO audits: Analyze site structure for optimization opportunities\nUX research: Understand navigation patterns and user paths\nContent strategy: Identify content gaps and organizational issues\nSite migrations: Document existing structure before redesigns\nCompetitive analysis: Study competitor site architectures\nClient presentations: Create visual site maps for stakeholder reviews",
  "featuredImage": "/data/workflows/7379/7379.webp",
  "author": {
    "id": 101,
    "slug": "growthai",
    "name": "Growth AI",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 687,
  "downloads": 68,
  "createdAt": "2025-08-14T11:35:55.742Z",
  "updatedAt": "2026-01-16T08:50:03.102Z",
  "publishedAt": "2025-08-14T11:35:55.742Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7379"
}