{
  "id": 10531,
  "slug": "10531",
  "title": "AI-driven inventory management with OpenAI forecasting & ERP integration",
  "description": "This n8n workflow automates the monitoring of warehouse inventory and sales velocity to predict demand, generate purchase orders automatically, send them to suppliers, and record all transactions in ERP and database systems. It uses AI-driven forecasting to ensure timely restocking while maintaining operational efficiency and minimizing stockouts or overstocking.\n\n---\n\n### Key Features\n\n* **Automated Scheduling:** Periodically checks inventory and sales data at defined intervals.\n* **Real-Time Data Fetching:** Retrieves live warehouse stock levels and sales trends.\n* **AI Demand Forecasting:** Uses OpenAI GPT to predict future demand based on sales velocity and stock trends.\n* **Auto-Purchase Orders:** Automatically generates and sends purchase orders to suppliers.\n* **ERP Integration:** Logs completed purchase orders into ERP systems like SAP, Oracle, or Netsuite.\n* **Database Logging:** Saves purchase order details and forecast confidence data into SQL databases (PostgreSQL/MySQL).\n* **Email Notifications:** Notifies relevant teams upon successful order creation and logging.\n* **Modular Configuration:** Each node includes configuration notes and credentials setup instructions.\n\n---\n\n### Workflow Process\n\n1. **Schedule Trigger**\n\n   * Runs every 6 hours to monitor stock and sales data.\n   * Interval can be adjusted for higher or lower frequency checks.\n\n2. **Fetch Current Inventory Data**\n\n   * Retrieves live inventory levels from the warehouse API endpoint.\n   * Requires API credentials and optional GET/POST method setup.\n\n3. **Fetch Sales Velocity**\n\n   * Pulls recent sales data for forecasting analysis.\n   * Used later for AI-based trend prediction.\n\n4. **Merge Inventory & Sales Data**\n\n   * Combines inventory and sales datasets into a unified JSON structure.\n   * Prepares data for AI model input.\n\n5. **AI Demand Forecasting**\n\n   * Sends merged data to OpenAI GPT for demand prediction.\n   * Returns demand score, reorder need, and confidence levels.\n\n6. **Parse AI Response**\n\n   * Extracts and structures forecast results.\n   * Combines AI data with original inventory dataset.\n\n7. **Filter: Reorder Needed**\n\n   * Identifies items flagged for reorder based on AI output.\n   * Passes only reorder-required products to next steps.\n\n8. **Create Purchase Order**\n\n   * Automatically creates a PO document with item details, quantity, and supplier information.\n   * Calculates total cost and applies forecast-based reorder logic.\n\n9. **Send PO to Supplier**\n\n   * Sends the generated purchase order to supplier API endpoints.\n   * Includes response validation for order success/failure.\n\n10. **Log to ERP System**\n\n    * Records confirmed purchase orders into ERP platforms (SAP, Oracle, Netsuite).\n    * Includes timestamps and forecast metrics.\n\n11. **Save to Database**\n\n    * Stores all PO data, supplier responses, and AI forecast metrics into PostgreSQL/MySQL tables.\n    * Useful for long-term audit and analytics.\n\n12. **Send Notification Email**\n\n    * Sends summary emails upon PO creation and logging.\n    * Includes PO ID, supplier, cost, and demand reasoning.\n\n---\n\n### Setup Instructions\n\n* **Schedule Trigger:**\n  Adjust to your preferred interval (e.g., every 6 hours or once daily).\n\n* **API Configuration:**\n\n  * Provide credentials in Inventory, Sales, and Supplier nodes.\n  * Use Authorization headers or API keys as per your system.\n\n* **AI Node (OpenAI):**\n\n  * Add your OpenAI API key in the credentials section.\n  * Modify the prompt if you wish to include additional forecasting parameters.\n\n* **ERP Integration:**\n\n  * Replace placeholder URLs with your ERP system endpoints.\n  * Match fields like purchase order number, date, and cost.\n\n* **Database Connection:**\n\n  * Configure credentials for PostgreSQL/MySQL in the Save to Database node.\n  * Ensure tables (`purchase_orders`) are created as per schema provided in sticky notes.\n\n* **Email Notifications:**\n\n  * Set up SMTP credentials (e.g., Gmail, Outlook, or custom mail server).\n  * Add recipients under workflow notification settings.\n\n---\n\n### Industries That Benefit\n\nThis automation is highly beneficial for:\n\n* **Retail & E-commerce:** Predicts product demand and auto-orders from suppliers.\n* **Manufacturing:** Ensures raw materials are restocked based on production cycles.\n* **Pharmaceuticals:** Maintains optimum inventory for high-demand medicines.\n* **FMCG & Supply Chain:** Balances fast-moving goods availability with minimal overstocking.\n* **Automotive & Electronics:** Prevents delays due to missing components.\n\n---\n\n### Prerequisites\n\n* API access to inventory, sales, supplier, and ERP systems.\n* Valid OpenAI API key for demand forecasting.\n* SQL database (PostgreSQL/MySQL) for record storage.\n* SMTP or mail server credentials for email notifications.\n* n8n environment with required nodes installed (HTTP, AI, Filter, Email, Database).\n\n---\n\n### Modification Options\n\n* Change forecast logic or thresholds for different industries.\n* Integrate Slack/Teams for live notifications.\n* Add approval workflow before sending POs.\n* Extend AI prompt for seasonality or promotional trends.\n* Add dashboard visualization using Grafana or Google Sheets.\n\n---\n\n**Explore More AI Workflows:**\n[Get in touch with us](https://www.oneclickitsolution.com/contact-us/) to build industry-grade n8n automations with predictive intelligence.\n",
  "featuredImage": "/data/workflows/10531/10531.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2250,
  "downloads": 225,
  "createdAt": "2025-11-05T13:27:19.843Z",
  "updatedAt": "2026-01-16T09:05:22.172Z",
  "publishedAt": "2025-11-05T13:27:19.843Z",
  "nodes": 24,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10531"
}