{
  "id": 8148,
  "slug": "8148",
  "title": "Generate product images & videos with Gemini AI, DeepSeek, and GoAPI for e-commerce",
  "description": "This workflow is designed for e-commerce, marketing teams, or creators who want to automate the production of high-quality, AI-generated product visuals and ad creatives.\n\nHere is what the workflow does:\n* It accepts a product description and other creative inputs through a web form.\n* It uses AI to transform your text input into a detailed, creative prompt.\n* This prompt is then used to generate a product image.\n* The workflow analyzes the generated image and creates a new prompt to generate a second image that includes a model, adding a human element to the visual.\n* A final prompt is created from the model image to generate a short, cinematic video.\n* All generated assets (images and video) are automatically uploaded to your specified hosting platform, providing you with direct URLs for immediate use.\n\nThis template is an efficient solution for scaling your content creation efforts, reducing time spent on manual design, and producing a consistent stream of visually engaging content for your online store, social media, and advertising campaigns.\n\n**Prerequisites:**\n\n* **OpenRouter Account:** Required for AI agents to generate image and video prompts.\n* **GOAPI Account:** Used for the final video generation process.\n* **Media Hosting Platform:** A self-hosted service like MediaUpload, or any alternative like Google Drive or a similar service that can provide a direct URL for uploaded images and videos. This is essential for passing the visuals between different steps of the workflow.",
  "featuredImage": "/data/workflows/8148/8148.webp",
  "author": {
    "id": 101,
    "slug": "ddm21",
    "name": "Dhruv Dalsaniya",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1438,
  "downloads": 143,
  "createdAt": "2025-09-02T07:36:09.872Z",
  "updatedAt": "2026-01-16T08:54:24.941Z",
  "publishedAt": "2025-09-02T07:36:09.872Z",
  "nodes": 50,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8148"
}