{
  "id": 7364,
  "slug": "7364",
  "title": "Create a self-hosted blockchain payment processor with x402 and 1Shot API",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n![facilitatorpreview.gif](fileId:2163)\n\n# Self-Hosted x402 Facilitator\n\nIn the [x402](https://x402.org) payment protocol, a [facilitator](https://x402.gitbook.io/x402/core-concepts/facilitator) is a role which helps sellers settle stablecoin payments onchain without dealing with blockchain complexities. This workflow allows you to run your own fully-featured, specification-compliant facilitator in n8n. You might want to do this if you want to accept payments in tokens not supported by existing facilitators or as your own business!\n\n## Details\n\nA facilitator supports three routes: `/verify`, `/settle`, and `/supported`. These routes are all created for you in this workflow with proper error handling and responses. \n\nA seller will first hit `/verify` with their payment details to ensure the payment information is correct. Next they will hit the `/settle` endpoint with the same payment information to settle the paymet on the blockchain. The `/supported` endpoint is used to indicate to sellers which blockchains you choose to support in a programatic fashion.\n\n## Setup\n\n1. Create a [1Shot API](https://1shotapi.com) account\n2. Create 1Shot API wallets for the networks where you wish to facilitate token payments and load them with sufficient gas tokens.\n3. Using [1Shot Prompts](https://app.1shotapi.com/1shot-prompts), import the `transferWithAuthorization` functions for the tokens you will settle payments for.\n4. Import this workflow into n8n and create a credential to link the 1Shot API community node to your 1Shot API business account.\n5. Enter the token and network information into the payment token and network configuration nodes indicated by the sticky nodes.\n6. Turn on your workflow and settle payments!\n",
  "featuredImage": "/data/workflows/7364/7364.webp",
  "author": {
    "id": 101,
    "slug": "oneshotapi",
    "name": "1Shot API",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 525,
  "downloads": 52,
  "createdAt": "2025-08-14T05:17:29.215Z",
  "updatedAt": "2026-01-16T08:49:55.470Z",
  "publishedAt": "2025-08-14T05:17:29.215Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7364"
}