{
  "id": 12730,
  "slug": "12730",
  "title": "Draft and manage academic research papers with GPT-4 and Pinecone",
  "description": "## How It Works\nThis workflow automates academic research processing by routing queries through specialized AI models while maintaining contextual memory. Designed for researchers, faculty, and graduate students, it solves the challenge of managing multiple AI models for different research tasks while preserving conversation context across sessions. The system accepts research queries via webhook, stores them in vector databases for semantic search, and intelligently routes requests to appropriate AI models (OpenAI, Anthropic Claude, or NVIDIA NIM). Results are consolidated, formatted, and delivered via email with full citation tracking. The workflow maintains conversation history using Pinecone vector storage, enabling follow-up queries that reference previous interactions. This eliminates manual model switching, context loss, and repetitive credential management—streamlining research workflows from literature review to hypothesis generation.\n\n## Setup Steps\n1. Configure Pinecone credentials  \n2. Add OpenAI API key for GPT-4 access and embeddings\n3. Set up Anthropic Claude API credentials for advanced reasoning\n4. Configure NVIDIA NIM API key for specialized academic models\n5. Connect Google Sheets for query logging and result tracking\n6. Set Gmail OAuth credentials for automated result delivery\n7. Configure webhook URL for query submission endpoint\n \n## Prerequisites\nActive accounts and API keys for Pinecone, OpenAI \n## Use Cases\nLiterature review automation with semantic paper discovery. \n## Customization\nModify AI model selection logic for domain-specific optimization.\n## Benefits\nReduces research processing time by 60% through automated routing.",
  "featuredImage": "/data/workflows/12730/12730.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 0,
  "downloads": 0,
  "createdAt": "2026-01-15T14:58:27.265Z",
  "updatedAt": "2026-01-16T09:12:54.168Z",
  "publishedAt": "2026-01-15T14:58:27.265Z",
  "nodes": 40,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12730"
}