{
  "id": 9970,
  "slug": "9970",
  "title": "Automated email responses with GPT-4O & Supabase conversation memory",
  "description": "### This n8n workflow lets you delegate inbox management to an AI agent. It automatically replies to emails when a suitable response is found in your knowledge base. If no match is found, the message is forwarded to a human for review. This ensures all replies follow company guidelines and prevent misinformation or misrepresentation.\n\n## Use Case\nIdeal for businesses that receive frequent inquiries about products or services and want to automate responses, freeing up time to focus on core operations.\n\n## How It Works\n- Polls your inbox for new incoming emails  \n- Cleans HTML to reduce token usage and filters spam  \n- Categorizes emails for better organization  \n- Retrieves conversation history from Supabase (if available) to give the AI proper context  \n- Uses the AI agent to query your FAQ database for relevant answers  \n- Replies automatically if a suitable answer is found  \n- Sends a placeholder email and forwards to a human if no accurate answer exists  \n- Ingests all processed emails into Supabase to retain conversation history and improve future AI accuracy  \n\n## Customization\nYou can connect any email provider or LLM model. The workflow can also be expanded to let the AI schedule meetings, answer availability questions, or handle other inbox tasks.\n\nIf you'd like help tailoring this workflow to your business, feel free to reach out:  \n[Upwork Profile](https://www.upwork.com/freelancers/~01b9cfafda64624983)",
  "featuredImage": "/data/workflows/9970/9970.webp",
  "author": {
    "id": 101,
    "slug": "lukmanabdh",
    "name": "Lukman",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 368,
  "downloads": 36,
  "createdAt": "2025-10-21T06:13:46.294Z",
  "updatedAt": "2026-01-16T09:02:48.332Z",
  "publishedAt": "2025-10-21T06:13:46.294Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9970"
}