{
  "id": 10735,
  "slug": "10735",
  "title": "Generate animal battle videos with Flux AI, Creatomate & multi-platform publishing",
  "description": "**Author: [Jadai Kongolo](https://www.instagram.com/jadai_ai_automation/)**\n\n## Overview\nThis comprehensive n8n workflow automates the entire production pipeline for creating viral \"versus\" style battle videos. The system generates dramatic AI-powered fight scenes between animals (or any characters you choose), complete with photorealistic imagery, cinematic effects, and automatic multi-platform publishing. Perfect for content creators looking to generate engaging short-form content at scale without manual editing or design work.\n\n## Use Cases\n1. **Viral Social Media Content**: Automatically produce trending \"X vs Y\" battle videos that perform exceptionally well on TikTok, Instagram Reels, and YouTube Shorts. These comparison-style videos consistently generate high engagement and shares.\n\n2. **Educational Entertainment**: Create visually stunning educational content comparing animals, historical figures, sports teams, or any competitive matchups while maintaining viewer interest through dramatic AI-generated imagery.\n\n3. **Automated Content Pipeline**: Build a hands-free content factory that can produce multiple videos per day on schedule, complete with automatic posting to all major social platforms through integrated social media management tools.\n\n👉 check out the UGC version of this [here](https://kongolo.gumroad.com/l/qkkndj)\n\n## How It Works\n\n### Stage 1 - Scene Generation\nThe workflow begins by fetching a main character from your Google Sheets database (filtered by \"To Do\" status). An AI agent powered by GPT-4.1-mini then generates eight unique opponents from your specified category, ensuring each comes from a different environment or background for maximum variety and interest.\n\n### Stage 2 - AI Image Creation\nThe system creates three distinct types of images for each matchup:\n\n**Close-Up Portraits**: Generates fierce, intimidating close-up shots of both the main character and each opponent using Flux image generation through PiAPI. The AI creates hyper-realistic, photorealistic images showing each character roaring with detailed textures, dramatic lighting, and threatening expressions.\n\n**Battle Aftermath Scenes**: A separate AI agent determines the realistic winner based on each character's strengths, then generates a dramatic full-body scene showing the victor standing dominantly over the defeated opponent. These images include visible battle scars, wounds, and cinematic composition that makes the outcome unmistakably clear.\n\nThe workflow includes intelligent polling mechanisms (90-second waits) to ensure all images are fully generated before proceeding, then aggregates and stores all image URLs in your Google Sheet for reference.\n\n### Stage 3 - Video Assembly\nUsing Creatomate's video rendering API, the workflow combines all generated images with background music and animated transitions into a polished final video. The template creates a fast-paced montage showing all eight battles with \"VS\" graphics and dynamic cuts timed to music beats.\n\n### Stage 4 - Multi-Platform Publishing\nOnce rendered, the video is automatically uploaded to Blotato's social media management platform and simultaneously published to:\n- **Instagram Reels** with optimized captions\n- **TikTok** with proper AI-generated content disclosure\n- **YouTube Shorts** as unlisted for review\n\nThe workflow updates your Google Sheet with \"Created\" status and final video URL for tracking and analytics.\n\n## Customization Options\n\n### Content Themes\n- Modify the Google Sheet to change from animals to any category: superheroes, historical warriors, vehicles, mythical creatures, sports teams, etc.\n- Adjust AI prompts in the \"Scene Creator\" node to control opponent selection criteria\n- Edit the \"Image Prompt Generator\" to customize visual style (fantasy, sci-fi, realistic, cartoon, etc.)\n\n### Video Production\n- Change video dimensions in \"Generate Close Ups\" and \"Generate Scene\" nodes for different platform requirements\n- Replace the Creatomate template with your own design for different visual styles\n- Swap background music by updating the music source URL in the \"Render Video\" node\n- Adjust the number of battles per video (currently 8 scenes)\n\n### Publishing Settings\n- Configure posting schedules via the Schedule Trigger node\n- Modify platform-specific settings (privacy levels, comments, duets) in Instagram/TikTok/YouTube nodes\n- Add or remove social platforms by connecting additional Blotato API endpoints\n- Customize captions using data from your Google Sheet\n\n### AI Models\n- Switch between different OpenRouter models for cost/quality tradeoffs\n- Use GPT-4.1 for complex winner determination and GPT-4.1-mini for faster scene generation\n- Experiment with different Flux models through PiAPI for various artistic styles\n\n## Prerequisites\n- **Google Sheets**: Connected Google account with access to the workflow template\n- **OpenRouter API**: For GPT-4.1 and GPT-4.1-mini access\n- **PiAPI Account**: For Flux image generation (use referral code for bonus credits)\n- **Creatomate Account**: For video rendering with template access\n- **Blotato Account**: For multi-platform social media publishing (use promo code \"NATE30\" for 30% off for 6 months)\n\n---\n\n# 🛠️ Setup Guide  \n\n1. **Make a copy** of this [Google Sheet Template](https://docs.google.com/spreadsheets/d/1hBjE1LR5rmSlEkwkNIwf_NnbjBS_cALS5FJ0r6vh7nM/edit?usp=sharing) and connect it to the five Google Sheet nodes in the workflow:\n   - `Get Main Character`\n   - `Add Close Ups`\n   - `Add Winner`\n   - `Get Elements`\n   - `Update Video Status`\n\n2. Connect your [OpenRouter](https://openrouter.ai/) API key to the two OpenRouter nodes in the \"Output Parser & Chat Models\" section:\n   - `GPT 4.1-mini`\n   - `GPT 4.1`\n\n3. Create a [PiAPI](https://piapi.ai/workspace) account and connect your API key to:\n   - `Generate Close Ups`\n   - `Generate Scene`\n   - `Get Close Ups`\n   - `Get Winners`\n\n4. Create a [Creatomate](https://creatomate.com/) account and connect your template ID and API key to the `Render Video` node.  \n   You can duplicate the same template shown in the video by using the source code linked in the same Skool post where you downloaded the workflow.\n\n5. Connect your [Blotato](https://blotato.com/) account and get your API key to enable auto-publishing:\n   - Configure the `Upload to Blotato` node\n   - Add your account IDs to `Instagram`, `TikTok`, and `YouTube` nodes\n \n6. Customize the `Schedule Trigger` node to set your desired posting frequency (daily, weekly, etc.)\n\n---\n\nThe Generate authentic, influencer-style UGC videos on autopilot version of this AI video generator can be found [here](https://kongolo.gumroad.com/l/qkkndj).\n\n",
  "featuredImage": "/data/workflows/10735/10735.webp",
  "author": {
    "id": 101,
    "slug": "jadai-ai-automation",
    "name": "Jadai kongolo",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 168,
  "downloads": 16,
  "createdAt": "2025-11-11T18:32:36.062Z",
  "updatedAt": "2026-01-16T09:06:05.430Z",
  "publishedAt": "2025-11-11T18:32:36.062Z",
  "nodes": 43,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10735"
}