{
  "id": 7029,
  "slug": "7029",
  "title": "Automate meeting intelligence with VEXA, OpenAI & Mem0 for conversation insights",
  "description": "### VEXA: AI-Powered Meeting Intelligence\n\nI'll be honest, I built this because I was getting lazy in meetings and missing key details. I started with a simple VEXA integration for transcripts, then added AI to pull out summaries and tasks. But that just solved part of the problem.\n\nThe real breakthrough came when we integrated Mem0, creating a persistent memory of every conversation. Now, you can stop taking notes and actually focus on the person you're talking to, knowing a system is tracking everything that matters. This is the playbook for how we built it.\n\n### How It Works\n\nThis isn't just one workflow; it's a two-part system designed to manage the entire meeting lifecycle from start to finish.\n\n1.  **Bot Management:** It starts when you flick a switch in your CRM (Baserow). A command deploys or removes an AI bot from Google Meet. No fluff—it's there when you need it, gone when you don't. The workflow uses a quick \"digital sticky note\" in Redis to remember who the meeting is with and instantly updates the status in your Baserow table.\n2.  **AI Analysis & Memory:** Once the meeting ends, VEXA sends the transcript over. Using the client ID (thank god for redis) , we feed the conversation to an AI model (OpenAI). It doesn't just summarize; it extracts actionable next steps and potential risks. All this structured data is then logged into a memory layer (Mem0), creating a permanent, searchable record of every client conversation.\n\n\n\n### Setup Steps: Your Action Plan\n\nThis is designed for rapid deployment. Here's what you do:\n\n1.  **Register Webhook:** Run the manual trigger in the workflow once. This sends your n8n webhook URL to VEXA, telling it where to dump transcripts after a call.\n2.  **Connect Your CRM:** Copy the `vexa-start` webhook URL from n8n. Paste it into your Baserow automation so it triggers when you set the \"Send Bot\" field to `Start_Bot`.\n3.  **Integrate Your Tools:** Plug your VEXA, Mem0, Redis, and OpenAI API credentials into n8n.\n4.  **Use the Baserow Template:** I've created a free Baserow template to act as your control panel. Grab it here: `https://baserow.io/public/grid/t5kYjovKEHjNix2-6Rijk99y4SDeyQY4rmQISciC14w`. It has all the fields you need to command the bot.\n\n### Requirements\n\n* An active n8n instance or cloud account.\n* Accounts for VEXA.ai, Mem0.ai, Baserow, and OpenAI.\n* A Redis database .\n* Your Baserow table must have these fields: `Meeting Link`, `Bot Name`, `Send Bot`, and `Status`.\n\n### Next Steps: Getting More ROI\n\nThis workflow is the foundation. The real value comes from what you build on top of it.\n\n* **Automate Follow-ups:** Use the AI-identified next steps to automatically trigger follow-up emails or create tasks in your project management tool.\n* **Create a Unified Client Memory:** Connect your email and other communication platforms. Use Mem0 to parse and store every engagement, building a complete, holistic view of every client relationship.\n* **Build a Headless CRM:** Combine these workflows to build a fully AI-powered system that handles everything from lead capture to client management without any manual data entry. \n\n*Copy the workflow and stop taking notes*",
  "featuredImage": "/data/workflows/7029/7029.webp",
  "author": {
    "id": 101,
    "slug": "reklaim",
    "name": "Stephan Koning",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 402,
  "downloads": 40,
  "createdAt": "2025-08-06T00:15:14.034Z",
  "updatedAt": "2026-01-16T08:48:15.299Z",
  "publishedAt": "2025-08-06T00:15:14.034Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7029"
}