{
  "id": 11381,
  "slug": "11381",
  "title": "Monitor Google Maps reviews with sentiment analysis & RAG agent using Pinecone",
  "description": "## Analyze and Sync Google Maps Reviews to Pinecone\n\n&gt; **Note:** This template requires an Apify account, an OpenAI account, and a Pinecone database.\n\n### Overview\nThis workflow automates your reputation management by scraping Google Maps reviews, analyzing their sentiment using AI, and storing them in a Vector Database (Pinecone). It also includes a RAG (Retrieval-Augmented Generation) agent that allows you to chat with your review data via Telegram to ask specific questions about customer feedback.\n\n### How it works\n* **Scrape:** At a scheduled time (or manually), the workflow triggers an Apify actor to scrape the latest reviews from a specific Google Maps URL.\n* **Analyze:** It uses GPT-4o to analyze the sentiment of the reviews and generates a summary of complaints and praises.\n* **Notify:** A Telegram message is sent with the sentiment score and a summary of the latest reviews.\n* **Store:** The review data is embedded and upserted into a Pinecone Vector Store.\n* **Chat (RAG):** You can send messages to a Telegram bot to query the database (e.g., \"What are people saying about our coffee?\"). The AI retrieves relevant reviews from Pinecone to answer your question.\n* **Cleanup:** A weekly schedule cleans up the namespace to ensure data freshness (optional).\n\n### How to set up\n1. **Apify:** Create an account and subscribe to the *Google Maps Reviews Scraper* actor. Set up your Apify credentials in n8n.\n2. **OpenAI:** Set up your OpenAI credentials in n8n.\n3. **Pinecone:** Create an Index in Pinecone. Set up your Pinecone credentials in n8n.\n4. **Telegram:** Create a new bot via BotFather to get your Token and Chat ID. Set up your Telegram credentials in n8n.\n\n### Configure the Workflow\n1. Open the **⚠️ CONFIGURATION** nodes.\n2. Paste your `telegram_chat_id`.\n3. Paste the `Maps_url` of the business you want to monitor.\n4. Define your `pinecone_namespace`.\n\n### HTTP Node Configuration\nIn the \"Empty Namespace\" node, update the URL to match your Pinecone Index Host and add your Pinecone API Key in the header or use credentials.\n\n## 🙋 Support\nIf you encounter any issues during setup or have questions about customization, please reach out to our dedicated support email: **foivosautomationhelp@gmail.com**",
  "featuredImage": "/data/workflows/11381/11381.webp",
  "author": {
    "id": 101,
    "slug": "tarasidis",
    "name": "Gtaras",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 38,
  "downloads": 3,
  "createdAt": "2025-12-01T00:09:04.519Z",
  "updatedAt": "2026-01-16T09:08:32.549Z",
  "publishedAt": "2025-12-01T00:09:04.519Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11381"
}