{
  "id": 3223,
  "slug": "3223",
  "title": "AI research agents to automate PDF analysis with Mistral’s best-in-class OCR",
  "description": "\n##  Overview\n\nMistral OCR is a cutting-edge document understanding API that improves how businesses extract and process information from complex documents. With top scores in benchmarks for accuracy and comprehension capabilities, Mistral OCR handles multi-column text, charts, diagrams, and multiple languages.\n\nThis workflow uses Mistral's Document understanding OCR API to automatically turns dense PDFs (such as financial reports) into either deep research reports or concise newsletters \n\n[![Multi-Agent Research team ](https://img.youtube.com/vi/Z9Lym6AZdVM/sddefault.jpg)](https://youtu.be/Z9Lym6AZdVM)\n\n\n\n## Key Features\n\n* **Superior Document Understanding**: Processes complex documents with high-fidelity rendering\n* **Multi-Format Support**: Handles PDFs containing text, images, charts, and diagrams\n* **Multilingual Capabilities**: Accurately processes documents in various languages\n* **Seamless API Integration**: Easy implementation through cloud-based API\n* **Customizable Research Depth**: Generate comprehensive 8-page reports or concise 1,750-word newsletters\n\n## How It Works\n\n1. Document Upload: Submit your PDF through an n8n form interface.\n\n2. Output Format Selection: Choose between comprehensive deep research (3,500 words) or Concise newsletter (1,750 words)\n\n3. Custom Instructions: Tailor the analysis by adding specific focus areas (e.g., quantitative data, growth catalysts).\n\n4. AI Processing: The document undergoes multi-stage AI analysis: OCR and text extraction using Mistral AI and Content structuring and summarization using GPT models\n\nAgents:\n- Research Leader: Plans and conducts initial research, creating a table of contents.\n- Project Planner: Breaks down the table of contents into manageable sections.\n- Research Assistants: Multiple agents that conduct in-depth research on assigned sections.\n- Editor: Compiles and refines the final article, ensuring coherence and proper citations.\n\n\n## Setup\n1. API Key Acquisition:\n- Obtain an API key from OpenRouter.ai\n- Get an API key from Mistral.ai\n\n2. n8n Configuration:\n- In your n8n instance, navigate to the credentials section.\n- Create new credentials for OpenRouter and Mistral, inputting the respective API keys.\n\n3. Form Configuration:\n- Customize the input form fields if needed (e.g., adding company-specific options).\n\n- Output Customization: Adjust the word count parameters in the Project Planner node to change output length.",
  "featuredImage": "/data/workflows/3223/3223.webp",
  "author": {
    "id": 101,
    "slug": "derekcheungsa",
    "name": "Derek Cheung",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 4385,
  "downloads": 438,
  "createdAt": "2025-03-19T19:50:58.902Z",
  "updatedAt": "2026-01-16T08:28:48.501Z",
  "publishedAt": "2025-03-19T19:50:58.902Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3223"
}