{
  "id": 10759,
  "slug": "10759",
  "title": "Real-time IoT anomaly detection with MQTT, GPT-4o-mini AI, and multi-channel alerts",
  "description": " \n## How It Works\n\nMQTT ingests real-time sensor data from connected devices. The workflow normalizes the values and trains or retrains machine learning models on a defined schedule. An AI agent detects anomalies, validates the results for accuracy, and ensures reliable alerts. Detected issues are then routed to dashboards for visualization and sent via email notifications to relevant stakeholders, enabling timely monitoring and response.\n\n## Setup Steps\n\n1. **MQTT:** Configure broker connection, set topic subscriptions, and verify data flow.\n2. **ML Model:** Define retraining schedule and specify historical data sources for model updates.\n3. **AI Agent:** Connect Claude or OpenAI APIs and configure anomaly validation prompts.\n4. **Alerts:** Set dashboard URL and email recipients to receive real-time notifications.\n\n## Prerequisites\nMQTT broker credentials; historical training data; OpenAI/Claude API key; dashboard access; email service\n\n## Use Cases\nIoT sensor monitoring; server performance tracking; network traffic anomalies; application log analysis; predictive maintenance alerts\n\n## Customization\nAdjust sensitivity thresholds; swap ML models; modify notification channels; add Slack/Teams integration; customize validation rules\n\n## Benefits\nReduces detection latency 95%; eliminates manual monitoring; prevents false alerts; enables rapid incident response; improves system reliability\n ",
  "featuredImage": "/data/workflows/10759/10759.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 130,
  "downloads": 13,
  "createdAt": "2025-11-12T14:31:20.351Z",
  "updatedAt": "2026-01-16T09:06:11.012Z",
  "publishedAt": "2025-11-12T14:31:20.351Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10759"
}