{
  "id": 12197,
  "slug": "12197",
  "title": "Predict tenant default risk with GPT-4o, Gmail, Slack and collections APIs",
  "description": "## How It Works\nThis workflow automates tenant screening by analyzing payment history, credit, and employment data to predict rental risks. Designed for property managers, landlords, and real estate agencies, it solves the challenge of objectively evaluating tenant reliability and preventing payment defaults.The system runs daily assessments, fetching rent payment history, credit bureau reports, and employment records. An AI agent merges this data, calculates risk scores, and routes alerts based on severity. High-risk tenants trigger immediate email notifications for intervention, medium-risk cases post to Slack for monitoring, while low-risk updates save quietly to databases. Automated collection workflows initiate for high-risk cases.\n\n## Setup Steps\n1. Configure payment history, credit bureau, and employment credentials in fetch nodes\n2. Add OpenAI API key for risk analysis and set Gmail/Slack credentials for alerts\n3. Customize risk score thresholds and routing rules in workflow logic\n\n## Prerequisites\nPayment system API, credit bureau access, employment verification API\n\n## Use Cases\nRental application screening, existing tenant monitoring \n\n## Customization\nModify risk scoring criteria, adjust alert thresholds\n\n## Benefits\nReduces defaults through early detection, eliminates screening bias\n\n",
  "featuredImage": "/data/workflows/12197/12197.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 46,
  "downloads": 4,
  "createdAt": "2025-12-27T07:57:34.809Z",
  "updatedAt": "2026-01-16T09:11:42.497Z",
  "publishedAt": "2025-12-27T07:57:34.809Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12197"
}