{
  "id": 4849,
  "slug": "4849",
  "title": "Automated invoice processing with Telegram, GPT-4o, OCR and SAP integration",
  "description": "**++HOW IT WORKS:++**\nThis workflow automates the processing of invoices sent via Telegram. It extracts the data using LlamaIndex OCR, logs it in Google Sheets, and optionally pushes the structured data to SAP Business One\n\n****🔹 1. Receive Invoice via Telegram:****\n- A user sends a PDF of an invoice through Telegram\n- A Telegram Trigger node listens for incoming messages and captures the file and metadata\n- The document is downloaded and prepared for OCR\n\n**🔹 2. OCR with LlamaIndex:**\n- The file is uploaded to the LlamaIndex OCR API.\n- The workflow polls the API until the processing status returns SUCCESS\n- Once ready, the parsed content is fetched in Markdown format\n\n**🔹 3. Data Extraction via LLM (editable):**\n- The Markdown content is sent to a language model (LLM) using LangChain\n- A Structured Output Parser transforms the result into a clean, structured editable JSON\n\n**🔹 4. Save to Google Sheets:**\nThe structured JSON is split into:\n1. Header (main invoice metadata)\n1. Detail (individual line items)\n\nEach part is stored in a dedicated tab within a connected Google Sheets file\n\n**🔹 5. Ask for SAP Confirmation:**\nThe bot replies to the user via Telegram:\n\n\"Do you want to send the data to SAP?\"\n\nIf the user clicks \"Yes\", the next automation path is triggered.\n\n**🔹 6. Push Data to SAP B1:**\nA connection is made to SAP Business One's Service Layer API\n\nHeader and detail data are fetched from Google Sheets\n\nThe invoice structure is rebuilt as required by SAP (DocumentLines, CardCode, etc.)\n\nA POST request creates the Purchase Invoice in SAP\n\nA confirmation message with the created DocEntry is sent back to the user on Telegram\n\n**++SET UP STEPS:++**\nFollow these steps to properly configure the workflow before execution:\n\n**1️⃣ Create Required Credentials:**\nGo to Credentials &gt; + New Credential and create the following:\n- *Telegram API* (set your bot token get it from BotFather)\n- *Google Sheets*\n- *OpenAI*\n\n**2️⃣ Set Up Environment Variables (Optional but Recommended):**\nLLAMAINDEX_API_KEY\nSAP_USER\nSAP_PASSWORD\nSAP_COMPANY_DB\nSAP_URL\n\n**3️⃣ Prepare Google Sheets:**\nEnsure your Google Spreadsheet has the following:\n➤ Sheet 1: Header\n➤ Sheet 2: Details\nContains columns for invoice lines",
  "featuredImage": "/data/workflows/4849/4849.webp",
  "author": {
    "id": 101,
    "slug": "raquelgiugliano",
    "name": "Raquel Giugliano",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 25133,
  "downloads": 2513,
  "createdAt": "2025-06-10T10:01:39.029Z",
  "updatedAt": "2026-01-16T08:36:31.182Z",
  "publishedAt": "2025-06-10T10:01:39.029Z",
  "nodes": 29,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4849"
}