{
  "id": 7040,
  "slug": "7040",
  "title": "Automate job search & curation with JSearch API & Google Sheets",
  "description": "### How it works\nThis workflow automates the job curation process by retrieving pending job search inputs from a spreadsheet, querying the JSearch API for relevant job listings, and writing the curated results back to another sheet. It is designed to streamline job discovery and reduce manual data entry.\n\n### Step-by-step\n**1. Trigger & Input**\n- The workflow starts on a defined schedule (e.g., once per day).\n\n- It reads a row from the Job Scraper sheet where the status is marked as \"Pending\".\n\n- The selected row includes fields like Position and Location, which are used to build the search query.\n\n**2. Job Search & Processing**\n- Sends a search request to the JSearch API using the Position and Location from the spreadsheet.\n\n- Parses the API response and extracts individual job listings.\n\n- Filters out empty, irrelevant, or invalid entries to ensure clean and relevant job data.\n\n**3. Output & Status Update**\n- Writes valid job listings to the Job Listing output sheet with fields such as job title, company name, location, and more.\n\n- Updates the original row in the source sheet to mark it as Scraped, ensuring it will not be processed again in future runs.\n\n### **Benefits**\n- Reduces manual effort in job research and listing.\n\n- Ensures only valid, structured data is stored and used.\n\n- Prevents duplicate processing with automatic status updates.\n\n- Simple to expand by adding more job sources or filters.",
  "featuredImage": "/data/workflows/7040/7040.webp",
  "author": {
    "id": 101,
    "slug": "itechnotion",
    "name": "Avkash Kakdiya",
    "avatar": ""
  },
  "categories": [
    "HR"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 819,
  "downloads": 81,
  "createdAt": "2025-08-06T07:28:27.835Z",
  "updatedAt": "2026-01-16T08:48:19.231Z",
  "publishedAt": "2025-08-06T07:28:27.835Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7040"
}