{
  "id": 7640,
  "slug": "7640",
  "title": "Automate real-time SEO keyword research with DataForSEO and Google Sheets",
  "description": "### This n8n template automates real-time SEO keyword research, delivering comprehensive keyword insights, autocomplete suggestions, subtopics, SERP analysis, and more, straight into your Google Sheet.\n\nUse cases are many: This workflow is perfect for bloggers, SEO professionals, affiliate marketers, e-commerce teams, and content creators who need fresh, actionable keyword data for planning, optimization, and content expansion - without endless manual research.\n\n## How It Works\n### Phase 1: Set Google Sheet ID & Input Target Keywords\n- In n8n, enter the **Google Sheet ID** in the **Set Sheet ID** node. \n- In the connected Google Sheet, for the first tab **Main Keyword**, you manually add the main keywords that you want the tool to research and generate relevant keyword suggestions for. \n- Trigger the process by clicking **Test Workflow** or **Execute Workflow**.\n- The workflow automatically reads your main keywords from the **Main Keyword** tab in your linked Google Sheet, only those marked with the status **Ready** will be processed.\n\n### Phase 2: Automated Research & Data Collection\nFor your input main keyword (considering here you only set **Ready** for one main keyword in the connected Google Sheet), the workflow runs multiple automated queries in parallel:\n\n**1. Get Related Keywords:**\n\n- The workflow sends a **POST request** to the **DataForSEO API** endpoint to directly retrieve an array of related keywords.\n- Then, the array of related keywords is parsed out, preparing each keyword as a separate record for further processing.\n- It appends each extracted related keyword as a new row in the **Related KW** tab of your connected Google Sheet. The **Main Keyword** value from your input is included in **Column A** of the tab to maintain keyword context.\n- Additionally, the workflow appends the related keywords  - along with the associated main keyword - to the **All Results** tab in your Google Sheet for consolidated tracking and future reference. This ensures you have both a dedicated list of related keywords and a master log of all research results in one place.\n\n\n**2. Get Keyword Suggestions:**\n\n- The workflow sends a **POST request** to the **DataForSEO API** endpoint to directly retrieve an array of keyword suggestions related to your main keyword.\n- This array of keyword suggestions is then parsed, splitting out each suggestion as an individual record for further processing.\n- Each extracted keyword suggestion is appended as a new row in the **KW Suggestion** tab of your connected Google Sheet. The original **Main Keyword** value from your input is included in Column A of the tab to maintain clear context.\n- Additionally, the workflow appends all keyword suggestions - along with the associated main keyword - to the **All Results** tab in your Google Sheet for consolidated tracking and future reference. This ensures you have both a dedicated list of keyword suggestions and a master log of all research results in one place.\n\n\n**3. Get Autocomplete Suggestions:**\n\n- The workflow sends a **POST request** to the **DataForSEO API** endpoint to retrieve Google autocomplete keyword suggestions for your main keyword.\n- The array of autocomplete keyword suggestions is parsed out as an individual record for processing.\n- Each extracted autocomplete keyword is appended as a new row in the **Autocomplete Suggestion** tab of your connected Google Sheet. The Main Keyword is included alongside each entry for proper tracking.\n- Additionally, the workflow appends all autocomplete keywords - along with the associated main keyword - to the **All Results** tab in your Google Sheet for consolidated tracking and future reference. This ensures you have both a dedicated list of autocomplete keywords and a master log of all research results in one place.\n\n\n**4. Get Content Ideas:**\n\n- The workflow sends a **POST request** to the DataForSEO API endpoint to retrieve content ideas and fresh topic suggestions based on your main keyword.\n- The array of content ideas is then parsed; each idea is extracted as a separate record for further use.\n- Every content idea is then appended as a new row in the **Content Idea** tab of your connected Google Sheet, with the Main Keyword included to provide context.\n- Additionally, the workflow appends all content ideas, along with their related main keyword, to the **All Results** tab in your sheet for consolidated tracking and easy access. This ensures you have both a dedicated list of content ideas for brainstorming and a central log of all keyword research outputs in one place.\n\n\n**5. Get SERPs:**\n\n- The workflow sends a **POST request** to the DataForSEO API endpoint, retrieving both the current Google SERP (Search Engine Results Page) data and People Also Ask (PAA) questions related to your main keyword.\n- Then, the data is split into two streams: one for standard SERP results and one for PAA questions.\n- For Standard SERPs:\n     + The workflow filters the SERP data to keep only the most relevant results.\n     + Each SERP entry is appended as a new row in the **SERP** tab of your connected Google Sheet, providing insights into top-ranking pages and their attributes.\n- For PAA (People Also Ask):\n     + The PAA data is also filtered.\n     + Each PAA question is split out and added as a new row in the **PAA** tab in your connected Google Sheet for focused tracking.\n     + Additionally, all PAA questions are consolidated and appended, along with their related main keyword, to the **All Results** tab in your sheet for consolidated tracking and easy access. This ensures you have both a dedicated list of PAA questions for brainstorming and a central log of all research outputs in one place.\n\n## Result Types\n\n**Main Keyword**: Your original list of main keywords with status tracking.\n\n**All Results**: A master log of all relevant keyword and idea research outputs for easy review.\n\n**Related KW**: Lists of related keywords for each main keyword.\n\n**KW Suggestion**: Suggested keyword ideas for broader targeting.\n\n**Autocomplete Suggestion**: Google autocomplete keyword suggestions to capture real user queries.\n\n**Content Idea**: Keyword-related content ideas to build out your content clusters.\n\n**SERP**: top-ranking pages, including their URLs, page titles, and descriptions - perfect for quick competitor and content analysis.\n\n**PAA**: People Also Ask questions for intent research and content expansion.\n\n## How To Set Up\n- Download the workflow package and import it into your n8n interface.\n- Duplicate the [**Keyword Research**](https://docs.google.com/spreadsheets/d/1QiaKcy5MwLwmBqD4FrBTd_m3GCK1Jjll9IsNi7q96QA/edit?gid=0#gid=0) Google Sheet template to your Google Sheets account.\n- Set up necessary credentials for tools access and usability:\n     + For **Google Sheets** access, ensure each node is properly connected to the correct tab in your connected Google Sheet template: \n     Node **Get Main Keywords** → connected to the **Main Keyword** tab\n     Node **Add Related KWs** → connected to the **Related KW** tab\n     Node **Save Related KWs to All Results** → connected to the **All Results** tab\n     Node **Add KW Suggestions** → connected to the **KW Suggestion** tab\n     Node **Save KW Suggestions to All Results** → connected to the **All Results** tab\n     Node **Add Autocomplete Suggestions** → connected to the **Autocomplete Suggestion** tab\n     Node **Save Autocomplete Suggestions to All Results** → connected to the **All Results** tab\n     Node **Add Content Ideas** → connected to the **Content Idea** tab\n     Node **Save Content Ideas to All Results** → connected to the **All Results** tab\n     Node **Add SERPs** → connected to the **SERP** tab\n     Node **Add PAAs** → connected to the **PAA** tab\n     Node **Save PAAs to All Results** → connected to the **All Results** tab\n     + For DataForSEO access, set up API credentials (Basic Auth) along with correct **POST URL** for each query in the following node:\nNode **Get Related KWs**\nNode **Get KW Suggestions**\nNode **Get Autocomplete Suggestions**\nNode **Get Content Ideas**\nNode **Get SERPs**\n- Enter your **Google Sheet ID** in the **Set Sheet ID** node to link the workflow to your connected Google Sheet.\n- Add your target keywords to **Column B** in the **Main Keyword** tab in the connected Google Sheet and set their status to **Ready**\n- Run the workflow by clicking **Test Workflow** or **Execute Workflow** in n8n.\n- Review the results across all output tabs in your connected Google Sheet.\n\n## Requirements\n- **n8n** instance (self-hosted or cloud).\n- Basic setup in **Google Cloud Console** (OAuth or API Key method enabled) with enabled access to **Google Sheets**.\n- **DataForSEO** API credentials.\n\n## How To Customize\n- **Add Extra Research Steps**: Expand the workflow by integrating additional research queries related to the main keywords - such as backlink analysis, competitor monitoring, or search trend tracking - to gather even more valuable insights alongside your keyword data.\n- **Automate Scheduling & Notifications**: Set up an automatic schedule in n8n so the workflow runs at your preferred intervals. Connect notification tools like Telegram, Slack, or a chatbox to receive alerts whenever the process finishes, keeping you instantly updated without manual checks.\n- **Personalize Data Mapping**: Tailor how the research results are saved to your Google Sheet by customizing column mapping and naming conventions. This lets you organize your data exactly how you want for easier analysis and reporting.\n\n## Need Help?\nIf you’d like this workflow customized to fit your tools and platforms availability, or if you’re looking to build a tailored AI Agent for your own business - please feel free to reach out to [**Agent Circle**](https://www.agentcircle.ai/). We’re always here to support and help you to bring automation ideas to life.\n\nJoin our community on different platforms for support, inspiration and tips from others.\nWebsite: https://www.agentcircle.ai/\nEtsy: https://www.etsy.com/shop/AgentCircle\nGumroad: http://agentcircle.gumroad.com/\nDiscord Global: https://discord.gg/d8SkCzKwnP\nFB Page Global: https://www.facebook.com/agentcircle/\nFB Group Global: https://www.facebook.com/groups/aiagentcircle/\nX: https://x.com/agent_circle\nYouTube: https://www.youtube.com/@agentcircle\nLinkedIn: https://www.linkedin.com/company/agentcircle\n\n\n",
  "featuredImage": "/data/workflows/7640/7640.webp",
  "author": {
    "id": 101,
    "slug": "agentcircle",
    "name": "Agent Circle",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1493,
  "downloads": 149,
  "createdAt": "2025-08-20T10:01:48.983Z",
  "updatedAt": "2026-01-16T08:51:33.681Z",
  "publishedAt": "2025-08-20T10:01:48.983Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7640"
}