{
  "id": 8365,
  "slug": "8365",
  "title": "Brand visibility & sentiment analysis across AI search tools (OpenAI, Perplexity, ChatGPT)",
  "description": "This n8n template demonstrates how to audit your brand’s visibility across multiple AI systems and automatically log the results to Google Sheets. It sends the same prompt to OpenAI, Perplexity, and (optionally) a ChatGPT web actor, then runs sentiment and brand-hierarchy analysis on the responses. \n\nUse cases are many: benchmark how often (and how positively) your brand appears in AI answers, compare responses across models, and build a repeatable “AI visibility” report for marketing and comms teams.\n\n## 💡 Good to know\n- You’ll bring your own API keys for OpenAI and Perplexity. Usage costs depend on your providers’ pricing.\n- The optional APIfy actor automates the ChatGPT web UI and may violate terms of service. Use strictly at your own risk.\n\n## ⁉ How it works\n- A Manual Trigger starts the workflow (you can replace it with any trigger).\n- Input prompts are read from a Google Sheet (or you can use the included “manual input” node).\n- The prompt is sent to three tools:\n-- OpenAI (via API) to check baseline LLM knowledge.\n-- Perplexity (API) to retrieve an answer with citations.\n-- Optionally, an APIfy actor that scrapes a ChatGPT response (web interface).\n- Responses are normalized and mapped (including citations where available).\n- An LLM-powered sentiment pass classifies each response into:\n-- Basic Polarity: Positive, Neutral, or Negative\n-- Emotion Category: Joy, Sadness, Anger, Fear, Disgust, or Surprise\n-- Brand Hierarchy: ordered list such as Nike&gt;Adidas&gt;Puma\n- The consolidated record (Prompt, LLM, Response, Brand mentioned flag, Brand Hierarchy, Basic Polarity, Emotion Category, Source 1–3/4) is appended to your “Output many models” Google Sheet.\n- A simplified branch shows how to take a single response and push it to a separate sheet.\n\n## 🗺️ How to use\n- Connect your Google Sheets OAuth and create two tabs:\n-- Input: a single “Prompt” column\n-- Output: columns for Prompt, LLM, Response, Brand mentioned, Brand Hierarchy, Basic Polarity, Emotion Category, Source 1, Source 2, Source 3, Source 4\n- Add your OpenAI and Perplexity credentials.\n- (Optional) Add an APIfy credential (Query Auth with token) if you want the ChatGPT web actor path.\n- Run the Manual Trigger to process prompts in batches and write results to Sheets.\n- Adjust the included “Limit for testing” node or remove it to process more rows.\n\n\n## ⚒️ Requirements\n- OpenAI API access (e.g., GPT-4.1-mini / GPT-5 as configured in the template)\n- Perplexity API access (model: sonar)\n- Google Sheets account with OAuth connected in n8n\n- (Optional) APIfy account/token for the ChatGPT web actor\n\n\n## 🎨 Customising this workflow\n- Swap the Manual Trigger for a webhook or schedule to run audits automatically.\n- Extend the sentiment analyzer instructions to include brand-specific rules or compliance checks.\n- Track more sources (e.g., additional models or vertical search tools) by duplicating the request→map→append pattern.\n- Add scoring (e.g., “visibility score” per prompt) and charts by pointing the output sheet into Looker Studio or a BI tool.",
  "featuredImage": "/data/workflows/8365/8365.webp",
  "author": {
    "id": 101,
    "slug": "aoepeople",
    "name": "AOE Agent Lab",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 671,
  "downloads": 67,
  "createdAt": "2025-09-08T07:46:36.884Z",
  "updatedAt": "2026-01-16T08:55:26.871Z",
  "publishedAt": "2025-09-08T07:46:36.884Z",
  "nodes": 48,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8365"
}