{
  "id": 12161,
  "slug": "12161",
  "title": "Analyze competitor strategy from YouTube & RSS with Gemini AI to Notion & Telegram",
  "description": "#### Description:\n\nTurn your n8n workflow into an automated competitive intelligence unit. This template monitors competitor activities across blog feeds and YouTube channels to detect strategic shifts. Instead of simply aggregating links, it uses **Apify** to fetch full video transcripts and **Google Gemini** to analyze the content's underlying message, tone, and positioning. The final output is a structured strategic briefing sent to Telegram and archived in Notion for long-term research.\n\n## Who is this for\nThis workflow is designed for **market researchers, founders,** and **content strategists** who need deep insights into competitor activities without manually scrubbing video timelines or reading daily blog posts.\n\n## How it works\n1. **Ingest:** The workflow pulls the latest articles from configured RSS feeds and searches for new videos on specific YouTube channels.\n\n2. **Deep Dive:** It automatically triggers an Apify actor to scrape the full transcript of any new video, ensuring the AI analyzes the spoken content rather than just metadata.\n\n3. **Analyze:** Google Gemini processes the consolidated text to identify core messages, hidden strategies, and suggests potential counter-tactics.\n\n4. **Report:**\n\n- **Telegram:** Delivers a concise HTML executive summary with direct source links.\n\n- **Notion:** Appends a comprehensive report to a database using formatted Notion Blocks (Headings, Toggles, and Bullet points).\n\n## Requirements\n- **Apify Account:** A free account is sufficient to run the `youtube-transcript-scraper`.\n\n- **Services:** Google Gemini (PaLM), YouTube Data API, Telegram, Notion.\n\n## How to set up\n1. **Credentials:** Configure your API keys for YouTube, Apify, Google Gemini, Telegram, and Notion.\n\n2. **Notion Setup:** Create a new Database with two properties: Name (Title) and date (Date). Copy the Database ID from the URL into the Notion node.\n\n3. **Data Sources:**\n\n- Update the **Channel ID** in the YouTube nodes to track your target competitors.\n- Update the **Feed URL** in the RSS nodes.\n\n## How to customize the workflow\n- **Scale Up:** To monitor more competitors, duplicate the YouTube or RSS nodes in the \"Data Sources\" section and connect them to the Merge node.\n\n- **Adjust Analysis:** Modify the system prompt in the **Google Gemini** node to focus on specific intelligence needs (e.g., \"Focus on pricing changes\" or \"Identify new feature releases\").\n\n- **Token Optimization:** Use the configuration in the `Code - Data Prep` node to limit the number of items processed daily if you are using free-tier API limits.\n## Need Help or Want to Customize This?\nContact me for consulting and support:\n**Email:** cuongnguyen@aiops.vn",
  "featuredImage": "/data/workflows/12161/12161.webp",
  "author": {
    "id": 101,
    "slug": "cuongnguyen",
    "name": "Cuong Nguyen",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 133,
  "downloads": 13,
  "createdAt": "2025-12-26T09:18:33.632Z",
  "updatedAt": "2026-01-16T09:11:35.983Z",
  "publishedAt": "2025-12-26T09:18:33.632Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12161"
}