{
  "id": 10726,
  "slug": "10726",
  "title": "Lusha to Easy Redmine CRM: automated lead enrichment",
  "description": "**Use this workflow to enrich lead records from Easy Redmine with Lusha data and sync updated fields back to the CRM.**\n\n### About Workflow  \nThis workflow connects Easy Redmine CRM with Lusha via API to enrich lead records. It fetches lead data from Easy Redmine, queries Lusha for matching contact information, transforms the results (e.g., phone, employee count, LinkedIn), and updates the original records in Easy Redmine CRM automatically.\n\n### Use Case  \nBuilt for CRM and sales teams using Easy Redmine, this automation replaces manual Lusha lookups and lead updates. It ensures that enriched data is consistently added to your CRM—boosting lead quality and reducing data maintenance time.\n\n### How it works  \n- **Schedule Trigger**  \n=&gt; Runs daily at a set hour (e.g., 10:00)  \n- **Get Leads from Easy Redmine**  \n=&gt; Pulls leads via saved query (e.g., today's leads) using the `easy_leads` resource  \n- **Split Out**  \n=&gt; Breaks down the batch of leads into single records for enrichment  \n- **Get Data from Lusha**  \n=&gt; Sends HTTP requests to Lusha’s API using lead fields (email, name, company)  \n- **Filter Leads Found in Lusha**  \n=&gt; Skips leads with missing or failed Lusha enrichment  \n- **Contact Data Transformation for CRM**  \n=&gt; Maps and transforms contact data:  \n  - Extracts phones, email, LinkedIn, job info  \n  - Converts employee ranges like [1000, 5000] into `5000`  \n  - Flattens nested Lusha response into CRM-friendly format  \n- **Update Leads in Easy Redmine CRM**  \n=&gt; Sends a PUT request to update each lead  \n\n### How to use  \n- Import the workflow into your n8n instance  \n- Set credentials for:  \n  - Easy Redmine API  \n  - Lusha API (HTTP Header Auth)  \n- Update the `Get Leads from Easy Redmine` node with your query ID  \n- Ensure Lusha API fields (email, name, company) match available lead fields  \n- Adjust the transformation logic in the Code node if needed  \n- Update the custom field ID in the final PUT request if your CRM uses different IDs  \n- Test with sample data before activating the automation  \n\n### Example Use Cases  \n- **Sales Intelligence**: Enrich new leads with verified phone and social info  \n- **CRM Hygiene**: Keep records consistent and complete without manual edits  \n- **Lead Scoring**: Add employee count and LinkedIn for better segmentation  \n\n### Requirements  \n- Easy Redmine API access  \n- Lusha API access    \n- API credentials for both platforms  \n\n### Customization Options  \n- Add more fields from Lusha (job title, company website, etc.)  \n- Include error notifications if updates fail  \n- Add filters to target only leads missing phone or LinkedIn info  \n- Use Merge node if fetching multiple lead segments  \n\n### Workflow Improvement Suggestions  \n- Rename technical node labels for better readability  \n- Secure credentials via environment variables or vault  \n- Handle rate limits or retries if using large lead batches  \n\n**This workflow automates lead enrichment, ensuring CRM records are updated with accurate, verified data—without the manual copy-paste.**\n\n",
  "featuredImage": "/data/workflows/10726/10726.webp",
  "author": {
    "id": 101,
    "slug": "easy8ai",
    "name": "Easy8.ai",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 123,
  "downloads": 12,
  "createdAt": "2025-11-11T13:15:50.835Z",
  "updatedAt": "2026-01-16T09:06:02.664Z",
  "publishedAt": "2025-11-11T13:15:50.835Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10726"
}