{
  "id": 6089,
  "slug": "6089",
  "title": "Automate cold outreach with email personalization using Gemini and Google Sheets",
  "description": "\n# This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution for powerful cold outreach campaigns.\n\nIt connects a Google Sheet of prospect data with Google Gemini to automatically generate highly personalized emails. By analyzing specific keywords and data points like company name, industry, or job title from your sheet, this automated workflow crafts unique, relevant messages that feel one-to-one, creating a complete system to dramatically improve your engagement and response rates.\n\n## How it Works\nManually writing personalized emails for a long list of leads is a significant bottleneck. This workflow eliminates that friction by creating an automated system that reads your lead list, understands the context, and writes compelling drafts for you.\n\n- **Scheduled Lead Processing:** On a schedule you define (e.g., daily), the workflow automatically activates to process your lead list.\n\n- **Fetches Your Lead List:** It connects to your designated Google Sheet and reads all the lead data you've prepared, such as names, companies, roles, and any custom notes or pain points.\n\n- **Intelligent Filtering:** The workflow is smart enough to know which leads have already been processed. Using an \"If\" node, it filters out any rows that already contain a generated email, ensuring it only works on new, untouched leads.\n\n- **AI-Driven Personalization (Google Gemini):** This is the core of the engine. For each new lead, it sends the relevant data to the Google Gemini Chat Model. The AI follows a custom prompt you define to draft a completely unique email, including a compelling subject line and a personalized body.\n\n- **Structured Data Output:** The workflow uses a Structured Output Parser to ensure the AI's response is always in a clean, predictable JSON format (e.g., {\"subject\": \"...\", \"body\": \"...\"}), making the data easy to handle in the next steps.\n\n- **Seamlessly Updates Your Spreadsheet:** Finally, the generated subject line and email body are written back into the correct row for that lead in your Google Sheet, ready for your team to copy, paste, and send.\n\n### How to Use: Quick Start Guide\n\n**1. Import Workflow Template:**\n- Download the template’s JSON file and import it into your n8n instance via “File” &gt; “Import from JSON.”\n\n**2. Configure Credentials:**\n- Google Gemini: Create and apply your API key credentials to the “Google Gemini Chat Model” node.\n- Google Sheets: Set up and apply OAuth credentials for the Google account that owns your lead spreadsheet. Apply this credential to both the \"Read Leads from Sheet\" and \"Update Sheet with Email\" nodes.\n\n**3. Customize Nodes & Spreadsheet:**\n- **Prepare Your Google Sheet:** Ensure your sheet has columns for lead data (e.g., FirstName, Company, Role) and empty columns to receive the output (e.g., GeneratedSubject, GeneratedEmail).\n- **Read Leads from Sheet:** Double-click this node and select your spreadsheet and sheet name from the list.\n- **If Node:** Update the condition to check your specific output column. For example, if your output column is named GeneratedEmail, the condition should check if {{$json.GeneratedEmail }} is empty.\n- **Basic LLM Chain Node:** This is the most important step.\n\n1. Edit the Template prompt to match your product, service, and desired tone.\n2. In the Template Variables section, make sure the values (e.g., {{ $('Read Leads from Sheet').item.json.FirstName }}) match the exact column names from your Google Sheet.\n\n- **Update Sheet with Email Node:** Select your spreadsheet and sheet name. Set the Lookup Column to a unique identifier for each lead (like their Email address). Then, map the output from the Prepare Data for Sheet node to the correct destination columns in your sheet.\n\n**4. Test & Activate:**\n- **Test Run:** Click “Execute Workflow” to perform a test run. Check your Google Sheet to see if the first unprocessed lead was updated correctly with a new subject and body.\n\n- **Activate:** Once satisfied, toggle the workflow “Active” switch to enable it to run on your defined schedule.\n\n#### Requirements\n\nTo use this workflow template, you will need:\n\n**1. n8n Instance:** A running n8n instance (cloud or self-hosted).\n**2. Google Gemini Account:** For generating the email content (requires a Google Gemini API Key from Google AI Studio).\n**3. Google Sheets Account:** With a prepared spreadsheet containing your lead list and columns for the generated output.\n\n\n## Connect with us\n\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n## For Custom Worflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)\n",
  "featuredImage": "/data/workflows/6089/6089.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2708,
  "downloads": 270,
  "createdAt": "2025-07-17T11:29:30.596Z",
  "updatedAt": "2026-01-16T08:43:04.700Z",
  "publishedAt": "2025-07-17T11:29:30.596Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6089"
}