{
  "id": 4233,
  "slug": "4233",
  "title": "Translate & repost Twitter threads in multiple languages with OpenAI",
  "description": "# Twitter Thread (Flood) Translator & Poster\n\n## What it does\n\n- **Thread Extraction:** Automatically detects and extracts all tweets from a provided Twitter thread (flood) link.\n- **Translation:** Translates each extracted tweet into your target language using OpenAI.\n- **Rewriting:** Rewrites each translated tweet to maintain the original meaning while improving clarity or style.\n- **Automated Posting:** Posts the rewritten tweets as a new thread on Twitter using twitterapi.io, preserving the original thread structure.\n\n## How it works\n\n- Accepts a Twitter thread (flood) link as input.\n- Extracts all tweets from the thread in their original order.\n- Each tweet is sent to OpenAI for translation into your desired language.\n- The translated tweets are then rewritten for clarity and natural flow, while keeping the original meaning intact.\n- The processed tweets are automatically posted as a new thread on your Twitter account via twitterapi.io.\n\n## Setup Steps\n\n1. **Create a Notion Database:**  \n   Set up a database page in Notion to store and manage your Twitter links and workflow data.\n2. **Configure Notion Integration:**  \n   Add the created database page ID to the Notion nodes in your workflow.\n3. **Set Twitter API Credentials:**  \n   Add your twitterapi.io API key to the relevant nodes.\n4. **Add Twitter Account Details:**  \n   Enter your Twitter account username/email and password for authentication.\n5. **Set Up OpenAI Credentials:**  \n   Provide your OpenAI API credentials to enable translation and rewriting.\n6. **Subworkflow Integration:**  \n   Create a separate workflow for subworkflow logic and call it using the Execute Workflow node for modular automation.\n7. **Set Desired Language & Thread Link:**  \n   Change the target language and Twitter thread (flood) link directly in the Manual Trigger node to customize each run.\n\n## Benefits\n\n- **Ultra Low Cost:** **Total cost for a 15-tweet thread (flood) is just $0.016 USD** ($0.015 for twitterapi.io + $0.001 for OpenAI API). *(Actual cost may vary depending on the density of tweets in the thread.)*\n- **End-to-End Automation:** Go from thread extraction to translation, rewriting, and reposting-all in one workflow.\n- **Multilingual Support:** Effortlessly translate and republish Twitter threads in any supported language.\n\n\n\n&gt; **Note:** Detailed configuration instructions and node explanations are included as sticky notes within the workflow canvas.\n\n---\n\n**Ideal for:**  \n- Content creators looking to reach new audiences by translating and republishing Twitter threads  \n- Social media managers automating multilingual content workflows  \n- Anyone wanting to streamline the process of thread extraction, translation, and posting\n\n---\n\n## Notes\n\n- This workflow is **not able to post images or videos to Twitter**-it handles text-only threads.\n",
  "featuredImage": "/data/workflows/4233/4233.webp",
  "author": {
    "id": 101,
    "slug": "ecingoz",
    "name": "enes cingoz",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5264,
  "downloads": 526,
  "createdAt": "2025-05-19T21:51:46.647Z",
  "updatedAt": "2026-01-16T08:33:28.324Z",
  "publishedAt": "2025-05-19T21:51:46.647Z",
  "nodes": 62,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4233"
}