{
  "id": 11610,
  "slug": "11610",
  "title": "Automate Incident Management with PagerDuty, Port AI, Jira & Slack",
  "description": "Complete incident workflow from detection through resolution to post-mortem, with full organizational context from Port's catalog. This template handles both incident triggered and resolved events from PagerDuty, automatically creating Jira tickets with context, notifying teams via Slack, calculating MTTR, and using Port AI Agents to schedule post-mortem meetings and create documentation.\n\n## How it works\nThe n8n workflow orchestrates the following steps:\n\n**On Incident Triggered:**\n- PagerDuty webhook — Receives incident events from PagerDuty via POST request.\n- Event routing — Routes to triggered or resolved flow based on event type.\n- Port context enrichment — Uses Port's n8n node to query your software catalog for service context, on-call engineers, recent deployments, runbooks, and past incidents.\n- AI severity assessment — OpenAI assesses severity based on Port context and recommends investigation actions.\n- Escalation routing — Critical incidents automatically escalate to leadership Slack channel.\n- Jira ticket creation — Creates incident ticket with full context, investigation checklist, and recommended actions.\n- Team notification — Notifies the team's Slack channel with incident details and resources.\n\n**On Incident Resolved:**\n- Port context extraction — Gets post-incident context from Port including stakeholders and documentation spaces.\n- MTTR calculation — Calculates mean time to resolution from incident timestamps.\n- Post-mortem generation — AI generates a structured post-mortem template with timeline.\n- Port AI Agent scheduling — Triggers Port AI Agent to schedule post-mortem meeting, invite stakeholders, and create documentation.\n- Resolution notification — Notifies team with MTTR, post-mortem document link, and meeting details.\n- Metrics logging — Logs MTTR metrics back to Port for service reliability tracking.\n\n## Setup\n- [ ] Register for free on [Port.io](https://www.port.io)\n- [ ] Configure Port with services, on-call schedules, and deployment history\n- [ ] Set up Port AI agents for post-mortem scheduling\n- [ ] Connect PagerDuty webhook for incident events\n- [ ] Configure Jira project for incident tickets (use project key 'INC' or customize)\n- [ ] Set up Slack channels for alerts (#incidents and #leadership-alerts)\n- [ ] Add OpenAI credentials for severity assessment\n- [ ] Test with a sample incident event\n- [ ] You should be good to go!\n\n## Prerequisites\n- You have a Port account and have completed the onboarding process.\n- Port's integrations are configured (GitHub, Jira, PagerDuty if available).\n- You have a working n8n instance (Cloud or self-hosted) with Port's n8n custom node installed.\n- PagerDuty account with webhook capabilities.\n- Jira Cloud account with appropriate project permissions.\n- Slack workspace with bot permissions to post messages.\n- OpenAI API key for severity assessment and post-mortem generation.\n\n\n⚠️ This template is intended for Self-Hosted instances only.\n",
  "featuredImage": "/data/workflows/11610/11610.webp",
  "author": {
    "id": 101,
    "slug": "portio",
    "name": "Port IO",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 21,
  "downloads": 2,
  "createdAt": "2025-12-08T17:31:56.428Z",
  "updatedAt": "2026-01-16T09:09:20.160Z",
  "publishedAt": "2025-12-08T17:31:56.428Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11610"
}