{
  "id": 9537,
  "slug": "9537",
  "title": "Create Branded Social Media Images with Bannerbear (Sync/Async modes)",
  "description": "Automatically create branded social media graphics, certificates, thumbnails, or marketing visuals using Bannerbear's template-based image generation API. \n**Bannerbear's API is primarily asynchronous by default**: this workflow shows you how to use both asynchronous (webhook-based) and synchronous modes depending on your needs.\n\n## What it does\n\nThis workflow connects to Bannerbear's API to generate custom images based on your pre-designed templates. You can modify text, colors, and other elements programmatically. \n\nBy default, Bannerbear works asynchronously: you submit a request, receive an immediate 202 Accepted response, and get the final image via webhook or polling. This workflow demonstrates both the standard asynchronous approach and an alternative synchronous method where you wait for the image to be generated before proceeding.\n\n## How it works\n\n1. **Set parameters** - Configure your Bannerbear API key, template ID, and content (title, subtitle)\n2. **Choose mode** - Select synchronous (wait for immediate response) or asynchronous (standard webhook delivery)\n3. **Generate image** - The workflow calls Bannerbear's API with your modifications\n4. **Receive result** - Get the image URL, dimensions, and metadata in PNG or JPG format\n\n**Async mode (recommended):** The workflow receives a pending status immediately, then a webhook delivers the completed image when ready.\n\n**Sync mode:** The workflow waits for the image generation to complete before proceeding.\n\n## Setup requirements\n\n- A Bannerbear account (free tier available)\n- A Bannerbear template created in your dashboard\n- Your API key and template ID from Bannerbear\n- For async mode: ability to receive webhooks (production n8n instance)\n\n## How to set up\n\n1. **Get Bannerbear credentials:**\n   - Sign up at bannerbear.com\n   - Create a project and design a template\n   - Copy your API key from Settings &gt; API Key\n   - Copy your template ID from the API Console\n\n2. **Configure the workflow:**\n   - Open the \"SetParameters\" node\n   - Replace the API key and template ID with yours\n   - Customize the title and subtitle text\n   - Set `call_mode` to \"sync\" or \"async\"\n\n3. **For async mode (recommended):**\n   - Activate the \"Webhook_OnImageCreated\" node\n   - Copy the production webhook URL\n   - Add it to Bannerbear via Settings &gt; Webhooks &gt; Create a Webhook\n   - Set event type to \"image_created\"\n\n## Customize the workflow\n\n- Modify the template parameters to match your Bannerbear template fields\n- Add additional modification objects for more dynamic elements (colors, backgrounds, images)\n- Connect to databases, CRMs, or other tools to pull content automatically\n- Chain multiple image generations for batch processing\n- Store generated images in Google Drive, S3, or your preferred storage\n- Use async mode for high-volume generation without blocking your workflow",
  "featuredImage": "/data/workflows/9537/9537.webp",
  "author": {
    "id": 101,
    "slug": "ladypixl",
    "name": "Elodie Tasia",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 136,
  "downloads": 13,
  "createdAt": "2025-10-12T17:58:24.266Z",
  "updatedAt": "2026-01-16T09:00:50.427Z",
  "publishedAt": "2025-10-12T17:58:24.266Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9537"
}