{
  "id": 10173,
  "slug": "10173",
  "title": "Scrape multi-page websites recursively with Google Sheets storage",
  "description": "## Configurable Multi-Page Web Scraper\n\n### Introduction\n\nThis n8n workflow provides a robust and highly reusable solution for scraping data from paginated websites. Instead of building a complex series of nodes for every new site, you only need to update a simple JSON configuration in the initial Input Node, making your scraping tasks faster and more standardized.\n\n### Purpose\n\nThe core purpose of this template is to automate the extraction of structured data (e.g., product details, quotes, articles) from websites with multiple pages. It is designed to be fully recursive: it follows the \"next page\" link until no link is found, aggregates the results from all pages, and cleanly structures the final output into a single list of items.\n\n### Setup and Configuration\n\n1. **Locate the Input Node:** The entire configuration for the scraper is held within the first node of the workflow.\n2. **Update the JSON:** Replace the existing JSON content with your target website's details:\n   * `startUrl`: The URL of the first page to begin scraping.\n   * `nextPageSelector`: The CSS selector for the \"Next\" or \"Continue\" link element that leads to the next page. This is crucial for the pagination loop.\n   * `fields`: An array of objects defining the data to extract on each page. For each field, specify the `name` (the output key), the `selector` (the CSS selector pointing to the data), and the `value` (the HTML attribute to pull, usually `text` or `href`).\n3. **Run the Workflow:** After updating the configuration, execute the workflow. It will automatically loop through all pages and deliver a final, structured list of the scraped data.\n\nFor a detailed breakdown of the internal logic, including how the loop is constructed using the Set, If, and HTTP Request nodes, please refer to the original blog post: [Flexible Web Scraping with n8n: A Configurable, Multi-Page Template](https://n8nplaybook.com/post/2025/10/flexible-n8n-scraper-template/)",
  "featuredImage": "/data/workflows/10173/10173.webp",
  "author": {
    "id": 101,
    "slug": "vklepikovskyi",
    "name": "Viktor Klepikovskyi",
    "avatar": ""
  },
  "categories": [
    "Document Extraction"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 154,
  "downloads": 15,
  "createdAt": "2025-10-25T16:50:07.547Z",
  "updatedAt": "2026-01-16T09:03:49.877Z",
  "publishedAt": "2025-10-25T16:50:07.547Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10173"
}