{
  "id": 12196,
  "slug": "12196",
  "title": "Generate SEO landing page content with GPT-4, Reddit, YouTube and Google Sheets",
  "description": "## How It Works\nThis workflow automates SEO content creation by aggregating multi-source research and generating optimized articles. Designed for content marketers, SEO specialists, and digital agencies, it solves the time-consuming challenge of researching trending topics and crafting search-optimized content at scale. The system pulls discussions from Reddit, videos from YouTube, and industry news via APIs, then combines this data into comprehensive insights. An AI agent analyzes aggregated research, performs Google Search SEO analysis, consults Wikipedia for accuracy, and generates structured, SEO-optimized HTML content. The final output saves automatically to Google Sheets for easy management and publishing workflows.\n\n## Setup Steps\n1. Configure Reddit, YouTube, and industry news API credentials in fetch nodes\n2. Add OpenAI API key for GPT-4 agent and Google API key for search analysis\n3. Connect Google Sheets with write permissions for content storage\n\n## Prerequisites\nReddit API access, YouTube Data API key, industry news API\n\n## Use Cases\nBlog content automation, competitive content analysis, trending topic research\n\n## Customization\nModify research sources, adjust AI prompts for brand voice, customize SEO parameters\n\n## Benefits\n10x faster content production, multi-platform research coverage\n\n",
  "featuredImage": "/data/workflows/12196/12196.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 63,
  "downloads": 6,
  "createdAt": "2025-12-27T07:46:57.130Z",
  "updatedAt": "2026-01-16T09:11:43.228Z",
  "publishedAt": "2025-12-27T07:46:57.130Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12196"
}