{
  "id": 4055,
  "slug": "4055",
  "title": "AI talent screener – CV parser, job fit evaluator & email notifier",
  "description": "## AI Talent Screener – CV Parser, Job Fit Evaluator & Email Notifier\n\n### Who is this for?\nThis template is ideal for HR teams, recruiters, staffing agencies, and tech-enabled hiring managers looking to automate the intake, analysis, and shortlisting of job applicants directly from CV submissions.\n\n### What problem is this workflow solving?\nManually evaluating resumes for job openings is time-consuming and prone to bias or oversight. This workflow uses AI to extract candidate data, analyze fit based on job descriptions, and make data-backed shortlisting decisions — automatically updating Google Sheets and notifying both Talent Acquisition and candidates.\n\n### What this workflow does\nThis workflow automates your recruitment pipeline by:\n\n**1. Accepting CV submissions via an embedded form.**\n\n**2. Saving resumes to Google Drive.**\n\n**3. Extracting and parsing resume content using AI.**\n\n**4. Fetching the relevant job description from Google Sheets.**\n\n**5. Summarizing both job and applicant profiles.**\n\n**6. Conducting an AI-powered fit evaluation (semantic match, red flags, soft skills, etc.).**\n\n**7. Updating detailed analysis in a centralized Google Sheet.**\n\n**8. Notifying the TA team for approval.**\n\n**9. Automatically sending shortlisting or rejection emails to candidates based on approval.**\n\n### Setup\n**1. Connect credentials for:**\n\n* Google Sheets\n\n* Google Drive\n\n* OpenAI API\n\n* SMTP email (for notification)\n\n**2. Update the Google Sheets document IDs and folder IDs in the relevant nodes.**\n\n**3. Adjust the form fields in the \"Form Trigger\" node if needed.**\n\n**4. Customize email sender/receiver addresses in the email nodes.**\n\n**5. Enable the workflow and embed the form on your career page.**\n\nFor convenience, the sticky notes guide you through what each block does.\n\n### How to customize this workflow to your needs\n* Change job roles by editing the dropdown options in the form.\n\n* Modify evaluation criteria in the “Semantic Fit & Evaluation by HR Expert” prompt.\n\n* Add more fields (e.g., GitHub, portfolio links) to the form and extend parsing.\n\n* Connect to ATS or Slack if you'd like to integrate further.",
  "featuredImage": "/data/workflows/4055/4055.webp",
  "author": {
    "id": 101,
    "slug": "ajstyle0411",
    "name": "Aayushman Sharma",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1503,
  "downloads": 150,
  "createdAt": "2025-05-14T19:24:37.751Z",
  "updatedAt": "2026-01-16T08:32:48.616Z",
  "publishedAt": "2025-05-14T19:24:37.751Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4055"
}