{
  "id": 12039,
  "slug": "12039",
  "title": "Analyze real estate submarket trends with GPT-4, Gmail, and Slack alerts",
  "description": "## How It Works\nAutomates daily real estate market opportunity analysis by aggregating MLS listings, public property records, demographic information, and macroeconomic indicators, applying GPT-4 for investment evaluation, assessing investment thresholds, and notifying investors of high-potential properties. Simultaneously collects MLS data, public records, demographic profiles, and economic metrics, consolidates the datasets, applies GPT-4 to perform comprehensive investment analysis including ROI projections and risk assessment, calculates key financial metrics via an investment calculator, validates opportunities against predefined thresholds, and sends alerts to acquisition teams and investors through email and Slack. Designed for real estate investors and property acquisition firms seeking automated, data-driven investment insights.\n\n## Setup Steps\n1. Connect MLS data provider, public records database, and demographic data source APIs.\n2. Configure OpenAI GPT-4 API for investment analysis and opportunity scoring.\n3. Set up investment calculator integration and ROI calculation parameters.\n4. Connect Gmail and Slack for team notifications; define investment thresholds.\n\n## Prerequisites\nMLS data access; public records database; demographic data provider; macroeconomic data source \n\n## Use Cases\nReal estate investment firms automating deal sourcing across markets; \n\n## Customization\nAdjust investment analysis criteria and thresholds \n\n## Benefits\nIdentifies investment opportunities automatically ",
  "featuredImage": "/data/workflows/12039/12039.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 50,
  "downloads": 5,
  "createdAt": "2025-12-22T16:27:37.052Z",
  "updatedAt": "2026-01-16T09:11:07.492Z",
  "publishedAt": "2025-12-22T16:27:37.052Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12039"
}