{
  "id": 5805,
  "slug": "5805",
  "title": "Create YouTube shorts scripts from video links with Gemini AI and Telegram",
  "description": "![スクリーンショット 20250715 22.05.10.png](fileId:1751)\n*disclaimer: This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n## Quick Summary\n\nThis template automates the creation of YouTube Shorts scripts. Simply send a YouTube video URL to a Telegram bot, and this workflow will use AI (Google Gemini) to generate a script optimized for Shorts and send it back to you. It streamlines your content creation process by eliminating the manual work of transcribing and scriptwriting.\n\n## Target Audience & Problem Solved\nThis template is ideal for:\n- YouTube Content Creators\n- Social Media Marketers\n- Anyone looking to efficiently repurpose - - video content\n\nIt solves the following problems:\n- Quickly creating engaging short-form video content from existing long-form videos.\n- Drastically reducing the time spent on video transcription, summarization, and scriptwriting.\n- Enabling content idea generation on the go, even from a smartphone without access to a PC.\n\n## **Workflow Overview**\n\nThis workflow automatically generates a script for YouTube Shorts using AI (Google Gemini) from a YouTube video URL received via Telegram, and then sends the result back to Telegram.\n\nThe process is as follows:\n\n1.  **Receive URL**: A Telegram bot receives a YouTube video URL from a user.\n2.  **Get Transcript**: It uses the community node **`n8n-nodes-supadata`** to retrieve the video's transcript via the Supadata service.\n3.  **Generate Script**: Based on the retrieved transcript, Google Gemini creates a script (title and body) optimized for a YouTube Shorts video.\n4.  **Send Result**: The generated script is sent back to the user who sent the original URL via Telegram.\n\n## **How to Use**\n\n1.  **Prerequisites**:\n    *   Install the `n8n-nodes-supadata` community node as described below.\n    *   Register your API keys for Telegram, Supadata, and Google Gemini as credentials in n8n.\n    *   Set the appropriate credentials in each node within the workflow.\n    *   For Telegram, create your bot with BotFarther.\n\n2.  **Execution**:\n    *   Activate the workflow.\n    *   Send a YouTube video URL to your configured Telegram bot.\n3.  **Confirmation**:\n    *   After a short while, the workflow will run automatically, and you will receive the completed script from the Telegram bot.\n\n## Customization Guide\nYou can tailor this template to your specific needs:\n- Modify the Prompt: Edit the prompt in the Google Gemini node to change the style of the generated script (e.g., make it more casual, use a specific tone, include emojis).\n- Change the AI Model: You can switch to other AI models like OpenAI. Simply add or replace the corresponding n8n node.\n- Change the Notification Channel: Replace the Telegram node with a Discord or Slack node to send the results to a different platform.\n\n## **Community Node Installation**\n\nThis workflow requires the **`n8n-nodes-supadata`** community node. Please install it using the following steps.\n\n## **Installation from the n8n UI (Recommended)**\n\n1.  Navigate to `Settings` &gt; `Community Nodes` in your n8n interface.\n2.  Click on `Install`.\n3.  Enter `n8n-nodes-supadata` in the input field and click the `Install` button.",
  "featuredImage": "/data/workflows/5805/5805.webp",
  "author": {
    "id": 101,
    "slug": "taiki",
    "name": "Taiki",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 3201,
  "downloads": 320,
  "createdAt": "2025-07-09T06:47:21.922Z",
  "updatedAt": "2026-01-16T08:41:30.340Z",
  "publishedAt": "2025-07-09T06:47:21.922Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5805"
}