{
  "id": 2339,
  "slug": "2339",
  "title": "Breakdown documents into study notes using templating MistralAI and Qdrant",
  "description": "This n8n workflow takes in a document such as a research paper, marketing or sales deck or company filings, and breaks them down into 3 templates: study guide, briefing doc and timeline.\n\nThese templates are designed to help a student, associate or clerk quickly summarise, learn and understand the contents to be more productive.\n\n* Study guide - a short quiz of questions and answered generated by the AI Agent using the contents of the document.\n* Briefing Doc - key information and insights are extracted by the AI into a digestable form.\n* Timeline - key events, durations and people are identified and listed into a simple to understand timeline by the AI\n\n## How it works\n* A local file trigger watches a local network directory for new documents.\n* New documents are imported into the workflow, its contents extracted and vectorised into a Qdrant vector store to build a mini-knowledgebase.\n* The document then passes through a series of template generating prompts where the AI will perform \"research\" on the knowledgebase to generate the template contents.\n* Generated study guide, briefing and timeline documents are exported to a designated folder for the user.\n\n## Requirements\n* Self-hosted version of n8n.\n* Qdrant instance for knowledgebase.\n* Mistral.ai account for embeddings and AI model.\n\n## Customising your workflow\n\nTry adding your own templates or adjusting the existing templates to suit your unique use-case. Anything is quite possible and limited only by your imagination!\n\n## Want to go fully local?\n\nA version of this workflow is available which uses Ollama instead. You can download this template here: https://drive.google.com/file/d/1VV5R2nW-IhVcFP_k8uEks4LsLRZrHSNG/view?usp=sharing",
  "featuredImage": "/data/workflows/2339/2339.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 28014,
  "downloads": 2801,
  "createdAt": "2024-07-11T09:13:39.718Z",
  "updatedAt": "2026-01-16T08:24:09.280Z",
  "publishedAt": "2024-07-11T09:13:39.718Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2339"
}