{
  "id": 10371,
  "slug": "10371",
  "title": "Create AI nature videos with Sora 2 (Kie AI), Gemini, and send to Telegram",
  "description": "Generate stunning 10-second AI-crafted nature stock videos on autopilot and deliver them straight to your Telegram chat—perfect for content creators seeking effortless inspiration without the hassle of manual prompting or editing.\n\n## 📋 What This Template Does\nThis workflow automates the creation and delivery of high-quality, 10-second nature-themed videos using AI generation tools. Triggered on a schedule, it leverages Google Gemini to craft precise video prompts, submits them to the Kie AI API for video synthesis, polls for completion, downloads the result, and sends it via Telegram. \n- Dynamically generates varied nature scenes (e.g., misty forests, ocean sunsets) with professional cinematography specs.\n- Handles asynchronous video processing with webhook callbacks for efficiency.\n- Ensures commercial-ready outputs: watermark-free, portrait aspect, natural ambient audio.\n- Customizable schedule for daily/weekly bursts of creative B-roll footage.\n\n## 🔧 Prerequisites\n- n8n instance with HTTP Request and LangChain nodes enabled.\n- Google Gemini API access for prompt generation.\n- Kie AI API account for video creation (supports Sora-like text-to-video models).\n- Telegram Bot setup for message delivery.\n\n## 🔑 Required Credentials\n\n### Google Gemini API Setup\n1. Go to [aistudio.google.com](https://aistudio.google.com) → Create API key.\n2. Ensure the key has access to Gemini 1.5 Flash or Pro models.\n3. Add to n8n as \"Google Gemini API\" credential type.\n\n### Kie AI API Setup\n1. Sign up at [kie.ai](https://kie.ai) → Dashboard → API Keys.\n2. Generate a new API key with video generation permissions (sora-2-text-to-video model).\n3. Add to n8n as \"HTTP Header Auth\" credential (header: Authorization, value: Bearer [Your API Key]).\n\n### Telegram Bot API Setup\n1. Create a bot via @BotFather on Telegram → Get API token.\n2. Note your target chat ID (use @userinfobot for personal chats).\n3. Add to n8n as \"Telegram API\" credential type.\n\n## ⚙️ Configuration Steps\n1. Import the workflow JSON into your n8n instance.\n2. Assign the required credentials to the Gemini, Kie AI, and Telegram nodes.\n3. Update the Telegram node's chat ID with your target chat (e.g., personal or group).\n4. Adjust the Schedule Trigger interval (e.g., daily at 9 AM) via node settings.\n5. Activate the workflow and monitor the first execution for video delivery.\n\n## 🎯 Use Cases\n- Content creators automating daily social media B-roll: Generate fresh nature clips for Instagram Reels or YouTube intros without filming.\n- Marketing teams sourcing versatile stock footage: Quickly produce themed videos for campaigns, like serene landscapes for wellness brands.\n- Educational bots for classrooms: Deliver randomized nature videos to Telegram groups for biology lessons on ecosystems and wildlife.\n- Personal productivity: Schedule motivational nature escapes to your chat for remote workers needing quick digital breaks.\n\n## ⚠️ Troubleshooting\n- Video generation fails with quota error: Check Kie AI dashboard for usage limits and upgrade plan if needed.\n- Prompt output too generic: Tweak the Video Prompting Agent's system prompt for more specificity (e.g., add seasonal themes).\n- Telegram send error: Verify bot token and chat ID; test with a simple message node first.\n- Webhook callback timeout: Ensure n8n production URL is publicly accessible; use ngrok for local testing.",
  "featuredImage": "/data/workflows/10371/10371.webp",
  "author": {
    "id": 101,
    "slug": "daniel-automates",
    "name": "Daniel Nkencho",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 964,
  "downloads": 96,
  "createdAt": "2025-10-31T01:51:46.619Z",
  "updatedAt": "2026-01-16T09:04:46.921Z",
  "publishedAt": "2025-10-31T01:51:46.619Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10371"
}