{
  "id": 6657,
  "slug": "6657",
  "title": "Process Voice Notes to AI Responses with Claude Sonnet, Nuclino & Slack",
  "description": "\nThis workflow provides a way to capture detailed AI prompts using a voice note transcription service and then passes them on for completion to an AI agent.\n\nTo preserve outputs in a knowledge management system, the AI response and the prompt are combined into one document that is created in a Nuclino collection (note: the Nuclino step is configured manually with a HTTP request node).\n\n### How it works\n\n- A webhook receives voice note data from Voicenotes.com containing the title and transcript\n- The transcript is extracted and sent to an AI Agent powered by OpenRouter's Claude Sonnet model\n- The AI generates a structured response in markdown format with Summary, Prompt, and Response sections\n- The original prompt and AI response are merged and prepared for multiple outputs\n- A Nuclino document is created via HTTP Request with the structured content\n- A Slack notification is sent with the prompt, response, and Nuclino note URL\n- Both the original prompt and AI response are archived in NocoDB for future reference\n\n### How to use\n\n- The webhook trigger can be configured to receive data from Voicenotes.com or any service that provides title and transcript data\n- Replace the manual trigger with webhook, form, or other triggers as needed\n- Customize the AI system message to change response format and behavior\n- Configure Nuclino workspace and collection IDs for proper document organization\n\n### Requirements\n\n- **OpenRouter account** for AI model access (Claude Sonnet)\n- **Nuclino account** and API token for document creation\n- **Slack workspace** with bot permissions for notifications\n- **NocoDB instance** for archiving (optional)\n- **Voicenotes.com account** for voice input (or alternative webhook source)\n\n### Customising this workflow\n\n- **AI Models**: Switch between different OpenRouter models by changing the model parameter\n- **Response Format**: Modify the AI Agent system message to change output structure\n- **Documentation Platforms**: Replace Nuclino HTTP Request with other documentation APIs\n- **Notification Channels**: Add multiple Slack channels or other notification services\n- **Archive Storage**: Replace NocoDB with other database solutions\n- **Input Sources**: Adapt webhook to accept data from different voice note or transcription services\n\n### Nuclino API \n\nThe Nuclino API is documented [here](https://www.nuclino.com/api).",
  "featuredImage": "/data/workflows/6657/6657.webp",
  "author": {
    "id": 101,
    "slug": "danielrosehill",
    "name": "Daniel Rosehill",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 245,
  "downloads": 24,
  "createdAt": "2025-07-29T17:14:30.771Z",
  "updatedAt": "2026-01-16T08:46:17.070Z",
  "publishedAt": "2025-07-29T17:14:30.771Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6657"
}