{
  "id": 12300,
  "slug": "12300",
  "title": "Find similar B2B companies to your best customers with Google Sheets and CompanyEnrich",
  "description": "This workflow allows you to automatically expand your B2B target lists by discovering companies similar to your existing leads. \n\nInstead of manually searching for competitors or lookalikes, you can input a list of domains into Google Sheets and let the CompanyEnrich API generate high-quality lookalike suggestions along with similarity scores.\n\n## Who is this for?\nThis template is ideal for **GTM Engineers**, **Sales Teams**, and **Growth Hackers** who want to enrich their lead databases and find new prospecting opportunities based on their current ideal customer profile (ICP).\n\n## What it does\n1. **Reads Source:** It pulls a list of company domains from a specified Google Sheet.\n2. **Enriches:** It sends each domain to the CompanyEnrich API to find similar companies (competitors/lookalikes).\n3. **Processes:** It merges the new data with your original list and formats the JSON response.\n4. **Saves:** It appends the results (Similar Company Name, Domain, and Similarity Score) back into a new tab in your Google Sheet.\n\n## Requirements\n* **Google Sheets:** A spreadsheet with a column named `Domain` containing the websites you want to analyze.\n* **CompanyEnrich API Key:** You need an API key from [CompanyEnrich](https://companyenrich.com).\n* **n8n Credentials:** Connected Google Sheets account.\n\n## How to set up\n1. **Prepare Sheet:** Create a Google Sheet with two tabs. In the first tab, create a column header named `Domain` and add your target websites. Leave the second tab empty for results.\n2. **Configure Nodes:** Open the \"Read Source List\" and \"Write Results\" nodes to select your spreadsheet file and the respective tabs.\n3. **Add API Key:** Open the \"Fetch Similar Companies\" node. In the **Header Parameters** section, replace `YOUR_API_TOKEN` with your actual API key (keep the `Bearer ` prefix).\n\n## How to customize\n* **Filter by Score:** You can add an \"If\" node after the API call to filter out results with a low similarity score.\n* **Change Destination:** Instead of Google Sheets, you can easily swap the final node to write results to Airtable, Notion, or your CRM (HubSpot/Pipedrive).",
  "featuredImage": "/data/workflows/12300/12300.webp",
  "author": {
    "id": 101,
    "slug": "companyenrich",
    "name": "CompanyEnrich",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 11,
  "downloads": 1,
  "createdAt": "2025-12-30T11:36:17.270Z",
  "updatedAt": "2026-01-16T09:12:01.978Z",
  "publishedAt": "2025-12-30T11:36:17.270Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12300"
}