{
  "id": 8442,
  "slug": "8442",
  "title": "Automated daily AI summaries from WhatsApp groups",
  "description": "# Automated Daily AI Summaries from WhatsApp Groups using a Custom AI Agent\n\nTransform your WhatsApp group conversations into actionable business intelligence through automated AI analysis and daily reporting. This workflow eliminates manual conversation monitoring by capturing messages in real-time, processing voice notes, and delivering structured insights directly to your team.\n\n## Overview\n\nThis workflow provides complete conversation intelligence automation from message capture to insight delivery. It eliminates manual monitoring, analysis, and reporting by using Evolution API integration, OpenAI transcription, and advanced LLM analysis for hands-free business intelligence that scales your team's awareness of important discussions.\n\n**Core Function**: Autonomous conversation analysis that transforms WhatsApp group chatter into structured business insights with zero manual intervention, maintaining consistent daily reporting while capturing emerging opportunities and trends before your competition.\n\n## Key Capabilities\n\n**Real-time message capture** - Monitors multiple WhatsApp groups simultaneously with instant processing and smart filtering\n**Voice message transcription** - Automatic conversion of audio messages to searchable text using OpenAI Whisper\n**AI-powered insight extraction** - Advanced LLM analysis identifies trends, opportunities, and actionable information while filtering noise\n**Automated daily reporting** - Scheduled intelligence summaries delivered directly to your team via WhatsApp\n**Multi-group organization** - Separate tracking and analysis for different communities with unified reporting\n**Smart content filtering** - AI agent trained to focus on business-relevant discussions (AI, automation, tech trends, opportunities)\n\n## Tools Used\n\n**n8n**: Workflow orchestration managing the entire intelligence pipeline from capture to delivery\n**Evolution API**: WhatsApp Business API integration for real-time message monitoring and sending\n**OpenAI Whisper**: Voice message transcription ensuring no important audio content is missed\n**OpenRouter/GPT-4.1**: Advanced AI analysis for intelligent insight extraction and content filtering\n**Google Sheets**: Organized message storage with timestamps and metadata for historical analysis\n**Custom AI Agent**: \"WhatsOn\" - specialized business intelligence detective for tech and automation insights\n\n## How to Install\n\n**Import the Workflow**: Download the JSON file and import into your n8n instance\n**Configure Evolution API**: Set up WhatsApp integration and webhook endpoints for message capture\n**API Credentials Setup**: Add OpenAI, OpenRouter, and Google Sheets credentials in n8n\n**Group Configuration**: Update group IDs in the \"Set Info\" node with your monitored groups\n**Google Sheets Setup**: Create organized spreadsheet with separate tabs for each group\n**Schedule Configuration**: Set your preferred daily summary delivery time\n**Test Execution**: Run manual test to verify message capture and AI analysis work correctly\n\n## Use Cases\n\n**Business Intelligence Automation**: Stay informed about industry discussions without manual monitoring\n**Opportunity Detection**: Identify emerging trends, tools, and business opportunities in real-time  \n**Team Knowledge Sharing**: Automated distribution of relevant insights from multiple communities\n**Competitive Intelligence**: Monitor industry discussions to stay ahead of market developments\n**Community Management**: Track engagement patterns and important conversations across groups\n**Voice Message Processing**: Ensure audio-based insights aren't lost in team communications\n\n## Setup Requirements\n\n**Evolution API account**: WhatsApp Business integration with webhook capabilities\n**OpenAI API**: Voice transcription access through Whisper API\n**OpenRouter account**: Access to GPT-4.1 for advanced conversation analysis\n**Google Sheets**: Message storage and organization with proper permissions configured\n**WhatsApp Groups**: Access to business or professional groups with relevant discussions\n\n**Total setup time**: 15-20 minutes once all API accounts are properly configured.\n\n## How to Customize\n\n**Analysis Focus**: Modify the AI agent's system prompt to target your industry or specific topics. Adjust keyword priorities, conversation themes, or insight categories based on your business needs.\n\n**Group Management**: Add additional groups by extending the Switch node logic, creating new Google Sheets tabs, and updating group ID variables. Scale from 3 to unlimited group monitoring.\n\n**Delivery Schedule**: Change summary frequency from daily to weekly, multiple times per day, or custom schedules. Add multiple delivery destinations for different team segments.\n\n**AI Intelligence**: Customize the \"WhatsOn\" agent personality, adjust insight priorities, modify filtering criteria, or add sentiment analysis for deeper conversation understanding.\n\n**Storage & Organization**: Modify Google Sheets structure, add custom metadata fields, integrate with other databases, or connect to business intelligence dashboards for advanced analytics.\n\n## Advanced Features\n\n### Smart Voice Processing\nAutomatically transcribes voice messages to text using OpenAI's Whisper API, ensuring critical audio-based discussions are captured and analyzed alongside text conversations.\n\n### Intelligent Content Filtering  \nThe AI agent is specifically trained to identify valuable business insights while filtering out casual conversation, ensuring your daily summaries focus on actionable information that drives decisions.\n\n### Multi-Fragment Delivery System\nLarge intelligence summaries are automatically broken into properly formatted WhatsApp messages with natural pacing to avoid delivery issues and improve readability.\n\n### Historical Analysis Capability\nAll conversations are stored with full metadata in Google Sheets, enabling historical trend analysis, keyword tracking, and long-term pattern recognition for strategic planning.\n\n---\n\n**Ready to transform group conversations into competitive intelligence?** This template converts casual WhatsApp discussions into structured business insights delivered automatically to your team, ensuring you never miss important industry developments or opportunities.\n\n## Google Sheets Template\n\nThe workflow includes a pre-configured structure for tracking:\n- Message timestamps and sender information  \n- Full conversation content with voice transcriptions\n- Group-specific organization and categorization\n- Daily summary delivery logs and performance metrics\n\n\n## Was this helpful? Let me know!\n\nI truly hope this WhatsApp intelligence system helps streamline your team's awareness of important conversations. Your feedback helps me create better automation resources for the n8n community.\n\n### Ready to Build Something Great?\n\nIf you're looking to take your n8n skills or business automation to the next level, I can help.\n\n**🎓 n8n Coaching**: Want to become an n8n pro? I offer one-on-one coaching sessions to help you master workflows, tackle specific problems, and build with confidence.\n#### ➡️ **[Book a Coaching Session](https://cal.com/averis/consultoria-personalizada)**\n\n**💼 n8n Consulting**: Have a complex project, an integration challenge, or need a custom workflow built for your business? Let's work together to create a powerful automation solution.\n#### ➡️ **[Inquire About Consulting Services](https://cal.com/averis/asesoria)**\n\n### Stay Updated on Automation\nFor more content automation strategies, AI workflow tips, and business automation insights:\n#### [Follow me on LinkedIn](https://www.linkedin.com/in/daniel-lianes/)\n\n---\n\nHappy Automating!\n\nDaniel Lianes",
  "featuredImage": "/data/workflows/8442/8442.webp",
  "author": {
    "id": 101,
    "slug": "daniellianes",
    "name": "Daniel Lianes ",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 659,
  "downloads": 65,
  "createdAt": "2025-09-10T08:22:27.546Z",
  "updatedAt": "2026-01-16T08:55:49.895Z",
  "publishedAt": "2025-09-10T08:22:27.546Z",
  "nodes": 52,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8442"
}