{
  "id": 9973,
  "slug": "9973",
  "title": "Generate AI-powered roadmaps for new leads with GPT-5 and email automation",
  "description": "## How it works  \nThis workflow automates the delivery of personalized, AI-generated reports or roadmaps for new leads.  \nWhen someone submits their information through a form, the workflow:  \n1. Captures and stores the lead data.  \n2. Uses an AI model to generate a customized report or roadmap.  \n3. Formats the output into a professional, email-ready HTML document.  \n4. Sends the report automatically to the lead via email.  \n5. Optionally sends internal notifications (e.g., via chat or email) for tracking and follow-up.  \n\nThe process eliminates manual work and ensures every lead receives instant, high-quality output tailored to their input.\n\n---\n\n## Setup steps  \n1. **Webhook** – Connect your form or website to the webhook endpoint to receive lead data.  \n2. **Data Table** – Create or link a table to store incoming leads and track delivery status.  \n3. **AI Configuration** – Add your OpenAI (or compatible) API credentials and customize prompts for your desired output.  \n4. **Email Setup** – Configure SMTP credentials and define sender/recipient addresses for report delivery.  \n5. **Notifications** – Optionally connect a chat or messaging service (e.g., Telegram) for internal alerts.  \n6. **Activation** – Test the workflow, confirm the data flow and email delivery, then activate it for live use.  \n\n---\n\nThis workflow transforms manual lead engagement into a fully automated, AI-driven experience that delivers instant, personalized value to every new contact.",
  "featuredImage": "/data/workflows/9973/9973.webp",
  "author": {
    "id": 101,
    "slug": "christianlutz",
    "name": "Christian Lutz",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 265,
  "downloads": 26,
  "createdAt": "2025-10-21T09:38:34.347Z",
  "updatedAt": "2026-01-16T09:02:49.548Z",
  "publishedAt": "2025-10-21T09:38:34.347Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9973"
}