{
  "id": 4471,
  "slug": "4471",
  "title": "Github webhook-based n8n workflow import template",
  "description": "**This n8n workflow template uses community nodes and is only compatible with the self-hosted version of n8n.** \n\nThis template aims to ease the process of deploying workflows from github. It has a companion repository that developers might find useful{. See below for more details\n\n## How it works\n\nAutomatically import and deploy n8n workflows from your GitHub repository to your production n8n instance using a secured webhook-based approach. This template enables teams to maintain version control of their workflows while ensuring seamless deployment through a CI/CD pipeline.\n\n1. Receives webhook notifications from GitHub when changes are pushed to your repository\n2. Lists all files in the repository and filters for `.json` workflow files\n3. Downloads each workflow file and saves it locally\n4. Imports all workflows into n8n using the CLI import command\n5. Cleans up temporary files after successful import\n\nTo trigger the deployment, send a POST request to your webhook with the set up credentials (basic auth) with the following body:\n```\n{\n  \"owner\": \"GITHUB_REPO_OWNER_NAME\",\n  \"repository\": \"GITHUB_REPOSITORY_NAME\"\n}\n```\n\n\n## Set up steps\nOnce importing this template in n8n :\n1. Setup the webhook basic auth credentials\n2. Setup the github credentials\n3. Activate the workflow !\n\n## Companion repository\nThere is a companion repository located at [https://github.com/dynamicNerdsSolutions/n8n-git-flow-template](https://github.com/dynamicNerdsSolutions/n8n-git-flow-template) that has a Github action already setup to work with this workflow.\n\nIt provides a complete development environment with:\n- Local n8n instance via Docker\n- Automated workflow export and commit scripts\n- Version control integration\n- CI/CD pipeline setup\n\nThis setup allows teams to maintain a clean separation between development and production environments while ensuring reliable workflow deployment.",
  "featuredImage": "/data/workflows/4471/4471.webp",
  "author": {
    "id": 101,
    "slug": "dbern",
    "name": "Dave Bernier",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1396,
  "downloads": 139,
  "createdAt": "2025-05-28T21:24:41.338Z",
  "updatedAt": "2026-01-16T08:34:32.367Z",
  "publishedAt": "2025-05-28T21:24:41.338Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4471"
}