{
  "id": 2741,
  "slug": "2741",
  "title": "AI-powered RAG workflow for stock earnings report analysis",
  "description": "This n8n workflow creates a financial analysis tool that generates reports on a company's quarterly earnings using the capabilities of OpenAI GPT-4o-mini, Google's Gemini AI and Pinecone's vector search. By analyzing PDFs of any company's earnings reports from their Investor Relations page, this workflow can answer complex financial questions and automatically compile findings into a structured Google Doc.\n\n## How it works:\n1. Data loading and indexing\n* Fetches links to PDF earnings document from a Google Sheet containing a list of file links.\n* Downloads the PDFs from Google Drive.\n* Parses the PDFs, splits the text into chunks, and generates embeddings using the Embeddings Google AI node (text-embedding-004 model).\n* Stores the embeddings and corresponding text chunks in a Pinecone vector database for semantic search.\n\n2. Report generation with AI agent\n* Utilizes an AI Agent node with a specifically crafted system prompt. The agent orchestrates the entire process.\n* The agent uses a Vector Store Tool to access and retrieve information from the Pinecone database.\n3. Report delivery\n* Saves the generated report as a Google Doc in a specified Google Drive location.\n\n## Set up steps\n1. Google Cloud Project & Vertex AI API:\n\t* Create a Google Cloud project.\n\t* Enable the Vertex AI API for your project.\n2. Google AI API key:\n\t* Obtain a Google AI API key from Google AI Studio.\n3. Pinecone account and API key:\n\t* Create a free account on the Pinecone website.\n\t* Obtain your API key from your Pinecone dashboard.\n\t* Create an index named company-earnings in your Pinecone project.\n4. Google Drive - download and save financial documents:\n\t* Go to a company you want to analize and download their quarterly earnings PDFs\n\t* Save the PDFs in Google Drive\n\t* Create a Google Sheet that stores a list of file URLs pointing to the PDFs you downloaded and saved to Google Drive\n5. Configure credentials in your n8n environment for:\n\t* Google Sheets OAuth2\n\t* Google Drive OAuth2\n\t* Google Docs OAuth2\n\t* Google Gemini(PaLM) Api (using your Google AI API key)\n\t* Pinecone API (using your Pinecone API key)\n6. Import and configure the workflow:\n\t* Import this workflow into your n8n instance.\n\t* Update the List Of Files To Load (Google Sheets) node to point to your Google Sheet.\n\t* Update the Download File From Google Drive to point to the column where the file URLs are\n\t* Update the Save Report to Google Docs node to point to your Google Doc where you want the report saved.",
  "featuredImage": "/data/workflows/2741/2741.webp",
  "author": {
    "id": 101,
    "slug": "mihailtd",
    "name": "Mihai Farcas",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 17606,
  "downloads": 1760,
  "createdAt": "2025-01-17T09:45:18.164Z",
  "updatedAt": "2026-01-16T08:26:16.913Z",
  "publishedAt": "2025-01-17T09:45:18.164Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2741"
}