{
  "id": 9749,
  "slug": "9749",
  "title": "Scheduled YouTube transcription with de-duplication using Transcript.io and Supabase",
  "description": "## **Scheduled YouTube Transcription with Duplicate Prevention**\n\n### **Who's It For?**\n\nThis template is for advanced users, content teams, and data analysts who need a robust, automated system for capturing YouTube transcripts. It’s ideal for those who monitor multiple channels and want to ensure they only process and save each video's transcript once.\n\n\n### **What It Does**\n\nThis is an advanced, \"set-it-and-forget-it\" workflow that runs on a daily schedule to monitor YouTube channels for new content. It enhances the basic transcription process by connecting to your **Supabase** database to prevent duplicate entries.\n\nThe workflow fetches all recent videos from the channels you track, filters out any that are too old, and then checks your database to see if a video's transcript has already been saved. Only brand-new videos are sent for transcription via the `youtube-transcript.io` API, with the final data (title, URL, full transcript, author) being saved back to your Supabase table.\n\n### **Requirements**\n\n* A **Supabase** account with a table to store video data. This table must have a column for the `source_url` to enable duplicate checking.\n* An API key from [youtube-transcript.io](https://www.youtube-transcript.io/) (offers a free tier).\n* The **Channel ID** for each YouTube channel you want to track.\n\n### **How to Set Up**\n\n1.  **Set Your Time Filter:**\n    * In the **\"Max Days\"** node, set the number of days you want to look back for new videos (e.g., `7` for the last week).\n2.  **Add Channel IDs:**\n    * In the **\"Channels To Track\"** node, replace the example YouTube Channel IDs with the ones you want to monitor.\n3.  **Configure API Credentials:**\n    * Select the **\"Get Transcript from API\"** node.\n    * In the credentials tab, create a new \"Header Auth\" credential. Name it `youtube-transcript-io` and paste your API key into the \"Value\" field. The \"Name\" field should be `x-api-key`.\n4.  **Connect Your Supabase Account:**\n    * This workflow uses Supabase in two places: **\"Check if URL Is In Database\"** and **\"Add to Content Queue Table\"**.\n    * You must configure your Supabase credentials in **both** nodes.\n    * In each node, select your target table and ensure the columns are mapped correctly.\n5.  **Adjust the Schedule:**\n    * The **\"Schedule Trigger\"** node is set to run once a day. Click it to adjust the time and frequency to your needs.\n6.  **Activate the Workflow:**\n    * Save your changes and toggle the workflow to **Active**.",
  "featuredImage": "/data/workflows/9749/9749.webp",
  "author": {
    "id": 101,
    "slug": "automate-social-media",
    "name": "automedia",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 139,
  "downloads": 13,
  "createdAt": "2025-10-16T05:10:57.465Z",
  "updatedAt": "2026-01-16T09:01:44.984Z",
  "publishedAt": "2025-10-16T05:10:57.465Z",
  "nodes": 52,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9749"
}