{
  "id": 7151,
  "slug": "7151",
  "title": "Bypass Cloudflare Turnstile for web scraping with 2captcha",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n## Bypass Cloudflare Turnstile for Web Scraping with n8n\n### How It Works\nThis workflow automatically solves Cloudflare Turnstile CAPTCHAs for legitimate web scraping and automation tasks. It extracts the Turnstile sitekey from target webpages, submits solving requests to [2captcha](https://2captcha.com/?from=26496602), and returns bypass tokens that can be used in automated form submissions or data collection workflows.\n\n### Set Up Steps\n1. [Create a 2captcha Account](https://2captcha.com/?from=26496602): Sign up and get your API clientKey for CAPTCHA solving.\n2. Import the Workflow into n8n: Add the workflow to your n8n instance.\n3. Configure Authentication: Set up custom HTTP authentication with your clientKey in the credential settings.\n4. Test the Workflow: Run with the demo URL to verify Turnstile detection and solving works correctly.\n5. Replace the sample destination_url with your target website and start automating!\n\nSetup should take just a few minutes with your API credentials ready.\n\n### Getting Started\nOnce configured, the workflow can extract sitekeys from any Turnstile-protected webpage and return solved tokens for seamless automation. The [API documentation](https://2captcha.com/api-docs/cloudflare-turnstile?from=26496602) provides additional technical details for advanced use cases.\n\n### Customizing the Workflow\nThe workflow targets a demo page for testing. To adapt it, simply update the destination_url variable with your target website. You can also modify the sitekey extraction logic for sites that implement Turnstile differently, or integrate this as a subworkflow into larger scraping operations.\n\n### API Reference\nUses the TurnstileTaskProxyless task type with REST-based HTTPS communication. Each solve costs approximately $0.002 USD and typically completes within 30-90 seconds depending on queue load.",
  "featuredImage": "/data/workflows/7151/7151.webp",
  "author": {
    "id": 101,
    "slug": "ludwig",
    "name": "Ludwig",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 141,
  "downloads": 14,
  "createdAt": "2025-08-07T23:18:31.830Z",
  "updatedAt": "2026-01-16T08:48:44.869Z",
  "publishedAt": "2025-08-07T23:18:31.830Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7151"
}