{
  "id": 6528,
  "slug": "6528",
  "title": "Automated WhatsApp group weekly team reports with Gemini AI summarization",
  "description": "This n8n template automatically summarizes your WhatsApp group activity from the past week and generates a team report.\n\n**Why use this?**\nRemote teams rely on chat for communication, but important discussions, decisions, and ideas get buried in message threads and forgotten by Monday. This workflow ensures nothing falls through the cracks.\n\n**How it works**\n* Runs every Monday at 6am to collect the previous week's group messages\n* Groups conversations by participant and analyzes message threads\n* AI summarizes individual member activity into personal reports\n* Combines all individual reports into one comprehensive team overview\n* Posts the final report back to your WhatsApp group to kick off the new week\n\n**Setup requirements**\n* WhatsApp (whapAround.pro) no need Meta API\n* Gemini AI (or alternative LLM of choice)\n\n**Best practices**\n* Use one workflow per WhatsApp group for focused results\n* Filter for specific team members if needed\n* Customize the report tone to match your team culture\n* Adjust the schedule if weekly reports don't suit your team's pace\n\n**Customization ideas**\n* Send reports via email instead of posting to busy groups\n* Include project metrics alongside message summaries\n* Connect to knowledge bases or ticket systems for additional context\n\nPerfect for project managers who want to keep distributed teams aligned and ensure important conversations don't get lost in the chat noise.",
  "featuredImage": "/data/workflows/6528/6528.webp",
  "author": {
    "id": 101,
    "slug": "jamot",
    "name": "Jamot",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 838,
  "downloads": 83,
  "createdAt": "2025-07-27T14:06:48.240Z",
  "updatedAt": "2026-01-16T08:45:30.116Z",
  "publishedAt": "2025-07-27T14:06:48.240Z",
  "nodes": 47,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6528"
}