{
  "id": 4528,
  "slug": "4528",
  "title": "Transcribe voice messages from Telegram using OpenAI Whisper-1",
  "description": "This n8n workflow processes incoming Telegram messages, differentiating between text and voice messages.\n\n### How it works:\n1.  **Message Trigger**: The workflow initiates when a new message is received via the Telegram \"Message Trigger\" node.\n2.  **Switch Node**: This node acts as a router. It examines the incoming message:\n    * If the message is `text`, it directs the flow along the \"text\" branch.\n    * If the message contains `voice`, it directs the flow along the \"voice\" branch.\n3.  **Get Audio File**: For audio messages, this node downloads the audio file from Telegram.\n4.  **Transcribe Audio**: The downloaded audio file is then sent to an \"OpenAI Transcribe Recording\" node, which uses OpenAI's `whisper-1` speech-to-text model to convert the audio into a text transcript.\n5.  **Send Transcription Message**: Regardless of whether the original message was text or transcribed audio, the final text content is then passed to a \"Send transcription message\" node.\n\n### Setup Requirements:\n* **Telegram Bot Token**: You will need a Telegram bot token configured in the \"Message Trigger\" node to receive messages.\n* **OpenAI API Key**: An OpenAI API key is required for the \"Transcribe audio\" node to perform speech transcription.\n\n### Additional Notes:\nThis workflow provides a foundational step for building more complex AI-driven applications. The transcribed text or original text message can be easily piped into an AI agent (e.g., a large language model) for analysis, response generation, or interaction with other tools, extending the bot's capabilities beyond simple message reception and transcription.\n\n### 👉 Need Help?\nFeel free to contact us at [1 Node](https://1node.ai).\nGet instant access to a library of [free resources](https://1node.ai/resources) we created.",
  "featuredImage": "/data/workflows/4528/4528.webp",
  "author": {
    "id": 101,
    "slug": "aitoralonso",
    "name": "Aitor | 1Node",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 7099,
  "downloads": 709,
  "createdAt": "2025-05-31T08:23:21.556Z",
  "updatedAt": "2026-01-16T08:34:50.543Z",
  "publishedAt": "2025-05-31T08:23:21.556Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4528"
}