{
  "id": 8637,
  "slug": "8637",
  "title": "Match CVs to job descriptions with Gemini analysis & email reports",
  "description": "## AI-Powered CV Feedback & Fit Score\n\nThis workflow uses AI to automatically analyze a candidate’s CV against any job posting. It extracts key skills, requirements, and gaps, then generates a clear fit summary, recommendations, and optimization tips. Candidates also receive a structured email report, helping them improve their CV and focus on the right roles.\n\n**No more guesswork, the workflow delivers objective, AI-powered career insights in minutes.**\n\n## Benefits\n\n•\tAutomated CV analysis: Instantly compare your CV with any job description.\n•\tClear recommendations: Get a fit score (1–10) plus “Apply,” “Consider,” or “Not a fit.”\n•\tActionable feedback: See missing skills and concrete optimization tips.\n•\tEmail reports: Candidates receive a professional summary directly in their inbox.\n\n## Target Audience\n\n•\tJob seekers \n•\tCareer coaches and recruiters\n•\tHR teams evaluating candidate job alignment\n•\tTech bootcamps and training programs\n\n## Required APIs\n•\tGoogle Gemini API (AI analysis)\n•\tEmail credentials (send candidate reports)\n\n## Easy Customization\n•\tFit score logic: Adjust thresholds for “Apply,” “Consider,” and “Not a fit.”\n•\tEmail templates: Personalize branding, tone, or add follow-up resources.\n•\tDelivery channels: Add Slack, Teams, or WhatsApp nodes for real-time feedback.\n•\tLanguage detection: Extend to more languages by adding translation nodes.\n",
  "featuredImage": "/data/workflows/8637/8637.webp",
  "author": {
    "id": 101,
    "slug": "mychel-garzon",
    "name": "Mychel Garzon",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 549,
  "downloads": 54,
  "createdAt": "2025-09-16T08:58:44.348Z",
  "updatedAt": "2026-01-16T08:56:57.880Z",
  "publishedAt": "2025-09-16T08:58:44.348Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8637"
}