{
  "id": 2700,
  "slug": "2700",
  "title": "AI agent to chat with Airtable and analyze data",
  "description": "### Video Guide\n\nI prepared a detailed guide that shows the entire process of building an AI agent that integrates with Airtable data in n8n. This template covers everything from data preparation to advanced configurations.\n\n[![Youtube Thumbnail](https://cflobdhpqwnoisuctsoc.supabase.co/storage/v1/object/public/my_storage/Video%2012%20-%20Chat%20with%20Airtable%20Blur.png)](https://youtu.be/SotqsAZEhdc)\n\n[Youtube Link](https://youtu.be/SotqsAZEhdc)\n\n### Who is this for?\nThis workflow is designed for developers, data analysts, and business owners who want to create an AI-powered conversational agent integrated with Airtable datasets. It is particularly useful for users looking to enhance data interaction through chat interfaces.\n\n### What problem does this workflow solve?\nEngaging with data stored in Airtable often requires manual navigation and time-consuming searches. This workflow allows users to interact conversationally with their datasets, retrieving essential information quickly while minimizing the need for complex queries.\n\n### What this workflow does\nThis workflow enables an AI agent to facilitate chat interactions over Airtable data. The agent can:\n- Retrieve order records, product details, and other relevant data.\n- Execute mathematical functions to analyze data such as calculating averages and totals.\n- Optionally generate maps for geographic data visualization.\n\n1. **Dynamic Data Retrieval**: The agent uses user prompts to dynamically query the dataset.\n2. **Memory Management**: It retains context during conversations, allowing users to engage in a more natural dialogue.\n3. **Search and Filter Capabilities**: Users can perform tailored searches with specific parameters or filters to refine their results.\n\n### Set up steps\n\n1. **Separate workflows**:\n\t- Create additional workflow and move there Workflow 2.\n\n2. **Replace credentials**:\n\t- Replace connections and credentials in all nodes.\n\n3. **Start chat**:\n\t- Ask questions and don't forget to mention required base name.",
  "featuredImage": "/data/workflows/2700/2700.webp",
  "author": {
    "id": 101,
    "slug": "lowcodingdev",
    "name": "Mark Shcherbakov",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 15548,
  "downloads": 1554,
  "createdAt": "2025-01-06T19:57:13.408Z",
  "updatedAt": "2026-01-16T08:26:04.658Z",
  "publishedAt": "2025-01-06T19:57:13.408Z",
  "nodes": 41,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2700"
}