{
  "id": 9506,
  "slug": "9506",
  "title": "Detect duplicate form submissions & send AI responses with Jotform and Gemini",
  "description": "# Duplicate Submission Detection & Auto Response for Jotform\n\n## Who's it for\n\nForm managers, SaaS platforms, event organizers, recruitment teams, and any organization using Jotform who need automatic duplicate prevention with intelligent, personalized email responses without manual intervention.\n\n## What it does\n\nThis workflow automatically detects duplicate form submissions by email address, prevents duplicate entries in your database, and triggers intelligent email responses. When a new submission arrives, the system checks against all previous submissions. If a match is found, it deletes the duplicate and sends a friendly notification. If it's a new submission, it sends a professional welcome confirmation.\n\nThe entire process happens in seconds with no manual work required. AI-generated emails adapt to your form type and industry, making responses feel personalized and relevant.\n\n👉 **[Get the JotForm from here](https://www.jotform.com/?partner=roshanramanidev)**\n\n## How it works\n\n**Step-by-step:**\n1. Form submission triggers the workflow\n2. System extracts email and contact information\n3. Fetches all previous submissions from Jotform\n4. Filters for active submissions matching the email\n5. Counts matching submissions to determine if duplicate\n6. If duplicate: Deletes the submission, generates rejection email, sends to submitter\n7. If new: Generates welcome confirmation email, sends to submitter\n\n## Requirements\n\n- Jotform form and account\n- Jotform API Key\n- n8n instance (self-hosted or cloud)\n- Google Gemini API (for email generation)\n- Gmail account with OAuth2 setup\n- Basic form field mapping knowledge\n\n## How to set up\n\n**Complete setup instructions are included in the workflow sticky notes:**\n1. Get your Jotform API Key from Account Settings\n2. Enable Google Gemini API in Google Cloud Console\n3. Configure Gmail OAuth2 authentication\n4. Add all credentials to n8n\n5. Import workflow and map your form fields\n6. Test with a sample submission\n7. Activate and deploy\n\nDetailed step-by-step guide is in the workflow documentation.\n\n## How to customize the workflow\n\n**Personalize emails for your industry:**\nEdit the AI prompts in both \"Generate Welcome Email\" and \"Compose Rejection Email\" nodes to match your business type, tone, and specific requirements. The AI will adapt responses based on your instructions.\n\n**Map your form fields:**\nUpdate field IDs in filtering nodes to match your actual Jotform structure. Different forms may have email in different field positions.\n\n**Add admin notifications:**\nDuplicate the email nodes to send alerts to your team whenever duplicates are detected.\n\n**Modify approval workflow:**\nChange next steps timeline, add additional verification requirements, or customize follow-up sequences based on your business process.\n\n## Template features\n\n- Instant duplicate detection by email\n- Automatic duplicate removal\n- AI-powered, personalized email responses\n- Token-efficient prompts for cost savings\n- Professional HTML email formatting\n- Mobile-responsive designs\n- Works with any form type or industry\n- Fully customizable for your use case\n- Complete setup documentation included\n\n---",
  "featuredImage": "/data/workflows/9506/9506.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 62,
  "downloads": 6,
  "createdAt": "2025-10-12T09:51:12.951Z",
  "updatedAt": "2026-01-16T09:00:46.072Z",
  "publishedAt": "2025-10-12T09:51:12.951Z",
  "nodes": 17,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9506"
}