{
  "id": 9169,
  "slug": "9169",
  "title": "Dual-channel workflow error alerts with WhatsApp & Gmail reporting",
  "description": "## Error Handler: WhatsApp Alert & Gmail Report for Failed Workflows\n### 🎯 What This Template Does / How it Works\nThis template provides a robust, two-step system for handling critical errors in your n8n workflows. It ensures that no workflow failure goes unnoticed, immediately notifying your team via a fast, urgent channel and providing a detailed record via a formal channel.\n\nInstant Trigger & Data Capture: The Error Trigger automatically captures all necessary metadata when an assigned workflow fails, including the error message and ID.\n\nContact Configuration: The Set node centralizes and prepares recipient contact information (email and phone number) from the error data.\n\nRapid Response: An urgent notification is sent via WhatsApp  for immediate team awareness.\n\nTraceability & Record-Keeping: A short Wait node introduces a delay to prevent notification spam. Following the pause, a comprehensive report is sent via Gmail, ensuring a detailed record of the incident is archived.\n\nThis design guarantees high-priority alerts are handled rapidly, while still maintaining essential documentation.\n\n### Who’s It For\nThis template is ideal for Ops Teams, Developers, and Automation Engineers who rely on mission-critical n8n workflows (e.g., payment processing, lead capture, data synchronization). If a failure requires immediate human intervention, this system is essential.\n\n### How to Set Up\nSetting up this robust error handler is quick and essential for workflow stability:\n\nConfigure Credentials: Ensure you have the necessary credentials added to your n8n instance for:\n\nWhatsApp Business API (for the Send message node).\n\nGmail (for the Send Email node).\n\nDefine Recipients: In the set_recipient_EMAIL/NUMBER node, replace the placeholder values with the actual email address and phone number of your incident team.\n\nActivate the Listener: Open the settings of the primary workflow you wish to monitor.Go to settings ,navigate to the Error Workflow field and select the name of this template (the Error Handler).\n\nSave Changes: Save both this Error Handler workflow and the primary workflow.\n\nDone! Any failure in the primary workflow will now automatically trigger this alert system.\n\n### Requirements\n\nGmail Account (Configured as a resource).\nWhatsApp Business API Access (Configured as a resource and a pre-approved template available).",
  "featuredImage": "/data/workflows/9169/9169.webp",
  "author": {
    "id": 101,
    "slug": "ryan55",
    "name": "rayane ",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 28,
  "downloads": 2,
  "createdAt": "2025-10-01T23:11:33.000Z",
  "updatedAt": "2026-01-16T08:59:19.349Z",
  "publishedAt": "2025-10-01T23:11:33.000Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9169"
}