{
  "id": 9301,
  "slug": "9301",
  "title": "Generate & Translate Video Subtitles with OpenAI Whisper and LibreTranslate",
  "description": "## **This n8n template demonstrates how to automatically generate accurate subtitles from any video and optionally translate them into other languages. By combining FFmpeg, OpenAI Whisper, and LibreTranslate, this workflow turns video audio into ready-to-use .srt subtitle files that can be delivered via email.**\n\n**Use cases**\n\n- Auto-generate subtitles for training or educational videos\n- Translate videos into multiple languages for global reach\n- Create accessibility-friendly content with minimal effort\n- Build a backend for media platforms to process subtitles automatically\n\n**Good to know**\n\nThis workflow requires a self-hosted n8n instance since it uses the Execute Command node. FFmpeg is used for audio extraction and must be installed on the host machine. OpenAI Whisper (Local) is used for transcription, providing highly accurate speech-to-text results. LibreTranslate is used for translating subtitles into other languages.\n\n## How it works\n\n- *Webhook Trigger* – Starts when a video URL is received.\n- *Download Video* – Fetches the video file from the provided link.\n- *Extract Audio (FFmpeg)* – Separates audio from the video file.\n- *Run Whisper (Local)* – Transcribes the extracted audio into text subtitles.\n- *Read SRT File* – Loads the generated .srt subtitle file.\n- *Merge Paths* – Combines both original and translated subtitle flows.\n- *Translate Subtitles (LibreTranslate)* – Translates the .srt file into the target language.\n- *Write Translated SRT* – Creates a translated .srt file for delivery.\n- *Send a Message (Gmail)* – Sends the final subtitle file (original or translated) via email.\n\n## How to use\n- Clone this workflow into your self-hosted n8n instance.\n- Ensure FFmpeg and Whisper are installed and available via your server’s shell path.\n- Add your LibreTranslate service credentials for translation.\n- Configure Gmail (or another email service) to send subtitle files.\n- Trigger the workflow by sending a video URL to the webhook, and receive subtitle files in your inbox.\n\n## Requirements\n- Self-hosted n8n instance\n- FFmpeg installed and available on the server\n- OpenAI Whisper (Local) installed and callable via command line\n- LibreTranslate service with API credentials\n- Gmail (or any email integration) for delivery\n\n## Customising this workflow\n- Replace Gmail with Slack, Telegram, or Drive uploads for flexible delivery.\n- Switch LibreTranslate with DeepL or Google Translate for higher-quality translations.\n- Add post-processing steps such as formatting .srt files or embedding subtitles back into the video.\n- Use the workflow as a foundation for building a multi-language subtitle automation pipeline.",
  "featuredImage": "/data/workflows/9301/9301.webp",
  "author": {
    "id": 101,
    "slug": "hellopaul",
    "name": "Paul Abraham",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1116,
  "downloads": 111,
  "createdAt": "2025-10-06T11:11:25.830Z",
  "updatedAt": "2026-01-16T08:59:54.841Z",
  "publishedAt": "2025-10-06T11:11:25.830Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9301"
}