{
  "id": 3104,
  "slug": "3104",
  "title": "Social Media Content Automation workflow",
  "description": "## Transform Your Social Media Strategy with AI-Powered Content Generation!\n\n### Stop spending hours crafting social media posts.\n\nThis automated workflow uses AI to generate professional, platform-specific content and publishes it across your social channels on schedule.\n\n## What This Workflow Does?\n\nThis workflow creates a complete social media publishing system, incorporarint automated actions such as:\n\n- Content Planning: Pull post ideas from a Google Sheet on schedule\n- AI Content Creation: Generate tailored content for each platform using OpenAI\n- Multi-Platform Publishing: Post to LinkedIn and Twitter with proper formatting\n- Content Tracking: Log all scheduled posts in a Google Sheet\n- Notification System: Get email confirmations when content is scheduled\n\n## Perfect For:\n\nMarketing teams looking to scale content creation\nSocial media managers handling multiple accounts\nSmall businesses without dedicated social media staff\nContent creators needing consistent publishing schedules\n\n## Setup Instructions:\n\nRequired Accounts\nBefore setting up the workflow, make sure you have:\n\n- OpenAI API Key: For AI-powered content generation\n- Google Account: To access Google Sheets for content ideas and tracking\n- LinkedIn Account: With developer access for publishing\n- Twitter/X Account: With developer access for publishing\n- Email Account: For sending notifications",
  "featuredImage": "/data/workflows/3104/3104.webp",
  "author": {
    "id": 101,
    "slug": "js9600",
    "name": "Joseph",
    "avatar": ""
  },
  "categories": [
    "AI",
    "Content Creation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 251,
  "downloads": 25,
  "createdAt": "2025-03-07T15:06:53.067Z",
  "updatedAt": "2026-01-16T08:28:05.089Z",
  "publishedAt": "2025-03-07T15:06:53.067Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3104"
}