{
  "id": 8793,
  "slug": "8793",
  "title": "Multi-modal personal AI assistant with Telegram & Google Gemini for productivity tools",
  "description": "# Automate Your Life: The Ultimate AI Assistant in Telegram (Powered by Google Gemini)\nTransform your Telegram messenger into a powerful, multi-modal personal or team assistant. This n8n workflow creates an intelligent agent that can understand text, voice, images, and documents, and take action by connecting to your favorite tools like Google Calendar, Gmail, Todoist, and more.\n\nAt its core, a powerful Manager Agent, driven by Google Gemini, interprets your requests, orchestrates a team of specialized sub-agents, and delivers a coherent, final response, all while maintaining a persistent memory of your conversations.\n\n**Key Features**\n\n🧠 **Intelligent Automation**: Uses Google Gemini as a central \"Manager Agent\" to understand complex requests and delegate tasks to the appropriate tool.\n\n🗣️ **Multi-Modal Input**: Interact naturally by sending text, voice notes, photos, or documents directly into your Telegram chat.\n\n🔌 **Integrated Toolset**: Comes pre-configured with agents to manage your memory, tasks, emails, calendar, research, and project sheets.\n\n🗂️ **Persistent Memory**: Leverages Airtable as a knowledge base, allowing the assistant to save and recall personal details, company information, or past conversations for context-rich interactions.\n\n⚙️ **Smart Routing**: Automatically detects the type of message you send and routes it through the correct processing pipeline (e.g., voice is transcribed, images are analyzed).\n\n🔄 **Conversational Context**: Utilizes a window buffer to maintain short-term memory, ensuring follow-up questions and commands are understood within the current conversation.\n\n# How It Works\n1. The **Telegram Trigger** node acts as the entry point, receiving all incoming messages (text, voice, photo, document).\n\n2. A **Switch** node intelligently routes the message based on its type:\n\n- **Voice**: The audio file is downloaded and transcribed into text using a voice-to-text service.\n\n- **Photo**: The image is downloaded, converted to a base64 string, and prepared for visual analysis.\n\n- **Document**: The file is routed to a document handler that extracts its text content for processing.\n\n- **Text**: The message is used as-is.\n\n3. A **Merge** node gathers the processed input into a unified prompt.\n\n4. The **Manager Agent** receives this prompt. It analyzes the user's intent and orchestrates one or more specialized agents/tools:\n\n- memory_base **(Airtable)**: For saving and retrieving information from your long-term knowledge base.\n\n- todo_and_task_manager **(Todoist)**: To create, assign, or check tasks.\n\n- email_agent **(Gmail)**: To compose, search, or send emails.\n\n- calendar_agent **(Google Calendar)**: To schedule events or check your agenda.\n\n- research_agent **(Wikipedia/Web Search)**: To look up information.\n\n- project_management **(Google Sheets)**: To provide updates on project trackers.\n\n5. After executing the required tasks, the Manager Agent formulates a final response and sends it back to you via the Telegram node.\n\n# Setup Instructions\nFollow these steps to get your AI assistant up and running.\n\n1. **Telegram Bot:**\n- Create a new bot using the BotFather in Telegram to get your Bot Token.\n- In the n8n workflow, configure the Telegram Trigger node's webhook.\n- Add your Bot Token to the credentials in all Telegram nodes.\n- For proactive messages, replace the **chatId** placeholders with your personal Telegram Chat ID.\n\n2. **Google Gemini AI:**\n- In the Google Gemini nodes, add your credentials by providing your Google Gemini API key.\n\n3. **Airtable Knowledge Base:**\n- Set up an Airtable base to act as your assistant's long-term memory.\n- In the memory_base nodes (Airtable nodes), configure the credentials and provide the Base ID and Table ID.\n\n4. **Google Workspace APIs:**\n- Connect your Google account credentials for Gmail, Google Calendar, and Google Sheets.\n- In the relevant nodes, specify the Document/Sheet IDs you want the assistant to manage.\n\n5. **Connect Other Tools:**\n- Add your credentials for Todoist and any other integrated tool APIs.\n\n6. **Configure Conversational Memory:**\n- This workflow is designed for multi-user support. Verify that the Session Key in the \"Window Buffer Memory\" nodes is correctly set to a unique user identifier from Telegram (e.g., {{ $json.chat.id }}). This ensures conversations from different users are kept separate.\n\n7. **Review Schedule Triggers:**\n- Check any nodes designed to run on a schedule (e.g., \"At a regular time\"). Adjust their cron expressions, times, and timezone to fit your needs (e.g., for daily summaries).\n\n8. **Test the Workflow:**\n- Activate the workflow.\n- Send a text message to your bot (e.g., \"Hello!\").\n\n# Estimated Setup Time\n- **30–60 minutes:** If you already have your API keys, account credentials, and service IDs (like Sheet IDs) ready.\n\n- **2–3 hours:** For a complete, first-time setup, which includes creating API keys, setting up new spreadsheets or Airtable bases, and configuring detailed permissions.",
  "featuredImage": "/data/workflows/8793/8793.webp",
  "author": {
    "id": 101,
    "slug": "anshulchauhan",
    "name": "Anshul Chauhan",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1777,
  "downloads": 177,
  "createdAt": "2025-09-21T08:10:09.117Z",
  "updatedAt": "2026-01-16T08:57:44.821Z",
  "publishedAt": "2025-09-21T08:10:09.117Z",
  "nodes": 83,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8793"
}