{
  "id": 8912,
  "slug": "8912",
  "title": "Create & share lip-synced avatar videos with Infinitalk AI & upload to TikTok/YouTube",
  "description": "This workflow automates the process of generating and publishing a **talking avatar video**.\nIt takes a **video** and an **audio file** as inputs, then uses the Infinitalk API to create a lip-synced avatar that naturally matches the audio. Once generated, the video is:\n\n1. Retrieved and stored (Google Drive upload).\n2. Optimized with an **AI-generated YouTube title** for better SEO.\n3. Automatically uploaded to **YouTube** and **TikTok** via the Upload-Post API.\n\n---\n\n### **Key Advantages**\n\n* ✅ **Full Automation**: From video generation to social media publishing, everything is handled automatically.\n* ✅ **AI-Powered Content Optimization**: Uses GPT-based AI to create SEO-friendly and catchy YouTube titles, increasing reach and engagement.\n* ✅ **Multi-Platform Publishing**: Videos are instantly shared across YouTube and TikTok, saving time on manual uploads.\n* ✅ **Seamless Storage Integration**: Generated videos are saved to Google Drive for archiving or reuse.\n* ✅ **Scalable Workflow**: Can be reused for multiple videos, podcasts, tutorials, or marketing clips with minimal effort.\n* ✅ **Natural Lip-Sync**: Infinitalk API ensures avatars sync realistically with audio, creating professional-looking videos.\n* ✅ **Customizable**: Resolution, number of frames, and acceleration options can be adjusted for different needs (e.g., faster processing vs. higher quality).\n\n---\n\n### How It Works\n\nThe process begins with a form submission where users provide a video URL (for the avatar), an audio URL (for lip-sync), and a text prompt describing the video content. The system then:\n\n1. **Video Generation**: Sends the inputs to Fal.ai's Infinitalk API which creates a talking avatar video where the character lip-syncs to the provided audio with natural facial expressions\n2. **Status Monitoring**: Continuously checks the processing status every 60 seconds until the video generation is completed\n3. **Title Generation**: Uses OpenAI's GPT model to create an SEO-optimized YouTube title based on the original prompt\n4. **File Handling**: Downloads the generated video and uploads it to Google Drive for storage\n5. **Multi-Platform Distribution**: Automatically publishes the video to both YouTube and TikTok using the Upload-Post service\n\nThe workflow includes conditional logic to ensure each step executes in the correct order and only proceeds when previous operations are successful.\n\n---\n### Set Up Steps\n\n**Step 1: Configure Fal.ai API**\n- Create an account at Fai AI and obtain your API key\n- In the \"Create Video\" node, set up Header Authentication with:\n  - Name: \"Authorization\"\n  - Value: \"Key YOURAPIKEY\"\n\n**Step 2: Configure Upload-Post Service**\n- Get your API key from [Upload-Post Manage Api Keys](https://www.upload-post.com/)\n- Set up the authentication header in both upload nodes:\n  - Name: Authorization\n  - Value: Apikey YOUR_API_KEY_HERE\n- Create social media profiles in Upload-Post and replace \"YOUR_USERNAME\" in the upload nodes with your profile name\n- Note: Free plan supports all platforms except TikTok (requires paid upgrade)\n\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/).",
  "featuredImage": "/data/workflows/8912/8912.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 635,
  "downloads": 63,
  "createdAt": "2025-09-25T06:13:44.375Z",
  "updatedAt": "2026-01-16T08:58:17.523Z",
  "publishedAt": "2025-09-25T06:13:44.375Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8912"
}