{
  "id": 10370,
  "slug": "10370",
  "title": "Automated Facebook group scraper: posts, comments, and sub-comments to Supabase",
  "description": "# This n8n template demonstrates how to automate the scraping of posts, comments, and sub-comments from a Facebook Group and store the data in a Supabase database.\n\nUse cases are many: Gather user engagement data for analysis, archive posts and comments for research, or monitor community sentiment by collecting feedback across discussions!\n\n**Good to know**\n\nAt the time of writing, this workflow requires the apify api for scraping and Supabase credentials for database storage.\n\n# How it works\n\n- The Facebook Group posts are retrieved using an Apify scraper node.\n- For each post, comments and sub-comments are collected recursively to capture all levels of engagement.\n- The data is then structured and stored in Supabase, creating records for posts, comments, and sub-comments.\n- This workflow includes the option to adjust how often it scrapes and which group to target, making it easy to automate collection on a schedule.\n\n# How to use\n\n- The workflow is triggered manually in the example, but you can replace this with other triggers like webhooks or scheduled workflows, depending on your needs.\n- This workflow is capturing data points, such as user interactions or media attached to posts.\n\n# Requirements\n\n- Apify account API\n- Supabase account for data storage\n\n# Customizing this workflow\nThis template is ideal for gathering and analyzing community feedback, tracking discussions over time, or archiving group content for future use.",
  "featuredImage": "/data/workflows/10370/10370.webp",
  "author": {
    "id": 101,
    "slug": "muhammadab1",
    "name": "Muhammad Abrar",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 940,
  "downloads": 94,
  "createdAt": "2025-10-30T23:48:11.141Z",
  "updatedAt": "2026-01-16T09:04:45.884Z",
  "publishedAt": "2025-10-30T23:48:11.141Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10370"
}