{
  "id": 4618,
  "slug": "4618",
  "title": "Website lead capture with Apollo.io enrichment, HubSpot storage & Gmail notifications",
  "description": "## What problem does this workflow solve?\nCapture leads from your website, enrich them via Apollo, store them in HubSpot, send a personalized thank-you email, and notify your team—all automatically.\n\n## What does this workflow do?\n1. Capture leads from website forms automatically.\n2. Send a personalized thank-you email to each new lead.\n3. Enrich lead data using Apollo for deeper insights.\n4. Create or update a contact/lead in HubSpot CRM.\n5. Notify the internal team via email about the new lead.\n\n## Setup\n\n### Gmail Setup\nCreate Gmail Credentials by creating a project in Google Cloud Console.\n\n### Hubspot Setup\nCreate Hubspot Credentials with App Token.\n\n## How it Works:\nThis workflow automates your lead capture, enrichment, and follow-up process to ensure no opportunity is missed. Here's how it works:\n\n### 1. Website Form Submission\nA visitor submits a lead form on your website. Lead details like name, email, company, and message are captured instantly.\n\n### 2. Personalized Thank-You Email\nA customized thank-you email is automatically sent to the lead, building trust and confirming receipt of their inquiry.\n\n### 3. Apollo Lead Enrichment\nThe captured data is enriched using Apollo to fetch additional information like job title, LinkedIn profile, and other details. This helps you better understand and qualify your leads.\n\n### 4. Create Lead in HubSpot\nThe enriched lead information is pushed into HubSpot as a new contact or lead. Duplicate checks ensure that there are no repeat entries.\n\n### 5. Internal Notification\nAn email notification with enriched lead details is sent to your team. Your team can follow up immediately with a complete profile.\n\n## Who can use it?\nThis workflow can be used by any website owner with a \"Get In Touch\" or \"Contact Us\" button.\n\n\n\n",
  "featuredImage": "/data/workflows/4618/4618.webp",
  "author": {
    "id": 101,
    "slug": "infyom",
    "name": "InfyOm Technologies",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1765,
  "downloads": 176,
  "createdAt": "2025-06-03T10:46:49.152Z",
  "updatedAt": "2026-01-16T08:35:21.250Z",
  "publishedAt": "2025-06-03T10:46:49.152Z",
  "nodes": 5,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4618"
}