{
  "id": 7264,
  "slug": "7264",
  "title": "Generate AI-summarized newsletter drafts from RSS feeds with GPT-4 and Gmail",
  "description": "## **How it works**\nEvery hour, the workflow checks the RSS feed https://www.artificialintelligence-news.com/feed/ for new articles.\nFor each new item, it extracts the title, snippet, and full content, then sends them to an AI model to summarize and optionally translate.\nThe processed summary is passed to another AI model (with a personalized “Patrik” assistant tone) to generate a newsletter-style text.\nFinally, the result is saved as a draft email in Gmail, ready to review and send.\n\n## How to use\nSet your preferred language in the Information Extractor system prompt.\n\nUpdate the RSS feed URL if you want to pull articles from a different source.\n\nCustomize the assistant tone in the Message a model node for your newsletter style.\n\nConnect your Gmail account to the Create a draft node.\n\nActivate the workflow — every hour it will fetch new articles, generate newsletter content, and save them as Gmail drafts.\n\n## Customising this workflow\nChange the source: Replace the RSS feed URL in the RSS Feed Trigger node.\n\nLanguage & length: Edit the system prompt in the Information Extractor to set your preferred language and summary style.\n\nTone & format: Adjust the Message a model node to define the assistant’s personality, structure (headlines, bullets, CTA), or output as HTML.\n\nEmail settings: Change the subject, sender, or draft folder in the Create a draft node.\n\nFrequency: Modify the trigger schedule to run daily, weekly, or at custom intervals.",
  "featuredImage": "/data/workflows/7264/7264.webp",
  "author": {
    "id": 101,
    "slug": "patrikdescodino",
    "name": "Patrik Schick",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1159,
  "downloads": 115,
  "createdAt": "2025-08-11T19:37:21.513Z",
  "updatedAt": "2026-01-16T08:49:23.113Z",
  "publishedAt": "2025-08-11T19:37:21.513Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7264"
}