{
  "id": 10315,
  "slug": "10315",
  "title": "Japanese document translation quality checker with DeepL & Google Drive to Slack",
  "description": "## Title\n\nJapanese Document Translation Quality Checker with DeepL & Google Drive to Slack\n\n## Who’s it for\n\nLocalization teams, QA reviewers, and operations leads who need a fast, objective signal on Japanese document translation quality without manual checks.\n\n## What it does / How it works\n\nThis workflow watches a Google Drive folder for new Japanese documents, exports the text, translates JA→EN with DeepL, then back-translates EN→JA. It compares the original and back-translation to estimate a quality score and summarizes differences. A Google Docs report is generated, and a Slack message posts the score, difference count, and report link—so teams can triage quickly.\n\n## How to set up\n\n1. Connect credentials for Google Drive, DeepL, and Slack.\n2. Point the Google Drive Trigger to your “incoming JP docs” folder.\n3. In the **Workflow Configuration (Set)** node, fill `targetFolder` (report destination) and `slackChannel`.\n4. Run once, then activate and drop a test doc.\n\n## Requirements\n\nn8n (Cloud or self-hosted), Google Drive, DeepL, and Slack credentials; two Drive folders (incoming, reports).\n\n## How to customize the workflow\n\nTune the diff logic (character → token/line level, normalization rules), adjust score thresholds and Slack formatting, or add reviewer routing/Jira creation for low-score cases. Always avoid hardcoded secrets; keep user-editable variables in the Set node.",
  "featuredImage": "/data/workflows/10315/10315.webp",
  "author": {
    "id": 101,
    "slug": "s3110",
    "name": "s3110",
    "avatar": ""
  },
  "categories": [
    "Document Extraction",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 49,
  "downloads": 4,
  "createdAt": "2025-10-30T09:16:21.330Z",
  "updatedAt": "2026-01-16T09:04:26.745Z",
  "publishedAt": "2025-10-30T09:16:21.330Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10315"
}