{
  "id": 5699,
  "slug": "5699",
  "title": "Automate daily keyword research with Google Sheets, Suggest API & Custom Search",
  "description": "## Who's it for\n\nThis workflow is perfect for SEO specialists, marketers, bloggers, and content creators who want to automate keyword research using Google Sheets, Google Suggest, and Google Custom Search. Ideal for those building content pipelines, researching trends, or powering AI content generation with fresh search data.\n\n\n## What it does\n\nThis workflow automates the process of discovering a new keyword daily. It:\n\n- Rotates through a keyword list in Google Sheets\n\n- Selects one keyword per day\n\n- Fetches autocomplete suggestions from Google Suggest\n\n- Queries the Google Custom Search API for top results\n\n- Returns structured JSON containing titles, links, and snippets\n\n\n## How it works\n\n1. Manual Trigger – Initiates workflow manually\n\n2. Google Sheets – Reads keywords from a sheet (column: Title or Keyword)\n\n3. Code Node – Selects a daily keyword based on the number of days since July 4, 2025\n\n4. Set Node – Saves the selected keyword as seed_keyword\n\n5. HTTP Request – Fetches autocomplete suggestions from Google Suggest API\n\n6. Function Node – Parses suggestions into usable items\n\n7. HTTP Request – Calls Google Custom Search API for each suggestion\n\n8. Code Node – Formats the search results into JSON\n\n\n## How to set up\n\n- Connect your Google Sheets OAuth2 credentials in n8n\n\n- Use credential variables for Google Custom Search (⚠️ do not hardcode your key and cx)\n\n- Replace the sample sheet ID with your own\n\n- Run the workflow manually or schedule it daily\n\n\n## Requirements\n\n- Google account\n\n- Enabled Custom Search JSON API on Google Cloud\n\n- Google Sheet with a column labeled Title or Keyword\n\n- n8n instance (cloud or self-hosted)\n\n\n## How to customize\n\n- Change the start date to control the keyword rotation cycle\n\n- Randomize keyword selection instead of rotating\n\n- Enrich results using tools like Ahrefs or SEMrush\n\n- Push final output to Telegram, Notion, Slack, or Airtable\n\n- Add filtering logic based on CPC, volume, or duplicates\n\n\n## Example Sheet\n\n📄 [Click Here](https://docs.google.com/spreadsheets/d/12GNwRDjdfyDvGbC3Vqiy7lIVdQJcPz3D42xpUOUVpbc/edit?usp=sharing) to access the example Google Sheet\n\nSheet must contain a column Title or Keyword in the first row:\n\nTitle\n\n - teknologi AI\n\n - berita viral\n\n - tren startup\n",
  "featuredImage": "/data/workflows/5699/5699.webp",
  "author": {
    "id": 101,
    "slug": "fahmi3322",
    "name": "Fahmi Oktafian",
    "avatar": ""
  },
  "categories": [
    "Market Research"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 910,
  "downloads": 91,
  "createdAt": "2025-07-05T13:37:50.549Z",
  "updatedAt": "2026-01-16T08:40:58.278Z",
  "publishedAt": "2025-07-05T13:37:50.549Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/5699"
}