{
  "id": 7184,
  "slug": "7184",
  "title": "Automated TikTok video downloader bot (no watermark) using n8n and Telegram",
  "description": "![AI2.png](fileId:2000)![AI3.png](fileId:1999)\n\n**Description**\nThis workflow is an n8n-based automation that allows users to download TikTok/Reels videos without watermarks simply by sending the video link through a Telegram Bot.\n\nIt uses a Telegram Trigger to receive the link from the user, then makes an HTTP request to a third-party API (tiktokio.com) to process and retrieve the download link. The workflow filters the results to find the Download without watermark link, downloads the video in MP4 format, and sends it back to the user directly in their Telegram chat.\n\n*Key features:*\n\n- Supports the best available video quality (bestvideo+bestaudio).\n- Automatically removes watermarks.\n- Instant response directly in Telegram chat.\n- Fully automated — no manual downloads required.\n\n**How It Works**\n1. Telegram Trigger\n- The user sends a TikTok or Reels link to the Telegram bot.\n- The workflow captures and stores the link for processing.\n\n2. HTTP Request – MediaDL API\n- The link is sent via POST method to https://mediadl.app/api/download.\n- The API processes the link and returns video file data.\n\n3. Wait Delay\n- The workflow waits a few seconds to ensure the API response is fully ready.\n\n4. Edit Fields\n- Extracts the video file URL from the API response.\n\n5. Additional Wait Delay\n- Adds a short pause to avoid connection errors during the download process.\n\n6. HTTP Request – Proxy Download\n- Downloads the MP4 video file directly from the filtered URL.\n\n7. Send Video via Telegram\n- The downloaded video is sent back to the user in their Telegram chat.\n\n\n**How to Set Up**\n1. Create & Configure a Telegram Bot\n- Open Telegram and search for BotFather.\n- Send /newbot → choose a name & username for your bot.\n- Copy the Bot Token provided — you’ll need it in n8n.\n\n2. Prepare Your n8n Environment\n- Log in to your n8n instance (self-hosted or n8n Cloud).\n- Go to Credentials → create new Telegram API credentials using your Bot Token.\n\n3. Import the Workflow\n- In n8n, click Import and select the PROJECT_DOWNLOAD_TIKTOK_REELS.json file.\n\n4. Configure the Telegram Nodes\n- In the Telegram Trigger and Send Video nodes, connect your Telegram API credentials.\n\n5. Configure the HTTP Request Nodes\n- Ensure the Download2 and HTTP Request nodes have the correct URL and headers (pre-configured for mediadl.app).\n- Make sure the responseFormat is set to file in the final download node.\n\n6. Activate the Workflow\n- Toggle Activate in the top right corner of n8n.\n- Test by sending a TikTok or Reels link to your bot — you should receive the no-watermark video in return.",
  "featuredImage": "/data/workflows/7184/7184.webp",
  "author": {
    "id": 101,
    "slug": "garri",
    "name": "Garri",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2307,
  "downloads": 230,
  "createdAt": "2025-08-08T15:01:44.752Z",
  "updatedAt": "2026-01-16T08:48:54.332Z",
  "publishedAt": "2025-08-08T15:01:44.752Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7184"
}