{
  "id": 9034,
  "slug": "9034",
  "title": "Automate lead generation with Apollo, AI parsing, and timed email follow-ups",
  "description": "## Good to know:\n- The workflow runs every hour with a randomized delay of 5–20 minutes to help distribute load.\n- It records the exact date and time a lead is emailed so you can track outreach.\n- Follow-ups are automatically scheduled two days after the initial email.\n\n## How it works:\n\n1. After apify completes, the JSON data is retrieved and inserted into the proper JSON node (only the JSON is removed — nothing else).\n2. The agent then runs on its own, parsing the data and pushing it to Google Sheets.\n3. When a lead is emailed, the system tags it with the date and time for tracking.\n4. Two days later the workflow automatically triggers a follow-up, again on an hourly schedule with the same time delay.\n\n## How to use:\n\n1. Start by connecting your apify account to retrieve data.\n2. Place the returned JSON into the designated JSON node.\n3. Configure your Google Sheet where the data will be stored.\n4. Adjust the time delay window or follow-up period if needed.\n5. Insert your email credentials and the message.\n \n## Requirements:\n\n- Apify account with active leads/data.\n- Google Sheet for storing and managing parsed lead information.\n- n8n credentials configured for your accounts.\n- email credentials\n\nCustomising this workflow:\n\nYou can easily extend this template to include other CRMs, different time delays, or additional notification steps. For example, push new leads to Slack, send SMS notifications, or trigger downstream analytics dashboards automatically.",
  "featuredImage": "/data/workflows/9034/9034.webp",
  "author": {
    "id": 101,
    "slug": "denizdinc",
    "name": "Deniz",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 526,
  "downloads": 52,
  "createdAt": "2025-09-28T09:42:33.325Z",
  "updatedAt": "2026-01-16T08:58:49.771Z",
  "publishedAt": "2025-09-28T09:42:33.325Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9034"
}