{
  "id": 11775,
  "slug": "11775",
  "title": "Monitor compliance with GPT-4 analysis of system logs and generate audit reports",
  "description": "\n## How It Works\nThis solution centralizes communication data from Slack, Microsoft Teams, Gmail, and GitHub into a unified AI-powered analysis and documentation workflow for teams managing distributed knowledge. Manual aggregation across multiple tools is time-consuming and leads to information silos that obscure key decisions and context. By automating secure data collection and normalization, the workflow enables AI models to analyze conversations, extract decisions, action items, and key themes, and convert these insights into continuously updated documentation such as design notes and knowledge base articles. This improves visibility, preserves organizational knowledge, and supports more effective collaboration and decision-making.\n\n## Setup Steps\n* **Connect credentials:** Slack App API, Microsoft Teams credentials, Gmail OAuth, GitHub Personal Access Token, Anthropic API key \n* **Configure monitoring parameters:** Specify channels, repositories, and email labels to track\n* **Set schedule triggers: \n \n## Prerequisites\nSlack workspace admin, Teams account, Gmail account, GitHub repository access, Anthropic API subscription, Notion workspace, n8n self-hosted or cloud instance.\n\n## Use Cases\nMarketing teams aggregating customer feedback across channels; Documentation teams collecting technical updates; \n\n## Customization\nModify source integrations by adding/removing trigger nodes. Adjust AI prompts in Anthropic node for different analysis types.  \n\n## Benefits\nSaves 5+ hours weekly on manual data collection. Ensures no communication missed across platforms.  \n\n\n \n",
  "featuredImage": "/data/workflows/11775/11775.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "SecOps",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 79,
  "downloads": 7,
  "createdAt": "2025-12-14T05:12:24.523Z",
  "updatedAt": "2026-01-16T09:10:03.995Z",
  "publishedAt": "2025-12-14T05:12:24.523Z",
  "nodes": 25,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11775"
}