{
  "id": 6697,
  "slug": "6697",
  "title": "Telegram fitness bot: Custom workout plans from photo/text using Gemini AI",
  "description": "## A Telegram Fitness Bot that creates personalized 7-day workout plans by analyzing user photos or text input. It uses Google Gemini AI for image and text understanding combined with LangChain for conversational flow and memory to deliver motivating fitness routines directly through Telegram.\n\nUse cases include virtual fitness coaching, AI-powered personal training assistants, and health & wellness engagement bots.\n\n## Who’s it for\n- Fitness coaches and personal trainers seeking to automate client workout plans\n- Developers building Telegram bots with AI-powered personalization\n- Startups creating virtual fitness assistants or health engagement tools\n\n## What it does\n- Users send a full-body photo or message to the Telegram bot.\n- The workflow detects if the input is photo or text.\n- For photos, Gemini AI analyzes body type, posture, and muscle tone.\n- For text, LangChain asks fitness questions (age, goals, activity level, etc.).\n- Based on input, a personalized 7-day workout plan is generated in Telegram-compatible HTML.\n- The plan is formatted and split as needed to fit message size limits.\n- The workout plan is sent back to the user via Telegram.\n\n## Requirements\n- Telegram Bot token with messaging and file permissions\n- Google Gemini API access with image and language model capabilities\n- n8n instance (cloud or self-hosted)\n- Basic knowledge of LangChain and n8n AI nodes for customization\n\n## How to customize the workflow\n- Modify LangChain system prompts for your coaching tone and style\n- Add or change fitness questions in the conversation flow\n- Enable PDF export of workout plans\n- Add daily workout reminders and streak tracking via Cron and Telegram nodes\n- Swap AI models or add new tools to enhance functionality\n- Embed videos or images to enrich workout plans\n\n\n\n\n\n\n",
  "featuredImage": "/data/workflows/6697/6697.webp",
  "author": {
    "id": 101,
    "slug": "parthpansuriya",
    "name": "Parth Pansuriya",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 275,
  "downloads": 27,
  "createdAt": "2025-07-30T11:26:48.137Z",
  "updatedAt": "2026-01-16T08:46:34.583Z",
  "publishedAt": "2025-07-30T11:26:48.137Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6697"
}