{
  "id": 12100,
  "slug": "12100",
  "title": "Compare LLM token costs across 350+ models with OpenRouter",
  "description": "###  This n8n template lets you run prompts against 350+ LLM models and see exactly what each request costs with real-time pricing from OpenRouter\n\n  Use cases are many: Compare costs across different models, plan your AI budget, optimize prompts for cost efficiency, or track expenses for client billing!\n\n  ## Good to know\n\n  - OpenRouter charges a platform fee on top of model costs. See [OpenRouter Pricing](https://openrouter.ai/pricing) for details.\n  - You need an OpenRouter account with API credits. Free signup available with some free models included.\n  - Pricing data is fetched live from OpenRouter's API, so costs are always up-to-date.\n\n  ## How it works\n\n  1. All available models are fetched from OpenRouter's API when you start.\n  2. You select a model and enter your prompt via the form (or just use the chat).\n  3. The prompt is sent to OpenRouter and the response is captured.\n  4. Token usage (input/output) is extracted from the response using a LangChain Code node.\n  5. Real-time pricing for your selected model is fetched from OpenRouter.\n  6. The exact cost is calculated and displayed alongside your AI response.\n\n  ## How to use\n\n  - **Chat interface**: Quick testing - just type a prompt and get the response with costs.\n  - **Form interface**: Select from all available models via dropdown, enter your prompt, and get a detailed cost breakdown.\n  - Click **\"Show Details\"** on the result form to see the full breakdown (input tokens, output tokens, cost per type).\n\n  ## Requirements\n\n  - OpenRouter account with API key ([Get one here](https://openrouter.ai/settings/keys))\n\n  ## Customising this workflow\n\n  - Add a database node to log all requests and costs over time\n  - Connect to Google Sheets for cost tracking and reporting\n  - Extend with LLM-as-Judge evaluation to also check response quality",
  "featuredImage": "/data/workflows/12100/12100.webp",
  "author": {
    "id": 101,
    "slug": "philflow",
    "name": "Philflow",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 68,
  "downloads": 6,
  "createdAt": "2025-12-24T12:21:06.911Z",
  "updatedAt": "2026-01-16T09:11:24.083Z",
  "publishedAt": "2025-12-24T12:21:06.911Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12100"
}