{
  "id": 7841,
  "slug": "7841",
  "title": "QuickBooks Online AI agent - Chat with Quickbooks data with GPT agent",
  "description": "## Video Introduction\n[![Video Walkthrough](https://vasarmilan-public.s3.us-east-1.amazonaws.com/blog_thumbnails/thumbnail_rec0EGjS8Q1AxvT1b.jpg)](https://youtu.be/mprQ4CY3yn0)\n\n#### Want to automate your inbox or need a custom workflow? [📞 Book a Call](https://smoothwork.ai/book-a-call/) | [💬 DM me on Linkedin](https://www.linkedin.com/in/mil%C3%A1n-v%C3%A1s%C3%A1rhelyi-3a9985123/)\n\n---\n\n## What This Workflow Does\n\nThis workflow creates an AI-powered chatbot that answers natural language questions about your QuickBooks data in real-time. Users can interact with a public chat interface to query customer information, balances, invoices, and other accounting data without needing to navigate the QuickBooks interface directly. The AI agent uses OpenAI's language model to understand questions and automatically retrieves the relevant data from QuickBooks.\n\n## Key Features\n\n- **Natural Language Interface**: Ask questions like \"How many customers do we have?\" or \"What's the total balance across all customers?\" and get instant answers\n- **Public Chat URL**: Share a link with team members or stakeholders so they can access QuickBooks insights without direct system access\n- **Customizable Data Access**: Configure the QuickBooks tool to retrieve different resources (customers, invoices, expenses, bills, etc.) based on your needs\n\n## Common Use Cases\n\n- Enable non-accounting staff to get quick answers about customer data\n- Provide executives with on-demand financial insights without training them on QuickBooks\n- Create a self-service interface for sales teams to check customer balances\n- Build internal support bots that can answer accounting questions\n\n## Setup Requirements\n\n1. **QuickBooks Developer Account**: Register at `developer.intuit.com` and create a new app with Accounting permissions\n2. **Credentials**: Configure QuickBooks OAuth2 API credentials (Client ID, Client Secret, and Redirect URI from the Intuit Developer dashboard) and OpenAI API credentials\n3. **Environment**: Start with Sandbox mode for testing, then switch to Production after getting your app approved by Intuit\n4. **Tool Configuration**: The QuickBooks tool is pre-configured to retrieve all customer data, but you can modify the operation and filters to access different QuickBooks resources based on your requirements",
  "featuredImage": "/data/workflows/7841/7841.webp",
  "author": {
    "id": 101,
    "slug": "vasarmilan",
    "name": "Milan Vasarhelyi - SmoothWork",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 206,
  "downloads": 20,
  "createdAt": "2025-08-25T13:06:33.029Z",
  "updatedAt": "2026-01-16T08:52:34.834Z",
  "publishedAt": "2025-08-25T13:06:33.029Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7841"
}