{
  "id": 7964,
  "slug": "7964",
  "title": "Generate video ads with Gemini 2.5 flash images & FAL WAN animation",
  "description": "![Captura de pantalla 20250828 a las 1.25.30.png](fileId:2268)\n\nThis automated workflow template transforms a single product image into a complete professional advertisement video with dynamic motion and custom soundtrack. Perfect for e-commerce businesses, marketing agencies, and content creators who need to quickly produce high-quality video ads for social media platforms like TikTok, Instagram Reels, and YouTube Shorts.\n\n***Note: This workflow uses FAL.ai API for AI image generation with Gemini Bano Banana and video creation with Wan, Google Gemini for intelligent storyboarding, ImgBB for image hosting, and Upload-Post.com for automated social media publishing.***\n\n## Who Is This For?\n- **E-commerce Businesses:** Transform product photos into engaging video advertisements that drive sales and increase conversion rates across social media platforms.\n- **Marketing Agencies:** Scale video ad production for multiple clients without expensive video equipment or extensive editing time.\n- **Social Media Managers:** Create consistent, professional video content for brands that stands out in crowded social feeds.\n- **Content Creators & Influencers:** Generate eye-catching product showcase videos for sponsored content and affiliate marketing campaigns.\n- **Small Business Owners:** Compete with larger brands by creating professional-quality video ads on a budget.\n\n## What Problem Does This Workflow Solve?\nCreating professional video advertisements traditionally requires expensive equipment, design skills, and hours of editing time. This workflow addresses these challenges by:\n- **AI-Powered Visual Enhancement:** Automatically generates 4 unique variations of your product image with different lighting, backgrounds, and visual effects.\n- **Intelligent Motion Generation:** Converts static images into dynamic 5-second video clips with smooth camera movements, rotations, and visual effects.\n- **Automated Storyboarding:** Uses AI to create a cohesive visual narrative that showcases your product from multiple appealing angles.\n- **Professional Audio Integration:** Automatically generates and adds suitable background music that matches your product and brand aesthetic.\n- **Seamless Video Composition:** Combines all video clips into a single 20-second advertisement with smooth transitions.\n- **Multi-Platform Publishing:** Automatically uploads finished videos to TikTok, Instagram, and YouTube with optimized formatting.\n\n## How It Works\n1. **Product Upload:** Submit a single product image and brief description through the web form interface.\n2. **AI Storyboard Creation:** Google Gemini AI analyzes your product and creates a 4-frame visual story with lighting enhancements, background changes, and cinematic effects.\n3. **Image Generation:** FAL.ai Gemini 2.5 Flash creates 4 unique variations of your product image based on the AI-generated prompts.\n4. **Video Animation:** Each enhanced image is converted into a 5-second video clip with specific motion patterns (rotation, zoom, lighting sweeps, camera orbits).\n5. **Quality Control:** The system monitors video generation progress and ensures all clips are successfully created before proceeding.\n6. **Video Sequencing:** FFmpeg API combines all 4 video clips into a seamless 20-second advertisement with smooth transitions.\n7. **Audio Enhancement:** AI generates appropriate background music that matches your product category and brand style.\n8. **Final Composition:** Audio and video are merged to create the complete advertisement.\n9. **Automated Publishing:** The finished video is automatically uploaded to TikTok, Instagram Reels, and YouTube with your product description.\n\n## Setup\n1. **FAL.ai API Setup:** \n   - Create account at [fal.ai](https://fal.ai) and obtain API credentials\n   - Add your API token to the HTTP request authentication nodes\n2. **Google Gemini API:**\n   - Set up Google AI Studio account and get API key\n   - Configure the Google Gemini Chat Model node with your credentials\n3. **ImgBB Configuration:**\n   - Register at [imgbb.com](https://imgbb.com) for image hosting\n   - Update the `imgbb_api_key` in the \"Set APIs Vars\" node\n4. **Upload-Post Integration:**\n   - Create account at [upload-post.com](https://upload-post.com)\n   - Connect your social media accounts (TikTok, Instagram, YouTube)\n   - Add your Upload-Post credentials to the final upload node\n5. **Workflow Configuration:**\n   - Adjust video parameters (resolution, frame rate, duration) in the image-to-video nodes\n   - Customize audio prompts in the \"Create Sounds\" node\n   - Modify social media posting settings in the \"Upload Post\" node\n\n## Requirements\n- **Accounts:** n8n, FAL.ai, Google AI Studio, ImgBB, Upload-Post.com\n- **API Keys:** FAL.ai API token, Google Gemini API key, ImgBB API key, Upload-Post credentials\n- **Social Media:** Connected TikTok, Instagram, and YouTube accounts for automated publishing\n\n## Features\n- **AI-Powered Image Enhancement:** Creates 4 professional variations with lighting, background, and effect improvements\n- **Dynamic Video Generation:** Converts static images to engaging videos with camera movements and visual effects\n- **Intelligent Audio Matching:** Generates background music that complements your product and target audience\n- **Multi-Platform Optimization:** Automatically formats videos for TikTok, Instagram Reels, and YouTube Shorts (9:16 aspect ratio)\n- **Progress Monitoring:** Built-in status checking ensures reliable video generation before proceeding to next steps\n- **Automated Publishing:** Direct upload to social media platforms with optimized descriptions and formatting\n- **Scalable Processing:** Handles multiple video generations simultaneously for efficient batch processing\n- **Professional Quality:** Produces broadcast-ready videos suitable for paid advertising campaigns\n\nUse this template to revolutionize your product marketing strategy, automatically converting any product photo into multiple high-quality video advertisements ready for immediate social media deployment.",
  "featuredImage": "/data/workflows/7964/7964.webp",
  "author": {
    "id": 101,
    "slug": "carlosgracia",
    "name": "Juan Carlos Cavero Gracia",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2447,
  "downloads": 244,
  "createdAt": "2025-08-27T23:28:52.145Z",
  "updatedAt": "2026-01-16T08:53:18.831Z",
  "publishedAt": "2025-08-27T23:28:52.145Z",
  "nodes": 61,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7964"
}