{
  "id": 8568,
  "slug": "8568",
  "title": "Create structured logging system with Supabase and Log4j2-style levels",
  "description": "Create centralized, structured logs directly from your n8n workflows, using Supabase as your scalable log database.\n\nWhether you're debugging a workflow, monitoring execution status, or tracking error events, this template makes it easy to log messages in a consistent, structured format inspired by Log4j2 levels (DEBUG, INFO, WARN, ERROR, FATAL).\n\nYou’ll get a reusable sub-workflow that lets you log any message with optional metadata, tied to a workflow execution and a specific node.\n\n## What this template does\n\n- Provides a sub-workflow that inserts log entries into Supabase.\n\n- Each log entry supports the following fields:\n   - workflow_name: Your n8n workflow identifier\n   - node_name: last executed node\n   - execution_id: n8n execution ID for correlation\n   - log_level: One of DEBUG, INFO, WARN, ERROR, FATAL\n   - message: Textual message for the log\n   - metadata: Optional JSON metadata (flexible format)\n\n- Comes with examples for diffrerent log levels:\nEasily call the sub-workflow from any step with a Execute Workflow node and pass dynamic parameters.\n\n\n## Use Cases\n\n- Debug complex workflows without relying on internal n8n logs.\n- Catch and trace errors with contextual metadata.\n- Integrate logs into external dashboards or monitoring tools via Supabase SQL or APIs.\n- Analyze logs by level, time, or workflow.\n\n\n## Requirements\n\nTo use this template, you'll need:\n- A Supabase project with:\n  - A log_level_type enum\n  - A logs table matching the expected structure \n- A service role key or supabase credentials available in n8n.\n\nThe table shema and SQL scripts are given in the template file.\n\n## How to Use This Template\n\n- Clone the sub-workflow into your n8n instance.\n- Set up Supabase credentials (in the Supabase node).\n- Call the sub-workflow using the Execute Workflow node.\n- Provide input values like:\n\n```\n{\n  \"workflow_name\": \"sync_crm_to_airtable\",\n  \"execution_id\": {{$execution.id}},\n  \"node_name\": \"Airtable Insert\",\n  \"log_level\": \"INFO\",\n  \"message\": \"New contact pushed to Airtable successfully\",\n  \"metadata\": {\n    \"recordId\": \"rec123\",\n    \"fields\": [\"email\", \"firstName\"]\n  }\n}\n```\n\n- Repeat anywhere you need to log custom events.",
  "featuredImage": "/data/workflows/8568/8568.webp",
  "author": {
    "id": 101,
    "slug": "ladypixl",
    "name": "Elodie Tasia",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 149,
  "downloads": 14,
  "createdAt": "2025-09-13T23:32:45.627Z",
  "updatedAt": "2026-01-16T08:56:32.978Z",
  "publishedAt": "2025-09-13T23:32:45.627Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8568"
}