{
  "id": 9009,
  "slug": "9009",
  "title": "Convert Slack messages to Notion todos using 📝 emoji reactions",
  "description": "This n8n workflow turns Slack messages into actionable Notion todos — using nothing more than a simple emoji reaction.\n\nBy reacting to any Slack message with the 📝 emoji, the workflow will automatically capture the message, extract its content, and create a new Notion to_do item with a link back to the original message. A daily scheduled Slack message then reminds you of any tasks left unchecked in Notion.\n\nPerfect for async teams who live in Slack but organize work in Notion, this template helps you bridge the gap between communication and execution—without switching tools or relying on memory.\n\n## Who’s it for\n\n- Teams that use Slack and Notion daily\n- Product managers, leads, and async-first teams who want quick capture of action items\n- Anyone tired of copy-pasting Slack messages into Notion manually\n\n## How it works\n### Emoji-triggered Notion capture\n\n1. The workflow listens for the reaction_added event from Slack.\n2. When a user reacts to a message with :memo:, it fetches the full message content and permalink. \n3. It creates a to_do block in Notion with the message and a direct link to the original Slack thread.\n\n### Daily Slack reminder\n\n1. Every day at 08:00, the workflow scans all to_do blocks in a designated Notion page. \n2. It filters out those that are still unchecked.\n3. It aggregates the unchecked tasks and sends a single Slack message to the user with the list of open todos.\n\n## How to set up\n\n- Connect your Slack account and configure the trigger to watch for the :memo: reaction.\n- Connect your Notion account and select a page where todos should be created.\n- Customize the schedule time if needed (default is 08:00).\n- (Optional) Set up the final Slack message node to send reminders to yourself or a specific team channel.\n\n## Requirements\n\n- A Slack app with permission to read messages and reactions\n- A Notion integration with access to edit the target page\n- A Notion page with blocks enabled (or create one manually)\n\n## How to customize the workflow\n\n- Change the emoji from :memo: to another (e.g. :fire: for urgent, :idea: for brainstorms)\n- Add logic to assign Notion tasks to specific team members\n- Use Slack threads, tags, or message metadata to auto-categorize tasks\n- Modify the daily reminder to include due dates, priorities, or Slack buttons to check off tasks",
  "featuredImage": "/data/workflows/9009/9009.webp",
  "author": {
    "id": 101,
    "slug": "gpirescampos",
    "name": "Guilherme Campos",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 289,
  "downloads": 28,
  "createdAt": "2025-09-27T13:09:10.702Z",
  "updatedAt": "2026-01-16T08:58:41.643Z",
  "publishedAt": "2025-09-27T13:09:10.702Z",
  "nodes": 14,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9009"
}