{
  "id": 10853,
  "slug": "10853",
  "title": "Extract text from Instagram posts (single & carousel) using HikerAPI & OCR.Space",
  "description": "## Overview  \nThis workflow extracts text from Instagram images by combining HikerAPI and OCR.Space. You can use it to collect text data from single posts or carousels, analyze visual content, or repurpose insights without manual copying. The process is fully automated inside N8N and helps marketers, researchers, and teams gather Instagram text quickly.\n\n## How it works  \n- Takes an Instagram post URL, either a single post or a carousel  \n- Retrieves media data using the HikerAPI Get Media endpoint  \n- Detects the post type, whether single feed, carousel, or reel  \n- For single posts, sends the image to OCR.Space for text extraction  \n- For carousels, loops through each slide and extracts text from every image  \n- Merges all parsed results into one raw text output  \n\n## Use cases  \n- Collecting text data from Instagram images for research  \n- Extracting visual insights for marketing analysis  \n- Repurposing creator content without manual transcription  \n- Helping marketers, agencies, and researchers identify message patterns in visual posts  \n\n## Prerequisites  \n- HikerAPI account with access to the Instagram media endpoint  \n- OCR.Space API key for image text extraction  \n- A valid Instagram post URL  \n- N8N instance capable of running HTTP requests and looping through items  \n\n## Set up steps  \n- Prepare your API keys for HikerAPI and OCR.Space  \n- Insert both API keys into their respective HTTP Request nodes  \n- Paste the Instagram post URL into the IGPost URL node  \n- Run the workflow to generate raw text extracted from Instagram images  \n- Check the sticky notes inside the workflow for additional guidance  \n\nMade by @fataelislami\nhttps://pake.ai\n",
  "featuredImage": "/data/workflows/10853/10853.webp",
  "author": {
    "id": 101,
    "slug": "pake-ai",
    "name": "Pake.AI",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 256,
  "downloads": 25,
  "createdAt": "2025-11-14T23:08:38.366Z",
  "updatedAt": "2026-01-16T09:06:32.560Z",
  "publishedAt": "2025-11-14T23:08:38.366Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10853"
}