{
  "id": 2507,
  "slug": "2507",
  "title": "📂 Automatically update stock portfolio from OneDrive to Excel",
  "description": "## Seamlessly Sync and Update Data from a csv in OneDrive to Excel with n8n\n\nThis workflow is perfect for users who need a reliable, automated way to transfer and organize data from OneDrive into Excel—especially for tasks like portfolio tracking, inventory management, and record-keeping. By monitoring your OneDrive folder for new CSV files, it performs data cleaning, transformation, and real-time updates in an Excel sheet, ensuring only new or changed records are added.\n\n---\n\n## How it Works\n\n1. **Automated Monitoring**: Every minute, the workflow scans a designated OneDrive folder for new files.\n2. **File Verification**: It checks if the detected file is in CSV format; if not, the process stops with an error message.\n3. **Data Extraction and Cleaning**: CSV data is loaded, and irrelevant headers are removed before mapping to specified columns in Excel.\n4. **Excel Update**: The workflow maps data to your Excel sheet, updating only new or modified entries based on a unique identifier (\"Ticker/ISIN\").\n5. **Cleanup**: To keep your OneDrive organized, processed files are deleted after updating Excel.\n\n---\n\n## Setup Steps\n\n1. **Connect OneDrive and Excel Accounts**: Link your Microsoft OneDrive and Excel accounts in n8n.\n2. **Designate Folder and Worksheet**: Specify the OneDrive folder for monitoring and the Excel sheet for data updates.\n3. **Configure Sync Frequency and CSV Validation**: Set the monitoring frequency to every minute and ensure the workflow identifies CSV files accurately.\n\nOnce configured, this workflow offers a hands-free, efficient solution to keep your OneDrive and Excel data synchronized effortlessly.",
  "featuredImage": "/data/workflows/2507/2507.webp",
  "author": {
    "id": 101,
    "slug": "louisdl",
    "name": "Louis",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 7587,
  "downloads": 758,
  "createdAt": "2024-10-29T19:41:20.189Z",
  "updatedAt": "2026-01-16T08:25:06.665Z",
  "publishedAt": "2024-10-29T19:41:20.189Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2507"
}