{
  "id": 8720,
  "slug": "8720",
  "title": "Build RAG-powered support agent for Jira issues using Pinecone and OpenAI",
  "description": "## Load Jira open issues with comments into Pinecone + RAG Agent (Direct Tool or MCP)\n\n## Who’s it for  \nThis workflow is designed for support teams, data engineers, and AI developers who want to centralize Jira issue data into a vector database.  \nIt collects open issues and their associated comments, converts them into embeddings, and loads them into Pinecone for semantic search, retrieval-augmented generation (RAG), or AI-powered support bots.  \nIt’s also published as an **MCP tool**, so external applications can query the indexed issues directly.  \n\n## How it works  \nThe workflow automates Jira issue extraction, comment processing, and vector storage in Pinecone. Importantly, the Pinecone index is **recreated at every run** so that it always reflects the current set of unresolved tickets.  \n\n1. **Trigger** – A schedule trigger runs the workflow at defined times (e.g., 8, 11, 14, and 17 on weekdays).  \n2. **Issue extraction with pagination** – Calls the Jira REST API to fetch open issues matching a JQL query (unresolved cases created in the last year).  \n   - Pagination is fully handled: issues are retrieved in batches of 25, and the workflow continues iterating until all open issues are loaded.  \n3. **Data transformation** – Extracts key fields (issue ID, key, summary, description, product, customer, classification, status, registration date).  \n4. **Comments integration** – Fetches all comments for each issue, filters out empty/irrelevant ones (images, dots, empty markdown), and merges them with the issue data.  \n5. **Text cleaning** – Converts HTML descriptions into clean plain text for processing.  \n6. **Embedding generation** – Uses the OpenAI Embeddings node to vectorize text.  \n7. **Vector storage with index recreation** – Loads embeddings and metadata into Pinecone under the `jira` namespace and the `openissues` index. The namespace is cleared at every run to ensure the index contains only unresolved tickets.  \n8. **Document chunking** – Splits long issue texts into smaller chunks (512 tokens, 50 overlap) for better embedding quality.  \n9. **MCP publishing** – Exposes the Pinecone index as an MCP tool (`openissues`), enabling external systems to query Jira issues semantically.\n\n## How to set up  \n1. **Jira** – Configure a Jira account and generate a token. Update the Jira node with credentials and adjust the JQL query if needed.  \n2. **OpenAI** – Set up an OpenAI API key for embeddings. Configure embedding dimensions (default: 512).  \n3. **Pinecone** – Create an index (e.g., `openissues`) with matching dimensions (512). Configure Pinecone API credentials and namespace (`jira`).  \n   - The index will be cleared automatically at every run before reloading unresolved issues.  \n4. **Schedule** – Adjust the cron expression in the Schedule Trigger to fit your update frequency.  \n5. **Optional MCP** – If you want to query Jira issues via MCP, configure the MCP trigger and tool nodes.  \n\n## Requirements  \n- Jira account with API access and permissions to read issues and comments.  \n- OpenAI API key with access to the embedding model.  \n- Pinecone account with an index created (dimensions = 512).  \n- n8n instance with credentials set up for Jira, OpenAI, and Pinecone.  \n\n## How to customize the workflow  \n- **JQL query**: Modify it to control which issues are extracted (e.g., by project, type, or time window).  \n- **Pagination size**: Adjust the `maxResults` parameter (default 25) if you want larger or smaller batches per iteration.  \n- **Metadata fields**: Add or remove fields in the “Extract Relevant Info” code node.  \n- **Chunk size**: Adjust chunk size/overlap in the Document Chunker for different embedding strategies.  \n- **Embedding model**: Switch to a different embedding provider if preferred.  \n- **Vector store**: Replace Pinecone with another supported vector database if needed.  \n- **Downstream use**: Extend with notifications, dashboards, or AI assistants that consume the vector data.\n---------------  \n\n## AI Chatbot for Jira open tickets with SLA insights\n\n### Who’s it for  \nThis workflow is designed for commercial teams, customer support, and service managers who need quick, conversational access to unresolved Jira tickets.  \nIt enables them to check whether a client has open issues, see related details, and understand SLA implications without manually browsing Jira.  \n\n### How it works  \n- **Chat interface** – Provides a web-based chat that team members can use to ask natural language questions such as:  \n  - *“Are there any issues from client ACME?”*  \n  - *“Do we have tickets that have been open for a long time?”*  \n- **AI Agent** – Powered by OpenAI, it interprets questions and queries the Pinecone vector store (`openissues` index, `jira` namespace).  \n- **Memory** – Maintains short-term chat history for more natural conversations.  \n- **Ticket retrieval** – Uses Pinecone embeddings (dimension = 512) to fetch unresolved tickets enriched with metadata:  \n  - Issue key, description, customer, product, severity color, status, AM contract type, and SLA.  \n- **SLA integration** – Service levels (Basic, Advanced, Full Service, with optional Fast Support) are provided via the SLA node. The agent explains which SLA applies based on ticket severity, registration date, and contract type.  \n- **AI response** – Returns a friendly, collaborative summary of all tickets found, including:  \n  - Ticket identifier  \n  - Description  \n  - Customer and product  \n  - Severity level (Red, Yellow, Green, White)  \n  - Ticket status  \n  - Contract level and SLA explanation  \n\n### Setup  \n1. Configure Jira → Pinecone index (`openissues`, 512 dimensions) already populated with unresolved tickets.  \n2. Provide OpenAI API credentials.  \n3. Ensure the SLA node includes the correct service-level definitions.  \n4. Adjust chat branding (title, subtitle, CSS) if desired.  \n\n### Requirements  \n- Jira account with API access.  \n- Pinecone account with an index (`openissues`, dimensions = 512).  \n- OpenAI API key.  \n- n8n instance with LangChain and chatTrigger nodes enabled.  \n\n### How to customize  \n- Change the SLA node text if your service levels differ.  \n- Adjust the chat interface design (colors, title, subtitle).  \n- Expand metadata in Pinecone (e.g., add project type, priority, or assigned team).  \n- Train with additional examples in the system message to refine AI behavior.  \n",
  "featuredImage": "/data/workflows/8720/8720.webp",
  "author": {
    "id": 101,
    "slug": "bruno-menegolli",
    "name": "Br1",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 387,
  "downloads": 38,
  "createdAt": "2025-09-18T12:19:40.727Z",
  "updatedAt": "2026-01-16T08:57:22.878Z",
  "publishedAt": "2025-09-18T12:19:40.727Z",
  "nodes": 30,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8720"
}