{
  "id": 10661,
  "slug": "10661",
  "title": "Create a secure personal AI assistant with OpenAI and Signal Messenger",
  "description": "![image.png](fileId:3290)\n# Overview\n\nThis workflow streamlines the process of setting up a chat-bot using the Signal Messager API.\n\n# What this is for\n\nChat-bot applications have become very popular on Whatsapp and Telegram.  However, security conscious people may be hesitant to connect their AI agents to these applications. Compared to Whatsapp and Telegram, the  Signal messaging app is more secure and end-to-end encrypted by default.  In part because of this, it is more difficult to create a chat-bot application in this app. However, this is still possible to do if you host your own Signal API endpoint. \n\nThis workflow requires the installation of a community-node package.  Some additional setup for the locally hosted Signal API endpoint is also necessary. As such, it will only work with self-hosted instances of n8n.\n\nYou may use any AI model you wish for this chat-bot, and connect different tools and APIs depending on your use-case. \n\n# How to setup\n### Step 1: Setup Rest API\nBefore implementing this workflow, you must setup a local Signal Client Rest API.\n\n- This can be done using a docker container based on this project: [bbernhard/signal-cli-rest-api](https://github.com/bbernhard/signal-cli-rest-api).\n\n```language\nversion: \"3\"\nservices:\n  signal-cli-rest-api:\n    image: bbernhard/signal-cli-rest-api:latest\n    environment:\n      - MODE=normal #supported modes: json-rpc, native, normal\n      #- AUTO_RECEIVE_SCHEDULE=0 22 * * * #enable this parameter on demand (see description below)\n    ports:\n      - \"8080:8080\" #map docker port 8080 to host port 8080.\n    volumes:\n      - \"./signal-cli-config:/home/.local/share/signal-cli\" #map \"signal-cli-config\" folder on host system into docker container. the folder contains the password and cryptographic keys when a new number is registered\n```\n\n- After starting the docker-container, you will be able to interact with a local Signal client over  a Rest API at http://localhost:8080 (by default, this setting can be modified in the docker-compose file).\n\n### Step 2: Install Node Package \n\n- This workflow requires the community-node package developed by [ZBlaZe](https://github.com/ZBlaZe/n8n-nodes-signal): [n8n-nodes-signal-cli-rest-api](https://www.npmjs.com/package/n8n-nodes-signal-cli-rest-api). \n\n![image.png](fileId:3263)\n\n- Navigate to ++your-n8n-server-address/settings/community-nodes++, click the 'Install' button, and paste in the communiy-node package name '++n8n-nodes-signal-cli-rest-api++' to install this community node.\n\n![image.png](fileId:3259)\n\n### Step 3: Register and Verify Account\n- The last step requires a phone-number. You may use your own phone-number, a pre-paid sim card, or (if you are a US resident), a free [Google Voice digital phone-number](https://voice.google.com/u/0/).\n\n![image.png](fileId:3262)\n- An n8n web-form has been created in this workflow to make headless setup easier. In the Form nodes, replace the URL with the address of your local Signal Rest API endpoint.\n![image.png](fileId:3260)\n\n- Open the webform and enter the phone number you are using to register your bot's Signal account\n- Signal needs to verify you are human before registering an account. Visit [this page](https://signalcaptchas.org/registration/generate) to complete the captcha challenge. The right-click the 'Open Signal' button and copy the link address. Paste this into the second form field and hit 'Submit'.\n\n![Screenshot 20251109 174810.png](fileId:3258)\n\n- At this point you should receive a verification token as an SMS message to the phone-number you are using. Copy this and paste it into the second web-form.\n- Your bot's signal account should be setup now. To use this account in n8n, add the Rest-API address and account-number (phone-number) as a new n8n credential.\n\n![image.png](fileId:3264)\n\n\n### Step 4: Optional\n- For extra security it is recommended to restrict communication with this chat-bot. In the 'If' workflow node, enter your own signal account phone-number.\n- You may also provide a UUID. This is an identifier number unique to your mobile device. You can find this by sending a test message to your bot's signal account and copying it from the workflow execution data.\n\n![image.png](fileId:3261)\n\n",
  "featuredImage": "/data/workflows/10661/10661.webp",
  "author": {
    "id": 101,
    "slug": "xopher001",
    "name": "Chris Pryce",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 420,
  "downloads": 42,
  "createdAt": "2025-11-09T16:10:25.765Z",
  "updatedAt": "2026-01-16T09:05:51.511Z",
  "publishedAt": "2025-11-09T16:10:25.765Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10661"
}