{
  "id": 11693,
  "slug": "11693",
  "title": "Scrape LinkedIn profiles into Google Sheets using Google Custom Search",
  "description": "## Who’s it for\nThis template is ideal for recruiters, founders, sales teams, and lead-generation specialists who want to quickly collect LinkedIn profiles based on role, industry, and region. It is perfect for users who want profile lists for outreach, research, hiring, or market analysis without manually searching LinkedIn.\n\n## What it does / How it works\nThis workflow begins with a web form where you enter three inputs: position, industry, and region.  \nOnce the form is submitted, the workflow performs a Google Custom Search query restricted to LinkedIn profile URLs.  \nThe results are processed to extract structured profile information such as:\n\n- Name  \n- Job title (cleaned using custom logic)  \n- LinkedIn profile link  \n- Description / bio snippet  \n- Profile image URL  \n\nThe workflow automatically handles pagination by detecting whether more results are available and continues fetching until the limit is reached.  \nAll extracted profiles are appended or updated in a Google Sheet so you always maintain an organized and deduplicated list.\n\n## Requirements\n- Google Sheets OAuth2 credentials  \n- Google Custom Search API key  \n- Google CSE (Custom Search Engine) ID  \n- A Google Sheet with the required columns (name, title, profile link, description, image link, searched position, searched industry, searched region)\n\n## How to set up\n1. Connect your Google Sheets credentials.  \n2. Add your Custom Search API key and CSE ID inside the HTTP Request node.  \n3. Select your target Google Sheet in the “Append or update row in sheet” node.  \n4. Open the form URL and submit your position, industry, and region.  \n5. Run the workflow to begin scraping profiles.\n\n## How to customize the workflow\n- Modify search query structure for niche industries  \n- Add enrichment tools (Hunter.io, Clearbit, People Data)  \n- Expand pagination limit beyond the default  \n- Add filters to remove non-relevant results  \n- Output data to CRM tools like HubSpot, Notion, Airtable, or Sheets  ",
  "featuredImage": "/data/workflows/11693/11693.webp",
  "author": {
    "id": 101,
    "slug": "pixcelsthemes",
    "name": "Pixcels Themes",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 256,
  "downloads": 25,
  "createdAt": "2025-12-11T10:18:13.506Z",
  "updatedAt": "2026-01-16T09:09:43.541Z",
  "publishedAt": "2025-12-11T10:18:13.506Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11693"
}