{
  "id": 6544,
  "slug": "6544",
  "title": "Forward Chatwoot Messages to WhatsApp via Evolution API with Media Support",
  "description": "## Description\nThis workflow automates forwarding messages received in Chatwoot to WhatsApp using the Evolution API. It provides full support for different types of messages, ensuring rich and seamless communication with the end user.\n\n## What Problem Does This Solve?\nManually forwarding messages from Chatwoot to WhatsApp can be time-consuming and error-prone, especially when handling diverse message types like media files. This subworkflow streamlines the process, automating message delivery while maintaining message fidelity and media compatibility.\n\n## Features\n\n- Support for plain text messages;\n- Support for media messages including images, videos, documents, and audio;\n- Automatic detection of media type based on the content_type field;\n- Automatic processing of incoming messages from Chatwoot via webhook or native integration\n\n## Prerequisites\nBefore using this subworkflow, make sure you have:\n1. Evolution API key and URL;\n2. Incoming messages from Chatwoot via webhook or native integration;\n3. Configured HTTP Request node in n8n\n\n## Suggested Usage\nThis subworkflow should be attached to a main workflow that receives messages from Chatwoot. It is ideal for automated customer service, help desks, or hybrid bots (human + automated), enabling messages originating from Chatwoot to be faithfully redirected to WhatsApp.\n\n\n![image.png](fileId:1895)\n\n",
  "featuredImage": "/data/workflows/6544/6544.webp",
  "author": {
    "id": 101,
    "slug": "thiagovazzoler",
    "name": "Thiago Vazzoler Loureiro",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1242,
  "downloads": 124,
  "createdAt": "2025-07-27T23:30:49.094Z",
  "updatedAt": "2026-01-16T08:45:35.243Z",
  "publishedAt": "2025-07-27T23:30:49.094Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6544"
}