{
  "id": 10072,
  "slug": "10072",
  "title": "Streamline Content Creation with GPT-4o and One-Click Human Review Approvals",
  "description": "## Overview\nAutomate AI content creation from request to approval. While AI writes quickly, human review often delays delivery—and multiple tools create workflow gaps and version confusion. This unified solution streamlines the entire process, enabling teams to produce quality content at scale with transparent tracking.\n\n## How it works\nSubmit a form with your topic, tone, and keywords. GPT-4o generates the content and assigns a quality score (0–100). The reviewer receives an email to approve, edit, or reject the draft—all actions are automatically logged in Google Sheets for tracking and audit purposes.\n\n## Setup steps\n1. Import the workflow JSON file into n8n\n2. Connect your OpenAI and Google account credentials\n3. Update three variables in the workflow: SHEET_ID (your Google Sheets document ID), REVIEWER_EMAIL (recipient for review notifications), and WEBHOOK_URL (for form submissions)\n4. Test the workflow with a sample submission\n\n### Workflow Stages\n1. Submit a form with topic, tone, and keywords.\n2. GPT-4o generates content and assigns a quality score (0–100).\n3. Reviewer receives an email to approve, edit, or reject the draft.\n4. All review actions are automatically logged in Google Sheets with timestamps and approval status.\n\n\n## Requirements\nn8n v1.0+ instance, OpenAI API key with GPT-4o access, and Google Workspace with OAuth2 credentials.\n\n## Custom options\nChoose model: gpt-4o, 4o-mini, or 3.5-turbo. Adjust score weights: Readability 40%, Keywords 30%, Length 30%.\n\n## Key benefits\nGenerate drafts 99% faster and approve content 95% quicker. Centralized tracking ensures clarity and accountability.",
  "featuredImage": "/data/workflows/10072/10072.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 57,
  "downloads": 5,
  "createdAt": "2025-10-23T04:45:46.227Z",
  "updatedAt": "2026-01-16T09:03:16.151Z",
  "publishedAt": "2025-10-23T04:45:46.227Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10072"
}