{
  "id": 9288,
  "slug": "9288",
  "title": "Process telegram image albums with Data Tables Cache and NanoBanana AI",
  "description": "This n8n workflow template simplifies processing of media group messages sent by users in Telegram. It caches image album messages using [Data Tables](https://docs.n8n.io/data/data-tables/), and then sends them to a Nano Banana model for processing.\n\nThis template showcases n8n's new Data Tables feature as a powerful caching layer to process entire image albums from Telegram.\n------------------------------------------------------------------------------------------------------------------------------------------------\n\n### How it works\n\n*   **Media Group handling**: captures all images and the shared caption when user sends an album via Telegram.\n*   **Data Table caching**: stores all incoming messages in a Data Table to prevent data loss and allow for batch processing.\n*   **Scheduled processing**: a timer trigger periodically finds and processes completed image albums from the cache.\n*   **Multi-modal AI**: sends the full set of images and the text prompt to the NanoBanana model via OpenRouter.\n*   **User feedback**: automatically notifies the user when processing begins and when the result is ready.\n\n### How to use\n\n*   Import the workflow template into your n8n instance.\n*   Create a new Data Table with the following columns (all of type String): `chat_id`, `message_id`, `media_group`, `message`, `status`.\n*   Configure your Telegram credentials and connect your bot.\n*   Update the \"prepare user messages\" node with your Telegram bot token to create the image download links.\n*   Set up your OpenRouter credentials.\n*   Activate the workflow. Now you can send a group of images with a caption to your Telegram bot.\n\n### Requirements\n\n*   An n8n instance (cloud or self-hosted) with Data Tables enabled. Minimal n8n version is `1.113`\n*   A Telegram account and a Telegram bot token.\n*   An OpenRouter account with access to the NanoBanana model.\n\nCustomizing this workflow\n-------------------------\n\n*   **Adjust the processing schedule**: modify the **Schedule Trigger** node to change how often the workflow checks for new media groups to process.\n*   **Handle other message types**: The workflow handles only the media groups. You can easily build logic for text messages, documents, or commands by adding nodes instead of the placeholder node (**\"Process other messages as usual\"**).\n*   **Extend the functionality**: add more nodes after the AI generates an image to perform different actions, such as saving the file, sending it to another service, or creating a social media post.",
  "featuredImage": "/data/workflows/9288/9288.webp",
  "author": {
    "id": 101,
    "slug": "eduard",
    "name": "Eduard",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 694,
  "downloads": 69,
  "createdAt": "2025-10-05T21:11:44.823Z",
  "updatedAt": "2026-01-16T08:59:50.799Z",
  "publishedAt": "2025-10-05T21:11:44.823Z",
  "nodes": 35,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9288"
}