{
  "id": 6014,
  "slug": "6014",
  "title": "Create faceless videos with Gemini, ElevenLabs, Leonardo AI & Shotstack",
  "description": "### This n8n template demonstrates walks you through a fully automated process to generate faceless videos - from script creation to final download - using AI-generated voice, images, and smart video editing.\n\nUse cases are many: This tool is perfect for **YouTube and Shorts creators** who want to publish daily content without showing their face, **TikTok and Reels marketers** automating voice-over-driven videos, and **solopreneurs** scaling up their content without hiring a team. It’s also ideal for **agencies** producing batches of faceless video ads, **automation enthusiasts** building smart media workflows in n8n, and anyone who’s rich in ideas but tired of spending hours editing.\n\n## How It Works\n- Phase 1: **Provide Topic Input**\n    - A short topic and idea should be entered into the **Idea** part in Node **Fields - Set Idea** inside the workflow in n8n.\n    - Trigger the process manually by clicking **Test Workflow** or **Execute Workflow**. \n- Phase 2: **Script Generation**\n    - Your idea is passed to **Google Gemini's chat model**. The model returns a concise, 60-second faceless video script. \n    - The script is then reformatted into a structured layout optimized for voice generation and visual synchronization.\n- Phase 3: **Audio Generation**\n    - The formatted script is passed to **ElevenLabs**, which turns the text into a high-quality voiceover audio.\n    - The generated audio is uploaded to **Google Drive** and made publicly accessible.\n    - At the same time, the audio is sent to **OpenAI Whisper** via a POST request to generate a transcription of the voiceover.\n- Phase 4: **Timestamps Generation**\n    - The tool merges the original script and the **OpenAI Whispe**r-generated transcription.\n    - The merged data is passed to **Google Gemini's chat model** to generate image prompts with precise timestamps.\n    - The output is parsed and cleaned using a structured parser to ensure it's in ready-to-use JSON format for image generation.\n- Phase 5: **Images Generation**\n    - The full list of timestamped prompts is is split into individual entries.\n    - Each prompt is sent to **Leonardo's API** that turns text descriptions into visuals.\n    - A delay of 30 seconds is added to give the image generation engine enough time to complete rendering.\n    - Once completed, the workflow retrieves all final images for the next stage.\n- Phase 6: **Images To Video Conversion**\n    - All generated images are sent to **Leonardo's API**, which stitches them together based on the structured prompts and timing.\n    - A 5-minute wait allows time for rendering.\n    - After the wait, the workflow retrieves the generated small videos and makes  them downloadable.\n    - Then, the tool aggregates all downloaded videos into a single unified structure, preparing them for the final editing.\n- Phase 7: **Video Editing and Downloading**\n    - The raw video, along with timestamps or subtitles, is sent to **Shotstack**, a video editing tool that supports advanced edits.\n    - A delay of 1 minute allows **Shotstack** to process the edit.\n    - Then, the tool checks whether the edited video is finished by **Shotstack** and ready to be downloaded.\n    - Once completed, you can download the final polished video to your local storage for later use.\n\n## How To Use\n- Download the workflow package.\n- Import the package into your n8n interface.\n- Set up necessary credentials for tools access and usability:\n    + For Google Gemini access, please connect to its API in the following nodes:\n        Node **Google Gemini Chat Model 1**\n        Node **Google Gemini Chat Model 2**\n    + For Google Drive access, please ensure connection in the following nodes:\n        Node **Upload Audio to Drive**\n        Node **Make Audio File Public**\n    + For ElevenLabs access, please connect to its API in the following node:\n        Node **Generate Voice**\n    + For OpenAI Whisper access, please connect to its API in the following node:\n        Node **Transcribe Audio with OpenAI Whisper**\n    + For Leonardo access, please allow connection to its API in the following nodes:\n        Node **Generate Images**\n        Node **Generate Videos/Scenes**\n    + For Shortstack access, please connect to its API in the following nodes:\n        Node **Edit with Shotstack**\n        Node **Render Final Video with Shotstack**\n- Input your video idea or short description as a string in Node **Fields - Set Idea** in n8n.\n- Run the workflow by clicking **Execute Workflow** or **Test Workflow**.\n- Wait the process to run and finish.\n- View the result in Node **Download Final Video** and download it in your local storage for later use.\n\n## Requirements\n- Basic setup in **Google Cloud Console** (OAuth or API Key method enabled) with enabled access to Google Drive.\n- **Google Gemini API** access with permission to use chat-based large language models.\n- **ElevenLabs API** access for generating high-quality voiceovers from scripts.\n- **OpenAI Whisper API** access to transcribe voiceovers into clean text.\n- **Leonardo API** access for both image and video generation tasks.\n- **Shotstack API** access for editing and rendering the final video with enhanced visuals and timing.\n\n## How To Customize\n- You can input your requested video topic or description directly in Node **Fields – Set Idea**.\n- By default, the script length is set to around 60 seconds in Node **60 Second Script Writer**. You can easily change this in the prompt to create shorter or longer videos based on your needs.\n- While the default setup uses **Google Gemini** for script and prompt generation, you can replace it with **OpenAI ChatGPT**, **Claude**, or any other compatible chat-based model you prefer.\n- The voiceover is currently created using **ElevenLabs**, but you’re free to substitute it with other text-to-speech engines like **Google Cloud Text-to-Speech**, **HeyGen**, etc.\n- We're using **OpenAI Whisper** to transcribe the voiceover into text. You can switch to alternatives such as **AssemblyAI**, **Deepgram**, or other compatible providers depending on your preference.\n- This workflow uses **Leonardo** for both image and video generation. You can swap it out for other compatible providers based on availability or style preference.\n- Video editing is handled by **Shotstack** by default. You can plug in alternatives like **Runway**, **FFmpeg**, or other API-based editors depending on your editing needs or desired effects.\n\n\nIf you’d like this workflow customized to fit your tools and platforms availability, or if you’re looking to build a tailored AI Agent for your own business - please feel free to reach out to [**Agent Circle**](https://www.agentcircle.ai/). We’re always here to support and help you to bring automation ideas to life.\n\n## Need Help?\nJoin our community on different platforms for support, inspiration and tips from others.\n\nWebsite: https://www.agentcircle.ai/\nEtsy: https://www.etsy.com/shop/AgentCircle\nGumroad: http://agentcircle.gumroad.com/\nDiscord Global: https://discord.gg/d8SkCzKwnP\nFB Page Global: https://www.facebook.com/agentcircle/\nFB Group Global: https://www.facebook.com/groups/aiagentcircle/\nX: https://x.com/agent_circle\nYouTube: https://www.youtube.com/@agentcircle\nLinkedIn: https://www.linkedin.com/company/agentcircle",
  "featuredImage": "/data/workflows/6014/6014.webp",
  "author": {
    "id": 101,
    "slug": "agentcircle",
    "name": "Agent Circle",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 7326,
  "downloads": 732,
  "createdAt": "2025-07-15T04:04:27.728Z",
  "updatedAt": "2026-01-16T08:42:40.561Z",
  "publishedAt": "2025-07-15T04:04:27.728Z",
  "nodes": 37,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6014"
}