{
  "id": 10757,
  "slug": "10757",
  "title": "Qualify and route sales leads with Mistral-Saba AI and MCDM scoring",
  "description": "## How It Works\nThe workflow starts with a scheduled trigger that activates at set intervals. Behavioral data from multiple sources is parsed and sent to the MCDN routing engine, which intelligently assigns leads to the right teams based on predefined rules. AI-powered scoring evaluates each prospect’s potential, ensuring high-quality leads are prioritized. The results are synced to the CRM, and updates are reflected on an analytics dashboard for real-time visibility.\n\n## Setup Steps\n1. **Trigger:** Define schedule frequency.\n2. **Data Fetch:** Configure APIs for all behavioral data sources.\n3. **MCDN Router:** Set routing rules, thresholds, and team assignments.\n4. **AI Models:** Connect OpenAI/NVIDIA APIs and configure scoring prompts.\n5. **CRM Integration:** Enter credentials for Salesforce, HubSpot, or other CRMs.\n6. **Dashboard:** Link to analytics tools like Tableau or Google Sheets for reporting.\n\n## Prerequisites\nAPI credentials: NVIDIA AI, OpenAI, CRM platform; data sources; spreadsheet/analytics access\n\n## Use Cases\nLead prioritization for sales teams; customer segmentation; automated routing; \n\n## Customization\nAdjust routing rules, add custom scoring models, modify team assignments, expand data sources, integrate additional AI providers\n\n## Benefits\nReduces manual lead routing 90%; improves scoring accuracy; accelerates sales cycle; enables data-driven team assignments;  \n",
  "featuredImage": "/data/workflows/10757/10757.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 11,
  "downloads": 1,
  "createdAt": "2025-11-12T14:17:38.862Z",
  "updatedAt": "2026-01-16T09:06:10.417Z",
  "publishedAt": "2025-11-12T14:17:38.862Z",
  "nodes": 33,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10757"
}