{
  "id": 12642,
  "slug": "12642",
  "title": "Extract ICP-targeted LinkedIn leads from post comments using Apify",
  "description": "This workflow automates the process of extracting and qualifying leads from LinkedIn post comments based on your Ideal Customer Profile (ICP) criteria. It turns LinkedIn engagement into a structured, downloadable list of qualified leads—without manual review.\n\n---\n\n## Who’s this for\n\n* Sales and business development teams generating outbound lead lists\n* Marketing teams running LinkedIn engagement campaigns\n* Recruiters sourcing candidates with specific job titles\n* Operators who want to convert LinkedIn comments into actionable data\n\n---\n\n## What problem does this solve\n\nManually reviewing LinkedIn post comments to identify relevant prospects is slow, repetitive, and error-prone. This workflow automates the entire process—from scraping comments to enriching profiles and filtering by ICP—saving hours of manual work and ensuring consistent results.\n\n---\n\n## What this workflow does\n\n1. Collects a LinkedIn post URL and ICP criteria via a form\n2. Scrapes post comments using Apify (supports up to 1,000 comments)\n3. Deduplicates commenters and enriches profiles with LinkedIn data\n4. Filters profiles by selected job titles and countries\n5. Exports matched leads as a downloadable CSV file\n\n---\n\n## How to set up\n\n1. Create an Apify account and generate an API key\n2. Add your Apify credentials in n8n (**Settings → Credentials → Apify API**)\n3. Execute the workflow and submit a LinkedIn post URL and ICP criteria\n\n---\n\n## Requirements\n\n* Apify account with API access - Apify offers a free tier with $5 in monthly credits, which is enough to test this workflow on smaller LinkedIn posts\n\n---\n\n## How to customize the workflow\n\n* Update job titles and target countries in the Form Trigger\n* Increase pagination limits to support larger posts\n* Replace CSV export with a CRM, Google Sheets, or database integration\n",
  "featuredImage": "/data/workflows/12642/12642.webp",
  "author": {
    "id": 101,
    "slug": "kidlat",
    "name": "Kidlat",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 58,
  "downloads": 5,
  "createdAt": "2026-01-11T18:21:22.885Z",
  "updatedAt": "2026-01-16T09:12:51.118Z",
  "publishedAt": "2026-01-11T18:21:22.885Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12642"
}