{
  "id": 7637,
  "slug": "7637",
  "title": "Generate Job-Specific ATS Resumes with Perplexity AI and PDF Export",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\n# ATS Resume Maker Workflow Explanation\n\n## Aim\nThe **aim** of the *ATS Resume Maker according to JD* workflow is to automate the creation of an **ATS-friendly resume** by tailoring a candidate’s resume to a specific job description (JD). It streamlines the process of aligning resume content with JD requirements, producing a professional, scannable PDF resume that can be stored in Google Drive.\n\n## Goal\nThe **goal** is to:\n- Allow users to input their resume (text or PDF) and a JD (PDF) via a web form.\n- Extract and merge the text from both inputs.\n- Use AI to customize the resume, prioritizing JD keywords while maintaining the candidate’s truthful information.\n- Generate a clean, ATS-optimized HTML resume and convert it to a downloadable PDF.\n- Upload the final PDF to Google Drive for easy access.\n\nThis ensures the resume is optimized for **Applicant Tracking Systems (ATS)**, which are used by employers to screen resumes, by incorporating relevant keywords and maintaining a simple, scannable format.\n\n## Requirements\nThe workflow relies on specific components and configurations:\n- **n8n Platform**: The automation tool hosting the workflow.\n- **Node Requirements**:\n  1. **Form Trigger**: A web form to collect user inputs (resume text/PDF, JD PDF).\n  2. **Process one binary file1**: JavaScript to rename and organize PDF inputs.\n  3. **Extracting resume1**: Extracts text from PDF files.\n  4. **Merge Resume + JD1**: Combines resume and JD text into a single string.\n  5. **Customize resume1**: Uses Perplexity AI to generate an ATS-friendly HTML resume.\n  6. **HTML format1**: Cleans the HTML output by removing newlines.\n  7. **HTML3**: Processes HTML for potential display or validation.\n  8. **HTML to PDF**: Converts the HTML resume to a PDF file.\n  9. **Upload file**: Saves the PDF to a specified Google Drive folder.\n- **Credentials**:\n  - *CustomJS account* for the HTML-to-PDF conversion API.\n  - *Google Drive account* for file uploads.\n  - *Perplexity account* for AI-driven resume customization.\n- **Input Requirements**:\n  - Resume (plain text or PDF).\n  - Job description (PDF).\n- **Output**: A tailored, ATS-friendly resume in PDF format, uploaded to Google Drive.\n\n## API Usage\nThe workflow integrates multiple APIs to achieve its functionality:\n- **Perplexity API**: Used in the *Customize resume1* node to leverage the *sonar-reasoning* model for generating an ATS-optimized HTML resume. The API processes the merged resume and JD text, aligning content with JD keywords while adhering to strict HTML and CSS guidelines (e.g., Arial font, no colors, single-column layout). [Ref: Workflow JSON]\n- **CustomJS API**: Used in the *HTML to PDF* node to convert the cleaned HTML resume into a PDF file. This API ensures the resume is transformed into a downloadable format suitable for ATS systems. [Ref: Workflow JSON]\n- **Google Drive API**: Used in the *Upload file* node to store the final PDF in a designated Google Drive folder (*Resume* folder in *My Drive*). This API handles secure file uploads using OAuth2 authentication. [Ref: Workflow JSON]\n\nThese APIs are critical for AI-driven customization, PDF generation, and cloud storage, ensuring a seamless end-to-end process.\n\n## HTML to PDF Conversion\nThe HTML-to-PDF conversion is a key step in the workflow, handled by the **HTML to PDF** node:\n- **Process**: The node takes the cleaned HTML resume (`$json.cleanedResponse`) from the *HTML format1* node and uses the `@custom-js/n8n-nodes-pdf-toolkit.html2Pdf` node to convert it into a PDF.\n- **API**: Relies on the *CustomJS API* for high-fidelity conversion, ensuring the PDF retains the ATS-friendly structure (e.g., no graphics, clear text hierarchy).\n- **Output**: A binary PDF file passed to the *Upload file* node.\n- **Relevance**: This step ensures the resume is in a widely accessible format, suitable for downloading or sharing with employers. The use of a dedicated API aligns with industry practices for HTML-to-PDF conversion, as seen in services like PDFmyURL or PDFCrowd, which offer similar REST API capabilities for converting HTML to PDF with customizable layouts. [Ref:,][](https://pdfmyurl.com/)[](https://pdfcrowd.com/api/html-to-pdf-api/)\n\n## Download from Community Link\nThe workflow does not explicitly include a community link for downloading the final PDF, but the **Upload file** node stores the PDF in Google Drive, making it accessible via a shared folder or link. To enable direct downloads:\n\n## Workflow Summary\nThe *ATS Resume Maker according to JD* workflow automates the creation of a tailored, ATS-friendly resume by:\n1. Collecting user inputs via a web form (*Form Trigger*).\n2. Processing and extracting text from PDFs (*Process one binary file1*, *Extracting resume1*).\n3. Merging and customizing the content using *Perplexity AI* (*Merge Resume + JD1*, *Customize resume1*).\n4. Formatting and converting the resume to PDF (*HTML format1*, *HTML3*, *HTML to PDF*).\n5. Uploading the PDF to Google Drive (*Upload file*).\n\nThe workflow leverages APIs for AI processing, PDF conversion, and cloud storage, ensuring a professional output optimized for ATS systems. Community sharing can be enabled via Google Drive links or external platforms, as discussed in related web resources. [Ref:,,][](https://pdfmyurl.com/)[](https://www.servicenow.com/community/servicenow-ai-platform-forum/allow-user-to-download-a-pdf-file-on-click-of-a-button/td-p/1082457)\n\n*Timestamp*: 02:54 PM IST, Wednesday, August 20, 2025",
  "featuredImage": "/data/workflows/7637/7637.webp",
  "author": {
    "id": 101,
    "slug": "theyashsisodiya",
    "name": "Yashraj singh sisodiya",
    "avatar": ""
  },
  "categories": [
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1255,
  "downloads": 125,
  "createdAt": "2025-08-20T09:27:21.366Z",
  "updatedAt": "2026-01-16T08:51:31.334Z",
  "publishedAt": "2025-08-20T09:27:21.366Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7637"
}