{
  "id": 8427,
  "slug": "8427",
  "title": "Automated range trading with Uniswap V3, Telegram alerts & MetaMask delegation",
  "description": "![image.png](fileId:2341)\n\n# Simple Range Trading w/ Uniswap V3\n\nThis workflow will monitor the price of a token trading pair (default is ETH - USDC) and automatically buy into ETH or sell into USDC based on a price window configured by the user. \n\nAdditionally, the workflow will notify the user on Telegram before a trade is executed, giving the user 1 minute to cancel the trade before the workflow proceeds. \n\nTransaction are executed via MetaMask's Delegation Framework, so trades are fully non-custodial, you retain full control of your assets at all times. \n\nCheck out the [YouTube tutorial](https://docs.1shotapi.com) for a full walkthrough.\n\n## Maintain Complete Trading Control with MetaMask Delegations\n\nWith the [MetaMask Delegation Framework](https://metamask.io/developer/delegation-toolkit), you never relinquish control of your funds to any 3rd party, not even 1Shot API. Furthermore, with this workflow, you have full control of your trading parameters and the assets you trade against. Lastly, by running your own trading setup, you can bypass fees incurred through centralized exchanges or hosted frontends that reduce your profitability. \n\n## Human-in-the-Loop with Telegram Notifiactions\n\nThis workflow uses Telegram to send you real-time updates on whats happening with your trades. Specifically, the Telegram human-in-the-loop node is used to give you a change to cancel trades before they happen or immediately approve them. \n\n## Setup\n\n1. Create a free [1Shot API](https://1shotapi.com) account, and create an API key.\n2. Import the workflow into your n8n portal.\n3. Create a credential for the 1Shot API nodes to communicate with your 1Shot API account.\n4. Trigger the sub-workflow to generate an Arbitrum server wallet and import all required smart contract methods. \n5. Point the 1Shot API nodes at the appropriate smart contract methods in you 1Shot API account.\n6. Create a Telegram credential for notifications & input the chatID of your Telegram bot.\n7. Set your desired trading price range in the Swap Configs node.\n8. Start your trading workflow.",
  "featuredImage": "/data/workflows/8427/8427.webp",
  "author": {
    "id": 101,
    "slug": "oneshotapi",
    "name": "1Shot API",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 802,
  "downloads": 80,
  "createdAt": "2025-09-09T18:08:54.617Z",
  "updatedAt": "2026-01-16T08:55:45.215Z",
  "publishedAt": "2025-09-09T18:08:54.617Z",
  "nodes": 42,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8427"
}