{
  "id": 11838,
  "slug": "11838",
  "title": "Slack workflow router: AI-powered workflow selection",
  "description": "### Slack Workflow Router: AI-Powered Workflow Selection\n\n#### Problem Statement\nSlack only allows one webhook per Slack app, and n8n generates a unique webhook for each workflow. This limitation means you typically need to create multiple Slack apps to trigger multiple n8n workflows from Slack. This workflow solves that problem by acting as a gateway for a single Slack app, enabling it to trigger multiple n8n workflows.\n\n#### How It Works\nWhen a message is received from Slack, an AI agent analyzes the message and selects the most suitable workflow to execute. The available workflows are stored in a data table, including their ID, name, and description, which the agent uses to make its decision. This approach allows you to manage and trigger multiple workflows from a single Slack app, making your Slack-to-n8n integration much more scalable and maintainable.\n\n#### Key Features\n* Trigger multiple n8n workflows from a single Slack app mention.\n* AI-powered workflow selection based on user message and workflow descriptions.\n* Centralized management of available workflows via a data table.\n* Scalable and easy to maintain—no need to create multiple Slack apps.\n\n#### Setup Instructions\n* Create a data table in your n8n project with these columns: workflow_id, workflow_name, and workflow_description.\n* Add your workflows to the table.\n* Connect your Slack and OpenAI accounts.\n* Deploy the workflow and mention your Slack app to trigger automations.\n\n\nThis template is ideal for teams who want to centralize and scale their Slack automation without creating multiple Slack apps.",
  "featuredImage": "/data/workflows/11838/11838.webp",
  "author": {
    "id": 101,
    "slug": "ertay",
    "name": "Ertay Kaya",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 46,
  "downloads": 4,
  "createdAt": "2025-12-15T23:08:47.567Z",
  "updatedAt": "2026-01-16T09:10:18.139Z",
  "publishedAt": "2025-12-15T23:08:47.567Z",
  "nodes": 16,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11838"
}