{
  "id": 12157,
  "slug": "12157",
  "title": "Automate job applicant screening with GPT-4, Gmail & Google Sheets",
  "description": "This workflow automates the initial screening process for new job applications, freeing up your recruitment team to focus on qualified candidates. It receives applications from a webhook, uses OpenAI (GPT-4) to analyze resumes for skill and culture fit, generates interview questions, logs the results to Google Sheets, sends interview invitations via Gmail, and notifies your team on Slack.\n\n\n## 🚀 Who is this for?\n- **HR and Recruitment Teams** looking to automate repetitive screening tasks.\n- **Hiring Managers** who want a consistent, data-driven first pass on applicants.\n- **Startups and SMBs** aiming to build an efficient, scalable hiring pipeline without a large HR team.\n\n\n## 💡 How it works\n1.  **Receive Application**: The workflow triggers when a new application is submitted via a webhook from your job board or application form.\n2.  **Extract & Analyze**: It downloads the resume/CV, extracts the text, and sends it to **OpenAI (GPT-4)** with a custom prompt.\n3.  **Score & Generate**: The AI scores the candidate on skill match and culture fit, provides a summary, and generates tailored interview questions based on their experience.\n4.  **Log Data**: The evaluation scores, AI summary, and candidate information are appended to a new row in a **Google Sheet** for tracking.\n5.  **Schedule Interview**: A personalized email is sent to the candidate via **Gmail** with a link to schedule their interview.\n6.  **Notify Team**: A summary card with the AI evaluation and links to the full report is posted in a **Slack** channel to keep the hiring team informed.\n\n\n## ⚙️ How to set up\n1.  **Configure Credentials**: Set up your credentials for OpenAI, Google (for both Sheets and Gmail), and Slack in n8n.\n2.  **Webhook URL**: Copy the \"Production URL\" from the \"Webhook: New Application\" node and set it as the destination in your job board's webhook settings (e.g., Greenhouse, Lever, Ashby, or a web form).\n3.  **Google Sheet**: Create a Google Sheet to track applicants. Update the \"G Sheets: Save Evaluation\" node with your Spreadsheet ID and Sheet Name. Ensure the columns in your sheet match the data you want to save.\n4.  **Customize Prompts & Email**:\n    -   Modify the prompts in the two **OpenAI** nodes to match your company's values and the specific job requirements.\n    -   Update the **Gmail** node with your email content and the logic for your scheduling link (e.g., Calendly, SavvyCal).\n\n\n## 📋 Requirements\n- An n8n instance (Cloud or self-hosted).\n- An **OpenAI API** key.\n- A **Google** account for Google Sheets and Gmail.\n- A **Slack** workspace.\n- A job application source capable of sending webhooks.",
  "featuredImage": "/data/workflows/12157/12157.webp",
  "author": {
    "id": 101,
    "slug": "riorio",
    "name": "sato rio",
    "avatar": ""
  },
  "categories": [
    "HR",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 37,
  "downloads": 3,
  "createdAt": "2025-12-26T08:54:33.073Z",
  "updatedAt": "2026-01-16T09:11:35.854Z",
  "publishedAt": "2025-12-26T08:54:33.073Z",
  "nodes": 23,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12157"
}