{
  "id": 10750,
  "slug": "10750",
  "title": "Automate blog-to-social media with GPT-4 for LinkedIn, X, and Reddit",
  "description": "\nTurn your blog into a set-and-forget content engine: every new article is instantly repurposed into channel-specific social posts with visuals, keeping your brand visible on LinkedIn, X, and Reddit without extra copywriting time. Perfect for lean marketing teams who want consistent, always-on distribution from a single source of content.\n\n# How it works\n• Watches your blog RSS feed (or receives a single URL) and detects new articles.\n• Saves each post in Postgres so every article is only processed once.\n• Fetches the article HTML, extracts the main body content and sends it to OpenAI (GPT-4.1).\n• OpenAI creates platform-optimized copy: 1 LinkedIn post, 1 X/Twitter post, 1 Reddit post + image prompts.\n• Generates on-brand images with OpenAI and publishes everything automatically to LinkedIn, X, and Reddit.\n• You can also trigger it manually or via webhook whenever you want to push a specific campaign.\n\n![image1.png](fileId:3287)\n![image2.png](fileId:3288)\n\n\n# Setup Steps\n• Time: around 20–40 minutes for someone familiar with n8n and the platforms.\n• Create a Postgres table “rss_items” with fields: guid (PRIMARY KEY), title, link, published_at.\n• Add credentials in n8n for:\n  – Postgres\n  – OpenAI\n  – LinkedIn OAuth2\n  – X/Twitter OAuth2 + OAuth1 (for media upload)\n  – Reddit OAuth2\n• In the RSS node, set your blog feed URL (for example: https://yourblog.com/feed).\n• In the webhook node, confirm the URL/path you want external tools or other workflows to call with a “link” field.\n• Run the manual trigger with one test blog URL to verify:\n  – Article content is extracted correctly.\n  – AI returns LinkedIn/X/Reddit posts and image prompts.\n  – Posts and images appear correctly on all social accounts.\n• Once tests look good, enable the Schedule Trigger so Blog2Social AI runs automatically at your chosen interval.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "featuredImage": "/data/workflows/10750/10750.webp",
  "author": {
    "id": 101,
    "slug": "leeseifer",
    "name": "Le Nguyen",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 279,
  "downloads": 27,
  "createdAt": "2025-11-12T09:24:53.723Z",
  "updatedAt": "2026-01-16T09:06:08.727Z",
  "publishedAt": "2025-11-12T09:24:53.723Z",
  "nodes": 51,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10750"
}