{
  "id": 9419,
  "slug": "9419",
  "title": "Automated lead qualification for JotForm with Google Gemini & Telegram alerts",
  "description": "## Smart Lead Qualification for JotForm Contact Forms\n\nAutomatically classify and manage contact form submissions using AI-powered lead scoring. This workflow analyzes JotForm submissions in real-time, categorizes them as hot leads, cold leads, or spam, and takes intelligent actions—sending Telegram notifications for hot leads, ignoring irrelevant inquiries, and automatically deleting spam.\n\n## Who's It For\n\nThis template is perfect for:\n- **Businesses receiving high volumes of contact form submissions** who need to prioritize responses\n- **Marketing and sales teams** wanting to focus on qualified leads immediately\n- **Agencies and consultants** offering AI/automation services who want to filter out noise\n- **Anyone struggling with spam** or low-quality form submissions\n\n## What It Does\n\nThe workflow uses Google Gemini AI to intelligently classify each JotForm submission into three categories:\n\n- **Hot Lead (1)**: Genuine inquiries about your services, collaboration requests, or project proposals → Sends Telegram notification + Flags in JotForm\n- **Cold Lead (0)**: Legitimate but irrelevant inquiries (job applications, unrelated business queries) → No action taken\n- **Garbage/Spam (2)**: Test submissions, bots, gibberish, or fake data → Automatically deleted from JotForm\n\n## How It Works\n\n1. JotForm trigger captures new contact form submissions\n2. Submission data is extracted and formatted\n3. Google Gemini AI analyzes the content and classifies the lead\n4. A switch routes the submission based on classification:\n   - Hot leads trigger Telegram notifications and get flagged\n   - Cold leads are ignored\n   - Spam submissions are automatically deleted\n\n## Requirements\n\n- **n8n instance** (cloud or self-hosted)\n- **JotForm account** with a contact form ([Get JotForm here](https://www.jotform.com/?partner=roshanramanidev))\n- **Google Gemini API key** (free tier available)\n- **Telegram account** for notifications\n\n## How to Set Up\n\n**📋 Detailed setup instructions are included inside the workflow in sticky notes.**\n\nQuick setup overview:\n1. Create your contact form in JotForm using the \"Contact Form with Fancy Header and Footer\" template\n2. Get your JotForm API key and form ID\n3. Obtain a Google Gemini API key from Google AI Studio\n4. Create a Telegram bot via @BotFather and get your chat ID\n5. Configure all credentials in the respective nodes\n6. Update the HTTP request nodes with your JotForm API key\n7. Test the workflow with sample submissions\n\nThe workflow includes comprehensive sticky notes with step-by-step instructions, including how to get your Telegram chat ID and configure all integrations.\n\n## How to Customize\n\n- **Adjust classification criteria**: Modify the AI Agent's system prompt to match your business type and lead qualification criteria\n- **Change notification format**: Edit the Telegram message template to include/exclude specific fields\n- **Add more actions**: Extend hot lead handling with additional nodes (e.g., add to CRM, send email, create task)\n- **Modify form fields**: Update field references if your JotForm uses different field names\n- **Multi-channel notifications**: Add Slack, Discord, or email notifications alongside Telegram\n\n## Note\n\nAll API keys and credentials shown in the workflow are placeholders. You'll need to replace them with your own credentials during setup.\n\n",
  "featuredImage": "/data/workflows/9419/9419.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 19,
  "downloads": 1,
  "createdAt": "2025-10-09T15:09:15.158Z",
  "updatedAt": "2026-01-16T09:00:26.549Z",
  "publishedAt": "2025-10-09T15:09:15.158Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9419"
}