{
  "id": 6003,
  "slug": "6003",
  "title": "Build a multi-modal Telegram AI assistant with Gemini, voice & image generation",
  "description": "## How it works\n\nThis workflow creates a multi-talented AI assistant named Simran that interacts with users via Telegram. It can handle text and voice messages, understand the user's intent, and perform various tasks.\nStep 1: Receive & Transcribe Input\nThe workflow triggers on any new Telegram message. If it's a voice message, it uses AssemblyAI to transcribe it into text; otherwise, it processes the incoming text directly.\nStep 2: Understand User Intent\nUsing a Large Language Model (LLM), the workflow analyzes the user's message to determine their goal, categorizing it as a general chat, a request to generate an image, a command to set a reminder, or a request to remember a specific piece of information.\nStep 3: Fetch Context & Route\nThe assistant retrieves past conversation summaries from a MongoDB database to maintain context. Based on the user's intent, the workflow routes the task to the appropriate path.\nStep 4: Execute the Task\nChat: Generates a response using an AI agent whose personality can be toggled between a standard assistant and a \"Girlfriend Mode.\" It also analyzes the user's mood to tailor the response.\nGenerate Image: Creates a detailed prompt and uses an image generation API to create and send a picture.\nSet Reminder: Parses the natural language request, creates an event in Google Calendar and a task in Google Tasks, and sends a confirmation.\nRemember Info: Saves specific user-provided information to a dedicated memory collection in MongoDB.\nStep 5: Respond and Save Memory\nThe final output (text, voice message, or image) is sent back to the user on Telegram. The workflow then summarizes the interaction and saves it to the database to ensure continuity in future conversations.\n## Set up steps\nEstimated Set up time: 20 - 30 minutes.\n1. Configure Credentials: You will need to add credentials for several services in your n8n instance:\nTelegram (Bot API Token)\nAssemblyAI (API Key)\nMongoDB\nGoogle (for Calendar, Tasks, Sheets, and Natural Language API)\nA Large Language Model (the workflow uses Google Gemini but can be adapted)\nAn image generation service (the workflow uses the Together.xyz API)\n2. Set up External Services:\nEnsure your MongoDB instance has two collections: user_memory and memory_auto.\nCreate a Google Sheet to manage the \"Girlfriend Mode\" status for different users.\nEnsure edge-tts is installed on the machine running your n8n instance for the text-to-speech functionality.\n3. Customize Nodes:\nReview the nodes with hardcoded IDs, such as Google Tasks and Google Sheets, and update them with your specific Task List ID and Sheet ID.\nThe sticky notes inside the workflow provide more detailed instructions for specific nodes and segments.",
  "featuredImage": "/data/workflows/6003/6003.webp",
  "author": {
    "id": 101,
    "slug": "netwithjc",
    "name": "Iniyavan JC",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2537,
  "downloads": 253,
  "createdAt": "2025-07-14T16:38:50.640Z",
  "updatedAt": "2026-01-16T08:42:38.407Z",
  "publishedAt": "2025-07-14T16:38:50.640Z",
  "nodes": 95,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6003"
}