{
  "id": 11429,
  "slug": "11429",
  "title": "Automate client onboarding across Google Drive, Slack, Notion & Gmail with GPT-4o-mini",
  "description": "Who is this for?\nThis template is perfect for agencies, consultancies, freelancers, and project-based teams who want to eliminate repetitive onboarding tasks. If you're tired of manually creating folders, Slack channels, and project pages every time a new client signs a contract, this automation will save you hours.\nWhat this workflow does\nWhen a new contract PDF is uploaded to a designated Google Drive folder, this workflow automatically:\n\nParses the filename to extract client name, project name, and contact email\nCreates a project folder structure in Google Drive with organized subfolders\nCreates a dedicated Slack channel for project communication\nSets up a Notion project page with initial kickoff tasks\nLogs project details to a master Google Sheet for tracking\nDrafts a personalized welcome email using OpenAI GPT-4o-mini\nNotifies your team on Slack with all relevant links when complete\n\nSetup steps\nTime required: ~15 minutes\n\nConfigure OAuth credentials for Google Drive, Gmail, Google Sheets, Slack, and Notion\nAdd your OpenAI API key for AI-powered email drafting\nUpdate the \"Set Config Variables\" node with your specific IDs:\n\nGoogle Drive parent folder ID\nNotion database ID\nGoogle Sheet ID\nSlack notification channel ID\n\n\nSet up the trigger folder in Google Drive where contracts will be uploaded\nPrepare your Google Sheet with columns: Client, Project Code, Notion Link, Slack Channel, Drive Folder\n\nRequirements\n\nGoogle Workspace account (Drive, Gmail, Sheets)\nSlack workspace with bot permissions to create channels\nNotion workspace with API integration\nOpenAI API key\n\nFile naming convention\nUpload PDF files using this format:\nClientName_ProjectName_email@example.com.pdf\nExample: AcmeCorp_WebsiteRedesign_john@acme.com.pdf\nHow to customize\n\nAdd more subfolders: Duplicate the \"Create Deliverables Subfolder\" node\nCustomize the email prompt: Edit the \"AI Draft Welcome Email\" node\nAdd more Notion properties: Extend the \"Create Notion Project Page\" node\nChange notification format: Modify the \"Notify Team on Slack\" message",
  "featuredImage": "/data/workflows/11429/11429.webp",
  "author": {
    "id": 101,
    "slug": "masa0258",
    "name": "長谷　真宏",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 147,
  "downloads": 14,
  "createdAt": "2025-12-02T11:51:08.672Z",
  "updatedAt": "2026-01-16T09:08:39.575Z",
  "publishedAt": "2025-12-02T11:51:08.672Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11429"
}