{
  "id": 10734,
  "slug": "10734",
  "title": "Validate newsletter quality with GPT-5 quality gate before sending",
  "description": "## Newsletter Quality Assurance with LLM Judge\n\nThis sub-workflow validates newsletter quality before sending to customers. It's triggered by the main newsletter workflow and acts as an automated quality gate to catch data issues, broken layouts, or missing content.\n\n## Who's it for\n\nE-commerce teams who want to automate newsletter quality checks and prevent broken or incomplete emails from reaching customers. Perfect for ensuring consistent brand quality without manual review.\n\n## How it works\n\n1. **Receives newsletter HTML** - Triggered by parent workflow with the generated newsletter content\n2. **Sends to test inbox** - Delivers newsletter to LLM Judge's Gmail inbox to validate actual rendering\n3. **Retrieves rendered email** - Fetches the email back from Gmail to analyze how it actually renders (catches Gmail-specific issues)\n4. **AI-powered validation** - GPT-5 analyzes the newsletter against quality criteria:\n   - Verifies all 6 product cards have images, prices, and descriptions\n   - Checks layout integrity and date range formatting\n   - Detects broken images or unprocessed template variables\n   - Validates sale prices are lower than original prices\n5. **Decision gate** - Based on Judge's verdict:\n   - **PASS**: Returns approval to parent workflow → sends to customers\n   - **BLOCK**: Alerts admin via email → requires human review\n\n## Set up steps\n\n**Setup time: ~5 minutes**\n\n1. Connect your **Gmail account** for sending test emails\n2. Update the **Judge's email address** in \"Send newsletter to LLM Judge\" node\n3. Update the **admin alert email** in error handling nodes\n4. Connect your **OpenAI API** credentials (GPT-5 recommended for heavy HTML processing)\n5. (Optional) Adjust quality thresholds in the Judge's system prompt\n\n## Requirements\n\n- Gmail account for test sends and retrieving rendered emails\n- OpenAI API key (GPT-5 recommended)\n- Parent workflow that passes newsletter HTML content\n\n## How to customize\n\n- **Adjust validation strictness**: Modify the Judge's system prompt to change what triggers BLOCK vs PASS\n- **Change product count**: Update prompt if your newsletters have different numbers of products\n- **Add custom checks**: Extend the system prompt with brand-specific validation rules\n- **Modify alert recipients**: Update email addresses in error handling nodes\n\n💡 **Pro tip**: The workflow validates the actual Gmail-rendered version to catch image loading issues and ensure consistent customer experience.",
  "featuredImage": "/data/workflows/10734/10734.webp",
  "author": {
    "id": 101,
    "slug": "emirbelkahia",
    "name": "Emir Belkahia",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 56,
  "downloads": 5,
  "createdAt": "2025-11-11T18:24:46.453Z",
  "updatedAt": "2026-01-16T09:06:04.711Z",
  "publishedAt": "2025-11-11T18:24:46.453Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10734"
}