{
  "id": 2271,
  "slug": "2271",
  "title": "Gmail AI Auto-Responder: Create Draft Replies to incoming emails",
  "description": "This workflow automatically generates draft replies in Gmail.\nIt's designed for anyone who manages a high volume of emails or often face writer's block when crafting responses.\nSince it doesn't send the generated message directly, you're still in charge of editing and approving emails before they go out.\n\n## How It Works:\n- Email Trigger: activates when new emails reach the Gmail inbox\n- Assessment: uses OpenAI gpt-4o and a JSON parser to determine if a response is necessary.\n- Reply Generation: crafts a reply with OpenAI GPT-4 Turbo\n- Draft Integration: after converting the text to html, it places the draft into the Gmail thread as a reply to the first message\n\n## Set Up Overview (~10 minutes):\n- OAuth Configuration ([follow n8n instructions here](https://docs.n8n.io/integrations/builtin/credentials/google/oauth-single-service/)):\n  - Setup Google OAuth in Google Cloud console. Make sure to add Gmail API with the modify scope.\n  - Add Google OAuth credentials in n8n. Make sure to add the n8n redirect URI to the   Google Cloud Console consent screen settings.\n- OpenAI Configuration: add OpenAI API Key in the credentials\n- Tweaking the prompt: edit the system prompt in the \"Generate email reply\" node to suit your needs\n\n## Detailed Walkthrough\nCheck out this [blog post](https://medium.com/@nchourrout/i-made-an-email-auto-responder-to-conquer-my-writers-block-aa2b91db6741) where I go into more details on how I built this workflow.\n\nReach out to me [here](https://flowful.ai/contact) if you need help building automations for your business.",
  "featuredImage": "/data/workflows/2271/2271.webp",
  "author": {
    "id": 101,
    "slug": "nchourrout",
    "name": "Nicolas Chourrout",
    "avatar": ""
  },
  "categories": [
    "Ticket Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 69916,
  "downloads": 6991,
  "createdAt": "2024-05-19T21:48:39.986Z",
  "updatedAt": "2026-01-16T08:23:44.071Z",
  "publishedAt": "2024-05-19T21:48:39.986Z",
  "nodes": 12,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2271"
}