{
  "id": 2667,
  "slug": "2667",
  "title": "🛠️ Auto workflow positioning",
  "description": "## Check Online Version !\n[https://n8n-tools.streamlit.app/](https://n8n-tools.streamlit.app/\n)\n## **Who is it for?**  \nThis workflow is perfect for n8n users who want to maintain clean and organized workflows without manually repositioning nodes.\n\nWhether you're building complex workflows or sharing them with a team, maintaining visual clarity is essential for efficiency and collaboration.\n\nThis template automates the positioning process, saving time and ensuring consistent layout standards.\n\n---\n\n## **How does it work?**  \nThe template is divided into two parts:  \n\n1. **Positioning Engine:**  \n   - A webhook node kicks off the process by receiving a workflow ID.  \n   - Using the provided workflow ID, an n8n API node fetches the workflow details.  \n   - The fetched workflow is sent to a processing webhook that calculates optimized positions for the nodes.  \n   - Finally, an n8n API node updates the workflow with the newly positioned nodes, ensuring a clean and professional layout.  \n\n2. **Reusable Positioning Block:**  \n   - This is an HTTP Request node that can be seamlessly integrated into any workflow you create. When triggered, it sends the current workflow for automatic positioning via the first part of this template.  \n\n---\n\n## **How to set it up?**  \n\n1. **Enable n8n API Access:**  \n   - Ensure that your n8n instance has API access enabled with the appropriate credentials.  \n\n2. **Input Your n8n API URL and Credentials:**  \n   - Open the template, locate the n8n API nodes, and update them with your instance API key.\n   - Update the URL of the 'Magic Positioning' Http Request node to point to your n8n instance webhook URL.\n\n3. **Embed the Reusable Block:**  \n   - Add the provided HTTP Request node to any of your workflows to instantly connect to the auto-positioning engine.",
  "featuredImage": "/data/workflows/2667/2667.webp",
  "author": {
    "id": 101,
    "slug": "lucaspeyrin",
    "name": "Lucas Peyrin",
    "avatar": ""
  },
  "categories": [
    "Engineering"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 2669,
  "downloads": 266,
  "createdAt": "2024-12-21T21:35:21.612Z",
  "updatedAt": "2026-01-16T08:25:54.768Z",
  "publishedAt": "2024-12-21T21:35:21.612Z",
  "nodes": 34,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2667"
}