{
  "id": 3776,
  "slug": "3776",
  "title": "Turn YouTube RSS videos into social posts with Dumpling AI and Airtable",
  "description": "\n### Who is this for?\n\nThis workflow is for content creators, social media managers, marketing teams, and virtual assistants who want to automatically repurpose YouTube videos into ready-to-post social media content. If you need to quickly turn long-form videos into short posts for platforms like Instagram, Facebook, or LinkedIn, this workflow saves you hours of manual work.\n\n---\n\n### What problem is this workflow solving?\n\nManually extracting ideas from YouTube videos, writing captions, creating images, and preparing social media posts takes a lot of time and effort.  \nThis workflow automates the entire process: it reads the video, generates posts with captions and AI images, and organizes everything into Airtable.  \nIt lets you focus more on growing your audience instead of spending hours repurposing content.\n\n---\n\n### What this workflow does\n\n1. Watches a YouTube channel RSS feed for new videos.\n2. Extracts the video transcript automatically using Dumpling AI.\n3. Summarizes and transforms the transcript into 3 social media captions (Instagram, Facebook, LinkedIn) using OpenAI.\n4. Generates 3 unique AI image prompts.\n5. Sends the prompts to Dumpling AI to create realistic social media images.\n6. Saves the captions and attaches the AI images into Airtable, ready for posting.\n\n---\n\n### Setup\n\n1. **RSS Feed Setup**  \n   - Get your YouTube channel’s RSS feed URL.\n   - Insert the URL into the RSS Trigger node.\n   - This will monitor for new YouTube uploads automatically.\n\n2. **Dumpling AI Setup for Transcript Extraction**  \n   - Sign up at [Dumpling AI](https://app.dumplingai.com).\n   - Get your Dumpling AI API Key.\n   - In the first HTTP Request node after the RSS trigger, insert your API Key (use HTTP Header Authentication).\n   - This sends the YouTube URL to Dumpling AI’s `/extract-transcript` endpoint.\n\n3. **OpenAI Setup for Caption and Prompt Generation**  \n   - Get your OpenAI API Key.\n   - In the OpenAI node, connect your account.\n   - The AI will:\n     - Generate 3 platform-specific captions.\n     - Generate 3 creative prompts to design images related to the video.\n\n4. **Edit Fields Node**  \n   - This node organizes the generated captions and prompts into separate fields for easy Airtable mapping.\n   - Captions are split for Instagram, Facebook, and LinkedIn.\n\n5. **Dumpling AI Setup for AI Image Generation**  \n   - After the Edit Fields node, the second HTTP Request node sends the image prompt to Dumpling AI’s `/generate-image` endpoint.\n   - This returns a realistic AI-generated image.\n\n6. **Airtable Setup for Saving Posts (Without Image First)**  \n   - Create a new base in Airtable with the following fields:\n     - `Platform` (Single select: Instagram, Facebook, LinkedIn)\n     - `Content` (Long text field)\n     - `Image` (Attachment field)\n   - Connect your Airtable Personal Access Token to the Airtable node.\n   - The Airtable node saves the generated captions into separate records, initially without images.\n\n7. **Upload Generated Images Back to Airtable**  \n   - The third HTTP Request node PATCHES the Airtable record.\n   - It updates the `Image` field with the generated AI image from Dumpling AI.\n\n8. **Credentials Required**  \n   - **Dumpling AI API Key** (for transcript extraction and AI image generation)  \n   - **OpenAI API Key** (for caption and prompt creation)  \n   - **Airtable Personal Access Token** (for inserting and updating records)\n\n---\n\n### How to customize this workflow to your needs\n\n- Change the OpenAI prompt to generate captions in your brand tone (e.g., friendly, professional, witty).\n- Modify the image prompts to match your design style better.\n- Adjust the Airtable base fields if you want to add more platforms or content formats.\n- Add scheduling tools like Buffer or Metricool to automatically post from Airtable.\n\n---\n\n### ⚡ Quick Tips\n\n- Make sure Dumpling AI credits are active to allow transcript and image generation.  \n- Set Airtable permissions properly so PATCH requests can update attachments.  \n\n",
  "featuredImage": "/data/workflows/3776/3776.webp",
  "author": {
    "id": 101,
    "slug": "yang",
    "name": "Yang",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 672,
  "downloads": 67,
  "createdAt": "2025-04-28T19:22:10.875Z",
  "updatedAt": "2026-01-16T08:31:24.929Z",
  "publishedAt": "2025-04-28T19:22:10.875Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3776"
}