{
  "id": 7028,
  "slug": "7028",
  "title": "INST - the n8n installer: deploy workflows with automatic credential mapping",
  "description": "## INST: The n8n Workflow Installer\n\nThis workflow provides everything you need to package and deploy multiple workflows from a **single workflow you distribute**.\n\nThat's right, now you can package up dozens of workflows and send your client(s) a single workflow to run, that will create them all and auto-assign all the credentials.\n\nThis workflow installs 3 files when you run it, demonstrating the functionality. Just make your own mods to the system, repackage it, and you are ready to go!\n\n---\n\n## Requirements\n\n- An n8n instance with API access enabled and an access key\n- Optional: GitHub and OpenAI access keys\n\n---\n\n## What This Workflow Does\n\n- Installs 3 additional workflows, demonstrating the functionality\n- One of the workflows is a packager, that you configure for your own needs\n- Two example workflows demonstrate functionality, and can be deleted\n\n---\n\n## Step-by-Step Setup\n\n1. **Run the Workflow**  \n   This will get the example and tool workflows on your instance.\n\n2. **Package Your Content**  \n   Configure the packager, then run it to produce a base64-compressed version of your files.\n\n3. **Customize the Installer**  \n   Make your own copy of the installer, and set the base64 payload.\n\n4. **Deploy the Installer**  \n   Export your installer script. Now, anyone you send it to will get all your packaged workflows when they execute it.\n\n---\n\n## How to Use This Workflow\n\nThis workflow is meant to be reused and adapted. You can:\n\n- Integrate it into a deployment pipeline  \n- Turn it into a subworkflow for dynamic installs  \n- Extend it to include triggers, permission settings, or test runs  \n\nIf you frequently deploy or share n8n assets, this installer gives you a repeatable way to do it with confidence.\n\n",
  "featuredImage": "/data/workflows/7028/7028.webp",
  "author": {
    "id": 101,
    "slug": "wyeth",
    "name": "Wyeth",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 104,
  "downloads": 10,
  "createdAt": "2025-08-05T23:44:13.199Z",
  "updatedAt": "2026-01-16T08:48:13.525Z",
  "publishedAt": "2025-08-05T23:44:13.199Z",
  "nodes": 31,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7028"
}