{
  "id": 6051,
  "slug": "6051",
  "title": "Generate personalized travel itineraries with Llama AI via email & WhatsApp",
  "description": "This n8n workflow automatically creates friendly, personalized travel itineraries based on messages received via email or WhatsApp. When a user says \"I want to go to Dubai with friends for 5 days\" or something similar, the AI agent understands the request, generates a detailed daily plan with suggested activities, transport tips, and hotel ideas — all in a warm, human tone. It saves time, adds value for travelers, and delivers ready-to-send itineraries without any manual effort.\n\n## **Good to know**\n* The AI agent uses advanced language processing to understand natural travel requests in multiple formats.\n* Itineraries are generated with personalized recommendations based on travel preferences, group size, and duration.\n* The workflow supports both email and WhatsApp communication channels for maximum accessibility.\n* All responses maintain a warm, friendly tone to enhance user experience.\n\n## **How it works**\n* The `Get Query from Email` node captures travel requests sent via email, parsing the message content for trip details.\n* The `Get Query from WhatsApp` node simultaneously monitors WhatsApp messages for travel planning requests.\n* Both inputs feed into the `Itinerary Creator Agent` node, which uses AI to analyze the request and generate comprehensive travel plans including activities, accommodations, and transportation suggestions.\n* The `Check Proper Data` node validates the generated itinerary to ensure all essential information is included and properly formatted.\n* The `Check where to send Answer` node determines the appropriate response channel (email or WhatsApp) based on the original request source.\n* If the request came via email, the `Sending Itinerary from Email` node sends the personalized itinerary back to the user's email address.\n* If the request came via WhatsApp, the `Send Itinerary from message` node delivers the travel plan through WhatsApp messaging.\n\n## **How to use**\n* Import the workflow into n8n and configure the nodes with your email service credentials and WhatsApp API access.\n* Set up the AI agent with your preferred travel data sources and recommendation algorithms.\n* Test the workflow by sending sample travel requests through both email and WhatsApp channels.\n* Monitor the generated itineraries to ensure quality and adjust the AI agent parameters as needed.\n\n## **Requirements**\n* Email service API credentials (SMTP or email provider API)\n* WhatsApp Business API access or WhatsApp integration service\n* AI/LLM service for the Itinerary Creator Agent (OpenAI, Anthropic, or similar)\n* Access to travel data sources for recommendations (optional but recommended)\n\n## **Customising this workflow**\n* Modify the `Itinerary Creator Agent` node to include specific travel preferences, local recommendations, or branded content.\n* Adjust the data validation rules in the `Check Proper Data` node to match your quality standards.\n* Customize response templates in both sending nodes to align with your brand voice and style.\n* Add additional input channels or integrate with other messaging platforms as needed.",
  "featuredImage": "/data/workflows/6051/6051.webp",
  "author": {
    "id": 101,
    "slug": "oneclick-ai",
    "name": "Oneclick AI Squad",
    "avatar": ""
  },
  "categories": [
    "Support Chatbot",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 682,
  "downloads": 68,
  "createdAt": "2025-07-16T07:42:04.539Z",
  "updatedAt": "2026-01-16T08:42:53.313Z",
  "publishedAt": "2025-07-16T07:42:04.539Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6051"
}