{
  "id": 12142,
  "slug": "12142",
  "title": "Generate natural health remedies guides with Claude AI & auto quality assurance",
  "description": "## DESCRIPTION\nThis workflow automates the creation of personalized natural health guides using Claude AI with built-in quality assurance. It generates comprehensive, medically-informed content tailored to specific diseases and patient demographics, featuring prevention strategies, natural remedies, and healing recipes. The workflow includes an intelligent quality loop that automatically refines content until it meets professional standards, eliminating generic templates and placeholders. Perfect for healthcare practitioners, wellness coaches, and health content creators who need accurate, personalized medical information at scale.\n\n## KEY FEATURES\n\n**AI-Powered Content Generation:**\nCreates disease-specific health guides with natural remedies, prevention strategies, and healing recipes\n**Automated Quality Assurance:**\nIntelligent evaluator reviews content for completeness and accuracy\n**Iterative Improvement Loop:**\nAutomatically refines content through AI optimization until quality standards are met\n**Patient Customization:**\nTailors information based on disease, age, and gender\n**Dual Timezone Display:**\nShows timestamps in both local time and UTC for global users\n**Professional Google Docs Export:** \nGenerates formatted documents with consistent styling and emoji section markers\n**Execution Tracking:**\nLogs metrics including tokens used, processing time, and quality iterations\n**Template-Free Output:** \nEliminates placeholders through strict prompt engineering\n\n## HOW IT WORKS\n\nThe workflow automates health content creation through intelligent AI agents: Users submit patient information via web form, triggering comprehensive content generation including medical information, natural remedies, and healing recipes. An automated quality evaluator reviews output for completeness and accuracy, initiating refinement loops as needed (max 5 iterations). Approved content is professionally formatted with dual timezone timestamps and exported to Google Docs, while execution metrics are logged for performance tracking.\n\n## HOW TO USE\n\n**Setup:** Configure LLM's API key and Google account credentials.\n**Customize:** Optionally adjust AI prompts, quality criteria, and timezone settings.\n**Run:** Submit patient information (disease, age, gender) via web form.\n**Access:** Download generated health guide from Google Docs.\n**Track:** Monitor execution metrics and performance in data table.\n\n## REQUIREMENTS\n**Essential:**\n\n•\tLLM's API account with OpenAI/Claude\n•\tGoogle account for Google Docs export\n•\tN8N data table to track and store the   \n   metrics(Alternate option if Google sheets)\n•\tn8n version 1.0+\n",
  "featuredImage": "/data/workflows/12142/12142.webp",
  "author": {
    "id": 101,
    "slug": "edupuganti",
    "name": "Sridevi Edupuganti",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 17,
  "downloads": 1,
  "createdAt": "2025-12-25T17:36:34.708Z",
  "updatedAt": "2026-01-16T09:11:31.494Z",
  "publishedAt": "2025-12-25T17:36:34.708Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12142"
}