{
  "id": 6334,
  "slug": "6334",
  "title": "Automate Instagram posts with GPT-4o captions, ImgBB & Buffer integration",
  "description": "## Disclaimer\nThis workflow uses two community nodes.![Instagram n8n workflow.png](fileId:1850)\n\n# What It Does\n[Workflow Demonstration](https://www.youtube.com/watch?v=kv--CRbrcFg)\n\nThis powerful automated workflow eliminates the need to manually create and upload Instagram posts, saving you time while delivering perfect captions and hashtags.\nSimply drop an image into a designated folder on your desktop, and the process begins instantly.\nGPT-4o analyzes the image and generates an engaging Instagram caption along with relevant hashtags tailored to the content.\nThe image is then uploaded to ImgBB for reliable hosting, while the caption and hashtags are sent to Airtable. From there, Airtable automatically pulls in the hosted image link.\nOnce everything is in place, Zapier takes over — sending the complete post, including the image and AI-generated description, directly to Buffer for scheduling and publishing to your Instagram account.\nIn just a few minutes, you go from saving an image to having a fully composed, ready-to-post piece of content — with almost zero effort.\n\n# Who This Is For\nThis workflow is designed for content creators, social media managers, entrepreneurs, and small business owners who want to save time, stay consistent, and scale their Instagram presence effortlessly.\nWhether you're running a brand, promoting a product, managing multiple clients, or just tired of the repetitive grind of posting — this automation gives you back your time while keeping your content sharp and professional.\nNo design skills needed. No social media assistant required. Just drop your image, and let AI handle the rest.\nIf you’re looking to streamline your workflow, boost engagement, and focus more on creativity than logistics — this is made for you.\n\n# How It Works\nStart by connecting a designated folder on your desktop to the workflow. Every time a new image is saved to this folder, the automation is triggered.\nOnce you've added the image you'd like to post to Instagram, the workflow kicks off — sending the image to OpenAI, where GPT-4o analyzes it and generates an engaging Instagram-style caption, complete with relevant hashtags.\nFor more personalized results, you can customize the GPT-4o prompt to match your brand’s voice or even provide a sample post from your Instagram account.\nThe image is then uploaded to ImgBB for reliable cloud storage, and the AI-generated caption is sent to Airtable. Airtable automatically pulls in the hosted image link from ImgBB.\nThis triggers Zapier, which packages the content and sends it to Buffer — where your post can be published immediately or scheduled for a later time based on your preferences.\nIn just a few minutes, your image goes from a desktop folder to a fully automated, AI-crafted Instagram post — all without manual input.\n\n# Set Up Steps\n- Create a Folder:\n- Create a folder on your computer for saving images. Copy the folder path and add it to the Local File Trigger node in n8n.\n- Get OpenAI API Key:\n- Visit https://platform.openai.com/api-keys to generate your API key. Connect it to the Analyze Image AI Agent and the Prompt/Text Generator AI Agent.\n- Fund Your OpenAI Account:\n- Add credits to your OpenAI account. GPT-4o costs approximately $0.01 for every 3 automation runs.\n- Create an ImgBB Account (free):\n- Sign up at https://imgbb.com and obtain your free API key.\n- Create an Airtable Account (free):\n- Sign up at https://airtable.com and get your API key.\n- Set Up Zapier:\n- Create a free Zapier account at https://zapier.com. Connect it to Airtable and Buffer (100 tasks/month free).\n- Set Up Buffer:\n- Sign up at https://buffer.com, connect your Instagram account, and start with 10 free posts/month.\n\n## Tips\nFor improved description and tag performance recommend customizing the Analyze node. Change the #Description portion of the node to describe the types of posts you normally place on your Instagram and tailor it to how you like your descriptions to be.  Additionally, change the #Example Post Description to a post with tags included of what you would normally post to your Instagram.",
  "featuredImage": "/data/workflows/6334/6334.webp",
  "author": {
    "id": 101,
    "slug": "lifehacks",
    "name": "AiAgent",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 169,
  "downloads": 16,
  "createdAt": "2025-07-23T20:42:41.481Z",
  "updatedAt": "2026-01-16T08:44:30.160Z",
  "publishedAt": "2025-07-23T20:42:41.481Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6334"
}