{
  "id": 9025,
  "slug": "9025",
  "title": "Automated economic calendar PDF reports to Telegram via RapidAPI",
  "description": "Stay ahead of the markets with this fully automated n8n workflow that delivers AI-generated economic calendar events PDF updates directly to your Telegram or Discord.\n\nPowered by the Economic Events Calendar API via RapidAPI, this workflow is perfect for traders, investors, and financial community managers who want timely notifications about high- and medium-impact global economic events—no coding required.\n\n## Key Features\n1. Automated PDF Generation: Receive medium and high impact upcoming economic calendar events schedule (for up to 7 days in future) straight to Telegram/Discord.\n2. Flexible Scheduling: Default update interval is every 7 days, adjustable to any custom frequency.\n3. Customizable Date Range: Easily set the window for economic event coverage (e.g., today to 7 days ahead).\n4. No Coding Needed: Simple setup—just plug in your API keys and Telegram credentials.\n\n## Who Is This For?\nRetail and professional traders\nFinancial influencers and Telegram group admins\nCommunity managers seeking hands-off, real-time macroeconomic alerts\n\n## Why Choose This Workflow?\n- Save Time: No more manual economic calendar checks. Get upcoming full week high and medium impact news events straight to your telegram in neatly formatted PDF.\n- Stay Informed: Instantly know about key market-moving events.\n- Easy Integration: Works out-of-the-box with n8n and Telegram.\n\nGet started today and never miss a critical economic event again!\n\n**PDF View:**\n![image.png](fileId:2691)",
  "featuredImage": "/data/workflows/9025/9025.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Crypto Trading"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 49,
  "downloads": 4,
  "createdAt": "2025-09-27T21:54:26.736Z",
  "updatedAt": "2026-01-16T08:58:44.210Z",
  "publishedAt": "2025-09-27T21:54:26.736Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9025"
}