{
  "id": 7469,
  "slug": "7469",
  "title": "Automate resume screening with Gmail, Gemini AI, and Airtable to Google Sheets",
  "description": "## Who’s it for\n\nThis workflow is perfect for recruiters, HR professionals, and startup founders who receive job applications by email and want to automate the process of parsing, matching, and evaluating resumes. If you want to save time by having candidate data and AI scores automatically organized in Google Sheets, this workflow is for you.\n\n---\n\n## How it works\n\n- Monitors a Gmail inbox for new emails with resume attachments (PDF)\n- Extracts the job title from the email subject and matches it against open positions stored in Airtable\n- Uploads the resume file to a designated Google Drive folder for storage\n- Builds a prompt with all relevant context and sends it, along with the resume file, to Gemini AI for analysis\n- Gemini scores the candidate, extracts their name and phone, and provides a one-sentence explanation\n- All results—including candidate info, AI score, feedback, and a download link for the resume—are appended as new rows in Google Sheets\n\n---\n\n## How to set up\n\n1. **Create accounts and APIs**: You’ll need Google (Gmail, Drive, Sheets), Airtable, and Gemini API access.\n2. **Prepare your Airtable base**: Add your job descriptions (title, code, description, skills, etc.)—these are matched against incoming applications.\n3. **Prepare your Google Sheet**: Create a spreadsheet to store applicant data and scores.\n4. **Connect credentials in n8n**: Set up Gmail, Google Drive, Google Sheets, Airtable, and Gemini API credentials in n8n’s credential manager.\n5. **Import this workflow**: Use the workflow import feature in n8n and connect your credentials to each node.\n6. **Test**: Send a test application email with a PDF resume to your connected Gmail—watch the data appear in Google Sheets!\n\n---\n\n## Requirements\n\n- Google account with access to Gmail, Drive, and Sheets\n- Airtable account for job data\n- Gemini API key (no hardcoded keys—use n8n environment variables or credentials)\n- n8n instance (cloud or self-hosted)\n\n---\n\n## How to customize the workflow\n\n- **Job matching logic**: Edit the EmailMatcher node to fine-tune how subjects are matched to job titles.\n- **Scoring criteria**: Adjust the prompt in PromptBuilder to change what Gemini evaluates.\n- **Supported file types**: Modify the ReadyAttachment node to accept other resume formats if needed.\n- **Sheet columns**: Edit the Google Sheets node to map new data points or change the output format.\n- **Notifications**: Add Slack or email nodes to notify you when a strong candidate is found.\n\n---",
  "featuredImage": "/data/workflows/7469/7469.webp",
  "author": {
    "id": 101,
    "slug": "sameedhusayn",
    "name": "Sameed",
    "avatar": ""
  },
  "categories": [
    "HR",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 608,
  "downloads": 60,
  "createdAt": "2025-08-16T10:49:15.204Z",
  "updatedAt": "2026-01-16T08:50:30.396Z",
  "publishedAt": "2025-08-16T10:49:15.204Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7469"
}