{
  "id": 10524,
  "slug": "10524",
  "title": "Phase-based blog creation system with specialized AI sub-agents",
  "description": "Chat with a multi-agent system to write a blog. The orchestrator advances through research, headlines, hooks, outline, intro, draft, and final polish–one phase per reply—outputting options and asking you to proceed or rerun at each step.\n\n## Who is this for?\nCreators, editors, and teams who want to drive a blog from an interactive chat. You type a message, the system replies with the phase result, you respond, and it moves forward—until the final draft is ready.\n\n## What problem does it solve?\nContent projects stall when steps are mixed together. This keeps strict phase order with confirmations at each turn. It prevents hidden state, enforces inputs, and keeps the loop conversational and controllable.\n\n## How it works\n1. **You send a message.** The Orchestrator reads recent chat, checks required inputs for the current phase, and either requests missing items or runs a sub-agent.\n2. **Phase execution.** Phases run in order: Research → Headlines → Hooks → Outline → Intros → Draft → Final. The sub-agent returns user-facing markdown only.\n3. **Deterministic replies.** The Orchestrator posts the sub-agent output verbatim, then asks whether to **proceed** to the next phase or **choose an optoion** or **rerun** this phase with new instructions.\n4. **Interactive gating.** If required inputs are missing, it replies with a short list of what’s needed and waits for your message.\n5. **Research any time.** You can request more research at any point. The phase does not change; new research is passed forward to the next sub-agent.\n6. **Memory window.** A short rolling memory keeps recent chat context without exposing internal prompts or variables.\n7. **Finish.** After you approve the Draft phase, the Final phase polishes and returns a publication-ready version.\n\n## Setup steps\n1. **Import the workflow JSON** into n8n.\n2. **Configure LLM** credentials for the chat model node.\n3. **Connect sub-agent workflows** referenced by the Orchestrator (Research, Headlines, Hooks, Outline, Intros, Draft, Final). Verify their input mappings (`WHO`, `WHAT`, `WHY`, `CONTEXT`, `research`, etc.).\n4. **Optional integrations:** Enable or disable Slack posting and any datastore nodes you use for research notes.\n5. **Test the loop:** Start with a chat message that includes topic, audience, and purpose. Confirm the Orchestrator returns the phase output and prompts you to proceed or rerun.\n\n## Notes\n- One sub-agent runs per turn for clarity and traceability.\n- Internal prompts, XML, and variables never appear in user messages.\n- “Proceed” advances one phase; “Rerun” keeps the phase and uses your updated instructions.\n\n## Resources\n- [n8n Docs](https://docs.n8n.io/)\n- [Anthropic Docs](https://docs.anthropic.com/en/docs)",
  "featuredImage": "/data/workflows/10524/10524.webp",
  "author": {
    "id": 101,
    "slug": "mattyreed1",
    "name": "Matty Reed",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 63,
  "downloads": 6,
  "createdAt": "2025-11-05T08:46:41.321Z",
  "updatedAt": "2026-01-16T09:05:20.030Z",
  "publishedAt": "2025-11-05T08:46:41.321Z",
  "nodes": 29,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10524"
}