{
  "id": 7375,
  "slug": "7375",
  "title": "Send WhatsApp notifications for Cal.com & Calendly bookings using Google Gemini",
  "description": "## Who's it for\nBusiness owners, freelancers, and professionals who use Cal.com or Calendly for scheduling and want instant WhatsApp notifications for all booking activities without constantly checking their email or calendar apps.\n\n## What it does\nThis workflow automatically monitors your calendar booking events from both Cal.com and Calendly, then sends beautifully formatted WhatsApp messages to notify you of:\n- New bookings with guest details\n- Rescheduled meetings with old vs new times  \n- Cancelled appointments\n- Meeting completion notifications (Cal.com only)\n\nThe AI agent intelligently formats each message with emojis, proper spacing, and all relevant booking information including guest names, emails, dates, times, locations, and notes.\n\n## How it saves you time\n**Stop checking multiple platforms:** Instead of constantly monitoring email notifications, calendar apps, and booking dashboards, get everything instantly on WhatsApp - the app you're already using throughout the day.\n\n**Immediate awareness:** Know about booking changes the moment they happen, not hours later when you finally check your email. This means you can quickly adjust your schedule, prepare for meetings, or reach out to clients if needed.\n\n**Mobile-first notifications:** Since most people check WhatsApp more frequently than email, you'll never miss important booking updates again. Perfect for busy professionals who are often away from their desk.\n\n## How it works\nWhen a booking event occurs on either platform, the workflow captures the data, merges it through an aggregator, then uses Google Gemini AI to generate a professionally formatted WhatsApp message that gets sent instantly to your phone.\n\n## Requirements\n- Cal.com and/or Calendly account with API access\n- WhatsApp Business API credentials\n- Google API key for Gemini\n- Active webhook endpoints for both calendar services\n\n## How to customize\n- Update the recipient phone number in the WhatsApp node\n- Modify message templates in the AI Agent's system prompt\n- Add additional calendar platforms by connecting more trigger nodes\n- Customize emoji usage and message formatting to match your brand",
  "featuredImage": "/data/workflows/7375/7375.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1030,
  "downloads": 103,
  "createdAt": "2025-08-14T10:50:59.501Z",
  "updatedAt": "2026-01-16T08:49:59.387Z",
  "publishedAt": "2025-08-14T10:50:59.501Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7375"
}