{
  "id": 7573,
  "slug": "7573",
  "title": "Generate ClickUp weekly assignment & performance reports with Gmail",
  "description": "**Description**\n\nAutomate your weekly task tracking with this n8n workflow that generates professional HTML reports of upcoming assignments and team performance. Fetches tasks from ClickUp, filters by current week, organizes by assignee, and delivers via Gmail.\n\nFeatures: Upcoming assignments with due dates \n• Urgent/overdue task alerts \n• Per-assignee breakdown with sprint points \n• Priority/status badges \n• Weekly team statistics \n• Automated Gmail delivery\n\nPerfect for project managers and team leads who need weekly visibility without manual reporting.\n\n**Prerequisites Required:**\n\n- n8n instance (v1.0+) and ClickUp workspace with API access\n- Gmail account with app-specific password\n- ClickUp tasks with assignees, due dates, and priority levels\n\n**Setup Instructions**\n\n- ClickUp Connection: Create ClickUp credential in n8n using API token from ClickUp Settings &gt; Apps\n- Gmail Setup: Add Gmail credentials with app-specific password (enable 2FA first)\n- Import Workflow: Import JSON and update ClickUp workspace IDs and email recipients\n- Customize: Adjust date filters, priority mapping, and HTML styling as needed\n- Schedule: Test manually, then set recurring schedule (recommended: Monday 9 AM)\n\nPerfect for sales teams, project managers, and leads who want full visibility on weekly task pipelines without manual reporting.\n\nKeywords: n8n ClickUp automation, weekly task report, performance tracking, upcoming assignments report, ClickUp to Gmail workflow, sprint points tracking, overdue task alerts, sales team productivity monitoring.",
  "featuredImage": "/data/workflows/7573/7573.webp",
  "author": {
    "id": 101,
    "slug": "rahul08",
    "name": "Rahul Joshi",
    "avatar": ""
  },
  "categories": [
    "Project Management",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 50,
  "downloads": 5,
  "createdAt": "2025-08-19T06:49:47.926Z",
  "updatedAt": "2026-01-16T08:51:10.589Z",
  "publishedAt": "2025-08-19T06:49:47.926Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7573"
}