{
  "id": 10888,
  "slug": "10888",
  "title": "Predict F1 Race Winners with OpenAI GPT-4o, Historical Data & Slack Alerts",
  "description": "## How It Works\nEvery day at 8 AM, the workflow automatically retrieves the latest F1 data—including driver standings, qualifying results, race schedules, and circuit information. All sources are merged into a unified dataset, and driver performance metrics are computed using historical trends. An AI agent, enhanced with vectorized race history, evaluates patterns and generates race-winner predictions. When the confidence score exceeds the defined threshold, the system pushes an automated Slack alert and records the full analysis in the database and Google Sheets.\n\n## Setup Steps\n1. Update the workflow configuration with: `newsApiUrl`, `weatherApiUrl`, `historicalYears`, and `confidenceThreshold`.\n2. Connect PostgreSQL using the schema:\n   **prediction_date, predicted_winner, confidence_score, prediction_source, data_version, full_analysis**.\n3. Provide the Slack channel ID for sending high-confidence alerts.\n4. Specify the Google Sheets document ID and sheet name for prediction logging.\n5. Test connectivity to the Ergast API (no authentication required).\n\n## Prerequisites\nOpenAI account (GPT-4o access), Slack workspace admin access, PostgreSQL instance, Google Sheets account, n8n instance with LangChain community nodes enabled.\n\n## Customization\nExtend by adding constructor predictions (modify AI prompt). Integrate Discord or Teams instead of Slack.\n\n## Benefits\nSaves time by automating data collection, improves accuracy using multiple performance metrics and historical patterns.\n\n",
  "featuredImage": "/data/workflows/10888/10888.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Miscellaneous",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 91,
  "downloads": 9,
  "createdAt": "2025-11-16T15:50:41.830Z",
  "updatedAt": "2026-01-16T09:06:44.914Z",
  "publishedAt": "2025-11-16T15:50:41.830Z",
  "nodes": 38,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10888"
}