{
  "id": 12353,
  "slug": "12353",
  "title": "Repurpose Instagram videos to YouTube with Claude and Google Sheets tracking",
  "description": "## How It Works\nThis workflow automates cross-platform content distribution from Instagram to YouTube with intelligent AI enhancement. Designed for content creators, social media managers, and digital marketers who need to maximize their content reach across platforms efficiently. The template solves the challenge of manual video repurposing by automating the entire process from content retrieval to optimized publishing. It retrieves Instagram videos on schedule, generates engaging metadata using dual AI models (Anthropic Claude for creative titles/descriptions), uploads to YouTube, logs performance metrics to Google Sheets, and sends WhatsApp notifications upon completion. The workflow intelligently routes tasks between AI providers: Claude's language capabilities create compelling and platform-optimized content. This dual-model approach delivers superior results compared to single-AI solutions, combining creativity with precision for maximum engagement.\n\n## Setup Steps\n1. Configure Instagram credentials \n2. Add Anthropic API key for Claude model in AI nodes\n3. Connect YouTube account and configure upload settings\n4. Link Google Sheets with target spreadsheet ID for logging\n5. Add WhatsApp Business API credentials\n\n## Prerequisites\nInstagram Business/Creator account with API access\n\n## Use Cases\nSocial media agencies managing multiple client accounts\n\n## Customization\nModify AI prompts for brand-specific tone, adjust scheduling frequency\n\n## Benefits\nSaves 2-3 hours daily on manual uploads, ensures consistent posting schedules",
  "featuredImage": "/data/workflows/12353/12353.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 18,
  "downloads": 1,
  "createdAt": "2026-01-01T06:39:43.854Z",
  "updatedAt": "2026-01-16T09:12:14.339Z",
  "publishedAt": "2026-01-01T06:39:43.854Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/12353"
}