{
  "id": 2909,
  "slug": "2909",
  "title": "Automate Google OAuth2 credential creation in n8n",
  "description": "\n## Overview: Automate Your Google OAuth2 Credential Creation\n\nThis workflow template streamlines the process of creating and naming individual Google OAuth2  credentials for multiple Google services within n8n. By automating tasks typically done manually, it saves significant time and reduces the risk of errors.\n\n## Who Is This For?\n\nThis template is perfect for:  \n- Marketers who frequently use Google Docs, Google Sheets, Google Slides, and Google Drive for document automation.  \n- Developers or technical users who manage numerous integrations and need to minimize credential creation overhead.  \n- Teams or solo users with multiple Google accounts who want to eliminate repetitive Google OAuth2 credential creation tasks.\n\n### Prerequisite Knowledge\n\n• Basic familiarity with n8n, including how to configure nodes and connect services.  \n• A Google OAuth JSON file (client ID, client secret, etc.) already set up in your Google Cloud Console.  \n• An understanding of Google services (Docs, Sheets, Slides, Drive, Gmail, Calendar, Contacts and others) and which you may need for your use cases\n\n## What Problem Does It Solve?\n\nManually creating and naming separate OAuth2 credentials for each Google service can be time-consuming and prone to errors. For instance, if you manage 16 Google accounts, you might need to create 112 credentials manually. This workflow automates that process by using your Google OAuth JSON file and email address, generating uniquely named OAuth2 credentials for each Google service in just a single run per account.\n\n\n## Key Features\n\n1. **Manual Trigger** – Start the workflow on demand to generate new credentials.  \n2. **Set Node for Google OAuth Details** – Store your client ID, client secret, and other JSON info securely in one place.  \n3. **Automated Naming Convention** – Use your Google email address to create distinct names for each credential, simplifying organization.  \n4. **Array of Google Services** – Customize which services to create credentials for, such as Docs, Sheets, Slides, Drive, Gmail, Calendar, or Contacts.  \n5. **Batch Credential Creation** – Split the array of Google services and automatically create separate OAuth2 credentials for each.  \n6. **Seamless OAuth2 Integration** – Effortlessly authenticate all generated credentials within n8n.\n\n## How to Set Up\n\n1. **Insert Your JSON Details** – Paste your Google OAuth 2.0 JSON data into the “Google JSON” node.  \n2. **Add Your Google Email Address** – Specify your email address in the “Google Email” node to personalize the naming convention.  \n3. **Configure n8n Account Credentials** – In the “n8n Create Credentials” node, select or add proper credentials (e.g., n8n API credentials).  \n4. **Execute the Workflow** – Run the workflow to automatically generate individual OAuth2 credentials.  \n5. **Finalize in n8n** – Visit your n8n Credentials dashboard to complete the OAuth sign-in for each newly created credential.\n\n## Customization Options\n\n- **Modify the Services Array** – Easily add or remove Google products based on your workspace needs by editing the array in the “Services” node.  \n- **Adjust Naming Logic** – Tailor the credential naming convention in the “n8n Create Credentials” node to match your organization’s style or best practices.  \n- **Set Role-Based Access** – In n8n, control who can view and use these automatically generated credentials by adjusting user permissions.\n\n## Time-Saving Example\n\nI initially had 16 Google accounts, requiring 112 credentials if done manually. With this workflow, I needed just one run per account—saving around two hours of repetitive data entry. Yes, I spent three hours building and documenting this, but it pays off quickly for anyone managing multiple accounts or large teams.",
  "featuredImage": "/data/workflows/2909/2909.webp",
  "author": {
    "id": 101,
    "slug": "jordan",
    "name": "Jordan Haisley",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 2237,
  "downloads": 223,
  "createdAt": "2025-02-14T23:08:08.900Z",
  "updatedAt": "2026-01-16T08:27:08.491Z",
  "publishedAt": "2025-02-14T23:08:08.900Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2909"
}