{
  "id": 3393,
  "slug": "3393",
  "title": "Google Calendar 📅 reminder system with GPT-4o and Telegram",
  "description": "How many times have you missed a meeting or forgotten an appointment because a calendar reminder got lost in the noise? Traditional notifications are often dry, easy to ignore, or scattered across different apps—leaving you scrambling at the last minute.\n\nThis smart **Google Calendar** workflow fixes that by sending you a clear, friendly reminder exactly **1 hour before your event starts**—delivered through **Telegram** as if a personal assistant were looking out for you. Powered by **AI**, it transforms cold calendar alerts into warm, conversational nudges you won't ignore.\n\n----\n#### Why This Works Better:  \n✅ **No More Overlooked Alerts** – Consolidates reminders into one clear, accessible place (Telegram), so you never miss them.  \n✅ **Friendly & Engaging** – AI transforms robotic calendar entries into natural, human-like reminders that are harder to ignore.  \n✅ **Works Everywhere** – Whether you're on your phone, laptop, or tablet, you’ll get the same clear notification, no matter the platform.  \n\n---\n#### **How It Works**\n1. **Scheduled Trigger**: The workflow starts with a Schedule Trigger node that runs every minute to check for upcoming events.\n2. **Google Calendar Check**: The \"Get upcoming event\" node queries Google Calendar for events starting within the next hour (between `timeMin` and `timeMax`).\n3. **Duplicate Prevention**: The \"Already sent?\" node ensures reminders are not sent multiple times for the same event by filtering out duplicates.\n4. **AI-Powered Reminder**: The \"Secretary Agent\" node, powered by **GPT-4**, crafts a friendly and professional reminder message. It includes event details like name, description, location, start/end time, and creator, formatted in a conversational tone.\n5. **Telegram Notification**: The final \"Send reminder\" node delivers the reminder via Telegram, ensuring the user receives it in a clear and accessible format.\n----\n#### **Set Up Steps**\n1. **Configure Schedule Trigger**: Set the interval (e.g., every minute) to check for events.\n2. **Connect Google Calendar**: Link your Google Calendar account and specify the calendar to monitor.\n3. **Set Up AI Agent**: Customize the \"Secretary Agent\" with the provided system message to ensure reminders are warm, professional, and detailed.\n4. **Link Telegram**: Add your Telegram credentials and specify the `CHAT_ID` where reminders will be sent.\n5. **Activate Workflow**: Ensure the workflow is active and set to the correct timezone (e.g., `Europe/Rome`).\n---\n#### **Why It’s Useful**\n- **Never Miss an Event**: Traditional calendar reminders can be easy to overlook, especially when scattered across platforms. This workflow consolidates reminders into a single, accessible channel (Telegram).\n- **Clear and Friendly**: The AI agent transforms generic calendar alerts into personalized, conversational reminders, making them harder to ignore.\n- **Cross-Platform Accessibility**: By delivering reminders via Telegram, users receive them in a consistent format, regardless of the device or platform they’re using. No more missed events due to unclear notifications!\n---\n\n### **Need help customizing?**  \n[Contact me](mailto:info@n3w.it) for consulting and support or add me on [Linkedin](https://www.linkedin.com/in/davideboizza/).",
  "featuredImage": "/data/workflows/3393/3393.webp",
  "author": {
    "id": 101,
    "slug": "n3witalia",
    "name": "Davide",
    "avatar": ""
  },
  "categories": [
    "Personal Productivity",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 28019,
  "downloads": 2801,
  "createdAt": "2025-04-01T07:27:50.382Z",
  "updatedAt": "2026-01-16T08:29:30.350Z",
  "publishedAt": "2025-04-01T07:27:50.382Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3393"
}