{
  "id": 11410,
  "slug": "11410",
  "title": "Review aggregator and AI alerts for Google, Facebook, Trustpilot, and Yelp",
  "description": "This workflow automatically collects customer reviews from Google, Facebook, Trustpilot, and Yelp, analyzes their sentiment using AI, sends real-time alerts for negative feedback, and generates a weekly summary report. It is ideal for businesses that want to monitor their online reputation across multiple platforms and respond quickly to customer concerns.\n\n---\n\n## How It Works\n\n- **Daily Schedule**: Triggers the workflow every day at 09:00.\n- **Review Collection**: Fetches new reviews from Google, Facebook, Trustpilot, and Yelp using their official APIs.\n- **Data Normalization**: Merges and standardizes all reviews into a unified format.\n- **AI Sentiment Analysis**: Uses GPT-4 to analyze the sentiment and extract key insights from each review.\n- **Negative Review Alerts**: Sends a Slack notification to managers if a negative review is detected.\n- **Logging**: Saves all reviews and their analysis to a Google Sheet for record-keeping.\n- **Weekly Reporting**: Every Monday, aggregates the past week’s reviews, generates an AI-powered summary, and emails it to management.\n\n---\n\n## Configuration\n\n1. API Credentials:\n   - **Google My Business API**: Create a project in Google Cloud, enable the My Business API, and generate OAuth credentials.\n   - **Facebook Graph API**: Create a Facebook App, request the necessary permissions, and obtain a Page Access Token.\n   - **Trustpilot API**: Register for a Trustpilot Business account and generate an API key.\n   - **Yelp Fusion API**: Sign up for Yelp Fusion, create an app, and get your API key.\n   - **OpenAI API**: Create an account at OpenAI, generate an API key for GPT-4 access.\n   - **Slack API**: Create a Slack App, enable Incoming Webhooks, and get the webhook URL.\n   - **Google Sheets API**: Enable the Google Sheets API in Google Cloud and create OAuth credentials.\n\n2. **Set Up Environment Variables**:\n   - Add all API keys, tokens, and configuration values in the `Workflow Configuration` node or as n8n credentials.\n\n3. **Google Sheet Setup**:\n   - Create a Google Sheet with columns for review data and share it with your service account email.\n\n4. **Slack Channel**:\n   - Set up a Slack channel for alerts and add the webhook URL in the configuration.\n\n5. **Email Settings**:\n   - Configure the recipient email address for weekly reports in the workflow.\n\n---\n\n## Usage\n\n- Activate the workflow after configuration.\n- Reviews will be collected and analyzed daily.\n- Negative reviews trigger instant Slack alerts.\n- Every Monday, a summary report is sent via email.\n\n---\n\n**Use Case:**  \nMonitor and respond to customer feedback across Google, Facebook, Trustpilot, and Yelp, automate sentiment analysis, and keep management informed with actionable weekly insights.",
  "featuredImage": "/data/workflows/11410/11410.webp",
  "author": {
    "id": 101,
    "slug": "tuguidragos",
    "name": "Țugui Dragoș",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 70,
  "downloads": 7,
  "createdAt": "2025-12-01T21:37:50.867Z",
  "updatedAt": "2026-01-16T09:08:37.645Z",
  "publishedAt": "2025-12-01T21:37:50.867Z",
  "nodes": 27,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11410"
}