{
  "id": 10697,
  "slug": "10697",
  "title": "Automate blog content creation from topics to WordPress with AI, Google Drive & Sheets",
  "description": "# Blog Post Content Creation (Multi-Topic with Brand Research, Google Drive, and WordPress)\n\n## Description\n\nThis workflow automates the full lifecycle of generating and publishing SEO-optimized blog posts from a list of topics. It reads topics (and optionally brands) from Google Sheets, performs brand research, generates a structured HTML article via AI, converts it into an HTML file for Google Drive, publishes a draft post on WordPress, and repeats this for every row in the sheet.\n\nWhen the final topic has been processed, a single Slack message is sent to confirm completion and share links.\n\n## How It Works\n\n### 1. Input from Google Sheets\n\nA Google Sheets node reads rows containing at least:\n\n- Brand (optional, can be defaulted)\n- Blog Title or Topic\n\nA Split In Batches node iterates through the rows one by one so each topic is processed independently.\n\n### 2. Configuration\n\nThe Configuration node maps each row’s values into:\n\n- Brand\n- Blog Title\n\nThese values are used consistently across brand research, content creation, file naming, and WordPress publishing.\n\n### 3. Brand Research\n\nA Language Model Chain node calls an OpenRouter model to gather background information about the brand and its services.\n\nThe brand context is used as input for better, on-brand content generation.\n\n### 4. Content Creation\n\nA second Language Model Chain node uses the brand research and the blog title or topic to generate a full-length, SEO-friendly blog article.\n\nOutput is clean HTML with:\n\n- Exactly one `<h1>` at the top\n- Structured `<h2>` and `<h3>` headings\n- Semantic tags only\n- No inline CSS\n- No `&lt;html&gt;` or `&lt;body&gt;` wrappers\n- No external resources\n\n### 5. HTML Processing\n\nA Code node in JavaScript:\n\n- Strips any markdown-style code fences around the HTML\n- Normalizes paragraph breaks\n- Builds a safe file name from the blog title\n- Encodes the HTML as a binary file payload\n\n### 6. Upload to Google Drive\n\nA Google Drive node uploads the generated HTML file to a specified folder.\n\nEach topic creates its own HTML file, named after the blog title.\n\n### 7. Publish to WordPress\n\nAn HTTP Request node calls the WordPress REST API to create a post.\n\nThe post content is the generated HTML, and the title comes from the Configuration node.  \nBy default, the post is created with status `draft` (can be changed to `publish` if desired).\n\n### 8. Loop Control and Slack Notification\n\nAfter each topic is processed (Drive upload and WordPress draft), the workflow loops back to Split In Batches to process the next row.\n\nWhen there are no rows left, an IF node detects that the loop has finished.\n\nOnly then is a single Slack message sent to:\n\n- Confirm that all posts have been processed\n- Share links to the last generated Google Drive file and WordPress post\n\n## Integrations Used\n\n- OpenRouter - AI models for brand research and SEO content generation\n- Google Sheets - Source of topics and (optionally) brands\n- Google Drive - Storage for generated HTML files\n- WordPress REST API - Blog post creation (drafts or published posts)\n- Slack - Final summary notification when the entire batch is complete\n\n## Ideal Use Case\n\n- Content teams and agencies managing a queue of blog topics in a spreadsheet\n- Marketers who want a hands-off pipeline from topic list to WordPress drafts\n- Teams who need generated HTML files stored in Drive for backup, review, or reuse\n- Any workflow where automation should handle the heavy lifting and humans only review the final drafts\n\n## Setup Instructions\n\n### Google Sheets\n\n- Create a sheet with columns like `Brand` and `Blog Title` or `Topic`.\n- In the Get Blog Topics node, set the sheet ID and range to match your sheet.\n- Add your Google Sheets credentials in n8n.\n\n### OpenRouter (LLM)\n\n- Add your OpenRouter API key as credentials.\n- In the OpenRouter Chat Model nodes, select your preferred models and options if you want to customize behavior.\n\n### Google Drive\n\n- Add Google Drive credentials.\n- Update the folder ID in the Upload file node to your target directory.\n\n### WordPress\n\n- In the Publish to WordPress node, replace the example URL with your site’s REST API endpoint.\n- Configure authentication (for example, Application Passwords or Basic Auth).\n- Adjust the `status` field (`draft` or `publish`) to match your desired workflow.\n\n### Slack\n\n- Add Slack OAuth credentials.\n- Set the channel ID in the Slack node where the final summary message should be posted.\n\n### Run the Workflow\n\n- Click Execute Workflow.\n- The workflow will loop through every row in the sheet, generating content, saving HTML files to Drive, and creating WordPress posts.\n- When all rows have been processed, a single Slack notification confirms completion.\n",
  "featuredImage": "/data/workflows/10697/10697.webp",
  "author": {
    "id": 101,
    "slug": "jonasfrewert",
    "name": "Jonas Frewert",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 247,
  "downloads": 24,
  "createdAt": "2025-11-10T16:42:37.956Z",
  "updatedAt": "2026-01-16T09:05:57.457Z",
  "publishedAt": "2025-11-10T16:42:37.956Z",
  "nodes": 18,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10697"
}