{
  "id": 7802,
  "slug": "7802",
  "title": "Auto-generate meeting minutes with GPT and share from Google Drive to Slack",
  "description": "### Who’s it for\nTeams who want to **automatically generate structured meeting minutes** from uploaded transcripts and instantly share them in Slack. Perfect for startups, project teams, or any company that collects meeting transcripts in Google Drive.\n\n---\n\n### How it works / What it does\nThis workflow automatically turns raw meeting transcripts into well-structured minutes in Markdown and posts them to Slack:\n\n1. **Google Drive Trigger** – Watches a specific folder. Any new transcript file added will start the workflow.  \n2. **Download File** – Grabs the transcript.  \n3. **Prep Transcript** – Converts the file into plain text and passes the transcript downstream.  \n4. **Message a Model** – Sends the transcript to OpenAI GPT for summarization using a structured system prompt (action items, decisions, N/A placeholders).  \n5. **Make Minutes** – Formats GPT’s response into a Markdown file.  \n6. **Slack: Send a message** – Posts a Slack message announcing the auto-generated minutes.  \n7. **Slack: Upload a file** – Uploads the full Markdown minutes file into the chosen Slack channel.  \n\nEnd result: your Slack channel always has clear, standardized minutes right after a meeting.\n\n---\n\n### How to set up\n1. **Google Drive**  \n   - Create a folder where you’ll drop transcript files.  \n   - Configure the folder ID in the Google Drive Trigger node.  \n2. **OpenAI**  \n   - Add your OpenAI API credentials in the *Message a Model* node.  \n   - Select a supported GPT model (e.g., `gpt-4o-mini` or `gpt-4`).  \n3. **Slack**  \n   - Connect your Slack account and set the target channel ID in the Slack nodes.  \n4. **Run the workflow** and drop a transcript file into Drive. Minutes will appear in Slack automatically.\n\n---\n\n### Requirements\n- Google Drive account (for transcript upload)  \n- OpenAI API key (for text summarization)  \n- Slack workspace (for message posting and file upload)\n\n---\n\n### How to customize the workflow\n- **Change summary structure**: Adjust the system prompt inside *Message a Model* (e.g., shorter summaries, language other than English).  \n- **Different output format**: Modify *Make Minutes* to output plain text, PDF, or HTML instead of Markdown.  \n- **New destinations**: Add more nodes to send minutes to email, Notion, or Confluence in parallel.  \n- **Multiple triggers**: Replace Google Drive trigger with Webhook if you want to integrate with Zoom or MS Teams transcript exports.\n\n---\n\n### Good to know\n- OpenAI API calls are billed separately. See [OpenAI pricing](https://openai.com/pricing).  \n- Files must be text-based (.txt or .md). For PDFs or docs, add a conversion step before summarization.  \n- Slack requires the bot user to be a member of the target channel, otherwise you’ll see a `not_in_channel` error.  \n",
  "featuredImage": "/data/workflows/7802/7802.webp",
  "author": {
    "id": 101,
    "slug": "lkwon",
    "name": "Lidia",
    "avatar": ""
  },
  "categories": [
    "AI Summarization",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 220,
  "downloads": 22,
  "createdAt": "2025-08-25T02:36:15.498Z",
  "updatedAt": "2026-01-16T08:52:28.526Z",
  "publishedAt": "2025-08-25T02:36:15.498Z",
  "nodes": 8,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7802"
}