{
  "id": 4678,
  "slug": "4678",
  "title": "Intelligent AI digest for security, privacy, and compliance feeds",
  "description": "**How it works**\nThis workflow acts like your own personal AI assistant, automatically fetching and summarizing the most relevant Security, Privacy, and Compliance news from curated RSS feeds. It processes only the latest articles (past 24 hours), organizes them by category, summarizes key insights using AI, and delivers a clean HTML digest straight to your inbox—saving you time every day.\n\n**Key Highlights**\n\n- Handles three independent tracks: Security, Privacy, and Compliance\n- Processes content from customizable RSS sources (add/remove easily)\n- Filters fresh articles, removes duplicates, and sorts by recency\n- Uses AI to summarize and format insights in a digestible format\n- Sends polished HTML digests via Gmail—one per category\n- Fully modular and extensible—adapt it to your needs\n\n**Personalization**\nYou can easily tailor the workflow:\n\n🎯 Customize feeds: Add or remove sources in the following Code nodes:\n```\nFetch Security RSS, Fetch Privacy Feeds, and Fetch Compliance Feeds\n```\n\n🔧 Modify logic: Adjust filters, sorting, formatting, or even AI prompts as needed\n\n🧠 Bring your own LLM: Works with Gemini, but easily swappable for other LLM APIs\n\n**Setup Instructions**\n\n- Requires Gmail and LLM (e.g., Gemini) credentials\n- Prebuilt with placeholders for RSS feeds and email output\n- Designed to be readable, maintainable, and fully adaptable",
  "featuredImage": "/data/workflows/4678/4678.webp",
  "author": {
    "id": 101,
    "slug": "niranjan",
    "name": "Niranjan G",
    "avatar": ""
  },
  "categories": [
    "SecOps",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 16984,
  "downloads": 1698,
  "createdAt": "2025-06-05T06:11:40.248Z",
  "updatedAt": "2026-01-16T08:35:36.556Z",
  "publishedAt": "2025-06-05T06:11:40.248Z",
  "nodes": 43,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4678"
}