{
  "id": 2344,
  "slug": "2344",
  "title": "Generating image embeddings via textual summarisation",
  "description": "This n8n template demonstrates an approach to image embeddings for purpose of building a quick image contextual search. Use-cases could for a personal photo library, product recommendations or searching through video footage.\n\n## How it works\n* A photo is imported into the workflow via Google Drive.\n* The photo is processed by the edit image node to extract colour information. This information forms part of our semantic metadata used to identify the image.\n* The photo is also processed by a vision-capable model which analyses the image and returns a short description with semantic keywords.\n* Both pieces of information about the image are combined with the metadata of the image to form a document describing the image.\n* This document is then inserted into our vector store as a text embedding which is associated with our image.\n* From here, the user can query the vector store as they would any document and the relevant image references and/or links should be returned.\n\n## Requirements\n* Google account to download image files from Google Drive.\n* OpenAI account for the Vision-capable AI and Embedding models.\n\n## Customise this workflow\n\nText summarisation is just one of many techniques to generate image embeddings. If the results are unsatisfactory, there are dedicated image embedding models such as [Google's vertex AI multimodal embeddings](https://cloud.google.com/vertex-ai/generative-ai/docs/embeddings/get-multimodal-embeddings).",
  "featuredImage": "/data/workflows/2344/2344.webp",
  "author": {
    "id": 101,
    "slug": "jimleuk",
    "name": "Jimleuk",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 9227,
  "downloads": 922,
  "createdAt": "2024-07-11T17:05:23.103Z",
  "updatedAt": "2026-01-16T08:24:10.163Z",
  "publishedAt": "2024-07-11T17:05:23.103Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/2344"
}