{
  "id": 11713,
  "slug": "11713",
  "title": "Automate vendor analysis & contract management with GPT-4o, Gmail, and Google Sheets",
  "description": " \n\n## How It Works\nSchedules automated vendor pricing analysis across multiple sources. Fetches delivery reliability and contract data, analyzes vendor performance using Claude AI, then distributes consolidated reports via Gmail and creates Google Sheets summaries. Target audience: procurement teams and business analysts managing multi-vendor relationships. Solves vendor evaluation bottlenecks by automating data collection, AI-driven analysis, and report distribution.\n\n## Workflow Steps\n**What:** Trigger → Scrapes vendor data (pricing, reliability, contracts) → Sends to vendor analysis agent → Branches to multiple outputs (Gmail notification, Google Sheets archive, Data parser).  \n\n## Setup Steps\n1. Configure Schedule Trigger timing. 2. Add scraper credentials (Vendor Pricing, Delivery Reliability, Contract Data nodes). 3. Connect Claude/OpenAI API key in Vendor Analysis Agent. 4. Authenticate Gmail account for notifications. 5. Link Google Sheets API for data storage.\n\n## Prerequisites\nOpenAI/Claude API key, Gmail credentials, Google Sheets API access, Vendor data sources (web scrapers or direct APIs).\n\n## Use Cases\nAutomate weekly vendor performance reviews, generate compliance reports for procurement teams \n\n## Customization\nModify trigger schedule, add/remove scraper nodes for new vendors, adjust Claude prompt for different analysis criteria \n\n## Benefits\nEliminates manual data gathering (hours to minutes), ensures consistent vendor evaluation criteria \n\n\n",
  "featuredImage": "/data/workflows/11713/11713.webp",
  "author": {
    "id": 101,
    "slug": "cschin",
    "name": "Cheng Siong Chin",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 87,
  "downloads": 8,
  "createdAt": "2025-12-11T16:20:46.999Z",
  "updatedAt": "2026-01-16T09:09:50.879Z",
  "publishedAt": "2025-12-11T16:20:46.999Z",
  "nodes": 28,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11713"
}