{
  "id": 7668,
  "slug": "7668",
  "title": "Write personalised direct messages for Instagram with Apify, OpenAI, GSheets",
  "description": "*This workflow contains community nodes that are only compatible with the self-hosted version of n8n.*\n\nFetch Instagram profile information with Apify and generate personalized DMs in Google Sheets. This is great for creator outreach, customer interviews, partnership prospecting, and streamlining your social Direct Messaging workflow. Saving hours per campaign or research study.\n\n## How it works\n* We read a list of Instagram accounts from a Google Sheet\n* We trigger the Apify Instagram Post Scraper task to fetch the latest post data per account\n* We pull the image URL of the newest post and analyze it with OpenAI Vision\n* We use the analysis plus account metadata to generate a personalized DM\n* We write the message back to the Google Sheet for easy sending and tracking\n\nNote: Both Apify and OpenAI provide free credits that can cover initial runs of this workflow (20.08.2025).\n\n## Set up steps\n* Copy Google Sheet template and add it in all Google Sheet nodes\n* Make sure that n8n has read & write permissions for your Google sheet.\n* Add your list of Instagram accounts in the first column in the Google sheet\n* Add Apify credentials (e.g. API key)\n* Create task for [Instagram Post Scraper](https://apify.com/apify/instagram-post-scraper) on Apify\n* Add OpenAI API credentials\n\n## What you can achieve\n**How do I scale creator outreach while keeping messages personal?**\nThis workflow pulls each profile’s latest post and bio, then generates a DM that references those specifics. One consistent prompt, fresh data per profile. Personal at scale.\n\n**How do I craft partnership or affiliate pitches that feel tailored to the creator’s audience?**\nThis n8n workflow spots niche, recent themes, and milestones, then inserts a targeted value prop like an affiliate code or UTM so the pitch mirrors their content and audience.\n\n**How can I personalize interview invites using details from a recent post or bio?**\nThis workflow opens with a concrete reference from the newest post or bio, states your interview topic, and adds a short CTA. If there’s no recent post, it switches to a bio-based hook.\n\n**How do I personalize at scale for thousands of profiles without duplicating outreach?**\nThis n8n workflow processes each handle once, logs status in Google Sheets, and skips already‑messaged rows, so you get unique, data-backed DMs across hundreds of profiles without repeats.",
  "featuredImage": "/data/workflows/7668/7668.webp",
  "author": {
    "id": 101,
    "slug": "michaelmuenzer",
    "name": "Michael Muenzer",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1191,
  "downloads": 119,
  "createdAt": "2025-08-20T21:53:00.537Z",
  "updatedAt": "2026-01-16T08:51:43.609Z",
  "publishedAt": "2025-08-20T21:53:00.537Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7668"
}