{
  "id": 8797,
  "slug": "8797",
  "title": "Automated hospital outreach system: Send personalized emails via Google Sheets & Gmail",
  "description": "### **Description:**\nThis workflow automates personalized email outreach to a list of hospitals. It uses a chat-based interface to accept a region and a list of hospital names, looks up their specific contact details from a structured Google Sheet, and sends a tailored email via Gmail.\n\n## Who’s it for\nThis template is perfect for healthcare startups, medical device sales representatives, or IT consultants who need to conduct targeted outreach to hospital administrators. It's designed for anyone looking to automate a personalized, region-specific email campaign without manual data entry.\n\n## How it works\n1.  **Trigger:** You provide input via a chat message. The first line is the region (e.g., `LUZON`), and each subsequent line is a hospital name.\n2.  **Parsing:** A Code node splits your message into a structured list of items for processing.\n3.  **Batching:** The workflow processes each hospital one by one for reliable execution.\n4.  **Data Lookup:** Based on the region, the workflow queries the corresponding sheet in a Google Sheets document to find the hospital's specific contact details.\n5.  **Email Delivery:** A personalized email is sent to the hospital's email address using Gmail, pulling data from the spreadsheet to customize the message.\n\n## How to set up\n1.  **Credentials:** Set up n8n credentials for **Google Sheets** and **Gmail** (using OAuth2 recommended).\n2.  **Google Sheet:** Duplicate the provided template Sheet structure. Your sheet must have columns like `Hospital Name` and `Main Email`.\n3.  **Workflow Configuration:** Replace the placeholder Google Sheet ID in the **Set Configuration** node with the ID of your own sheet.\n\n## Requirements\n*   An n8n instance (cloud or self-hosted).\n*   A Google account with access to Google Sheets and Gmail.\n*   The provided Google Sheets template structure.\n\n## How to customize\n*   **Email Template:** Modify the email subject and body in the **Send Gmail Message** node. Use placeholders like `{{ $json[\"Your Field\"] }}` to insert data from your Google Sheet.\n*   **Data Source:** Replace the Google Sheets node with another data source (e.g., Airtable, PostgreSQL) by ensuring it outputs data in a similar JSON format.\n*   **Output:** Instead of Gmail, use the SendBlue node to send an SMS or the Slack node to send a DM.\n\n---\n\n",
  "featuredImage": "/data/workflows/8797/8797.webp",
  "author": {
    "id": 101,
    "slug": "hwmr",
    "name": "Hans Wilhelm Radam",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Lead Nurturing"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 344,
  "downloads": 34,
  "createdAt": "2025-09-21T10:24:14.219Z",
  "updatedAt": "2026-01-16T08:57:42.973Z",
  "publishedAt": "2025-09-21T10:24:14.219Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8797"
}