{
  "id": 6663,
  "slug": "6663",
  "title": "Automated Web Scraper: Niche Job/Product Monitor With Telegram Alert",
  "description": "**How it works**\n\nThis workflow is your personal digital assistant for tracking specific information on websites that lack APIs or RSS feeds. It's perfect for keeping an eye on:\n\n- Niche job postings on specialized forums or company career pages.\n\n- Product availability or price changes on smaller e-commerce sites.\n\n- Any specific text or data appearing on a public webpage.\n\nIt automatically:\n\n- Visits a specified webpage on a schedule (e.g., hourly, daily).\n\n- Intelligently extracts specific data points (like job titles, links, product names, or stock status) from the page's HTML using advanced selectors.\n\n- Notifies you via Telegram when new relevant information is found or if a change occurs.\n\nStop manually refreshing pages and let automation bring the critical updates directly to you!\n\n**Set up steps**\n\nSetting up this workflow is more involved than basic automations due to the web scraping aspect, typically taking around 20-40 minutes. You'll need to:\n\n- Identify the exact URL of the webpage you want to monitor.\n\n- Learn how to find CSS Selectors or XPath for the specific data elements you want to extract from the webpage (a browser's developer tools are essential here).\n\n- Authenticate your Telegram account to receive notifications.\n\n- Optionally, set up an AI service (like OpenAI) if you want to summarize extracted content.\n\nAll detailed setup instructions and specific configuration guidance, including how to find CSS selectors, are provided within the workflow itself using sticky notes.",
  "featuredImage": "/data/workflows/6663/6663.webp",
  "author": {
    "id": 101,
    "slug": "piotrsobolewski",
    "name": "Piotr Sobolewski",
    "avatar": ""
  },
  "categories": [
    "Market Research",
    "AI Summarization"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1985,
  "downloads": 198,
  "createdAt": "2025-07-29T19:29:46.832Z",
  "updatedAt": "2026-01-16T08:46:20.079Z",
  "publishedAt": "2025-07-29T19:29:46.832Z",
  "nodes": 6,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6663"
}