{
  "id": 9961,
  "slug": "9961",
  "title": "Ai-powered lead scoring & personalized responses with JotForm, GPT, and Gmail",
  "description": "## Who's it for\nThis workflow is perfect for digital marketing agencies, sales teams, and business development professionals who want to automate lead qualification, scoring, and personalized outreach. If you're tired of manually reviewing every form submission and crafting individual responses, this template will save you hours while improving response quality.\n\n## What it does\nThis AI-powered lead management system automatically processes JotForm submissions through a sophisticated 6-step pipeline:\n\n1. **Captures leads** from JotForm submissions in real-time\n2. **Scores each lead** using AI (GPT-4.1-nano) based on budget, company fit, and project clarity\n3. **Logs all data** to Google Sheets with AI scores, tiers (high/medium/low), and reasoning\n4. **Enriches company information** by fetching industry, employee count, tech stack, and location data\n5. **Generates personalized emails** that reference the lead's specific needs and company insights\n6. **Sends tailored responses** via Gmail with tier-appropriate calls-to-action\n\nHigh-tier leads get priority treatment with direct calendar links, medium-tier leads receive consultation offers, and low-tier leads are sent helpful resources—all automatically.\n\n## How to set up\n\n### Requirements\n- JotForm account with a contact form (free tier works)\n- OpenAI API key with GPT-4.1-nano access\n- Google account for Sheets and Gmail\n- Company enrichment API endpoint (see setup guide below)\n\n### Setup steps\n\n1. **Clone this workflow** to your n8n instance\n2. **Configure JotForm Trigger**: Connect your JotForm account and select your contact form\n3. **Add OpenAI credentials**: Both AI nodes use the same OpenAI API key\n4. **Set up Google Sheets**: Create a new spreadsheet with columns: first_name, last_name, company, email, message, estimated_budget, ai_score, ai_tier, ai_reasoning\n5. **Configure Gmail**: Connect your Gmail account for sending responses\n6. **Set up enrichment API**: Deploy the company enrichment workflow (workflow #9960) and update the webhook URL in the \"API: Company Enrichment Request\" node\n\n### Company Enrichment API Setup\nThe enrichment API is a separate workflow that fetches company data. You can:\n- Use the [enrichment workflow template](https://drive.google.com/file/d/1OK0s6v9m-Hk0Esb1t4BhVT8wP41XkBLj/view?usp=sharing/)\n- Deploy it to your n8n instance\n- Update the webhook URL in the HTTP Request node to point to your deployed version\n\n## How to customize\n\n**Adjust AI scoring criteria**: Modify the system prompt in \"AI: Lead Scoring Analysis\" to match your ideal customer profile and budget thresholds\n\n**Customize email templates**: Edit the system prompt in \"AI: Generate Personalized Email\" to match your brand voice and offerings\n\n**Add more data points**: Extend the Google Sheets schema to capture additional form fields or enrichment data\n\n**Change email provider**: Swap Gmail for Outlook, SendGrid, or any SMTP service\n\n**Add notifications**: Insert a Slack or Discord node after lead scoring to alert your team about high-tier leads instantly\n\n**Implement lead routing**: Add an IF node after scoring to route high-value leads to senior team members.",
  "featuredImage": "/data/workflows/9961/9961.webp",
  "author": {
    "id": 101,
    "slug": "n8nstein",
    "name": "Naveen Choudhary",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 335,
  "downloads": 33,
  "createdAt": "2025-10-20T21:39:56.492Z",
  "updatedAt": "2026-01-16T09:02:46.375Z",
  "publishedAt": "2025-10-20T21:39:56.492Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9961"
}