{
  "id": 8082,
  "slug": "8082",
  "title": "Nano banana AI image editor via Telegram",
  "description": "# Nano Banana AI Image Editor\n\nTransform your Telegram photos with AI-powered image processing using the revolutionary Nano Banana technology. This workflow automatically receives photos via Telegram, processes them through Google's advanced Gemini 2.5 Flash vision model, and sends back intelligently enhanced images - all powered by the innovative Nano Banana processing pipeline.\n\n## Who's it for\n\nPerfect for content creators, social media managers, photographers, and anyone who wants to automatically enhance their Telegram photos with AI. Whether you're running a photo editing service, creating content for clients, or just want smarter image processing in your personal chats, the Nano Banana AI editor delivers professional-grade results.\n\n## How it works\n\nThe Nano Banana workflow creates an intelligent Telegram bot that processes images in real-time. When you send a photo with a caption to your bot, it automatically downloads the image, converts it to the proper format, sends it to Google's Gemini AI for analysis and enhancement, then returns the processed result. The Nano Banana engine optimizes every step for speed and quality.\n\n## How to set up\n\n1. **Create Telegram Bot:** Get your bot token from @BotFather on Telegram\n2. **OpenRouter Account:** Sign up at openrouter.ai for free Gemini access  \n3. **Configure Credentials:** Add your Telegram and OpenRouter API keys to n8n\n4. **Update Chat ID:** Replace \"YOUR_CHAT_ID_HERE\" with your actual Telegram chat ID\n5. **Activate Webhook:** Enable the Telegram trigger to start receiving messages\n\n## Requirements\n\n- n8n instance (cloud or self-hosted)\n- Telegram Bot API credentials\n- OpenRouter account (free tier available)\n- Basic understanding of webhook configuration\n\n## How to customize the workflow\n\nThe Nano Banana editor is highly customizable:\n\n- **Change AI Model:** Modify the model parameter in \"Nano Banana Image Processor\" node\n- **Add Filters:** Insert additional processing nodes before the AI analysis\n- **Custom Prompts:** Edit the text content sent to Gemini for different processing styles\n- **Multiple Chats:** Duplicate the final node for different Telegram destinations\n- **Error Handling:** Add conditional logic for failed processing attempts\n- **Batch Processing:** Extend to handle multiple images simultaneously\n\nThe Nano Banana technology ensures optimal performance while maintaining flexibility for your specific use cases.",
  "featuredImage": "/data/workflows/8082/8082.webp",
  "author": {
    "id": 101,
    "slug": "rawsun007",
    "name": "Roshan Ramani",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 6982,
  "downloads": 698,
  "createdAt": "2025-08-31T14:34:04.295Z",
  "updatedAt": "2026-01-16T08:54:02.876Z",
  "publishedAt": "2025-08-31T14:34:04.295Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8082"
}