{
  "id": 6007,
  "slug": "6007",
  "title": "Auto-convert OneDrive Word documents to PDF with Foxit and send via Gmail",
  "description": "## This n8n template demonstrates how to add a document conversion process to incoming Word documents in a OneDrive folder. Documents are converted to PDF and emailed to a reviewer.\n\nUse cases would be environments where incoming documents are dropped into cloud storage and a human needs to review them. By converting to PDF, it becomes easier to read in a consistent format in the browser.\n\n## How it works\n\n* Listen for new files added in a OneDrive folder, identified by an ID\n* Download the bits of the new document if the file was a Micrsoft Word document (the API I'm using can convert any Office document, but wanted to start simple)\n* Upload to Foxit's API service, convert to PDF, and download when done\n* Use GMail to mail the PDF to a human reviewer.\n\n## How to use\n\n* You'll need to determine a OneDrive folder ID to monitor, or select an entire account instead, just be careful when testing. \n* When the workflow is done, it emails to myself, so please connect your own GMail and set a preferred email address for testing. \n\n## Requirements\n\n* A Microsoft OneDrive account\n* Foxit developer account (https://developer-api.foxit.com)\n* A Gmail account\n* At least one Word document - we all have that, right?\n\n## Next Steps\n\nThis workflow could be modified to work with any Office style document, and could also upload the PDF version back to OneDrive. ",
  "featuredImage": "/data/workflows/6007/6007.webp",
  "author": {
    "id": 101,
    "slug": "raymondcamden",
    "name": "Raymond Camden",
    "avatar": ""
  },
  "categories": [
    "File Management"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1122,
  "downloads": 112,
  "createdAt": "2025-07-14T19:10:03.916Z",
  "updatedAt": "2026-01-16T08:42:38.813Z",
  "publishedAt": "2025-07-14T19:10:03.916Z",
  "nodes": 13,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6007"
}