{
  "id": 7842,
  "slug": "7842",
  "title": "QuickBooks Online MCP Server - add QuickBooks tool to any AI (like Claude)",
  "description": "## Video Introduction\n[![Video Walkthrough](https://vasarmilan-public.s3.us-east-1.amazonaws.com/blog_thumbnails/thumbnail_rec0EGjS8Q1AxvT1b.jpg)](https://youtu.be/mprQ4CY3yn0)\n\n#### Want to automate your inbox or need a custom workflow? [📞 Book a Call](https://smoothwork.ai/book-a-call/) | [💬 DM me on Linkedin](https://www.linkedin.com/in/mil%C3%A1n-v%C3%A1s%C3%A1rhelyi-3a9985123/)\n\n---\n\n## What This Workflow Does\n\nThis workflow creates an AI-powered chatbot that can answer natural language questions about your QuickBooks Online data. Using OpenAI's GPT models and the Model Context Protocol (MCP), the agent can retrieve customer information, analyze balances, and provide insights through a conversational interface. Users can simply ask questions like \"How many customers do we have?\" or \"What's our total customer balance?\" and get instant answers from live QuickBooks data.\n\n## Key Features\n\n- **Natural language queries**: Ask questions about your QuickBooks data in plain English\n- **MCP architecture**: Uses Model Context Protocol to manage tools efficiently, making it easy to expand with additional QuickBooks operations\n- **Public chat interface**: Share the chatbot URL with team members who need QuickBooks insights without direct access\n- **Real-time data**: Queries live QuickBooks data for up-to-date answers\n\n## Common Use Cases\n\n- Customer service teams checking account balances without logging into QuickBooks\n- Sales teams quickly looking up customer information\n- Finance teams getting quick answers about customer data\n- Managers monitoring key metrics through conversational queries\n\n## Setup Requirements\n\n**QuickBooks Developer Account**: Register at `developer.intuit.com` and create an app with Accounting scope permissions. You'll receive a Client ID and Client Secret.\n\n**Configure OAuth**: In your Intuit Developer dashboard, add the redirect URL provided by n8n when creating QuickBooks credentials. Set the environment to Sandbox for testing, or complete Intuit's app approval process for Production use.\n\n**OpenAI API**: Add your OpenAI API credentials to power the chat model. The workflow uses GPT-4.1-mini by default, but you can select other models based on your performance and cost requirements.\n\n**Chat Access**: The chat trigger is set to public by default. Configure access settings based on your security requirements before sharing the chat URL.",
  "featuredImage": "/data/workflows/7842/7842.webp",
  "author": {
    "id": 101,
    "slug": "vasarmilan",
    "name": "Milan Vasarhelyi - SmoothWork",
    "avatar": ""
  },
  "categories": [
    "AI Chatbot",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 216,
  "downloads": 21,
  "createdAt": "2025-08-25T13:46:14.362Z",
  "updatedAt": "2026-01-16T08:52:35.282Z",
  "publishedAt": "2025-08-25T13:46:14.362Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7842"
}