{
  "id": 11880,
  "slug": "11880",
  "title": "Automate social media content planning with Llama 3.3 AI, trending topics & Google Suite",
  "description": "**How it works:**\n\n1. Daily Trigger:\nEvery morning at 8 AM, the workflow is automatically triggered.\n\n2. Fetch Trending Topics:\nThe workflow collects trending topics from external sources, such as news RSS feeds and Reddit popular posts. These trends are merged and summarized to provide up-to-date context for content generation.\n\n3. Read Active Campaigns:\nThe workflow reads all rows from the “Active Campaigns” Google Sheet, but only processes campaigns with a status of \"active\" to avoid generating content for paused or inactive campaigns.\n\n4. Enrich Campaigns with Trends:\nEach active campaign is enriched with the latest trending topics, so the generated content can reference current events or popular themes.\n\n5. AI Content Generation:\nFor each enriched campaign, Groq AI generates:\n- An engaging post caption tailored to the platform and target audience\n- Creative direction with visual suggestions\n- Relevant hashtags (5-10)\n- Best posting time recommendation for the platform\n\n6. Quality Scoring:\nThe workflow calculates a quality score for each generated content idea, considering factors like caption length, hashtag count, and creative direction.\n\n7. Append to Google Sheets:\nThe generated content ideas, along with their quality scores and other details, are appended to the “Daily Content Plan” Google Sheet for record-keeping and team collaboration.\n\n8. Schedule in Google Calendar:\nFor each campaign, an event is created in Google Calendar with the content details and recommended posting time, ensuring the team is reminded to review or publish the content.\n\n9. Daily Email Summary (Optional):\nAt the end of the process, a summary email can be sent to the team, including statistics such as the number of campaigns processed, average quality score, and a platform breakdown.\n\n\n**Set up steps:**\n\n1. Prepare Your Google Sheets:\n\n- Create a sheet named “Active Campaigns” with columns: Project Name, Theme, Target Audience, Platform, and Status (to mark campaigns as active/inactive).\n- Create another sheet named “Daily Content Plan” with columns for Project Name, Date, Platform, Caption, Creative Direction, Hashtags, and any other details you want to track.\n\n2. Connect Google Services to n8n:\n- In n8n, set up and authenticate your Google Sheets and Google Calendar credentials. You can find authentication information in the n8n documentation for Google credentials.\n\n3. Add a Cron Node:\nDrag in a Cron node and set it to trigger every day at 8:00 AM.\n\n4. Read Campaigns from Google Sheets:\n- Add a Google Sheets node.\n- Set the operation to “Read Rows” and select your “Active Campaigns” sheet.\n- (Optional) Use a Filter or IF node to process only rows where Status is “active”.\n\n5. (Optional) Fetch Trending Topics:\nIf you want to enrich your content with trending topics, add nodes to fetch data from RSS feeds, Reddit, or other sources.\n\n6. Process Each Campaign:\n- Use a SplitInBatches node to process each campaign row individually.\n\n7. Generate Content Ideas with Groq AI:\n- Add a Groq AI node (or OpenAI node if Groq is not available).\n- Configure the prompt to generate a content idea using the campaign’s theme, target audience, and platform. You can reference fields from the Google Sheets node using expressions like $(\"Google Sheets\").item.json['Theme'].\n\n8. Append Results to “Daily Content Plan”:\n- Add another Google Sheets node.\n- Set the operation to “Append” and select your “Daily Content Plan” sheet.\n- Map the generated content fields to the appropriate columns.\n\n9. Schedule Events in Google Calendar:\n- Add a Google Calendar node.\n- Set the operation to “Create Event”.\n- Use the project name and content idea for the event title and description, and set the event time as needed.\n\n10. (Optional) Send a Daily Summary Email:\n- Add an Email node to send a summary of the day’s content plan to your team.\n\n11. Test the Workflow:\n- Run the workflow manually to ensure all steps work as expected.\n- Check that new content ideas appear in the “Daily Content Plan” sheet and that events are created in Google Calendar.\n\n12. Activate the Workflow:\n- Once you’ve confirmed everything works, activate the workflow so it runs automatically every morning.",
  "featuredImage": "/data/workflows/11880/11880.webp",
  "author": {
    "id": 101,
    "slug": "digimetalab",
    "name": "DigiMetaLab",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 152,
  "downloads": 15,
  "createdAt": "2025-12-17T00:52:43.444Z",
  "updatedAt": "2026-01-16T09:10:31.390Z",
  "publishedAt": "2025-12-17T00:52:43.444Z",
  "nodes": 26,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11880"
}