{
  "id": 4250,
  "slug": "4250",
  "title": "Extract & summarize B2B leads from Crunchbase with Bright Data, GPT-4o & Google Sheets",
  "description": "### Who this is for\nThe Crunchbase B2B Lead Discovery Pipeline is designed for sales teams, B2B marketers, business analysts, and data operations teams who need a reliable way to extract, structure, and summarize company information from Crunchbase to fuel lead generation and market intelligence.\n\nThis workflow is ideal for:\n\n1. **Sales Development Reps (SDRs)** - Needing structured leads from Crunchbase\n\n2. **Marketing Analysts** - Generating segmented outreach lists\n\n3. **Growth Teams** - Identifying trending B2B startups\n\n4. **RevOps Teams** - Automating company research pipelines\n\n5. **Data Teams** - Consolidating insights into Google Sheets for dashboards\n\n### What problem is this workflow solving?\n\nManual extraction of company data from Crunchbase is time-consuming, inconsistent, and often lacks the contextual summary required for sales enablement or growth targeting. \n\nThis workflow automates the extraction, transformation, summarization, and delivery of Crunchbase company data into structured formats, making it instantly usable for B2B targeting and analysis.\n\nIt solves:\n\n- The difficulty of scaling lead discovery from Crunchbase\n\n- The need to summarize raw textual content for quick insights\n\n- The lack of integration between web scraping, LLM processing, and storage\n\n### What this workflow does\n- **Markdown to Textual Data Extractor**: Takes raw scraped markdown from Crunchbase and converts it into readable plain text using a basic LLM chain\n\n- **Structured Data Extraction**: Applies a parsing model (OpenAI) to extract structured fields such as company name, funding rounds, industry tags, location, and founding year\n\n- **Summarization Chain**: Generates an executive summary from the raw Crunchbase text using a summarization prompt template\n\n- **Send to Google Sheets**: Adds the structured data and summary into a Google Sheet for team access and further processing\n\n- **Persist to Disk**: Saves both raw and structured data files locally for archiving or further use\n\n- **Webhook Notification**: Sends a structured payload to a webhook endpoint (e.g., Slack, CRM, internal tools) with lead insights\n\n### Pre-conditions\n\n1. You need to have a [Bright Data](https://brightdata.com/) account and do the necessary setup as mentioned in the \"Setup\" section below.\n2. You need to have an OpenAI Account.\n\n### Setup\n- Sign up at [Bright Data](https://brightdata.com/).\n- Navigate to Proxies & Scraping and create a new Web Unlocker zone by selecting Web Unlocker API under Scraping Solutions.\n- In n8n, configure the Header Auth account under Credentials (Generic Auth Type: Header Authentication).\n![Header Authentication.png](fileId:1345)\nThe Value field should be set with the\n**Bearer XXXXXXXXXXXXXX**. The XXXXXXXXXXXXXX should be replaced by the Web Unlocker Token.\n- In n8n, Configure the Google Sheet Credentials with your own account. Follow this documentation - [Set Google Sheet Credential](https://docs.n8n.io/integrations/builtin/credentials/google/)\n- In n8n, configure the OpenAi account credentials.\n- Ensure the URL and Bright Data zone name are correctly set in the **Set URL, Filename and Bright Data Zone** node.\n- Set the desired local path in the **Write a file** to disk node to save the responses.\n\n### How to customize this workflow to your needs\n\n**LLM Prompt Customization** : \n- Modify the extraction prompt to include additional fields like revenue, social links, leadership team\n\n- Adjust summarization tone (e.g., executive summary, sales-focused snapshot or marketing digest)\n\n**File Persistence**\n\n- Store raw markdown, extracted JSON, and summary text separately for audit/debug\n\n**Webhook Notification**\n\n- Connect to CRM (e.g., HubSpot, Salesforce) via webhook to automatically create leads\n\n- Send Slack notifications to alert sales reps when a new high-potential company is discovered",
  "featuredImage": "/data/workflows/4250/4250.webp",
  "author": {
    "id": 101,
    "slug": "ranjancse",
    "name": "Ranjan Dailata",
    "avatar": ""
  },
  "categories": [
    "Lead Generation",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 1212,
  "downloads": 121,
  "createdAt": "2025-05-20T23:51:39.434Z",
  "updatedAt": "2026-01-16T08:33:32.524Z",
  "publishedAt": "2025-05-20T23:51:39.434Z",
  "nodes": 21,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4250"
}