{
  "id": 9862,
  "slug": "9862",
  "title": "Automated lead qualification voice agent with OpenAI GPT, Twilio, Elevenlabs and Gmail",
  "description": "## What is this?\n\n### This workflow is a Lead Qualification Voice Agent automation template built in n8n. It automates the process of qualifying leads by initiating outbound calls, analyzing call transcripts, updating lead data, and sending follow-up emails. The workflow integrates Google Sheets, OpenAI, and Twilio (via ElevenLabs API) to streamline lead management for sales or customer success teams.\n\n## 1. Initiate Call\n### Purpose: This step starts the lead qualification process by detecting new leads and preparing to contact them.\n### How it works:\n- The workflow is triggered when a new lead is added to your data source (such as a new row in Google Sheets, using the “Google Sheets Trigger” node).\n- The trigger node captures essential lead information (e.g., name, phone number, service of interest) from the new entry.\n- The workflow then prepares a personalized call script or opener, often using an AI node (like OpenAI) to generate a friendly and relevant introduction based on the lead’s details.\n- An outbound call is initiated to the lead’s phone number using a telephony integration node (such as HTTP Request to ElevenLabs or Twilio).\n### Note:\n- Ensure your trigger node is correctly set up to monitor the right data source and columns.\n- Configure the telephony node with valid API credentials and the correct phone number field.\n- Optionally, customize the AI prompt to tailor the call opener to your business context.\n\n## 2. Fetch Client Data\n### Purpose: This step retrieves detailed information about the lead from your data source (such as a CRM, database, or Google Sheets).\n### How it works:\n- The workflow uses a data retrieval node (such as Google Sheets, HTTP Request, or a database node) to fetch client details based on a unique identifier (like phone number or email) captured in the trigger step.\n- The node is configured to query the data source for all relevant fields, such as the lead’s name, company, previous interactions, and any custom attributes important for your qualification process.\n- The fetched data is then made available to subsequent nodes, allowing for dynamic personalization of the call script and follow-up actions.\n### Note:\n- Ensure your data source is up-to-date and contains all necessary fields for lead qualification.\n\n## 3. Outbound Call Processing\n### Purpose: To manage the workflow after the outbound call is initiated, including handling call results, analyzing transcripts, and updating lead status.\n### How it works:\n- After the call is placed (using a telephony integration node), the workflow waits for the call to complete. This can be achieved using a webhook node (if your provider supports callbacks) or a polling node to check call status.\n- Once the call is finished, the workflow retrieves the call outcome (e.g., answered, voicemail, failed) and, if available, the call transcript.\n- The transcript can be sent to an AI node (like OpenAI) for analysis—such as extracting intent, sentiment, or key information discussed during the call.\n- Based on the analysis, the workflow updates the lead’s status in your data source (e.g., marking as “Qualified,” “Needs Follow-up,” or “Unreachable”).\n- Optionally, the workflow can trigger additional actions, such as sending a follow-up email, notifying a sales rep, or logging the interaction in your CRM.\n\n### Note:\n- Use webhook nodes for real-time call result processing if your telephony provider supports it.\n- Log all call results and analysis for future reference and reporting.\n\n## Prerequisities\n- OpenAI\n- Google Sheets\n- Twilio\n- Elevenlabs: \n  - Import the twilio number into Elevenlabs\n  - Set up an agent in Elevenlabs\n  - Set up prompt into Elevenlabs\n  - Set up webhooks for fetch client initiation data and post call data\n\n\n## Customization\n- Change Data Source: Swap the Google Sheets node for another data source (e.g., Airtable, MySQL) as needed.\n- Modify Call Script: Edit the OpenAI prompt to generate different call openers or scripts based on your use case.\n- Adjust Call Logic: Modify the outbound call node to use a different telephony provider or to handle call scheduling.\n- Notification Options: Integrate with email, chat, or notification services to alert your team of qualified leads.\n",
  "featuredImage": "/data/workflows/9862/9862.webp",
  "author": {
    "id": 101,
    "slug": "jainik",
    "name": "Jainik Sheth",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 802,
  "downloads": 80,
  "createdAt": "2025-10-18T13:26:16.936Z",
  "updatedAt": "2026-01-16T09:02:22.328Z",
  "publishedAt": "2025-10-18T13:26:16.936Z",
  "nodes": 20,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9862"
}