{
  "id": 7838,
  "slug": "7838",
  "title": "Automated export of Quickbooks Online data with n8n - with tutorial",
  "description": "## Video Introduction\n[![Video Walkthrough](https://vasarmilan-public.s3.us-east-1.amazonaws.com/blog_thumbnails/thumbnail_rec0EGjS8Q1AxvT1b.jpg)](https://youtu.be/mprQ4CY3yn0)\n\n#### Want to automate your inbox or need a custom workflow? [📞 Book a Call](https://smoothwork.ai/book-a-call/) | [💬 DM me on Linkedin](https://www.linkedin.com/in/mil%C3%A1n-v%C3%A1s%C3%A1rhelyi-3a9985123/)\n\n---\n\n## Overview\n\nThis workflow automatically exports customer balance data from QuickBooks to Google Sheets on a monthly basis. It eliminates manual data entry and creates a historical record of customer balances that updates automatically, making it easy to track payment trends, identify outstanding balances, and monitor customer financial health over time.\n\n## Key Features\n\n- **Automated Monthly Reporting**: Runs on the first day of each month to capture a snapshot of all customer balances\n- **Clean Data Structure**: Extracts only the essential fields (Customer ID, Balance, Email, and Period) for easy analysis\n- **Historical Tracking**: Each monthly run appends new data to your Google Sheet, building a timeline of customer balances\n- **No Manual Work**: Once configured, the workflow runs completely hands-free\n\n## Common Use Cases\n\n- Track customer payment patterns and identify accounts with growing balances\n- Create monthly reports for management or finance teams\n- Build dashboards and visualizations from historical QuickBooks data\n- Monitor customer account health without logging into QuickBooks\n\n## Setup Requirements\n\n**QuickBooks Developer Account**: Register at `developer.intuit.com` and create a new app in the App Dashboard. Select the 'Accounting' scope for permissions. You'll receive a Client ID and Client Secret to configure your n8n credentials.\n\n**Credentials**: Set up QuickBooks OAuth2 credentials in n8n using your app's Client ID and Client Secret. Use 'Sandbox' environment for testing or 'Production' for live data (requires Intuit app approval). Also connect your Google Sheets account.\n\n**Google Sheet**: Create a spreadsheet with column headers matching the workflow output: Period, Id, Balance, and Email.\n\n## Configuration\n\n- **Schedule**: The workflow runs monthly on the first day at 8 AM. Modify the Schedule Trigger to change timing or frequency\n- **Spreadsheet URL**: Update the 'Export to Google Sheets' node with your destination spreadsheet URL\n- **Data Fields**: Customize the 'Prepare Customer Data' node to extract different customer fields if needed",
  "featuredImage": "/data/workflows/7838/7838.webp",
  "author": {
    "id": 101,
    "slug": "vasarmilan",
    "name": "Milan Vasarhelyi - SmoothWork",
    "avatar": ""
  },
  "categories": [
    "CRM",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 244,
  "downloads": 24,
  "createdAt": "2025-08-25T12:49:54.531Z",
  "updatedAt": "2026-01-16T08:52:33.712Z",
  "publishedAt": "2025-08-25T12:49:54.531Z",
  "nodes": 7,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7838"
}