{
  "id": 8402,
  "slug": "8402",
  "title": "Generate AI-curated sales quotes with OpenAI, Qdrant & CraftMyPDF PDF delivery",
  "description": "## 👀 Short Description\nTurn form submissions into AI-curated quotes with SKU selection straight from Qdrant, branded PDF generation, and automatic email—now streamlined for quoting only (FAQ removed). (Improved from the previous workflow: [Automated Request-to-Quote System with OpenAI, Google Sheets & CraftMyPDF Email Delivery](https://n8n.io/workflows/8239-automated-request-to-quote-system-with-openai-google-sheets-and-craftmypdf-email-delivery/))\n\n\n\n## 🎉What’s new vs. the old version\n- Products now come directly from Qdrant (no Google Sheets catalog in the loop).\n- Focused quote-only flow — removed FAQ/RAG nodes for a leaner, faster pipeline.\n- Agent enforces a JSON-only contract, keeping pricing/stock grounded in Qdrant payloads.\n- Easier to maintain; fewer moving parts and lower token usage.\n\n\n## 📄 What this workflow does\n- Captures lead details via Form: Request a Quote.\n- Searches your Qdrant collection (products) for relevant SKUs by keyword, use-case, features, and budget hints.\n- An AI Agent (OpenAI) selects in-stock SKUs, respects min_qty, and returns a strict JSON quote (optional discount ≤ 10%).\n- A Code step computes line totals, discount, VAT, generates a unique invoice_number (e.g., Q-YYYYMMDD-ABCDE), and validates or falls back the due_date.\n- CraftMyPDF renders a branded PDF; the file is fetched and SMTP emails the quote to the customer.\n\n\n## 👤 Who this is for\n- SMBs and sales teams needing instant, accurate quotes from website forms.\n- Ops teams storing product data in Qdrant and wanting AI-assisted SKU selection.\n- Agencies or shops that must generate consistent, branded PDFs and send them automatically.\n\n\n## ✅ Requirements\n- Self-hosted n8n instance.\n- Qdrant collection (default: products) with payload fields:\n-  sku, name, uom, unit_price, currency, in_stock (true/false), min_qty, handle/url, features.\n- Connected credentials: OpenAI (or compatible), Qdrant API, CraftMyPDF, SMTP.\n- A CraftMyPDF template aligned with the Code node output (invoice_number, items[], gross_total, etc.).\n\n\n## ⚙️ How to set up\n1. Import the workflow JSON into n8n.\n2. In Qdrant Vector Store (Products), set collection=products and your Qdrant API credentials.\n3. In Sales Quote Agent, keep or change the model (default gpt-4.1-mini) and the JSON-only system prompt.\n4. In Create a PDF, set your CraftMyPDF templateId.\n5. In Email: Send Quote, set fromEmail and SMTP credentials.\n6. Submit a test form; verify: Agent JSON → PDF render → email delivery.\n7. (Optional) Adjust defaults in the Code node: vat_pct (default 10), payment_terms, currency fallback, valid_days.\n\n\n## 🔁 How it works (end-to-end)\n1. Trigger → Form captures: Full Name, Email, Company, Requirements, Budget Min/Max, Need By, Notes.\n2. Product Search → Agent calls PRODUCTS_QDRANT to retrieve relevant SKUs and payload fields from Qdrant.\n3. Agent Quote → Selects SKUs and qty, applies pricing and ≤10% discount.\n\n\n## 💡 About Margin AI\n[Margin AI](https://marginai.co/) is your AI Service Companion. We help organizations design intelligent, human-centric automation — from content pipelines and branding workflows to customer insights and sales enablement. Our tailored AI solutions scale marketing, operations, and creative processes with ease.",
  "featuredImage": "/data/workflows/8402/8402.webp",
  "author": {
    "id": 101,
    "slug": "cong-nguyen",
    "name": "Cong Nguyen",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "AI RAG"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 97,
  "downloads": 9,
  "createdAt": "2025-09-09T08:04:57.993Z",
  "updatedAt": "2026-01-16T08:55:37.946Z",
  "publishedAt": "2025-09-09T08:04:57.993Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/8402"
}