{
  "id": 7048,
  "slug": "7048",
  "title": "Auto-create GitHub PRs & JIRA updates from git commit commands (multi-repo)",
  "description": "# This n8n template from [Intuz](https://www.intuz.com/) provides a complete and automated solution for scaling your DevOps practices across multiple repositories.\n\nAre you tired of the repetitive dance between git push, creating a pull request in GitHub, updating the corresponding task in JIRA, and then manually notifying your team in Slack, or Notion? \n\nThis template puts your entire post-commit workflow on autopilot, creating a seamless and intelligent bridge between your code and your project management.\n\nBy embedding specific keywords and a JIRA issue ID into your git commit commands, this workflow automatically creates a Pull Request in the correct GitHub repository and updates the corresponding JIRA ticket. This creates a complete, centralized system that keeps all your projects synchronized, providing a massive efficiency boost for teams managing a diverse portfolio of codebases.\n\n## Who This Template Is For?\n\nThis template is a must-have for any organization looking to streamline its software development lifecycle (SDLC). It’s perfect for:\n\n- Development Teams: Eliminate tedious, manual tasks and enforce a consistent workflow, allowing developers to stay focused on coding.\n- DevOps Engineers: A ready-to-deploy solution that integrates key developer tools without weeks of custom scripting.\n- Engineering Managers & Team Leads: Gain real-time visibility into development progress and ensure processes are followed without constant check-ins.\n- Project Managers: Get accurate, automatic updates in JIRA the moment development work is completed, improving project tracking and forecasting.\n\n\n## Step-by-Step Setup Instructions\n\nFollow these steps carefully to configure the workflow for your environment.\n\n**1. Connect Your Tools (Credentials)**\n- GitHub: Create credentials with repo scope to allow PR creation.\n- JIRA: Create an API token and connect your JIRA Cloud or Server instance.\n- Slack: Connect your Slack workspace using OAuth2.\n- Notion: Connect your Notion integration token.\n\n**2. Configure the GitHub Webhook (For Each Repository)**\n\nThis workflow is triggered by a GitHub webhook. You must add it to every repository you want to automate.\n- First, Save and Activate the n8n workflow to ensure the webhook URL is live.\n- In the n8n workflow, copy the Production URL from the Webhook node.\n- Go to your GitHub repository and navigate to Settings &gt; Webhooks &gt; Add webhook.\n- In the Payload URL field, paste the n8n webhook URL.\n- Change the Content type to application/json.\n- Under \"Which events would you like to trigger this webhook?\", select \"Just the push event.\"\n- Click \"Add webhook.\" Repeat this for all relevant repositories.\n\n**3. Configure the JIRA Nodes (Crucial Step)**\n\nYour JIRA project has unique IDs for its statuses. You must update the workflow to match yours.\n\n- Find the two JIRA nodes named \"Update task status after PR\" and \"Update the task status without PR.\"\n- In each node, go to the Status ID field.\n- Click the dropdown and select the status that corresponds to \"Done\" or \"Development Done\" in your specific JIRA project workflow. The list is fetched directly from your connected JIRA instance.\n\n**4. Configure Notification Nodes**\n\nTell the workflow where to send updates.\n\n- For Slack: Open the two nodes named \"Send message in slack...\" and select your desired channel from the Channel ID dropdown.\n- For Notion: Open the two nodes named \"Append a block in notion...\" and paste the URL of the target Notion page or database into the Block ID field.\n\n**5. Final Activation**\n\nOnce all configurations are complete, ensure the workflow is Saved and the toggle switch is set to Active. You are now ready to automate!\n\n\n\n## Customization Guidance\n\nThis template is a powerful foundation. Here’s how you can adapt it to your team's specific needs.\n\n**1. Changing the PR Title or Body:**\n\n- Go to the \"Request to create PR\" (HTTP Request) node.\n- In the JSON Body field, you can edit the title and body expressions. For example, you could add the committer's name ({{$('Webhook').item.json.body.pusher.name }}) or a link back to the JIRA task.\n\n**2. Adapting to a Fixed Branching Strategy:**\n\n- If your team always creates pull requests against a single branch (e.g., develop), you can simplify the workflow.\n- In the \"Request to create PR\" node, change the base value in the JSON body from {{...}} to your static branch name: \"base\": \"develop\".\n- You can then remove the base branch logic from the \"Commit Message Breakdown\" (Code) node.\n\n**3. Modifying Notification Messages:**\n- The text sent to Slack and Notion is fully customizable.\n- Open any of the Slack or Notion nodes and edit the text fields. You can include any data from previous nodes, such as the PR URL ({{ $('Request to create PR').item.json.body.html_url }}) or the repository name.\n\n**4. Adjusting the Commit Regex for Different Conventions:**\n\n- This is an advanced customization. If your team uses a different commit format (e.g., (DEV-123) instead of DEV-123), you can edit the regular expression in the \"Commit Message Breakdown\" (Code) node. Be sure to test your changes carefully. \n\n**5. Adding/Removing Notification Channels:**\n\n- Don't use Notion? Simply delete the two Notion nodes.\n- Want to send an email instead? Add a Gmail or SMTP node in parallel with a Slack node and configure it with the same data.\n\n\n## Connect with us\n- Website: https://www.intuz.com/services\n- Email: getstarted@intuz.com\n- LinkedIn: https://www.linkedin.com/company/intuz\n- Get Started: https://n8n.partnerlinks.io/intuz\n\n## For Custom Worflow Automation\nClick here- [Get Started](https://www.intuz.com/get-started)",
  "featuredImage": "/data/workflows/7048/7048.webp",
  "author": {
    "id": 101,
    "slug": "intuz",
    "name": "Intuz ",
    "avatar": ""
  },
  "categories": [
    "DevOps"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 325,
  "downloads": 32,
  "createdAt": "2025-08-06T12:01:43.057Z",
  "updatedAt": "2026-01-16T08:48:22.714Z",
  "publishedAt": "2025-08-06T12:01:43.057Z",
  "nodes": 39,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7048"
}