{
  "id": 6533,
  "slug": "6533",
  "title": "Personalized thank-you emails with website scraping, GPT-4o, and Gmail",
  "description": "## Overview\nImpress your leads with ultra-personalized “thank you” emails that look hand-written — sent automatically seconds after they submit your intake form.\n\nThis workflow instantly scrapes the prospect's website, extracts meaningful copy, and uses AI to write a custom thank-you message referencing something specific from their site. It gives the impression you immediately reviewed their business and crafted a thoughtful reply — without lifting a finger.\n\n### Who’s it for\n- Agencies and consultants using intake forms  \n- Freelancers booking discovery calls  \n- B2B businesses that want high-touch first impressions  \n- Sales teams automating initial follow-ups  \n\n### How it works\n- Triggered when a form (e.g. Tally, Typeform) is submitted  \n- Scrapes the website URL provided in the form  \n- Converts HTML to Markdown and extracts plain copy  \n- Uses AI to write a personalized thank-you message referencing the site  \n- Waits briefly to simulate real typing delay  \n- Sends the message via Gmail (or any email provider)\n\n### Example use case\n&gt; Prospect submits a form with their website: `coolstartup.ai`  \n&gt;  \n&gt; 30 seconds later, they receive:  \n&gt;  \n&gt; _“Thanks for reaching out! I just checked out Cool Startup’s homepage — love the clean UX and mission around AI for teams. Looking forward to diving into how we might collaborate!”_\n\n### How to set up\n1. Connect your form tool (e.g. Tally or Typeform)  \n2. Connect Gmail or another email provider  \n3. Customize the AI prompt to match your tone  \n4. Set the wait time (e.g. 30 seconds) for a realistic delay  \n5. Update your website scraping logic if needed  \n\n### Requirements\n- Form tool with webhook support  \n- OpenAI (or other LLM) credentials  \n- Email sending integration (Gmail, Mailgun, Postmark, etc.)\n\n### How to customize\n- Edit the email tone (casual, formal, funny, etc.)  \n- Add CRM integration to log form submission and response  \n- Trigger additional workflows like lead scoring or Slack alerts  \n- Add fallback logic if the website doesn’t scrape cleanly\n",
  "featuredImage": "/data/workflows/6533/6533.webp",
  "author": {
    "id": 101,
    "slug": "abdulmir",
    "name": "Abdul Mir",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 782,
  "downloads": 78,
  "createdAt": "2025-07-27T15:27:41.560Z",
  "updatedAt": "2026-01-16T08:45:31.084Z",
  "publishedAt": "2025-07-27T15:27:41.560Z",
  "nodes": 11,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6533"
}