{
  "id": 11337,
  "slug": "11337",
  "title": "Automated lead nurturing with Gemini AI, Telegram, and Gmail reply detection",
  "description": "# Purpose and Audience\nThis n8n workflow automates the entire lead nurturing process from initial contact through a 3-email follow-up sequence, with intelligent reply detection and personalized AI-generated content. It's designed to save sales teams countless hours while maintaining a personal touch in every interaction.\n\n## What It Does\nThis workflow orchestrates a comprehensive lead management system that:\n1. Captures leads via Telegram: Sales agents submit lead information (name, company, email, notes) through a Telegram bot after phone calls\n2. Generates personalized emails: Uses AI (Google Gemini) to create contextually relevant, personalized emails based on conversation notes and sequence position\n3. Sends automated follow-ups: Delivers a 3-email nurture sequence with strategic timing (initial email, 24-hour follow-up, final follow-up)\n4. Tracks engagement: Monitors email opens and replies in real-time\n5. Detects responses: Automatically checks Gmail daily for lead replies and stops the sequence when detected\n6. Updates lead status: Maintains accurate lead status throughout the journey (active → 2nd follow-up sent → 3rd follow-up sent → replied)\n7. Provides real-time notifications: Sends Telegram alerts to agents when emails are sent, replies are received, or sequences complete\n8. Stores all communications: Archives email content and metadata in a structured data table for reference and analysis\n\nThe workflow intelligently adapts email tone and content based on sequence position—warm and conversational for first contact, value-adding for second follow-up, and brief yet respectful for the final touchpoint.\n\n## Who Is It For\nThis workflow is perfect for:\n- Sales teams managing multiple leads and needing consistent follow-up without manual effort\n- Small businesses looking to professionalize their outreach without hiring additional staff\n- Account executives who want to focus on conversations rather than email scheduling\n- Founders and solopreneurs juggling sales alongside other responsibilities\n- Marketing agencies managing client outreach campaigns\n- Anyone who has promising leads but struggles with timely, personalized follow-up\n\n## How to Setup\nPrerequisites\nBefore implementing this workflow, ensure you have:\n\n- Telegram Bot (for lead submission and notifications)\n- SMTP Connection (for sending emails)\n- Gmail Node Connection (for reply detection)\n- Data Table with the following columns:\nname\nemail\ncompany\nnotes\nstatus\nemailSequenceNumber\nlastSentDate\nfirst_email_content\nfirst_email_sbjct\nsecond_email_content\nsecond_email_sbjct\nthird_email_content\nthird_email_sbjct\n(Table name: leads_test)\n- Gemini API Key (for AI-powered email generation)\n\n## Setup Instructions\nOnce you have all prerequisites ready, follow the provided setup tutorials for complete setup and configuration.",
  "featuredImage": "/data/workflows/11337/11337.webp",
  "author": {
    "id": 101,
    "slug": "malikx",
    "name": "Malik Hashir",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 53,
  "downloads": 5,
  "createdAt": "2025-11-28T17:56:57.466Z",
  "updatedAt": "2026-01-16T09:08:26.612Z",
  "publishedAt": "2025-11-28T17:56:57.466Z",
  "nodes": 47,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/11337"
}