{
  "id": 10004,
  "slug": "10004",
  "title": "Two-way property repair management system with Google Sheets & Drive",
  "description": "\n\n## This workflow automates the repair request process between **tenants** and **building managers**, keeping all updates organized in a single spreadsheet. It is composed of **two coordinated workflows**, as two separate triggers are required — one for new repair submissions and another for repair updates. A **Unique Unit ID** that corresponds to individual units is attributed to each request, and **timestamps** are used to coordinate repair updates with specific requests. \n\nGeneral use cases include: \n- **Property managers** who manage multiple buildings or units.\n- **Building owners** looking to centralize tenant repair communication.\n- **Automation builders** who want to learn multi-trigger workflow design in n8n.\n\n---\n\n## ⚙️ How It Works\n\n### **Workflow 1 – New Repair Requests**\n\n**Behind the Scenes:**\nA tenant fills out a Google Form (“Repair Request Form”), which automatically adds a new row to a linked Google Sheet.\n\n**Steps:**\n\n1. **Trigger:** Google Sheets `rowAdded` – runs when a new form entry appears.\n2. **Extract & Format:** Collects all relevant form data (address, unit, urgency, contacts).\n3. **Generate Unit ID:** Creates a standardized identifier (e.g., `BUILDING-UNIT`) for tracking.\n4. **Email Notification:** Sends the building manager a formatted email summarizing the repair details and including a **link to a Repair Update Form** (which activates Workflow 2).\n\n---\n\n### **Workflow 2 – Repair Updates**\n\n**Behind the Scenes:**\\\nTriggered when the building manager submits a follow-up form (“Repair Update Form”).\n\n**Steps:**\n\n1. **Lookup by UUID:** Uses the Unit ID from Workflow 1 to find the existing row in the Google Sheet.\n2. **Conditional Logic:**\n   - **If photos are uploaded:** Saves each image to a Google Drive folder, renames files consistently, and adds URLs to the sheet.\n   - **If no photos:** Skips the upload step and processes textual updates only.\n3. **Merge & Update:** Combines new data with existing repair info in the same spreadsheet row — enabling a full repair history in one place.\n\n---\n\n## 🧩 Requirements\n\n- Google Account (for Forms, Sheets, and Drive)\n- Gmail/email node connected for sending notifications\n- n8n credentials configured for Google API access\n\n---\n\n## ⚡ Setup Instructions (see more detail in workflow)\n\n1. Import both workflows into n8n, then copy one into a second workflow. \n2. Change manual trigger in workflow 2 to a n8n Form node.\n3. Connect Google credentials to all nodes.\n4. Update spreadsheet and folder IDs in the corresponding nodes.\n5. Customize email text, sender name, and form links for your organization.\n6. Test each workflow with a sample repair request and a repair update submission.\n\n---\n\n## 🛠️ Customization Ideas\n\n- Add Slack or Telegram notifications for urgent repairs.\n- Auto-create folders per building or unit for photo uploads.\n- Generate monthly repair summaries using Google Sheets triggers.\n- Add an AI node to create summaries/extract relevant repair data from repair request that include long submissions.\n\n\n\n\n\n\n\n\n",
  "featuredImage": "/data/workflows/10004/10004.webp",
  "author": {
    "id": 101,
    "slug": "matt-vl",
    "name": "Matt@VeraisonLabs",
    "avatar": ""
  },
  "categories": [
    "Ticket Management"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 189,
  "downloads": 18,
  "createdAt": "2025-10-22T00:02:09.524Z",
  "updatedAt": "2026-01-16T09:02:58.579Z",
  "publishedAt": "2025-10-22T00:02:09.524Z",
  "nodes": 32,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/10004"
}