{
  "id": 7583,
  "slug": "7583",
  "title": "Generate personalized cold emails with GPT-4o-mini and Google Sheets",
  "description": "Google Email Ice Breaker Workflow\nDescription\nThis n8n workflow automates the creation of personalized cold emails for dental clinics to promote an AI chatbot service. It retrieves verified email data from a Google Sheet, generates tailored email subject lines and bodies using OpenAI’s GPT-4o-mini model, processes the output, and updates the Google Sheet with the results. Designed for dental clinics or marketers, it streamlines outreach by crafting engaging, seemingly hand-researched emails that drive appointment bookings through an AI chatbot integration.\nKey Features\n\nData-Driven Outreach: Pulls verified emails, company names, descriptions, and websites from a Google Sheet to create targeted emails.\nAI-Powered Email Generation: Uses OpenAI’s GPT-4o-mini to craft concise, persuasive, and personalized cold email content.\nPersonalization: Shortens company names and locations (e.g., \"San Fran\" instead of \"San Francisco\") and references specific business details for a tailored feel.\nBatch Processing: Handles multiple prospects efficiently using a looping mechanism.\nGoogle Sheet Integration: Updates the sheet with generated email subjects, bodies, and a status marker for tracking.\nCustomizable Prompts: Easily modify the AI prompt to adapt the tone or service offering for different industries.\n\nRequirements\n\nCredentials: Google Sheets OAuth2 API (for data access) and OpenAI API (for email generation).\nSetup: Configure a Google Sheet with columns for \"EMAIL verified\", \"companyName\", \"description\", \"website\", \"category\", \"email subject\", \"body\", and \"email created\". Ensure the sheet is accessible via your Google account.\nDependencies: No external packages required; uses n8n’s built-in Google Sheets, OpenAI, and Code nodes.\n\nHow It Works\n\nTrigger & Input: Starts manually (e.g., via \"Test workflow\") and retrieves data from a Google Sheet, filtering for rows where \"category\" is \"Good\" and \"email created\" is \"no\".\nBatch Processing: Loops over filtered rows to process each prospect individually.\nEmail Generation: OpenAI generates a JSON output with a subject and body, personalized using the prospect’s company name, description, and website.\nContent Processing: A Code node cleans and parses the AI output, extracting the subject and body.\nSheet Update: Updates the Google Sheet with the generated subject, body, and sets \"email created\" to \"yes\".\nLooping: Continues processing until all prospects are handled.\n\nBenefits\n\nTime Efficiency: Automates cold email creation, reducing manual effort from hours to minutes.\nPersonalized Outreach: Crafts emails that feel deeply researched, increasing engagement rates.\nScalability: Processes large lists of prospects in batches, ideal for high-volume campaigns.\nTracking: Updates the Google Sheet to track which emails have been generated.\nVersatility: Adaptable for other industries by modifying the AI prompt or Google Sheet structure.\n\nPotential Customizations\n\nPrompt Adjustments: Tweak the OpenAI prompt to target different services (e.g., marketing tools, SaaS products) or industries.\nFilter Modifications: Change Google Sheet filters to target specific prospect categories or regions.\nOutput Expansion: Add nodes to send emails directly or integrate with CRMs like HubSpot.\nNotifications: Include email or Slack notifications when the workflow completes.\n",
  "featuredImage": "/data/workflows/7583/7583.webp",
  "author": {
    "id": 101,
    "slug": "tamure",
    "name": "rana tamure",
    "avatar": ""
  },
  "categories": [
    "Lead Nurturing",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 642,
  "downloads": 64,
  "createdAt": "2025-08-19T09:47:22.559Z",
  "updatedAt": "2026-01-16T08:51:14.104Z",
  "publishedAt": "2025-08-19T09:47:22.559Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7583"
}