{
  "id": 7051,
  "slug": "7051",
  "title": "Custom branded QuickBooks invoices to PDF & email",
  "description": "# Automated QuickBooks Invoice to Custom PDF & Email\n\nTired of the standard, boring invoices from QuickBooks Online? This workflow completely automates the process of creating beautiful, custom-branded PDF invoices and emailing them directly to your clients, saving you time and elevating your brand's professionalism.\n\nThe moment you create an invoice in QuickBooks, this workflow triggers, fetches all the necessary data, and generates a lavish, multi-page-aware PDF invoice complete with your company logo and signature.\n\n***\n\n## Key Features\n\n*   **Fully Automated:** Runs instantly when a new invoice is created in QuickBooks.\n*   **Custom Branding:** Automatically fetches your company logo and signature from a URL to place on the invoice.\n*   **Modern & Professional Design:** Uses a premium, multi-column HTML template that is clean, easy to read, and far superior to the default QBO templates.\n*   **Multi-Page Ready:** If an invoice has many line items, the template will intelligently create multiple pages and add a \"Page X of Y\" footer automatically.\n*   **Smart Layout:** The totals and summary block are designed to never break across pages, ensuring a professional look no matter the length.\n*   **Automatic Emailing:** The final PDF is attached to a beautifully formatted email and sent directly to the customer's email address on file.\n\n## Prerequisites\n\nBefore you start, you will need a few things:\n\n*   A running **n8n instance**.\n*   A **QuickBooks Online** account with API access.\n*   A running **Gotenberg** instance. This is a powerful, open-source tool for converting HTML to PDF. This workflow is designed to connect to its API. You can learn more about it [here](https://gotenberg.dev/).\n*   Publicly accessible URLs for your **company logo** and **signature image** (e.g., hosted on your website or a service like Imgur).\n\n## Setup Guide\n\nFollow these steps carefully to configure the workflow for your own use. Nodes that need your attention are marked with a `[!!]` prefix.\n\n### Step 1: Configure the QuickBooks Webhook\n\nThe workflow starts with a webhook. You need to tell QuickBooks to send information to this webhook.\n\n1.  Open the `[!!] Listen for New QuickBooks Invoice` node.\n2.  You will see a **Webhook URL**. Copy the **Production URL**.\n3.  Go to your QuickBooks Developer dashboard, select your app, and navigate to the **Webhooks** section.\n4.  Paste the n8n URL into the Endpoint URL field and select the **Invoice** event to subscribe to.\n\n### Step 2: Connect Your QuickBooks Account\n\n1.  Open the `[!!] Get Invoice Data from QuickBooks` node.\n2.  In the \"Credentials\" field, select your existing QuickBooks Online credentials or create a new set.\n\n### Step 3: Add Your Branding\n\n1.  Open the `[!!] Fetch Company Logo Image` node. In the **URL** field, replace the placeholder with the public URL of your company's logo.\n2.  Open the `[!!] Fetch Company Signature Image` node. In the **URL** field, replace the placeholder with the public URL of your signature image.\n\n### Step 4: Update the PDF Generation Service\n\n1.  Open the `[!!] Generate PDF via Gotenberg` node.\n2.  In the **URL** field, replace the placeholder `http://YourGotenBergInstanceURL/...` with the real URL of your running Gotenberg instance.\n\n### Step 5: Configure Your Email\n\n1.  Open the `[!!] Email PDF Invoice to Customer` node.\n2.  In the \"Credentials\" field, select your SMTP or email service credentials.\n3.  Customize the **From Email** and **Subject** fields. You can also edit the beautiful HTML email body to match your company's tone of voice.\n\n### Step 6: Activate Your Workflow\n\nYou're all set! Save the workflow and activate it using the toggle at the top-right of the screen. Now, when you create a new invoice in QuickBooks, this automation will handle the rest.\n\n***\n\n### A Note from the Creator\n\nThank you for using this workflow! I believe that professional and automated invoicing is a cornerstone of a great business. This tool was designed to save you time and help you put your best foot forward with every client interaction.\n\nIf you have any questions or need assistance, feel free to reach out.\n\n*   **Website:** [https://www.elegantbiztech.com/](https://www.elegantbiztech.com/)\n*   **Email:** [sales@elegantbiztech.com](mailto:sales@elegantbiztech.com)",
  "featuredImage": "/data/workflows/7051/7051.webp",
  "author": {
    "id": 101,
    "slug": "ebworkflows",
    "name": "Elegant Biztech",
    "avatar": ""
  },
  "categories": [
    "Invoice Processing"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 339,
  "downloads": 33,
  "createdAt": "2025-08-06T13:23:13.746Z",
  "updatedAt": "2026-01-16T08:48:22.783Z",
  "publishedAt": "2025-08-06T13:23:13.746Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7051"
}