{
  "id": 3668,
  "slug": "3668",
  "title": "Altcoin news to LinkedIn posts with DeepSeek AI & Google Sheets",
  "description": "# Altcoin News to LinkedIn Posts with DeepSeek AI & Google Sheets\n\nAutomate your daily crypto content creation and publishing using this n8n workflow. This automation fetches the latest altcoin news from an RSS feed, rewrites it into LinkedIn-style posts using DeepSeek AI, stores it in Google Sheets, and schedules it for publishing—completely hands-free.\n\n<h3>🔧 Prerequisites</h3>\nn8n instance (cloud or self-hosted)\n\nDeepSeek AI or OpenAI API key\n\nGoogle account with Sheets API enabled\n\nRSS feed URL of your preferred altcoin news source\n\n(Optional) LinkedIn API or scheduling tool\n\n<h3>⚙️ Workflow Breakdown</h3>\nFetch RSS Feed – Retrieve altcoin news articles.\n\nFilter Articles – Only select posts from today and containing keywords like \"altcoin\", \"crypto\", \"defi\", etc.\n\nRewrite with DeepSeek – Convert article into a LinkedIn-style post using a prompt template (includes Hook, Body, CTA).\n\nStore in Google Sheets – Save the generated content into your sheet.\n\nPost to LinkedIn (optional) – Schedule or publish via LinkedIn API or integration.\n\n### Setup\nConnect RSS Feed: Set up the CoinDesk RSS feed to be fetched automatically.\n\nAPI Keys: Add your DeepSeek AI API key to enable content generation.\n\nGoogle Sheets: Link your Google Sheet to store both raw RSS data and AI-generated LinkedIn posts.\n\nScheduling: Set the time intervals for when the posts will be scheduled (e.g., every 6 hours).\n\n### Customization Instructions\n**Change RSS Feed URL:\n**\nOpen the Fetch RSS Feed node.\n\nReplace the current URL with your new RSS feed URL in the \"URL\" field.\n\n**Change GPT Model:\n**\nOpen the DeepSeek Chat Model node.\n\nFind the \"Model\" field and select your preferred model (e.g., gpt-4).\n\n**Change Prompt:\n**\nOpen the DeepSeek Chat Model node.\n\nEdit the prompt text in the \"Prompt\" field to customize the tone, content, or keywords.\n\n**Change Wait Time:\n**\nOpen the Schedule Tweet node.\n\nAdjust the \"Wait Time\" (in seconds) to your desired interval:\n\nFor 6 hours: 21600\n\nFor 1 hour: 3600\n\nFor 30 minutes: 1800\n\nFor 15 minutes: 900\n\n",
  "featuredImage": "/data/workflows/3668/3668.webp",
  "author": {
    "id": 101,
    "slug": "letsautomate",
    "name": "Lawal Ridwan",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 426,
  "downloads": 42,
  "createdAt": "2025-04-23T08:18:57.744Z",
  "updatedAt": "2026-01-16T08:30:58.142Z",
  "publishedAt": "2025-04-23T08:18:57.744Z",
  "nodes": 22,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/3668"
}