{
  "id": 7265,
  "slug": "7265",
  "title": "Track and monitor AI token usage metrics for OpenAI and Gemini models",
  "description": "📊 Token Usage Metrics Workflow\n\nDescripción:\nEste flujo de trabajo en n8n extrae y resume las métricas de uso de tokens (prompt, completion y total) y los modelos utilizados en una ejecución específica. Requiere el execution_id y un array con los nombres de los nodos de AI (por ejemplo: openai, gemini).\n\nRequisitos:\n\n    execution_id: ID de la ejecución de n8n de la cual se extraerán los datos.\n\n    model_names: Array con los nombres de los nodos AI a buscar (ejemplo: openai, gemini).\n\nFuncionamiento:\n\n    Obtiene la ejecución con el ID proporcionado.\n\n    Busca en los nodos indicados la información de token usage dentro de la ejecución.\n\n    Suma los tokens usados y genera un listado de modelos utilizados.\n\n    Devuelve métricas totales y un desglose detallado por modelo.\n\nConfiguración recomendada:\n\n    Este workflow debe configurarse para ejecutarse siempre al final del flujo de trabajo.\n\n    Desactivar la opción “Esperar a que termine” para evitar bloqueos y asegurar que se obtenga la ejecución completa.\n\n---\n📊 Token Usage Metrics Workflow\n\nDescription:\nThis n8n workflow extracts and summarizes token usage metrics (prompt, completion, and total tokens) along with the models used in a specific execution. It requires the execution_id and an array of AI node names (e.g., openai, gemini).\n\nRequirements:\n\n    execution_id: The n8n execution ID from which data will be extracted.\n\n    model_names: An array of AI node names to search for (e.g., openai, gemini).\n\nHow It Works:\n\n    Fetches the execution using the provided ID.\n\n    Searches the specified nodes for token usage information within the execution.\n\n    Aggregates token counts and compiles a list of models used.\n\n    Returns total metrics and a detailed breakdown per model.\n\nRecommended Configuration:\n\n    Configure this workflow to run always at the end of your workflow.\n\n    Disable the “Wait until finished” option to avoid blocking and ensure the complete execution data is available.",
  "featuredImage": "/data/workflows/7265/7265.webp",
  "author": {
    "id": 101,
    "slug": "elimeleth",
    "name": "Elimeleth",
    "avatar": ""
  },
  "categories": [
    "Engineering",
    "Multimodal AI"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 1036,
  "downloads": 103,
  "createdAt": "2025-08-11T19:46:06.231Z",
  "updatedAt": "2026-01-16T08:49:24.552Z",
  "publishedAt": "2025-08-11T19:46:06.231Z",
  "nodes": 10,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/7265"
}