{
  "id": 4082,
  "slug": "4082",
  "title": "Automate SEO blog creation + social media with GPT-4, Perplexity and WordPress",
  "description": "# 🚀 AI Blog & Social Media Publisher – Fully Automated Workflow\n\nThis workflow is ideal for individuals, marketers, agencies, and brands who want to effortlessly automate the entire blogging and social media process—from idea generation to promotion. Its primary goal is to consistently deliver engaging, SEO-optimized blog posts directly to WordPress, accompanied by professionally crafted social media content ready for Instagram, Facebook, and X (Twitter).\n\nNo writers, editors, designers, or social media managers required. Save countless hours and resources while boosting your brand's online presence.\n\n## 🔧 Workflow Capabilities:\n\n-Automated Blog Topic Generation: Instantly generates unique, high-value blog ideas tailored to your brand.\n-SEO Content Creation: Produces comprehensive, 2000–2500 word articles optimized for search engines.\n-Real-Time Research: Integrates Perplexity AI to ensure factually accurate, authoritative content.\n-Visual Content Generation: Creates custom, AI-generated featured images via GPT-4, with automatic fallback to Pexels.\n-WordPress Publishing: Automatically publishes articles directly to WordPress with complete formatting (HTML), meta descriptions, featured images, and proper categorization.\n-Social Media Automation: Generates and schedules engaging, platform-specific posts for Instagram, Facebook, and X, complete with relevant hashtags, calls-to-action, and links.\n-Detailed Logging & Reporting: Logs every step transparently into Google Sheets and optionally sends publication reports to Gmail.\n\n## ⚙️ How It Works:\nWhen activated, the workflow checks your content calendar in Google Sheets to avoid duplicate topics. It generates fresh, brand-aligned blog ideas, conducts live research, and creates complete, ready-to-publish articles. It then automatically designs and sources appropriate visuals, publishes content seamlessly to WordPress, and prepares engaging social media posts optimized for each platform.\n\n## 🛠️ Easy Setup Steps:\n-Connect your APIs: OpenAI, WordPress, Google Sheets, Gmail, and optionally Pexels.\n-Replace placeholders (WordPress URLs, Google Sheets ID/tab, workflow IDs).\n-Customize AI prompts with your brand’s tone, keywords, and CTAs for personalized content.\n-Configure scheduling to automate daily, weekly, or custom publishing intervals.\n\n## 📌 Additional Features:\n-Modular workflow design for easy customization and scalability.\n-Comprehensive Markdown and PDF setup guides included.\n-Bonus: Reference placeholders and quick-edit Sticky Notes for effortless adjustments.\n\n## Launch today. Automate permanently. Amplify your reach effortlessly.",
  "featuredImage": "/data/workflows/4082/4082.webp",
  "author": {
    "id": 101,
    "slug": "lukaszb",
    "name": "LukaszB",
    "avatar": ""
  },
  "categories": [
    "Content Creation",
    "Multimodal AI"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 5362,
  "downloads": 536,
  "createdAt": "2025-05-15T18:59:00.587Z",
  "updatedAt": "2026-01-16T08:32:57.728Z",
  "publishedAt": "2025-05-15T18:59:00.587Z",
  "nodes": 79,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/4082"
}