{
  "id": 9886,
  "slug": "9886",
  "title": "Automated AI news curation and LinkedIn posting with GPT-5 and Firebase",
  "description": "What this workflow does\n\nAutomatically:\n\t1.\tfetches fresh news,\n\t2.\tfilters out aggregators/PR wires and duplicates,\n\t3.\twrites a human-sounding LinkedIn post with GPT,\n\t4.\tdownloads the article image to verify it’s usable,\n\t5.\tpublishes to LinkedIn (with or without media),\n\t6.\tand logs the posted titles in Firestore to avoid re-posting.\n\nRuns on a daily schedule (cron) and supports two post variants:\n\t•\tCase 1: article has a description → richer post\n\t•\tCase 2: no description → short, still human and casual\n\n⸻\n\nHow it works (high level flow)\n\t•\tSchedule Trigger (0 10,12,19,21 * * *): runs at 10:00, 12:00, 19:00, 21:00 (server timezone).\n\t•\tFirestore (Get Previous News Titles): loads previously posted titles (document asma/x20) to de-dupe.\n\t•\tHTTP Request (API NEWS): calls newsapi.org with query “AI Startup” for example, last 24–48h window, searchIn=title, sorted by publishedAt.\n\t•\tCode: Select Articles:\n\t•\texcludes Biztoc and common aggregators/PR wires (Techmeme, TheFly, PRNewswire, GlobeNewswire, MarketWatch press-releases, Medium, Substack, Yahoo consent, etc.),\n\t•\trequires valid URL + image,\n\t•\tgroups by topic (normalized title + domain) and picks the best representative,\n\t•\tsorts by recency and returns up to 10 unique articles.\n\t•\tIF (URL & De-dupe checks): ensures link present and not already posted (compares against Firestore titles).\n\t•\tIF (Description Checker): branches on presence of description.\n\t•\tLLM Agents (2 prompts): generate a casual, human LinkedIn post in English (no emojis/links/markdown, 2–3 hashtags).\n\t•\tPost setup: cleans the text, passes the image URL forward.\n\t•\tHTTP Request (Image Downloader): retrieves the image as a file to confirm the link works.\n\t•\tLinkedIn Publisher:\n\t•\tIf image OK → posts with media.\n\t•\tOtherwise → posts text-only.\n\t•\tTime Checkers + Firestore Upserts: after a successful publish, writes the article’s title to Firestore (asma/x20 fields title10, title12, title19, title21) so it won’t be posted again at other times.\n\n⸻\n\nCredentials & prerequisites\n\t•\tNewsAPI.org: API key (free tier works to start; mind rate limits).\n\t•\tLinkedIn OAuth2: connected account with permission to create posts on your profile (uses “Person” target in the node).\n\t•\tGoogle Firebase (Firestore): Service Account with read/write to the asma collection. The workflow uses document ID x20.\n\n⸻\n\nSetup (5 minutes)\n\t1.\tImport the workflow and open it in n8n.\n\t2.\tIn API NEWS, set your NewsAPI key in the query param apiKey.\n\t3.\tIn Get Previous News Titles and Firebase Article Saver [1–8], attach your Google Service Account and confirm projectId, collection=asma.\n\t4.\tIn LinkedIn Publisher [1–4], attach your LinkedIn OAuth credential and ensure the Person is your profile URN.\n\t5.\t(Optional) Adjust the cron in Hourly trigger (server timezone).\n\t6.\t(Optional) Change the search query (q=AI startup), language, or time window in API NEWS.\n\t7.\tEnable the workflow.\n\n⸻\n\nCustomization tips\n\t•\tSearch scope: edit q, language, from/to in API NEWS to cover your niche.\n\t•\tAggregator policy: tweak the aggregatorDomains set in the Select Articles code node.\n\t•\tPost voice: modify the LLM prompt (keeps the “human, slightly messy” tone).\n\t•\tHashtags: the prompt ends with 2–3 simple tags (#AI #Startups #Innovation) — change as you like.\n\t•\tPosting times: change the cron or the downstream time-checker logic to map specific titles → time slots.\n\t•\tNo-image fallback: text-only path is already handled; replace with a placeholder image if you prefer always-with-media.\n\n⸻\n\nNotes & constraints\n\t•\tTimezone: Schedule Trigger uses the n8n server timezone; adjust if your LinkedIn audience is elsewhere.\n\t•\tDe-dupe: this template stores last posted titles in one Firestore doc (asma/x20) under title10, title12, title19, title21. You can change the schema or keep a rolling history.\n\t•\tFiltering: items missing URL or image are skipped by design. Yahoo consent pages are also skipped.\n\t•\tLLM costs: posts are short; usage is modest, but keep an eye on your OpenAI billing.\n\t•\tNewsAPI limits: free plans throttle requests; consider caching or widening the time window if you hit limits.\n\n⸻\n\nTroubleshooting\n\t•\tNothing posts: check NewsAPI quota/response, then see the URL checker and Description Checker branches.\n\t•\tImage errors: some sites block hotlinking; the image download step will fall back to text-only posting.\n\t•\tDuplicates appeared: verify Firestore upserts executed after posting and that your comparison uses the right fields.\n\t•\tWrong hours: confirm your n8n instance timezone and the cron expression.\n\n⸻\n\nWhy this template\n\nYou get a robust “news → LinkedIn” autoposter that feels authentically human (no corporate vibes), avoids low-quality aggregators, prevents duplicates, and gracefully handles media — all with clean, modular nodes that are easy to tweak.",
  "featuredImage": "/data/workflows/9886/9886.webp",
  "author": {
    "id": 101,
    "slug": "wakizara",
    "name": "Arthur Dimeglio",
    "avatar": ""
  },
  "categories": [
    "Social Media",
    "AI Chatbot"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 677,
  "downloads": 67,
  "createdAt": "2025-10-19T10:07:51.990Z",
  "updatedAt": "2026-01-16T09:02:28.972Z",
  "publishedAt": "2025-10-19T10:07:51.990Z",
  "nodes": 66,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9886"
}