{
  "id": 6624,
  "slug": "6624",
  "title": "Query and answer questions from Excel spreadsheets with GPT-4 Mini",
  "description": "This workflow creates an intelligent chatbot that uses your Microsoft Excel workbooks as a knowledge base. The AI agent can automatically query your Excel spreadsheets to provide accurate, contextual responses based on your stored data and information.\n\n![825shots_so 1.jpg](fileId:1893)\n\n## Who's it for\n\nThis template is perfect for:\n* Business teams who maintain their knowledge base in Excel spreadsheets\n* Organizations with existing data and processes in Microsoft 365\n* Small businesses using Excel for inventory, customer data, or documentation\n* Teams wanting to make their Excel data conversationally accessible without complex database setup\n* Companies looking to leverage familiar Excel workflows with AI capabilities\n\n## How it works\n\nThe workflow combines OpenAI's language model with Microsoft Excel's spreadsheet capabilities to create a smart chatbot. When users ask questions, the AI agent automatically determines which Excel worksheets and data ranges are relevant and uses that information to generate helpful responses. The system maintains conversation history for natural, contextual interactions.\n\n## How to set up\n\n1. **Add your credentials:**\n   - Configure your **Microsoft Excel** (Office 365) credentials in the Get Excel Data node\n   - Set up your **OpenAI API** credentials in the OpenAI Chat Model node\n\n2. **Configure your Excel connection:**\n   - Click the **Get Excel Data** node\n   - Select your Excel workbook containing your knowledge base data\n   - The AI will automatically determine relevant worksheets and data ranges\n\n3. **Customize the AI model:**\n   - Open the **OpenAI Chat Model** node\n   - Choose your preferred model (GPT-4, GPT-3.5-turbo, etc.)\n   - Adjust token limits if needed\n\n4. **Test the chatbot:**\n   - Click the **Chat** button to start a conversation\n   - Ask questions related to your Excel data\n\n5. **Optional - Make it public:**\n   - Enable public access in the Chat Trigger node\n   - Embed the provided code into your website\n\n## Requirements\n\n- n8n instance (cloud or self-hosted)\n- Microsoft 365 account with Excel Online access\n- Excel workbooks with data you want to query\n- OpenAI API key with available credits\n- Microsoft Graph API permissions for Excel access\n\n## How to customize the workflow\n\n**Change the AI Provider:**\nYou can replace the OpenAI Chat Model with other providers like Anthropic Claude, Google Gemini, or local models by swapping the language model node.\n\n**Adjust Context Window:**\nModify the \"Remember Chat History\" node to increase or decrease how many previous messages the AI remembers (default is 10 interactions).\n\n**Update System Instructions:**\nEdit the Smart AI Agent's system message to change how the assistant behaves or add specific instructions for your use case.\n\n**Connect Multiple Workbooks:**\nAdd additional Get Excel Data nodes to give the AI access to multiple Excel workbooks within your Microsoft 365 environment.\n\n**Add Data Validation:**\nInclude nodes to validate Excel data format and structure before processing to ensure consistent AI responses.\n\n**Add More Tools:**\nExtend the AI agent with additional tools like web search, email sending, or integration with other Microsoft 365 services.\n\n## Workflow Structure\n\n```\nChat Trigger → Smart AI Agent ← OpenAI Chat Model\n                     ↓\n              Get Excel Data\n                     ↑\n           Remember Chat History\n```\n\nThe Smart AI Agent orchestrates the conversation, deciding when to query Excel and how to use the retrieved data in responses. The memory buffer ensures natural conversation flow by maintaining context across interactions.",
  "featuredImage": "/data/workflows/6624/6624.webp",
  "author": {
    "id": 101,
    "slug": "gegenfeld",
    "name": "Gegenfeld",
    "avatar": ""
  },
  "categories": [
    "Internal Wiki",
    "AI Chatbot"
  ],
  "complexityLevel": "intermediate",
  "price": 0,
  "visitors": 208,
  "downloads": 20,
  "createdAt": "2025-07-29T10:29:22.373Z",
  "updatedAt": "2026-01-16T08:46:01.167Z",
  "publishedAt": "2025-07-29T10:29:22.373Z",
  "nodes": 9,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6624"
}