{
  "id": 9136,
  "slug": "9136",
  "title": "Extract LinkedIn Sales Navigator contacts to Google Sheets with auto pagination",
  "description": "## Complete Template Description\n\n## Automate LinkedIn Sales Navigator contact extraction to Google Sheets\n\nThis workflow scrapes LinkedIn Sales Navigator search results and automatically saves contact details to Google Sheets with pagination support and rate limiting protection.\n\n## Who's it for\n\nSales teams, recruiters, and business development professionals who need to extract and organize LinkedIn contact data at scale without manual copy-pasting.\n\n## What it does\n\nThe workflow connects to a LinkedIn scraping API to fetch contact information from Sales Navigator search results. It handles pagination automatically, extracts contact details (name, title, company, location, profile URL), and appends them to a Google Sheet. Built-in rate limiting (30-60 second delays) prevents API blocks and mimics natural browsing behavior.\n\n## Requirements\n\n- **Self-hosted n8n instance** (this workflow will NOT work on n8n Cloud due to cookie requirements and third-party API usage)\n- LinkedIn Sales Navigator account\n- Google Sheets account\n- EditThisCookie browser extension\n- API access from the creator (1 month free trial available)\n\n## How to set up\n\n**Step 1: Get API Access**\nEmail the creator to request 1 month of free API access using the link in the workflow. You'll receive your API key within 24 hours.\n\n**Step 2: Configure API Authentication**\n1. Click the \"Scrape LinkedIn Contacts API\" node\n2. Under Authentication, select \"Header Auth\"\n3. Create new credential with Name: `x-api-key` and your received API key as the Value\n4. Save the credential\n\n**Step 3: Extract LinkedIn Cookies**\n1. Install the [EditThisCookie extension](https://chromewebstore.google.com/detail/editthiscookie-v3/ojfebgpkimhlhcblbalbfjblapadhbol)\n2. Navigate to LinkedIn Sales Navigator\n3. Click the cookie icon in your browser toolbar\n4. Click \"Export\" and copy the cookie data\n5. Paste into the `cookies` field in the \"Set Search Parameters\" node\n\n**Step 4: Configure Your Search**\nIn the \"Set Search Parameters\" node, update:\n- `cookies`: Your exported LinkedIn cookies\n- `url`: Your LinkedIn Sales Navigator search URL\n- `total_pages`: Number of pages to scrape (default: 2, each page = ~25 contacts)\n\n**Step 5: Set Up Google Sheets**\n1. Make a copy of the template Google Sheet (or create your own with matching column headers)\n2. In the \"Save Contacts to Google Sheets\" node, connect your Google Sheets account\n3. Select your destination spreadsheet and sheet name\n\n**Important Security Note:** Keep your LinkedIn cookies private. Never share them with others or commit them to public repositories.\n\n## Customization options\n\n- Adjust `total_pages` to control how many contacts you scrape\n- Modify the delay in \"Rate Limit Delay Between Requests\" node (default: 30-60 seconds random) - **do not lower this to avoid API blocks**\n- Customize which contact fields to save in the Google Sheets column mapping\n- Change the search URL to target different prospect segments or filters",
  "featuredImage": "/data/workflows/9136/9136.webp",
  "author": {
    "id": 101,
    "slug": "n8nstein",
    "name": "Naveen Choudhary",
    "avatar": ""
  },
  "categories": [
    "Lead Generation"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 643,
  "downloads": 64,
  "createdAt": "2025-10-01T07:11:08.598Z",
  "updatedAt": "2026-01-16T08:59:08.794Z",
  "publishedAt": "2025-10-01T07:11:08.598Z",
  "nodes": 15,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/9136"
}