{
  "id": 6594,
  "slug": "6594",
  "title": "Automate website monitoring with GPT-4 Mini, MCP tools & multi-channel alerts",
  "description": "## How it works\nThis workflow automatically monitors multiple websites using AI-powered analysis and MCP (Model Context Protocol) tools. The system runs scheduled checks, analyzes website performance and security using browser-tools-mcp and mcp-recon servers, categorizes issues by severity (critical, warning, info), sends appropriate alerts through Slack and email, and logs all findings to Google Sheets for historical tracking and trend analysis.\n\n## Who is this for\nDevOps engineers, website administrators, system monitors, digital agencies, and technical teams responsible for maintaining multiple websites. Perfect for organizations that need automated website health monitoring with intelligent analysis, comprehensive security checks, and immediate alerting for critical issues.\n\n## Requirements\n- **MCP Servers**: Browser-tools-mcp and mcp-recon servers running locally or remotely\n- **OpenAI API**: API key for AI-powered website analysis\n- **Google Sheets**: Spreadsheet with \"Websites\" and \"Monitoring Log\" sheets\n- **Slack Integration**: Slack workspace with webhook or bot token for alerts\n- **Email Configuration**: SMTP settings for critical email notifications\n- **Environment Variables**: Secure storage for all credentials and endpoints\n\n## How to set up\n1. **Install and Configure MCP Servers** - Set up browser-tools-mcp and mcp-recon servers, configure endpoints in environment variables (MCP_BROWSER_TOOLS_URL, MCP_RECON_URL)\n2. **Prepare Google Sheets Integration** - Create spreadsheet with \"Websites\" sheet (URL column) and \"Monitoring Log\" sheet, set GOOGLE_SHEET_ID environment variable\n3. **Configure Notification Systems** - Set up Slack webhook/bot and email SMTP settings, configure SLACK_CHANNEL, ALERT_EMAIL, FROM_EMAIL variables\n4. **Customize Monitoring Parameters** - Update Configuration Variables node with your monitoring thresholds, batch sizes, and website lists\n\n## How to customize the workflow\nModify the Configuration Variables node to adjust monitoring thresholds (response times, performance scores), change batch processing sizes, update notification preferences, or add additional websites to monitor. Customize alert severity rules in the Alert Severity Router and modify notification templates in the Slack and Email nodes.",
  "featuredImage": "/data/workflows/6594/6594.webp",
  "author": {
    "id": 101,
    "slug": "grace-bola",
    "name": "Grace Gbadamosi",
    "avatar": ""
  },
  "categories": [
    "DevOps",
    "AI Summarization"
  ],
  "complexityLevel": "advanced",
  "price": 0,
  "visitors": 961,
  "downloads": 96,
  "createdAt": "2025-07-28T18:49:40.497Z",
  "updatedAt": "2026-01-16T08:45:52.179Z",
  "publishedAt": "2025-07-28T18:49:40.497Z",
  "nodes": 19,
  "version": "1.0.0",
  "sourceUrl": "https://n8n.io/workflows/6594"
}